{
    "parse": {
        "title": "Algeria",
        "pageid": 176,
        "wikitext": {
            "*": "{{pagebanner|Algeria banner.jpg}}\n{{quickbar\n| image=Kabylie-neige.jpg\n| caption=\n| location=Algeria in its region.svg\n| flag=Flag of Algeria.svg\n| capital=[[Algiers]] \n| government=Unitary semi-presidential people's republic\n| currency=Algerian dinar (د.م  DZD)\n| area=2,381,741km²<br />''land: 919,595km²<br />water: 0%''\n| population=40,400,000 (January 2016 estimate)\n| language=[[Arabic]] and Tamazight (official), [[French]] and [[English]] are often the languages of business\n| religion=Muslim 98%, Christian 1.0%, Jewish 0.2%\n| electricity=220V, 50Hz (European plug)\n| callingcode=+213\n| tld=.\n| timezone=UTC/UTC+1\n}}\n\n==Understand==\n[http://www.algeriantourism.com/index.php '''Algeria'''] ([[Arabic phrasebook|Arabic]]: '''الجزائر''') is a country in [[North Africa|North]] [[Africa]]. It has a Mediterranean Sea coastline in the north and is surrounded by [[Morocco]] to the northwest, [[Tunisia]] to the northeast, [[Libya]] to the east, [[Niger]] to the southeast, [[Mali]] to the southwest, and [[Mauritania]] to the west. After the secession of [[South Sudan]] from [[Sudan]], Algeria became the largest country in Africa. Recent Algerian history has been marred by civil wars. That said, Algeria is gradually restoring order and will prove an interesting — if difficult — destination.\n\n==Regions==\n\n{{Regionlist\n| regionmaptext=Algeria regions\n| regionmapsize=330px\n\n| region1name=[[Central Algeria]]\n| region1color=#c181c0\n| region1items=\n| region1description=the metropolitan area around the capital\n\n| region2name=[[Northeast Algeria]]\n| region2color=#87bf89\n| region2items=\n| region2description=the extensive mountains and high plains east of Algiers\n\n| region3name=[[Northwest Algeria]]\n| region3color=#8397cb\n| region3items=\n| region3description=the mountainous coastal area west of Algiers\n\n| region4name=[[Saharan Atlas]]\n| region4color=#be8383\n| region4items=\n| region4description=the mountain range inland of the high plateaus\n\n| region5name=[[Saharan Algeria]]\n| region5color=#d7d4a2\n| region5items=\n| region5description=the vast desert in the south of the country\n\n}}\n\n==Cities==\n*[[Algiers]] — with nearly 3 Million inhabitants Algiers is the Capital but also political and cultural centre of Algeria. Beautiful mix of white-washed French buildings, narrow streets of the UNESCO listed [[Casbah]], beautiful parks and the magic Bay of Algiers.\n\n*[[Annaba]] — A town with 200,000 inhabitants located in the east of Algeria next to the border of Tunisia. Annaba enjoys nice colonial building, a very nice church on a hill built for Saint-Augustin and amazing beaches.\n\n*[[Batna]] — A modern city in the Aures region, in the East of Algeria. Near can be found Timgad, one of the most beautiful Roman ruins in the world, but also the Ghoufi Canyons.\n\n*[[Bechar]] — Small city in the Sahara, not far away from the Moroccan border.\n\n*[[Constantine]] — An impressive city in the East, full of history and traditions, on huge and dramatic cliffs and crossed by various bridges.\n\n[[Image:Oran.jpg|thumb|upright=1.3|The harbour at [[Oran]]]]\n*[[Oran]] — Biggest city after Algiers also called second Paris by Algerians, with many impressive buildings from the colonial time. Oran is the city of partying and leisure with its beaches and nightclubs and the worldwide famous Raï music.\n\n*[[Sétif]] — South of Kabylia with quite moderate temperatures and occasional snow falls in the winter. Near can be found Djemila, a beautiful ancient Roman city.\n\n*[[Tamanrasset]] — Largest town in the South and starting point for expeditions to the Sahara and the Hoggar mountains\n\n*[[Bejaia]] — Second largest city in Kabylia, with an amazing coastline, gorgeous beaches and nice architecture, a castle can be visited on the Gourara mountain.\n\n*[[Ghardaia]] — A UNESCO listed city where the desert starts with its marvellous Mzab architecture and its art.\n\n*[[Tipaza]] — A very nice city next to Algiers with beautiful beaches and Roman ruins next to the sea.\n\n*[[Mostaganem]] — A very touristy city next to Oran, known in the whole country for its culture and its numerous and very nice beaches.\n\n*[[Tlemcen]] — A sophisticated city full of history, the most Moorish city of Algeria with its mosques and Muslim architecture.\n\n==Other destinations==\n*'''Roman ruins at Timgad''' outside [[Batna]]\n*[[El-Oued]] with its domed architecture & nearby '''Grand Erg Oriental'''&mdash;the Sahara's second largest dune field\n*[[Hippo Regius]], an ancient Numidian city once an early center of Christianity with well preserved baths & forum\n*The fantasy architecture of the [[M'zab|M'zab Valley]]\n*[[Tassili N'Ajjer]]\n\n==Get in==\n\n===Visas===\n{{VisaRestriction|Entry will be refused to citizens of [[Israel]] and travellers with any evidence of having visited [[Israel]].}}\n\nNationals of [[Libya]], [[Malaysia]], Maldives, [[Mali]], [[Mauritania]], [[Morocco]], the [[Western Sahara|Sahrawi Arab Democratic Republic]], [[Seychelles]] and [[Tunisia]], in addition to refugees and stateless persons residing in these countries, may enter Algeria visa-free for up to 90 days. All other nationalities require a visa.\n\nAs of February 2017, transiting (up to 24h) through Algiers Airport is possible without obtaining a visa.\n\n====Visa instructions====\n\nFor the most current visa instructions and visa application forms for applications in the United States, visit the appropriate web site and confirm if you meet the requirements to submit your visa application through that site. The two sites are [http://www.algerianembassy.org/consular-affairs/visa-instructions.html Embassy of Algeria to the United States of America] or [https://algeria-cgny.org/visa-application/ Consulate General of Algeria in New York].\n* Submit your visa application to the appropriate location. All applicants residing in the United States who wish to travel to Algeria may need a visa issued by the Consular section of the Embassy of Algeria in Washington DC if you currently reside within their constituency which includes the District of Columbia, and the States of North Carolina, South Carolina, Delaware, Maryland and Virginia, West Virginia. Holders of Diplomatic and Official passport may submit their request to this Office. Residents of all other states including Hawaii must apply through the Consulate General in New-York, please visit www.algeria-cgny.org \n\nThe information about visas that follows is provided for convenience only and may be outdated. Please visit the official Algerian embassy or consulate websites for the latest information and additional detail that may not be included below.\n* For inquiries about visa application status, please contact the visa office from Monday to Thursday 09:00-11:00\n* Please read carefully the instructions before filling out the application forms. ''Answer all the questions'' on the application form and fill out all the sections of the form. For example, if your parents are deceased, give their full names. Do not leave the section blank or write simply “Deceased”.\n* Both forms must bear the original signature of the applicant.                                                  \n* Please note that old visa forms ''will not be accepted'' to apply for a visa. Use only the new application forms available on the appropriate embassy web site. Any application submitted using an old form will be rejected.\n* Application form MUST be filled out on screen, printed and then dated and hand signed. Handwritten forms are not accepted. Photos should be glued on the box reserved for photo at the upper right side of the application form. There is only ONE application form but you have to submit two copies with a glued photo on each copy.\n* The average processing time for visas is about 5-8 business days, depending on the applicant's nationality.\n* In case of minors, one of the parents must submit the visa application on their in behalf along with an authorization to travel abroad signed by both parents that must be authenticated by a Notary Public.\n* Some nationalities may require proof of travel insurance, please contact the entity serving your state for more information.\n\n====Visa requirements====\n\n1. Remember to submit your passport when you apply for a visa and please attach two recent passport pictures with white background (glued or stapled) to the two forms, one on each form. The passport must be valid at least six months after the date of entry to Algeria.\n\n2. A non-refundable USPS money-order (individual) made payable to the Embassy of Algeria or Consulate General of Algeria in New York (depending on which entity your are submitting your application to) in the amount of $160 for US citizens. All other nationals must check with the Visa Section for the applicable requirements and fees.\n\n3. Business Visa applicants must include a letter on official letterhead from their employer stating the purpose of their trip, and the full names and addresses of their contacts in Algeria. Applicants must submit with their application an invitation letter from the Algerian company they intend to visit.\n\n4. Work Visa applicants must submit with their visa application an employment authorization delivered by the Algerian Ministry of Labor. The Embassy will not accept any authorization faxed or mailed separately.\n\n5. Tourism Visa applicants must submit an itinerary of their airline travel and a confirmed Hotel reservation in Algeria.\n\n6. Family / Guest Visa: Applicants must provide with their application an invitation from their host in Algeria and notarized at the city hall of the place of residence of the Algerian host. The Embassy will not accept invitations faxed or sent separately.\n\nSpouses of Algerian Citizens should submit a copy of the valid Consulate Registration Card of their spouse and a sponsorship letter signed by the Algerian spouse.\n\nReturn of Passports: Applicants may pick up their passports at the Embassy or send a prepaid self-addressed envelope. The Embassy is not responsible for the lost or delays of document by the post office or other visa services.\n\n'''Important'''\n\n- Complete documentation is required. Any incomplete documentation may extend the processing time or returned to applicant at cost.<br />\n- Processing of an application may be delayed, if prior agreement by Algerian authorities is required. Furthermore, the Embassy reserves the right to request additional documentation from any applicant. It is not the responsibility of the Embassy if there is any delay in the processing of the visa application.<br />\n- Applicants should make travel arrangements to Algeria based on the date of entry indicated on their visa. Applicants should not arrive in Algeria before that date; they will not be allowed to enter. In case of change in travel plans, applicants must obtain a new visa.<br />\n- The Consular office will evaluate the documents submitted and may request additional ones at its discretion. Furthermore, be aware that submitting the required documentation does not guarantee the issuance of a visa. Examples of additional documentation would be two months of your primary checking bank statement or two months of pay stubs.\n\n===By plane===\n[[Image:Ghardaïa.jpg|thumb|upright=1.3|[[Ghardaïa]] in the [[M'zab|M'zab Valley]]]]\nMost major European airlines such as (Lufthansa, Air Berlin, British Airways, Air France, Iberia, Alitalia, TAP Portugal, Turkish Airlines) fly daily to Algiers but there are also some long-haul routes such as (Beijing, Montreal, Doha)\n\nThere are good and relatively cheap direct flights from the UK e.g. BA from Gatwick.  Flights as everywhere vary greatly in price according to when you go, but are typically £250 return in April or May.\n\nFrom the United States the cheapest way to get into Algiers is via London (British Airways), Paris (Air France) or Frankfurt (Lufthansa).\n\nThe national airline [http://www.airalgerie.dz Air Algerie] flies to many destinations in Europe especially France but also to some cities in Africa and the Middle East. All destinations served by Air Algerie from Algiers : Abijan, Alicante, Bamako, Barcelona, Brussels, Basel, Beijing, Beirut, Berlin, Cairo, Casablanca, Dakar, Damascus, Dubai, Frankfurt, Geneva, Istanbul, London, Madrid, Milan, Montreal, Moscow, Niamey, Paris, Rome, Tripoli, Tunis.\n\n===By train===\nThe Algerian train company is named [http://www.sntf.dz SNTF], tickets can be bought at the Train stations, unfortunately the website hasn't been updated since 2008 and online booking is not possible any more, time tables are subject to change; the best way is to ask for information at the train station itself. The network in the north is dense. You can reach Algeria by train from Tunisia, although you will have to change the train at the border post. All border points with Morocco are currently closed.\n\nIf you can try to catch the newer trains they are more comfortable and climate-controlled.\n\n===By car===\nThe realistic and most secure way to reach Algeria by car is across the Tunisian border.\nThe Mauritanian and Malian borders present some security problems, and the Moroccan border is closed.\n\nIf you want to get into Algeria from Niger or from the Tozeur border post in southern Tunisia, you'll have to contract an official guide to accompany you across the Saharan routes; otherwise, police will not allow you to get into Algeria with your car.\nThere are no problems if you want to get into Algeria from the Tunisian border posts in the north. As of January 2019 the border to Morocco is still closed and not scheduled to open any time soon.\n\n===By boat===\nThe prices are usually more expensive than flying so if you can and have no car take a plane. Most connections are offered by [http://www.algerieferries.com Algerie Ferries].\n\nFrom/to [[Spain]]:\n* Alicante to Algiers and Oran\n* Almeria to Gazhaouet\n* Barcelona to Algiers and Oran\n\nFrom/to [[France]]:\n* Marseille to almost every Algerian harbour (Annaba, Skikda, Bejaia, Jijel, Algiers, Oran)\n\nFrom/to [[Italy]]:\n* Napoli to Tunis and then by road for 1 hour\n* Roma (Civitavecchia) to Tunis and then by road for 1 hour\n\n==Get around==\n\nAlgeria is a '''huge''' country and travelling between major cities can take a lot of time and nerves as well, while the distances in the more populated north are not so big and a trip from the east to the west can be done in a 12 hours on highway. Travelling to cities in the Sahara is more difficult since the south is barely connected with good roads, train and bus connections.\n\n===By plane===\n\nFrom Algiers you can reach almost every major Algerian city by plane, and it is highly recommended to take a flight when travelling longer routes and to Saharan cities. Houari Boumediene, in Algiers, is the biggest airport in the country; there are other airports in major cities like Oran,Constantine & annaba.the other airports are basic .\n\n'''Air Algérie''' [http://www.airalgerie.dz/] is the national carrier with many flights to almost all Algerian cities with an airport. The prices vary regarding of the length of the flown route; airfares to smaller and Sahara cities tend to be pricier than between bigger cities (such as Oran to Algier). The airline uses Houari Boumediene Airport as its hub, and almost all flights start or land there. There are seven daily flights to Oran from Algiers and five daily flights to Annaba and Costantine. Other destinations served from Algiers daily or several days weekly are Adrar, El Oued, Tebessa, Batna, Biskra, Sétif, In Ames, Tindouf, Timmoun, Tlemcen, Tamanrasset, Tiaret, Tebessa, El Goela, Ouaragla, Hassi Mesaoud, Bejaia, Ghrardaia, Tlemcen, Illizi, Djanet, Touggourt, and Béchar.\n\n===By taxi===\n\nIt's usual to take a taxi to travel between near cities or in cities, the prices are pretty moderate but when travelling between bigger cities with large distances taxis are the same or more expensive as flying. Try to avoid unofficial taxis since it's very likely the driver will rip you off. Most Taxis have no taximeter so arrange a price in advance. Many drivers will try to take advantage of your lack of knowledge but never pay more than 30 DA per KM regardless of what you are told. Tipping is not necessary but you can round up to the next 10 Dinars.\n\n===By car===\nThe road network is well developed in the north, the Algeriean goverment has made much improvements in the last years regarding road building, new highways were built to replace the already marod roads. The most important highway is the 1200 km long '''N1 (Route est-ouest)''' from Annaba to Oran, almost all bigger cities in the north are connected to this highway including Algiers.\n\nA car is not absolutely necessary because of the well running public transportation system, but could be sometimes useful to reach more remote areas. Keep in mind that driving habits are completly different compared to western norms and that rules and prohibitive signs are more seen as guidelines, even by the police! It would be a wise decision letting a local algerian do the driving for you in the first days to get an impression of the driving style, if this is not possible it's recommended to stay on the highways.\n\n'''Do not''' try to reach saharan areas with another car than a 4x4, occasional dunes on the roads and extreme temperature changes will offer a challenge for the driver and the car.\n\nFuel is extremely cheap and will not cost more than 31 DA per liter.\n\n===By train===\nThe Algerian Railways are operated by '''SNTF''' [http://www.sntf.dz], currently the trains and lines are being modernised. Ten comfortable highspeed trains named Autorail were bought, currently two of them are in operation. Tickets can not be bought online, only at the train stations, prices are quite moderate but more expensive than buses or taxis but in return you will have more comfort and enjoy wonderful landscapes.\n\n'''Main Routes''' :\n\n*'''[[Algiers]]''' to '''[[Oran]]''' , the train takes 4 hours and departs each day at 15:00 from Algiers Central Station and arrives in Oran at 19:30, 2nd Class: 1.000 DA, 1st Class: 1.500 DA.\n\n*'''[[Algiers]]''' to '''[[Annaba]]''', on this route there's a only a slow and less comfortable nighttrain, departing each day at 20:45 and taking all the night for the way to Annaba. As an alternative you can catch the daytrain to [[Constantine]] and take from there a cheap taxi to Annaba.\n\n*'''[[Algiers]]''' to '''[[Constantine]]''' departing each day at 06:45 and arriving in Constantine at 13:30, make sure that you get a window seat because the train will take you through the scenic kabilyan mountains and wonderful landscapes, 2nd Class: 1.200 DA, 1st Class : 1.800 DA.\n\n==See==\n[[File:A_beach_in_Jijel_2015-08-19_16-32.jpg|thumbnail|right|A beach in Jijel]]\n\n[[File:Djurdjura_mountains_2015-08-19_16-31.jpg|thumbnail|right|Djurdjura mountains]]\n\n[[File:Annaba_2015-08-19_16-12.jpg|thumbnail|right|Annaba (st-Augustin basilica)]]\n\n[[File:Bejaïa_2015-08-19_16-11.jpg|thumbnail|right|Bejaïa]]\n\n[[File:Oran_2015-08-19_16-07.jpg|thumbnail|right|Oran]]\n\n[[File:Overview_on_Sidi-m'cid_suspended_bridge_of_constantine_2015-08-19_15-40.jpg|thumbnail|right|Constantine]]\n\n[[File:Algiers_2015-08-19_16-02.jpg|thumbnail|right|Algiers]]\n[[Image:Mzab Ghardaïa.jpg|thumb|280px|[[M'zab]] architecture]]\n\nSimilar to that of Libya, Algerian tourism is best known for its '''ancient ruins'''—principally those from the Phoenician, Roman, and Byzantine eras. Some of the most famous include '''Timgad''' near [[Batna]], '''Hippo Regius''' at [[Annaba]], '''Djemila''' at [[Sétif]], '''Calama''' at [[Guelma]], and ruins from all three empires at [[Tipasa]].\n\nWhile better known for the Roman ruins, Algeria's greatest tourist possibilities lie in the '''Sahara'''; there simply is no other country on earth that can offer the sort of exciting and exotic adventures around the great desert. The crown jewel is the center of Mozabite culture in the [[M'zab|M'zab Valley]]. The five interconnected cities are a breathaking architectural playground evocative of modern cubist and surrealist art. They simply must be seen in person. But the landscapes are impressive as well: the harsh, rugged [[Saharan Atlas]] mountains, the endless desert and Hoggar Mountains around the country's desert capital of [[Tamanrasset]], the huge dunefield of Grand Erg Oriental at [[El-Oued]], and the ancient rock carvings of [[Djelfa]] and the Saharan National Park of [[Tassili N'Ajjer]].\n\nThe Mediterranean '''beaches''' in Algeria are woefully underdeveloped, despite excellent potential, owing to the country's poor security situation scaring off almost all tourists. But if you are in the country for a while, a bit of relaxation will at some point be in order, and there is no need to fly over to [[Tunisia]]. [[Oran]] (urban) on the '''Turquoise Coast''', [[Annaba]], and particularly [[Skikda]] and [[Ghazaouet]] all have nice beaches. The spot to go near Algiers is undoubtedly the resort town of Sidi Fredj.\n\nOf Algeria's '''major cities''', you may be surprised at the number of things to see. [[Algiers]] is a big, beautiful, thriving Mediterranean city with great architecture, ranging from French colonial superbe buildings (like the \"Grande Poste\", a mix of French and Arab architecture) to the ancient area of the Casbah. [[Oran]] is a wonderful and dynamic city in the West of Algeria with a lively feeling, very good seafood restaurants, beaches, museums, nightclubs, mosques, churches, castles... [[Annaba]], [[Skikda]], [[Mostaganem]], [[Cherchell]], [[Tipaza]] and [[Bejaia]] are other beautifuls coastal cities where great architecture meets the magic blue of the sea.\n\n[[Constantine]] is an incredible city with awesome buildings built on huge cliffs, the whole city is crossed by bridges, overlooking the Rhummel river and the countryside.it's the oldest city in the country,built by phoenicians,romans,ottomans,french and arabs.a great mixture lf history,nature and culture.its famous for its suspended bridges,ruins,cuisine,traditional dresses and local andlucian music \"Malouf\" .it is also famous for its sweets such \"Baklawa\" \"harissa\" \"chbah-safra\" and the very famous \"djawziya\",all of them can be bought from shops in the ottoman \"Medina\" (kasbah and swika) \n\n[[Tlemcen]] is a jewel in the Western part of Algeria, next to the Moroccan border. It is a former capital of the Maghreb region and enjoys numerous amazing Moorish buildings such as mosques but [[Tlemcen]] is also a city of art with handicraft, Arabo-Andalu music and traditions. The \"Lalla Setti\" plateau overlooks the city and can be reached by a brand new cable car, there can be found parks, restaurants, woods, fountains, a splendid hotel and an incredible view on the city and its surroundings.\n\n[[Azazga]] if you are looking for something a little unique and amazing is a perfect place, drive through the mountains of Tizi Ouzou, in Azazga. Along the way you can encounter some of the local wildlife. Monkeys are found crossing these local roads and you can stop and feed them.\n\n==Do==\n☆Visit the Kasbah:\nA UNESCO world heritage with plenty of tourists visiting Algiers. \n\n☆Go Taghit & Beni abbas in the south west of Algerian Sahara  (By air from Algiers 90mn to Bechar) \n\n☆Travel on camels in the Sahara desert. Locations:\n* South Algeria,Tassilli-National Park\n\n☆Get on cable cars in (constantine,algiers,annaba,oran and tlemcen) for breath-taking from above views.\n\n☆Hike the ahaggar mountains to see a great sunset.\n\n☆Desert surfing on sahara dunes.\n\n☆Jump from sea cliffs of Annaba\n\n☆Walk through the \"jardin d'essaie\" botanic garden\n*This garden is full of beautiful exotic plant and animal life.\n\n\n☆Go clubbing in oran\n(Could be dangerous if you're not with locals)\n\n☆Travel to the port in Bejaïa and sit along the waters edge or enjoy some of the local scenery. On occasion vendors will line the boardwalk of the port and sell goods, get pictures taken with exotic animals, and even eat at local restaurants while watching the boats traveling in and out of port.\n\n==Talk==\n\nThe official languages are [[Arabic phrasebook|Arabic]] and Tamazight(Berber language).The dialects of Arabic spoken in the North African \"Maghreb\" Region are closely related to each other,but not to the Middle-Eastern ones.They are called Darja (or Darija) and have been influenced by French and Berber vocabulary to various degrees.\n\nStandard Arabic is taught in schools from the very first year, and the vast majority of the population understands it. It is also the language used in newspapers and radio broadcasts. However,like in every Arab country,the locals feel uncomfortable speaking a literary,formal language, and will inevitably slip words from their dialect in it.\n\n[[French phrasebook|French]], the colonial language, is still widely spoken, and almost every local that you meet will be bilingual in Arabic and French. It is the language of business and technology. Old and rural folk in addition to low-income individuals may have a heavily-accented, poorly worded French.\n\nTamazight or Berber is also spoken by many people in Algeria, mainly in rural areas. Berber people are proud of their ancestry and you will rarely hear Arabic spoken inside their communities. The largest Berber groups are the Kabyles and Chaouis in the east, the Mzab in the interior, and the nomadic Tuaregs in the deep south.\n\nMany young people now have at least basic knowledge of English,some (mostly the highly educated) reaching total fluency. The linguistics branch in High Schools enabled Algerians to learn Spanish and German,thus a minority of the population have some understanding of them.\n\nSome common pharses in Algerian Arabic :\n\n*Wesh - Depending on context,can mean \"Hi\" or \"What\"\n*Wesh bik - What's wrong/what's the matter with you\n*Weshrak/Kifesh rak — How are you ?\n*ça va/hamdullah (lit.Praise God) — Good\n*Shukran/Saha — Thank you\n*wasmi/wasemni .... — My Name is ....\n*Salam alaikum — Hello (Reply is walaikum assalam)\n*Besslama/Aaslama/Hiya (slang)/Bye — Good Bye\n*Sbah al khir/ Akhir! — Good Morning (Reply is Sabah al noor)\n*M'seh l'khir — Good afternoon / evening (Reply is Masah al noor)\n*S'il te plaît (french)/yarham babak - Please\n*Smah li - Excuse me\n\n==Buy==\nAlgeria uses the ''Algerian dinar'' ('''DZD''').\n\nUSD1 = DZD119.05\n\nThere are 5, 10, 20, 50, 100 and 200 dinar coins. Banknotes circulate in denominations of DZD100, DZD200, DZD500, DZD1000 and DZD2000.\n\nMoney can be exchanged at Banks or Post offices. Make sure that the exchanged bills are in a good condition, people tend to be picky with accepting ripped and older bills. Be careful with other currencies than euro or US dollars it could be hard to find a bank that exchange less common currencies.\n\nATMs are widely available and can be found in every post office or larger bank you can withdraw Algerian dinar with any major credit card and maestro cards. If a pin with 6 numbers is necessary just enter two zeros before your pin.\n\nLiving in Algeria is very cheap compared to western conditions. For example, DZD300 will get you a full meal or bus ride from Algiers to Oran (400km). Renting a mid-sized apartment will cost normally DZD60,000 (6 months in the advance) a month.\n\nDon't forget about the internet. There are various solutions available on the market. The best are eSim based connectivity hubs, such as Nommi. It provides internet in over150 countries at a nearly local price and gives free access to over 4 million Wi-Fi networks around the world which are available via Nommi App as a Wi-Fi map. Additionally, the device functions as a power bank, able to charge a smartphone a few times. Nommi also has a built-in VPN that works in China.\n\n==Eat==\n\nAlgerian food is delicious, varies from region to region, and is in general a mixture of Berber, French, Italian, Spanish, Turkish, and Arab cuisines.\n\n*Couscous (steamed semolina with sauce containing meat and carrots, courgette, turnips, or chick peas)\n\n*Algerian Tajines (stew)\n\n*variety of algerian pasta (chekh-choukha in the east,Trida,Chawwat...)\n\n*M'hajeb \n\n*Chwa (algerian BBQ)\n\n*variety of soups ( Chorba frik in the east, Hrira in the west)\n\n*variety of breads (french baguettes,Kesra, Matloua',khobz-eddar ..)\n\n*Bouzellouf (cooked lambs head)\n\n*Dowara (stew of stomach and intestines with courgette and chick peas) \n\n*Rechta (hand made steamed vermicelli)served with chicken, zucchini and turnips )\n\n*Chakchouka (normally, it has green peppers, onions and tomatoes; egg may be added)\n\n*Mechoui (charcoal grilled lamb)\n\n*Algerian pizza\n\n*Mediterranean juices (grenadine, orange); very sweet green tea, and strong coffee.\n\n*Qalb El Louz (dessert containing almonds)\n\n*Baklava (almond cakes drenched in honey)\n\n*Ktayef (a kind of baked vermicelli, filled with almonds and drenched in sugar, syrup, and honey)\n\n==Drink==\n\nThe legal drinking/purchasing age of alcoholic beverages is '''18'''.\n\nAlgeria produces a selection of wine (not in big volume in more) and also beer. However, Algeria is a Muslim country, and you do not find alcohol sold everywhere, you have to know where to find it. Wine and alcoholic drinks are sold in the few bar restaurants in the big cities, high end hotels, and night clubs. Some bar restaurants can be found in nice parks, so if you are in a nice wooded park, look for the restaurants. The fast food restaurants open and affordable to the public do not sell beer, and the coffee shops do not sell alcohol. If you visit Algiers or coastal cities, there are fish restaurants in almost every fishing port, the fishing is traditional and the fish sold is very fresh; usually, these restaurants sell alcohol but you have to ask (do not expect to see it, sometimes it is on the menu, sometimes not).\nFinally, you can buy your own bottle of Algerian wine to take home in discrete shops that sell alcoholic drinks. It is better to buy it at the Algiers airport. In smaller towns, buying alcohol can be challenging; you usually find them at the edge of the towns in sketchy areas and the conditions in which the alcohol was kept is sometimes questionable. Some Muslims drink but they consider it a sin. Brown-bagging of alcohol is very common as you are not expected to publicly display those beverages in the streets. Consumption of drinks is social but private, thus it mostly occurs only indoors or in remote areas. If someone invites you into his home and does not offer alcohol, he expects you not to be drunk or smell alcohol, and does not expect you to bring your own bottle or even discuss drinking alcohol in front of his wife and kids.\n\n==Smoke==\nAll cigarettes are sold freely.\nSmoking in the presence of someone who is not a smoker in a public place requires his permission, if someone does not like the smoke, cough or ask you not to smoke, just stop and say sorry. This is what the locals do.\nIf you are invited to someone's house do not smoke unless the host does and after he does, you can ask for permission to smoke (is it okay if I smoke in here?)\nIf you are in a restaurant or coffee terrace where people smoke, you can smoke, if you are with locals who are not smokers, ask them first if it is okay.\nLess and less people smoke, it is because of a global health awareness not because of religion. Women smoking, not many, social and not religiously, are stigmatized by the society.\n\n==Sleep==\nFor housing, it really is not difficult, as there are luxury hotels and cheap ones throughout the country. The price of a beautiful deluxe room for a couple costs between € 150 and € 250 per day, as there are rooms from € 10 to € 45 for low budget tourists. It should be noted that many services are available in luxury hotels, such as the cafeteria, bar, restaurant, nightclub, pool, etc.. In addition it should be noted that during the summer season from June 15 to August 31, many owners rent houses and cottages on the Mediterranean Sea from Port Say (Marsa Ben M'hidi) in El-Kala. Prices vary depending on the number of pieces, usually between 700 euros to 3000 euros per month, electricity included, but it is best to book in advance through an acquaintance or a travel agency. Also, many Algerian uses the site on the Internet ads, bids are sometimes interesting and even opportunities to be missed, but it is always best to send a loved one to visit the place before paying money to the deal. There is also the complex Meskoutine Hammam (spa, pool, etc.) which is located near a waterfall from which flows a source of hot water at 98 ° C. This is the second source the hottest in the world after the geyser in Iceland. The price, depending on the number of rooms in the bungalow, varies between 1500 and 3000 DA (15 to € 30) per day.\n\n==Learn==\nThe safest way and most friendly to learn is to get closer to a small circle of people and listen. There is also a tradition of oral transmission of knowledge. It is also good to be open to others and not to refuse what they offer: accept it willingly.\n\n==Work==\nUnemployment is at 9%, the government encourages foreign investment in different sectors. Unemployment is, however, one major problem in Algeria. In fact, it is very difficult to identify the phenomenon in the absence of a real substantive work, able to give an exact idea of the exact extent of the phenomenon. What we know, for cons, is that the informal economy and undeclared work occupies a vast majority of Algerians and spares no industry. Some sources estimate that about 40% of the part played by the informal sector in the country's economic activity, and the phenomenon has never been considered in the evaluation of the unemployment rate in Algeria.\n\n==Stay safe==\nDespite many western advisory warnings against visiting Algeria, the security situation is getting better. Terrorism in 2005 was focused only in isolated areas such as heavily wooded mountains in less developed regions of the center and attacks near the Libyan or Malian border caused by war in those two countries. Security forces are doing their best to protect visitors to these areas, but tourists must take caution when visiting these places. They have to give their itinerary and plans to the local police before taking the road.\n\nDo not travel after nightfall; travel by plane if you can rather than car; avoid minor roads; ask the police if you are unsure about your surroundings and nothing unusual should happen to you. Also, you should trust only ''official'' travel advisories when it comes to personal safety when you travel to a foreign country.\n\nAs with most Muslim countries, prostitution is illegal and punishments are severe, so it's best to avoid it while staying here.\n\n==Stay healthy==\nHuge improvements have been made in this sector with the construction of dozens of brand new hospitals throughout the country.\n\nAlgerian doctors are highly qualified and offer a good service and pharmacies are well supplied.\n\nMosquitoes are also a problem in Algeria, but they are just a nuisance, as malaria is not common. In urban areas, city-wide sprayings against mosquitoes are periodically carried on.\n\nTap water is considered not drinkable although its quality is better than before. Once boiled, there is no problem in consuming it. Algeria enjoys a large variety of excellent mineral bottled water.\n\n==Respect==\nAlgerians in general are hospitable, friendly and welcoming, sometimes to a fault. As in all of North Africa, the dominant religion in Algeria is Islam, and appropriate religious prohibitions and attitudes should be in order. \n\n=== Social Etiquette and Breaches ===\n* '''Algerians in general are indirect communicators'''. Honour is considered a cornerstone of Algerian culture, and thus people are tempered by the need to save face. For instance, Algerians believe that turning down a friend's request for a favour causes the other person to lose honour and thus will normally go out their way to fulfil a request. \n\n* '''Do not publicly criticise or insult someone'''. Algerians associate public criticism as dishonouring someone and thus is considered impolite manners. A foreign visitor's public criticism is likely to have an even greater impact on someone as Algerians in general strive to look their best in front of others, especially foreigners. Should you ever run into an issue, it's advisable to discuss the issue behind closed doors. \n\n* '''If visiting a mosque, be sure to be dressed conservatively''' and remove your shoes before entering it. \n\n* '''Do not ask about someone's private life'''. Algerians in general like to keep their family lives separate from everyday business, and do not like being asked about their family. On the contrary, Algerian women are more open about their children, husband, parents, and extended family.\n\n\n=== Things to avoid: ===\n\n==== Politics: ====\n* '''Steer clear of discussing Algerian politics'''. It's advisable to refrain from engaging in political discussions with Algerians as it is automatically perceived as interfering in State affairs. Stating your opinion or deliberately engaging in a political discussion is considered rude as a foreign visitor, and it won't be appreciated. \n\n==== Symbols: ====\n* '''Do not desecrate or inappropriately use the Algerian flag'''. Not only would it offend ordinary Algerians, but it is a crime that can result in '''5-10 years of imprisonment'''. \n\n==== Religion: ====\n* '''Steer clear of discussing religion'''. It is considered awkward to discuss religion point blank with Algerians, especially if they're people you aren't very well acquainted with. Jokes, humorous comments or anything of the sort about Islam won't be appreciated.\n\n== Emergency phone numbers ==\nPolice: '''17''' or '''1548'''\n\nCivil protection (medical emergency and fire department): '''14'''\n\nNational Gendarmerie (especially outside cities): '''1055'''\n\nSupport for children : '''3033'''\n.\nNumbers of administrations, hospitals and different agencies can be found on the yellow pages (pages jaunes) in airports and some hotels and on the internet. As its developed in Algeria (but mostly in french), you can check this website:\nhttp://www.pagesjaunes-dz.com\n\n== Travel Advice ==\n\nUK Foreign and Commonwealth Travel Advice for Algeria '''[http://www.fco.gov.uk/en/travel-and-living-abroad/travel-advice-by-country/middle-east-north-africa/algeria]'''\n\n{{outline}}\n{{isPartOf|North_Africa}}\n{{Countryguide}}\n[[ar:الجزائر]]\n[[ca:Algèria]]\n[[de:Algerien]]\n[[eo:Alĝerio]]\n[[es:Argelia]]\n[[fi:Algeria]]\n[[fr:Algérie]]\n[[hu:Algéria]]\n[[it:Algeria]]\n[[ja:アルジェリア]]\n[[nl:Algerije]]\n[[pl:Algieria]]\n[[pt:Argélia]]\n[[ro:Algeria]]\n[[ru:Алжир]]\n[[sv:Algeriet]]\n[[zh:阿尔及利亚]]\n[[wts:category:Algeria]]\n\n[[WikiPedia:Algeria]]\n[[Dmoz:Africa/Algeria/]]\n[[World66:africa/algeria]]"
        }
    }
}