{
    "parse": {
        "title": "Belgium",
        "pageid": 226,
        "wikitext": {
            "*": "{{pagebanner|Belgium Banner.jpg}}\n\n{{quickbar\n|image=Brussels_facade.jpg\n|caption=a building in Brussels\n|location=Belgium in its region.svg\n|flag=Flag of Belgium.svg\n|capital=[[Brussels]]\n|government=Federal parliamentary democracy under a constitutional monarch\n|currency=Euro (EUR)\n|area=30,510km²\n|population=10,414,336 (July 2009 est.)\n|language=[[Dutch]] (official) 60%, [[French]] (official) 40%, [[German]] (official) less than 1%\n|religion=Roman Catholic 75%, Protestant or other 25% - most people aren't religious.\n|electricity=230/50Hz (European plug)\n|callingcode=+32\n|tld=.be\n|timezone=UTC +1\n}}\n[http://www.visitbelgium.com '''Belgium'''] (Dutch: ''België'', French: ''Belgique'', German: ''Belgien'')  is a low-lying country on the North Sea coast in the [[Benelux]]. With the majority of West European capitals within 1,000km or 622 miles of the Belgian capital of [[Brussels]], and as a member of the long-standing international [[Benelux]] community, Belgium sits at the crossroads of Western Europe. Its immediate neighbours are [[France]] to the southwest, [[Luxembourg]] to the southeast, [[Germany]] to the east and the [[Netherlands]] to the north.\n\n==Understand== \nBelgium is a densely populated country trying to balance the conflicting demands of urbanization, transport and industry with commercial and intensive agriculture. It imports large quantities of raw materials and exports a large volume of manufactured goods, mostly to other EU countries. Belgium is the homeland of Peyo, the creator of the Smurfs.\n\n===History===\nBelgium is the heir of several former Medieval powers, previously named Belgae (or Belgica reference to the Roman Empire period), and you will see traces of these everywhere during your trip in this country.\n\nAfter the collapse of the Carolingian Empire in the 9th century, the territory that is nowadays Belgium, Netherlands, and Luxembourg, was part of Lotharingia, an ephemeral kingdom soon to be absorbed into the Holy Roman Empire; however, the special character of \"Lower Lotharingia\" remained intact in the feudal Empire: this is the origin of the Low Countries, a general term that encompasses present-day Belgium, Netherlands, and Luxembourg.\n\nThe widely autonomous fiefdoms of the Low Countries were amongst the richest places in Medieval Europe and you will see traces of this past wealth in the rich buildings of Bruges, Brussels, Antwerp, Ghent, Leuven, Tournai, Mons, etc. These cities progressively fell under the control of a powerful and ambitious family : the Dukes of Burgundy. The whole realm of the dukes extended from the Low Countries to the borders of Switzerland. Using wealth, strategy, and alliances, the Dukes of Burgundy aimed at reconstituting Lotharingia. The death of the last Duke, Charles the Bold, put an end to this dream. However, the treasures of the Dukes of Burgundy remains as a testimony of their rules in Belgian museums and landmarks.\n\nThe powerful Habsburg family then inherited from the Low Countries. Reformation is the reason that Belgium and Netherlands were first put apart: the northern half of the Low Countries embraced Protestantism and rebelled against the Habsburg rule, while the southern half remained faithful to both its ruler and the Catholic faith. These two halves roughly correspond to present-day Belgium and Netherlands.\n\nBelgium was called Austrian Netherlands, then Spanish Netherlands, depending on which branch of the Habsburg ruled it. The powerful German emperor and Spanish king, Charles V, was born in the Belgian city of Ghent and ruled from Brussels. Many places in Belgium are named after him, including the city of Charleroi and even a brand of beer. Every year, the Brusselers emulate his first parade in their city in what is called the Ommegang.\n\nBelgium was briefly a part of the Napoleonic Empire. After Napoleon's defeat, a large Kingdom of the Netherlands was created, comprising the whole of the Low Countries. However, the religious opposition still remained and the split was aggravated by political differences between Belgian liberals and Dutch aristocrats. Belgium became independent from the Netherlands in 1830 after a short revolution and a war against the Netherlands.\n\nIt was occupied by Germany during World Wars I and II and has many war graves near the battle zones, most of them are around Ieper (in English archaically rendered as [[Ypres]], with Yperite another name for mustard gas due to intensive use there in the first World War). It has prospered in the past half century as a modern, technologically advanced and highly developed European state and member of NATO and the EU. Socioeconomic, political and cultural tensions between the Dutch-speaking Flemings of the north and the French-speaking Walloons of the south have led in recent years to constitutional amendments granting these regions formal recognition and autonomy.\n\n===Terrain===\nFlat coastal plains in northwest, central rolling hills, wooded hills and valleys of [[Ardennes (Belgium)|Ardennes]] Forest in southeast.\n\n===Climate===\nTemperate; mild winters, cool summers; rainy, humid, cloudy.\nAverage annual temperature between 1976-2006: 10°C\n\n===Electricity===\nElectricity is supplied at 220-230V, 50Hz. Outlets are CEE7/5 (protruding male earth pin) and accept either CEE 7/5 (Grounded), CEE 7/7 (Grounded) or CEE 7/16 (non-grounded) plugs. Older German-type CEE 7/4 plugs are not compatible as they do not accommodate the earth pin found on this type of outlet. However, most modern European appliances are fitted with the hybrid CEE 7/7 plug which fits both CEE 7/5 (Belgium & France) and CEE 7/4 (Germany, Netherlands, Spain and most of Europe) outlets. \n\nTravellers from the UK, Ireland, Australia, New Zealand, Denmark, Italy, Switzerland and those many other countries using 230V, 50Hz but using different plugs, simply require a plug adaptor to use their appliances in Belgium.\n\nTravellers from the US, Canada, Japan and other countries using 110V, 60Hz may need a voltage converter. However, some laptops, mobile phone chargers and other devices can accept either 110V or 230V and so only require a simple plug adaptor. Check the voltage rating plates on your appliances before connecting them.\n\n==Regions==\nBelgium consists of three federal regions, listed from North to South:\n\n{{Regionlist\n| regionmap=Begium.png\n| regionmaptext=Cities and regions in Belgium\n| regionmapsize=upright=1.8\n\n| region1name=[[Flanders]]\n| region1color=#b0af88\n| region1items=\n| region1description=The northern, Dutch-speaking region of the country.  It includes well known cities like [[Antwerp]], [[Ghent]] and [[Bruges]]. The Flemish provinces are (from west to east): [[West Flanders]], [[East Flanders]], [[Antwerp (province)|Antwerp]], [[Flemish Brabant]] and [[Limburg (Belgium)|Limburg]]. \n\n| region2name=[[Brussels]]\n| region2color=#888db0\n| region2items=\n| region2description=The bilingual capital region of the country and headquarters of the EU.\n\n| region3name=[[Wallonia]]\n| region3color=#7cbc7f\n| region3items=\n| region3description=The southern, French-speaking region, incorporating a small [[Ostkantons|German speaking region]] in the east near the German border. The Walloon provinces are (from west to east): [[Hainaut]], [[Walloon Brabant]], [[Namur (province)|Namur]], [[Liège (province)|Liège]] and [[Luxembourg (Belgium)|Luxembourg]].}}\n\n==Cities==\nBelgium has a very high rate of urbanization and has an astonishing number of cities for such a small territory\n\n*[[Brussels]] — Belgium's bilingual capital and the unofficial capital of the EU. Today one of the most multicultural cities in Europe. Brussels has a nice historic centre around the famous ''Grand Place'' with its Gothic town hall and baroque guild halls. Other popular destinations are the ''Atomium'', one of the symbols of Belgium, the European Quarter, the Palace of Justice, the Cathedral of Saint Michael and Gudula, the Stock Exchange, the Royal Palace, The \"Manneken Pis\" and the art nouveau Houses of Victor Horta. Brussels houses some important museums, such as the Magritte Museum, the Belgian Comic Strip Center and the Royal Museums of Fine Arts.\n\n'''Flanders'''\n*[[Antwerp]] (Dutch: Antwerpen, French: Anvers) — Belgium's second largest city, along the Scheldt river, is landmarked by the enormous Gothic cathedral of Our Lady and especially known for four things: Rubens, diamonds, fashion and the port, the second largest of Europe. Places of interest are the Grote Markt, with the renaissance city hall and stair shaped guild houses, the central station, the Plantin-Moretus museum, the MAS museum, the zoo and the Royal Museum of Fine Arts.\n*[[Beringen]] — Once an important coal-mining city, Beringen is landmarked by Europe's largest and well preserved coal-mining site. Also worth visiting is the place of pilgrimage referred to by locals as Koersels Kapelleke.\n*[[Bruges]] (Dutch: Brugge) — One of Europe's wealthiest cities in the 14th century, nicknamed the 'Venice of the north' because of the canals and romantic atmosphere. The historic centre is mainly medieval, including the famous belfry, a <abbr title=\"residential establishment of a Christian lay religious order\">Beguine</abbr> and the Groeningen museum. Quiet at night, Bruges offers lots of small guest houses and family businesses greatly outnumbering chain hotels. Damme and Lissewege are popular towns to visit in the environs.\n*[[Ghent]] (Dutch: Gent, French: Gand) — Once one of Europe's largest cities, Ghent is now a perfect mixture of Antwerp and Bruges: a cosy medieval centre with canals, a lot of churches and a great castle, yet with a lively student population, a modern art scene and some great festivals. The Gothic Saint Bavo cathedral houses the Lamb of God, one of the masterpieces of Flemish medieval painting.\n*[[Leuven]] (French: Louvain) — A small city dominated by one of Europe's oldest universities. Beautiful historic centre and a lively nightlife. Leuven is also known as the home of Stella Artois and Anheuser-Busch InBev, the world's largest brewing company.\n*[[Lier]] (French: Lière)— Charming Flemish city situated along the Nete river with a beautiful Beguine, a belfry, stair-shaped houses, a Gothic cathedral and small medieval streets.\n*[[Mechelen]] (French: Malines) — An important medieval city with a nice historic district around the Saint Rumbolds cathedral, famous for its carillon school, the oldest and largest in the world.\n*[[Tongeren]] (French: Tongres) — The oldest town in Belgium along with Tournai, Tongeren lives up to its promise.\n\n*[[Ypres|Ieper]] (French: Ypres) — Once one of the largest cities in the Low Countries, now best known for its destruction during the First World War, marked by memorials and cemeteries (Flanders Fields Country, see below).\n\n\n'''Wallonia'''\n*[[Binche]] — Walled town that is famous for its carnival.\n\n*[[Charleroi]] — Although the name ´Charleroi Brussels-South Airport´ suggest otherwise, Charleroi is not a suburb of Brussels, but is actually the largest town in Wallonia (being marginally larger than Liège). Sadly, it is not the kind of town that most people would want to visit, unless they´re into heavy industry and urban decay (in which case it is paradise). Nonetheless, those who venture into the centre will be surprised to find it is friendly and relaxed (and to find that there are also some nice buildings).\n\n*[[Dinant]] — A small town with a cathedral and citadel in a stunning natural setting on the Meuse river, Dinant is a popular spot for adventure sports such as canoeing and rock-climbing which best visited in winter. Dinant is known as the place where Adolphe Sax invented the saxophone.\n\n*[[Liège]] (Dutch: Luik, German:  Lüttich) — The cultural hub of Wallonia - which sits on the banks of the wide river Meuse - is a many sided city that is definitely worth visiting if you are in Belgium. Besides some industrial scars, it is undeniable that Liège has a unique character, an eclectic mix of architecture from the middle ages to the present, a dramatic setting, exciting night-life, a number of museums, and varied natural surroundings to boot!\n\n*[[Mons]](Dutch: Bergen) — Also known as the ´Bruges of Wallonia´, Mons´ historic centre is simply stunning!\n\n*[[Namur]] (Dutch: Namen) — The political capital of Wallonia, Namur is a classy town of around a 100,000 inhabitants,  that boasts a tidy, well preserved old centre and an impressive citadel at the confluence of the Sambre and Meuse rivers. Similarly to Liège, Namur has a a dramatic setting and impressive natural scenery in its immediate surroundings.\n\n* [[Spa (town)|Spa]] — The elegant small town in the Ardennes which put the word spa into spa-town.\n\n*[[Tournai]](Dutch: Doornik) — The oldest town in Belgium along with Tongeren, Tournai is a pleasant town on the banks of the Escaut (Scheldt) with an impressive four-towered cathedral.\n\n* [[Verviers]] (pop: 55,936) — Overlooked by almost everyone, Liège's little brother to the east was one of the first towns in the world outside Great Britain to be mechanically industrialised in the early 19th century, when British entrepreneur William Cockerill (and his son John) set up shop there in 1799. Verviers -- which is set in the dramatic valley of the Vesdre -- also contains many traces of its pre-mechanical history, which dates make to medieval times. While the town might not be everyone's cup of tea, it will certainly prove fascinating to many others!\n\n==Other destinations== \n* [[Ardennes (Belgium)|Ardennes]] &mdash; the most sparsely populated region in Benelux, this is a hilly countryside region covered with forests, tiny nature-stone villages and castles, such as the one of Bouillon or Durbuy.\n* [[Fondry des Chiens]]\n* [[Limburg (Belgium)|Limburg]] &mdash; This province has a solid reputation as a cycling paradise. It's also well known for its castles, abbeys, orchards, smaller cities abound with remnants of the past and its history in coal mining.\n* [[Waterloo]]\n* [[Tyne Cot Cemetery]]\n* '''Abbeys''' &mdash; a lot of them famous for brewing beer, such as Orval, Chimay, Postel, Floreffe or Val Dieu.\n\n==Get in==\n \n===Entry requirements===\n{{Schengen}}\nCitizens of the above countries are permitted to work in Belgium without the need to obtain a visa or any further authorisation for the period of their 90 day visa-free stay. However, this ability to work visa-free does not necessarily extend to other Schengen countries. \n\n===By plane=== \n[http://www.brusselsairport.be/en/ '''Brussels Airport'''] (also known as Zaventem due to the town in which it is mainly located) is Belgium's main airport (IATA code '''BRU'''). It is not located in Brussels proper, but in surrounding [[Flanders]]. The airport is the base of the national airline [http://www.brusselsairlines.com/ '''Brussels Airlines''']. Other full-service airlines use BRU, as well as budget carriers such as [http://www.vueling.com/ Vueling], [http://www.jetairfly.com/ JetairFly] and [http://www.thomascookairlines.com/ Thomas Cook].\n\n* There is a train (€8.60) running every 15 minutes to Brussels centre, taking 25 minutes, some of them continuing to [[Ghent]], [[Mons]] and [[West Flanders]].\n* STIB-bus lines number 12 and 21 (€4.50 at the vending machine/€6 on board) depart every 20 to 30 minutes for Place Luxembourg (European Parliament district). The bus stops at NATO and Schuman (for the EU institutions) on its way to the centre. \n* De Lijn-bus lines 272 and 471 (€3 on board) depart every 30 to 60 minutes for Brussels North Station, just North of the city centre. These buses also serve NATO.\n* A taxi to the centre of Brussels costs around €35 - cheaper if booked in advance. Taxis bleus: +32 2 268 0000, Taxis Autolux:  +32 2 411 4142, Taxis verts:  +32 2 349 4949. \n* There are also two trains (€8.10) per hour to [[Leuven]], taking 14 minutes, and two trains (€10.40) per hour to [[Antwerp]], taking 43 minutes.\n\n'''Brussels South Charleroi Airport'''[http://www.charleroi-airport.com] (IATA code '''CRL'''), about 50km south of Brussels, mostly serves low-cost carriers, such as Ryanair [http://www.ryanair.com/] and Wizzair [http://wizzair.com/].  You can get to Brussels Gare du Midi on a coach in about an hour (€13 one way, €22 return). If you're going to any other part of Belgium, buy a combination bus+train ticket via Charleroi Sud train station from the TEC vending machines outside the airport for at most €19.40 one-way.\n\nHowever, if you are really stuck, it is not unusual for taxi drivers to take credit cards. The price of a taxi ride to Brussels is a set fare (approximately €95 as of May 2006) and you can check with the taxi driver if he will accept your credit card(s) or not. \n\n'''Antwerp Airport''' [http://www.antwerpairport.be/] (IATA code '''ANR''') has some business flights, including CityJet [http://www.cityjet.com/]'s reasonably priced link to London City airport. \n\n'''Ostend Airport''' & '''Liège Airport''' have a limited selection of flights by '''JetAirFly''' (varying every season), but mostly receive business, charter & cargo flights.\n\nFlights to airports in neighbouring countries might be worth considering, especially to Amsterdam [[Schiphol Airport]] which has a direct rail link to [[Brussels]], also making stops at [[Antwerp]] and [[Mechelen]]. Some low-budget airlines (Ryanair, Easyjet) offer a limited selection of flights to [[Eindhoven]],  [[Maastricht]],  [[Köln]] & [[Lille]], all of which have a selection of public transit options to Belgian cities.\n\n===By train===\nThere are direct trains between Brussels and:\n*[[Luxembourg]] (normal trains, running every hour)\n*[[Rotterdam]], [[The Hague]] (normal trains, running every two hours)\n*[[Paris]], [[Cologne|Köln/Cologne]], [[Aachen]], [[Amsterdam]] (Thalys [http://www.thalys.com/])\n*[[Lyon]], Paris-CDG airport and many other French cities (TGV Bruxelles-France [http://www.voyages-sncf.com/]).\n*[[London]], [[Ebbsfleet]], [[Ashford (England)|Ashford]], [[Lille]] and [[Calais]] (Eurostar [http://www.eurostar.com/]). Tip: If going to another Belgian city opt for the \"any Belgium Station\" ticket (£5.50 one-way in 2nd class), and your local transport is included in your Eurostar ticket. Depending on the distance this may work out cheaper than getting a separate ticket. Note: Passengers travelling from the UK to Belgium go through French passport/identity card checks (done on behalf of the Belgians) in the UK before boarding, rather than on arrival in Belgium. Passengers travelling from Lille/Calais to Brussels are within the Schengen Area. \n*[[Frankfurt]], Köln/Cologne (ICE [http://www.bahn.de/p/view/international/englisch/international_guests.shtml])\n\nThey connect with domestic trains at Brussels' Gare du Midi/Zuidstation, and with all Eurostar or ICE and some Thalys tickets, you can finish your journey for free on domestic trains. For all high-speed trains, you need to book in advance for cheap fares, either online or using a travel agency. There are no regularly scheduled sleeper trains anymore.\n\nYou might want to check the TGV connections to Lille too. The trains from the rest of France to Lille are more frequent and usually cheaper. There is a direct train connection from Lille Flandres to Ghent and Antwerp. If your TGV arrives in Lille Europe, it will take a 15 min walk to the Lille Flandres railway station.\n\nPlan your trip with the Deutsche Bahn timetable [http://reiseauskunft.bahn.de/bin/query.exe/en]. It has all domestic and international connections across Europe.\n\nSmoking is no longer allowed in Belgian trains.\n\n===By car=== \nMajor European highways like the E-19, E-17, E-40, E-411 E-314 and E-313 pass through Belgium.\n\n===Carpooling===\nThe cheapest way to get to Belgium (3€/100km) from anywhere in Europe if you are a little flexible and lucky is usually taxistop [http://www.taxistop.be]\n\n===By bus===\nYou can get to Belgium from all over Europe on Eurolines [http://www.eurolines.be] coaches. International busses have stopovers in [[Antwerpen]], [[Brussels|Brussels north-station]], [[Leuven]] & [[Liege]].\n\nNow there are also other bus service operators like Flixbus and Ouibus.\n\nDue to the Bosnian war in the 1990'ies there are bus companies serving the Bosnian diaspora, which provide a cheap and [[Ecotourism#CO2_emissions|clean]] way of getting to the other side of the European continent. ''Semi tours'' [http://semi-tours.com] runs three times  per week from various destinations in [[Bosnia and Hercegovina]] to Belgium and the Netherlands, Off-season approx. (132€) for a return ticket.\n\n===By ship===\nThere is an overnight ferry to/from Zeebrugge from Hull in England, but it is not cheap.\n\n[[Image:be-map.png|frame|Map of Belgium]]\n\n===From France===\n* There are domestic Belgian trains that terminate in '''Lille''' (station ''Lille-Flanders'').\n* Between the '''De Panne''' terminus of the Belgian railways (and the Coast tram &ndash; ''Kusttram'') and the French coastal city of ''Dunkerque'', there is a bus line run by DK'BUS Marine: [http://www.dkbus.com/]. It may, however, be operating only in certain time of the year. It is also possible to take a DK'BUS bus which goes to the closest possible distance of the border and then cross it on foot by walking on the beach and arriving at a convenient station of the Coast tram, such as ''Esplanade''.\n\n===From Germany===\n* You can take a bus between the train stations of '''Eupen''' (Belgium) and '''Aachen''' (Germany) which is quite fast and less expensive than doing the same trip on an international train ticket.\n\n\n===From the Netherlands===\n* For a list of border-crossing buses between Belgium and the Netherlands, you may consult the list at [http://www.xs4all.be/~rvdborgt/bus/belgie.html].\n* In order to avoid paying for an international train ticket on the route between Amsterdam and Antwerp, you can get off in one of the border stations of '''Essen''' (Belgium) and '''Roosendaal''' (the Netherlands) and walk to the other on foot. You can follow the main road between the two places and will need to walk some 10 kilometers in a flat and open, though particularly uninhabited terrain.\n* Apart from being a peculiar result of ancient European history, the town of '''Baarle''' (formally '''Baarle-Hertog''' in Belgium and '''Baarle-Nassau''' in the Netherlands) is a possible change point, since the town's main bus stop ''Sint-Janstraat'' is operated by both Flemish (Belgian) and Dutch buses.\n* The Flemish (Belgian) company De Lijn operates a border-crossing bus between '''Turnhout''' in Belgium and '''Tilburg''' in the Netherlands, both of which are termini in the respective country's railway network.\n* There's a bus (line 45) operated by the Flemish (Belgian) company De Lijn going between the train stations of '''Genk''' (Belgium) and '''Maastricht''' (the Netherlands). There is another bus (line 20A) departing from '''Hasselt''', going to '''Maastricht'''. A train connection is non-existing in this place, but it is being built at the moment.\n\n==Get around==\nBeing such a small country (300 km as its maximum distance), you can get anywhere in a couple of hours.  \nPublic transport is fast and comfortable, and not too expensive.  Between larger cities, there are frequent train connections, with buses covering smaller distances. A useful site is InfoTEC [http://www.infotec.be/index.aspx?Language=english], which has a door-to-door routeplanner for the whole country, covering all forms of public transport (including train, bus, subway and tram).\n\nA look on the map may suggest that Brussels is a good starting point to explore Antwerp, Ghent, Brugge, Namur and Leuven on day trips. Antwerp is popular among those who want to be in a cosmopolitan place, and Ghent is tops with those who like a good mix of open-minded provincialism. Antwerp, Brussels and Bruges are located at 20-40 min train ride from Ghent, with several trains each hour until late. Liège is beautiful, but too close to Germany to be a good base for day trips. Mechelen is considered boring by tourists, but has a very good brand new youth hostel next to a train station with trains to everywhere else every 30 mins.\n\nTo do some local sightseeing, especially in Flanders, a lot of infrastructure is available for cycling. Bikes can be rented virtually everywhere. In the country side of Wallonia, mountainbikes are available, and rafting is popular along the border with Luxembourg.\n\n=== By train ===\n\nMost of Belgium is well connected by train, run by NMBS (SNCB in French) [http://www.b-rail.be/] with most of the main routes passing through Brussels and Antwerp. This is where you'll arrive on international trains, and both can be reached by train from Brussels airport or by coach from Antwerp or Charleroi airport. Transfers are very easy. Note that all ICE and some Thalys tickets allow '''free same-day transfers''' by domestic trains to any other Belgian station. Also, there are Thalys trains from Paris directly to Ghent, Brugge and Oostende with no need to change in Antwerp or Brussels. From London (by Eurostar) you need to switch in Brussels for Antwerp, Leuven or Ghent, but for Brugge and Ghent, you can also change at Lille (France) with no need to make the detour via Brussels. Both in Lille and Brussels the staff are very helpful and willing to smile.\n\nDestinations are listed at stations in the language of the locality. For example, if travelling from somewhere in Flanders to Liège, this will be listed as 'Luik', the Flemish for Liège. If travelling from a French-speaking area to Antwerp, it will be listed as 'Anvers', from a Flemish-speaking area 'Antwerpen'. The exception is Brussels, where destinations are listed in both languages. Only a limited number of international trains and trains to Brussels National Airport are announced in English in the major stations.\n\nAnnouncements on board trains reflect the official language of the region that the train passes through. In Flanders, all announcements will be in Dutch; similarly in Wallonia, all announcements will be in French. In Brussels, announcements will be in French and Dutch. On personal request, train staff will help you in French or Dutch, and often also in English, regardless of the region.\n\nBrussels has 5 major stations, and three of them have two names in French / Dutch: Bruxelles-Midi = Brussel-Zuid, Bruxelles-Central = Brussel-Centraal and Bruxelles-Nord = Brussel-Noord. Many trains stop at all 3, but some trains (Eurostar, Thalys) only stop at Bruxelles-Midi / Brussel-Zuid. Lines to the south (Namur and Luxembourg) also serve the major stations of Brussel/Bruxelles Schuman and Brussel/Bruxelles Luxemb(o)urg, both located in the European quarter of the city.\n\nWhen travelling during rush hour, delays between larger cities are to be expected (5-15 minutes). Nevertheless, delays of more than 30 minutes are extremely rare. Rush hour trains between major cities and around major cities tend to be very crowded, although standing places are normally available.\n\nNormal fares on Belgian trains are cheap compared to Germany or the UK, with no need nor a possibility to pre-book or reserve. Seating places can not be reserved on national trains. 2nd class fares don't go much higher than €20 for the longest domestic trips, and 1st class costs 50% extra. Trains can get very full during the rush hours, so you might need a 1st class ticket to get a seat at those times, although they also don't garantee seating places. \n\nIt's very rare to get train tickets in travel agancies but you can easily buy normal tickets online [http://buy.b-rail.be/], on the SNCB application or in stations. Almost all stations have ticket dispensers (only cards and sometimes coins accepted) and the bigger ones also have staffed offices (cards and cash accepted). If you want to buy a ticket on the train, you have to warn the train conductor and a supplement (€ 7) will be charged, unless there are officially no ticket offices or ticket dispensers. But this is getting rare so be prepared for a supplement. Not buying a ticket can cost you up to €200. There are many options to buy a ticket so why taking the risk to be charged or to be fined.\n\nNormal tickets are sold for a designated day, so there is no extra validation when you step on a train. \n\nThere are several possibilities to keep the ticket price low. First of all, for people younger than 26, one can buy a ''''Go-Pass 1'''' for one trip at a fixed price of €6.4, no matter the distance. The cheapest option if you're planning several train trips and are under 26 years old, is a Go Pass [http://www.belgianrail.be/en/travel-tickets/passes-cards/go-pass-10.aspx], which gives you 10 single 2nd class trips anywhere in Belgium (including train changes if necessary) for €51. It's valid for a year and can be shared with (one line per person) or given to other people without any restrictions. A similar ticket for people of 26 or older is called the '''Rail Pass''', also allowing 10 trips within a year. This costs €77 for 2nd class or €117 for 1st. Also other discount passes for frequent travellers are available.\nWhen using these passes make sure you have filled in the line ''before'' you get on the train (strictly speaking: before you enter the platform). The train conductor can be very picky when the pass is not correctly filled in. However, if you address train station staff before boarding, they will be glad to help you. \n\nAnother cheap alternative are the '''weekend tickets'''. Valid from 7pm on Friday evening until the last train on Sunday night (can overlap till Monday 2am), this ticket is only available as a roundtrip but about 45-50% cheaper than a regular roundtrip ticket. \n\nFor example, different options to get a rountrip ticket to Bruges from Brussels (any station within Brussels zone):\n<br>\nGo Pass 1 (-26yrs): € 12,8 pp\n<br>\nRegular rountrip (+26yrs) (Mo-Fr): € 29,6 pp\n<br>\nWeekend ticket: € 15,8 pp\n\nThese mentioned are the most important ones for travellers, more options are available on the NMBS/SNCB website [http://www.belgianrail.be/] in English, Dutch, French and German. The terms and conditions are however only available in Dutch or French. The website also offers a searchable timetable, with real time delay information, and a fare calculator [http://www.b-rail.be/cgi-script/tarif/tarif_nat.cgi?lang=E]. You can also find a map of Belgian railways and stations [http://www.loughrigg.org/b-rail/full1.gif].\n\nAs in other European countries, timetables usually change on the second Sunday in December. Those changes are usually limited to introducing a few new train stations and adding a few regular lines. Next major changes are planned for december 2020, with the new timetable usually being available a few months before [http://www.belgianrail.be/].\n\n===By bus/tram===\n\nBuses cover the whole country, along with trams and metro in the big cities. Most routes cover short distances, but it is possible to go from city to city by bus. However, this is much slower and only slightly cheaper than taking a train. \n\nThere is also the '''Kusttram''' (''Coast Tramway'') [http://www.dekusttram.be/], which runs for 68 km along almost the whole Flemish seaside from Adinkerke, near the French border, to Knokke-Heist, near the Dutch border. As such, it is the most convenient way to travel from [[Oostende]] to [[Zeebrugge]]. A full end-to-end trip takes approximately 2½ hours. Trams run every 10 minutes during the summer and every 20 minutes during the winter.\n\nWithin cities, a normal ticket for one zone never costs more than €3.00, and there are various travelcards available. Note that local transport is provided by different companies: '''STIB/MIVB''' in Brussels [http://www.stib.be/], '''De Lijn''' [http://delijn.be/] in Flanders and '''TEC''' [http://www.infotec.be/] in Wallonia, and, outside Brussels, they don't accept each others' tickets. Tickets are cheaper when bought at ticket machines.\n\nMost tourists won't need the bus companies, as it is much more user-friendly to take trains between cities and go on foot inside them. Only Brussels and Antwerp have a subway, but, even there, you can make your way around on foot. The historic centre of Brussels is only about 300 by 400 m long. Antwerp is much bigger, but a ride on a horse-pulled coach gives a better view than the subway.\n\n===By car===\nBelgium has a dense network of modern toll-free motorways, but some secondary roads are poorly maintained. The only place where you have to pay toll is the Liefkenshoektunnel in Antwerp. This tunnel is a good alternative to circumvent the often congested Kennedytunnel. Signs are always in the local language only, except in [[Brussels]], where they're bilingual. As many cities in Belgium have quite different names in Dutch and French, this can cause confusion. For example, [[Mons]] in French is Bergen in Dutch; [[Antwerp]] is called Antwerpen in Dutch and Anvers in French; [[Liège]] in French is Luik in Dutch and Lüttich in German, and so on. This even applies to cities outside Belgium; driving along a Flemish motorway, you may see signs for Rijsel, which is the French city of [[Lille]] or Aken, which is the German city of Aachen. Exits will be marked with the word 'Uit' (out) in Flemish areas, 'Sortie' in French areas and 'Ausfahrt' in German-speaking ones.\n\nDrivers in Belgium should also be aware of the \"priority from the right\" rule. At road crossings, traffic coming from the right has the right of way unless otherwise indicated by signs or pavement markings. You're most likely to encounter such crossings in urban and suburban areas. \n\nIn Belgium the motorway signs are notoriously inconvenient, especially on secondary roads. There is no uniformity in layout and color, many are in bad state, placed in an awkward position or simply missing.  A good roadmap (Michelin, De Rouck, Falk) or a GPS system is recommended.\nAlso Belgian roads are always in a state of disrepair. They are however VERY WELL LIT, as this is a remainder of the 80's. Expect good lighting and bad driving. Belgium traffic is extremely congested, with Brussels and Antwerp ranking number one and two on the list of most congested cities in the world. Also smaller cities and even rural areas, especially in Flanders, may have a surprising congestion rate. Belgian traffic is notorious hectic.\n\nSpeed traps are positioned along roads frequently, including highways speed traps and SPECS cameras. When stopped by the police you can be obliged to pay the fine immediately, and failing so will result in the impoundment of your car.\nDrink driving of only small amounts comes with serious penalties, such as 125 Euros on the spot fine for 0.05 per cent and 0.08 per cent. Over that amount of alcohol in your system and you face anything up to 6 months imprisonment and loss of driving licence for 5 years. Speeding\n\n===Car Hire===\n\nSome hire cars come equipped with sat nav but it's a good idea to request this when you book your car. It's probably the most reliable way to get from A to B in Belgium. This way you will get to see some of the sites of Belgium, as flat as it may be, but architecture in the towns is something to be admired. You will be pleasantly surprised at just how clean the towns and villages of Belgium are. Drive through on any afternoon and you will see people caring for the street in front of their homes - a real, backdated village community feel. \n\n===By thumb===\nThe best place for hitchhikers. Just ask for a lift!  Having cardboard signs with towns' names on it can really help to get a quick lift.\n\n*Leaving Brussels: Heading South (e.g. Namur) get to the underground station named 'Delta'.\nNext to it you have a huge 'park and ride' and a bus stop. Hitchhiking near the bus stop should get you a ride in less than 5 minutes during traffic hours.\n\n*Heading to Ghent/Bruges: Good spot near the Shopping Mall called 'Basilix' in Berchem-ste-Agathe. You can reach this place with the bus N°87.\nAn alternative spot to go to the north is in Anderlecht, near the Hospital Erasme/Erasmus (Metro station Erasme/Erasmus.)\n\n*Heading to Liège/Hasselt: Take the pre-metro to the station 'Diamant' in Schaarbeek. When leaving the station you should see a lot of outgoing cars just below you. Just walk and follow the roadsigns mentioning 'E40'. You should arrive in a small street giving access to a road joigning the E40 (the cars are leaving a tunnel at this point). Just hitchhike on the emergency lane at this point, in the portion near the tunnel. Cars should still be riding slowly at this point and see you are visible to them, so it's not that dangerous.\n\n*Leaving Louvain-la-Neuve (University) to Brussels (north) or to Namur (south), stand at the roundabout next to exit/entrance \"8a\" near to \"Louvain la Neuve-centre\" road signs. Quick lift guaranteed. Avoid exit 7 or 9, since they have far less traffic.\n\n==See==\nMostly known for its key role in European Union administration, the small nation of Belgium might leave you surprised by its rich and gorgeous heritage. It boasts a number of fascinatingly historic cities packed with medieval and Art Nouveau architecture and famous for their long traditions in arts, fashion and fine dining. If you've seen the best of them, the Belgian countryside offers anything from sandy beaches to the densely forested hills and ridges of the [[Ardennes]].\n\n'''[[Brussels]]''', the country's vibrant capital, is a modern world city with a highly international character. It combines massive post-modern buildings in its '''European Quarter''' with impressive historic monuments, such as the World Heritage listed '''Grand Place''', surrounded by guildhouses and the Gothic '''town hall'''. There's '''Laken Castle''' and the large '''St. Michael and St. Gudula Cathedral''', dedicated to the cities patron saints. The '''Royal Palace''' is a more recent but no less grand structure. One of the city's most famous landmarks is the '''Atomium''', a remarkable steel structure and remnant of the 1958 World's Fair. And yet, with all those magnificent sights at hand, many travellers' favourite is a tiny bronze fountain in the shape of a peeing boy: the curious '''Manneken Pis'''. \n\nPerhaps the most popular of the Belgian cities is '''[[Bruges]]'''. Much of the excellent architecture that arose during the towns Golden Age, roughly the 14th century, remains intact and the old centre is a valued UNESCO World Heritage Site. Among its most prominent landmarks is the 13th century '''belfry''', where the carillonneur still rings the bells on a daily basis. With countless other noteworthy monuments, Bruges is a highly popular destination and get a bit overcrowded during holidays. And then there's '''[[Ghent]]''', which in ages past was one of the wealthiest cities in Northern Europe. Although larger and much busier than Bruges, its excellent medieval architecture can definitely compete. Its '''beguinages, belfry and former cloth hall''' are World Heritage Sites. Or visit '''[[Antwerp]]''', the country's current place to be as it is a hotspot of the Belgian fashion, clubbing, arts and diamonds scenes. Nevertheless, the city's timeless old centre is right up there with the others, boasting the countries most stunning '''cathedrals'''. Other pleasant cities with good sights include '''[[Leuven]]''', with the oldest Catholic University still in use, '''[[Mechelen]]''', '''[[Liège]]''' and '''[[Beringen]]''', with its pitoresque mining estate.\n\nFor hiking, biking and camping, head to the rugged hills of the '''[[Ardennes]]''' with their tight '''forests, caves and cliffs'''. They are home to wild boar, deer and lynx and hide a number of friendly villages, lots of castles and a few other notable sights. The impressive '''caves of [[Han-sur-Lesse]]''', the '''castle of [[Bouillon]]''' and the modern '''Labyrinth of [[Barvaux]]''' are some of the best picks. The city of '''[[Namur]]''' makes a great base from where to explore the Ardennes and has some fine sights itself too. The city is beautifully located along the rivers Meuse and Sambre and from the ancient '''citadel''' you'll have a great view over town.\n\nThe Belgian province of '''[[Limburg]]''' is one of the '''hidden gems of [[Europe]]'''. It has a solid reputation as a '''cycling paradise'''. This province offers 2,000 kilometers (1.242 mi) mainly '''car free cycling routes''', enough for days of cycling pleasure through varied landscapes. The bicycle network of numbered junctions in Limburg, which has been copied on a worldwide basis, takes you through the most charming landscapes - from junction to junction. The '''rolling hills of Haspengouw''' with its typical villages, castles and endless orchards. The '''flat Maasland''' where you can cycle along the Maasdijk and take the free bicycle ferries across the border with the '''[[Netherlands]]'''. The region of '''[[Voeren]]''' with its '''steep hills, streams and idyllic autumn scenes'''. The Campine with its '''colorful mix of canals, purple heathland, pine forests, sweeping views and ponds'''. Limburg is also well known for its '''castles, abbeys and cities''' abound with remnants of the past and its '''history in coal mining'''.\n\nThe Belgians brought forward a good number of world famous masters of art, and their love for arts is still today reflected in the range of fine arts museums. The '''Musées Royaux des Beaux-Arts''' in Brussels and the '''Koninklijk Museum voor Schone Kunsten''' in Antwerp (closed for renovation until the end of 2017) are just a few excellent examples. However, the Belgians love museums, with over 80 of them in the capital alone. Besides arts, they display anything from history and folkore to industry and technology. As some of the worst fighting of both World Wars took place on Belgian territory, there's also a large number of memorials and museums dedicated to those dark times, along some humbling military cemeteries.\n\n==Do==\n\n*[http://www.lapetitemerveille.be '''Biggest adventure park in Belgium'''] Just next to Durbuy, the smallest city in the world, lays the adventure park; La Petite Merveille. The park offers different activities such as kayaking, mountain biking, climbing and more. La Petite Merveille also have a range of superb restaurants. \n\n*'''Ducasse de Mons''': yearly parade in the city of Mons that celebrates the release of a legendary dragon (which is displayed every year in the city)\n\n*'''Ommegang''': a parade in Brussels that celebrates the beginning of the reign of Charles V of Habsburg. It takes place on the stunning cityscape of the Grand Place and involves thousands of stunts in period costume.\n\n*'''Zinnekeparade''': the biennial celebration of the Brusseler's spirit - the theme changes each time and involves costumes and chariots made by volunteers and locals.\n\n*<do name=\"DOCVILLE - International Documentary Film Festival\" alt=\"\" address=\"Naamsestraat 96, 3000 Leuven\" directions=\"\" phone=\"+32 16 320300\" url=\"http://www.docville.be/\" hours=\"\" price=\"€4.50-6\" lat=\"\" long=\"\">International Documentary Film Festival at the beginning of May, with national and international competition in the city of Leuven. Selected films have a focus on cinematography.</do>\n\n[[Image:Graspop 2008.JPG|thumb|upright=1.3|In Flames performs at Graspop 2008]]\n*<do name=\"Graspop Metal Meeting\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"http://www.graspop.be/\" hours=\"\" price=\"\" lat=\"\" long=\"\">Yearly heavy metal festival held in the town of Dessel, in June.\n</do>\n\n*[http://www.visitbelgium.com/mediaroom/BincheCarnival.htm '''Carnival de Binche'''] - Three days in February the town of [[Binche]] is transported back to the 16th century for one of the most fantastic festivals of the year. Highlighted by music parades and fireworks, the climax of this event is when the Gilles appear on the Grand Place and throw oranges to the spectators. This infamous festivity has been classified as part of the world's cultural [[UNESCO_World_Heritage_List|heritage by UNESCO]] along with its renowned Gilles.\n\n*[http://www.rockwerchter.be '''Rock Werchter'''] - end of June, beginning of July, [[Werchter]].  \n*[http://www.dourfestival.be '''Dour festival'''] - \"European Alternative Music Event\" in [[Dour]].\n[http://www.pukkelpop.be* '''Pukkelpop'''] - mid-August at Kiewit, Hasselt - one of the biggest alternative music festivals in the world, showcasing around 150 artists on 8 stages over a three day span.\n\n[[Image:Atomium.JPG|thumb|upright=1.3|Atomium]]\n* '''Atomium''' built for the 1958 Brussels World Fair (Expo ’58), it is a 102 meter tall representation of an atomic unit cell. More precisely, it is symbolic of a unit cell of an iron crystal magnified 165 billion times. Nine steel spheres 16 metres in diameter connect via tubes with elevators 32 metres long.\n\n*[http://www.gentsefeesten.be '''Gentse Feesten'''], 2nd half of July. Huge, ten day street festival in the historical centre of Ghent. The biggest street festival in Europe, with theatre, music in all genres, techno parties, and so on.\n\n*<do name=\"Activiteiten Gent & Antwerpen\" address=\"Rerum Novarumlaan 132\" directions=\"Merksem\" phone=\"+32 475 696 880\" url=\"http://www.janplezier.be/bedrijfsuitje-activiteiten-gent/\" hours=\"\" price=\"\" lat=\"\" long=\"\">Great boat tours around Ghent and Antwerp.</do>\n\n* '''24 hours cycling, Louvain-La-Neuve''' Louvain-La-Neuve is in Wallonia not far from Brussels. It's a small pedestrian city created in the 60's for the French-speaking students. Every year, in October, they organize a bicycle competition. Actually, the course is a pretext to enjoy the event... And to drink beers. This party is one of the most important for consumption of beers in the whole of Europe.\n\n* '''Belgian Beer Tour''' Belgian Beer Tour is a tour operator specializing in tours of Belgium breweries. It offers a great way for beer lovers to visit their favourite breweries and discover new ones. The tours cover a wide range of beers and appeals to connoisseurs and amateurs alike.\n\n*<do name=\"International Short Film Festival Leuven\" alt=\"\" address=\"Naamsestraat 96, 3000 Leuven\" directions=\"\" phone=\"+32 16 320300\" url=\"http://www.shortfilmfestival.org/\" hours=\"\" price=\"4.5-6 euro\" lat=\"\" long=\"\">International Short Film Festival with many foreign guests and directors. Focus on the best Flemish and European short films.</do>\n*<do name=\"TomorrowLand\" alt=\"\" address=\"De Schorre, Boom\" directions=\"\" phone=\"\" url=\"www.tomorrowland.be\" hours=\"\" price=\"\" lat=\"\" long=\"\"></do>\n*<do name=\"Bokrijk \" alt=\"\" address=\"Genk\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">A reconstructed 19th century village brings history here alive. </do>\n*<do name=\"Slagkracht\" alt=\"\" address=\"Koolmijnlaan 201, 3582 Koersel\" directions=\"Koersel\" phone=\"+32 11 431618\" price=\"free\" lat=\"\" long=\"\"> Slagkracht is a free dance festival in Beringen-Mijn. Enjoy stunning views while dancing on an old coal-mine hill.</do>\n*<do name=\"Drive-In Movie Koersel\" alt=\"\" address=\"Albert-1-Laan 41, 3582 Koersel\" directions=\"Koersel\" phone=\"+32 11 431618\" url=\"https://www.club9.be/drive-in-movie-2017\" hours=\"\" price=\"6-9 euro\" lat=\"\" long=\"\">Drive-In Film Festival, first of it's kind in Belgium. Catch a movie from your car.</do>\n\n==Talk==\nBelgium has three official languages: [[Dutch_phrasebook|Dutch]], [[French phrasebook|French]] and [[German phrasebook|German]]. \n\nVirtually all official information will be only in the language of the region you are in.  The same is true for public transport information.  If you need to fill out government forms or submit documents in support of your application for government services (e.g. a visa, resident permit), please take note that you need to give your responses in French, Dutch or German.  The government does not recognise responses in any other language.  \n\nPlease note that although Belgium has three official languages, that does not mean that all of them are official everywhere.  In fact, language is one of the most politically sensitive/divisive issues in the country, and it may be considered offensive and unappreciated to speak the \"wrong\" language (particularly French and Dutch) at the \"wrong\" region. The only official language of Flanders is Dutch; Brussels has both Dutch and French as its official languages albeit the ''lingua franca'' is French. The only official language of Wallonia is French, except for the nine municipalities (including the town of [[Eupen]] and its surroundings) of the German-speaking Community.  \n\nA number of inhabitants of Wallonia, particularly the older generations, speak the Walloon language.  This language, while not official, is recognized by the French Community of Belgium as an \"indigenous regional language\", together with a number of other Romance (Champenois, Lorrain and Picard) and Germanic (Luxembourgian) language varieties.\n\nEnglish is widely spoken by the younger generation of Dutch-speaking Belgians. In contrast, French-speaking Belgians rarely speak much English, though it is a much better (and less bitter) bet to use compared to Dutch. Consequently, one can get around Flanders without much problem speaking English, but if travelling around Wallonia, bringing a phrasebook or a smartphone translator app (preferably with offline functions) along is highly recommended.  \n\nLikewise, foreign TV programmes (including news interviews to foreigners) and films are subtitled to Dutch in Flanders (except those catering to young children), and dubbed to French in Wallonia.\n\n==Buy== \n=== Currency ===\n{{Euro}}\n\n=== Items===\n* Belgian '''chocolate''':  A long tradition has given Belgian chocolate a superior refinement process that is recognized worldwide.\n* The best chocolates are from: Pierre Marcolini [https://eu.marcolini.com/en/], Mary (the Royal family providers) [https://www.mary.be/en/home] and the Elisabeth´s \"orangettes\". \n* Laces in [[Bruges]]\n* Designer fashions in [[Antwerp]]\n* Jewelry in one of [[Antwerp]]s many jewelry shops\n* Belgian beers are very famous and they have really good differents flavors, for every taste. You should do a beer tasting before leaving Belgium.\n* Belgian comic books and related merchandising, especially in [[Brussels]]\n\n===Internet===\nDon't forget about the internet. There are various solutions available on the market. The best are eSim based connectivity hubs, such as Nommi. It provides internet in over150 countries at a nearly local price and gives free access to over 4 million Wi-Fi networks around the world which are available via Nommi App as a Wi-Fi map. Additionally, the device functions as a power bank, able to charge a smartphone a few times. Nommi also has a built-in VPN that works in China.\n\n==Eat== \n[[Image:RueDesBouchers.JPG|thumb|240px|Restaurants at Rue des Bouchers/Beenhouwersstraat, [[Brussels]]]]\n\nBelgians like to eat. Belgium is famous for its good cuisine and people like to go to restaurants frequently. Best description for Belgian food would be \"French food in German quantities\". \n\n===General rules===\n\n* As anywhere else in the world, avoid the tourist traps, where the touts are trying to get you in the restaurants. You will get average to bad quality food for average to high prices, and, at busy times,  they will try to get rid of you as soon as possible to make space for the next customer. A good example of this is the famous \"Rue des Bouchers/Beenhouwersstraat\" in Brussels in this picture.\n\n* Belgium is a country that understands what eating is all about and can be a real gastronomic paradise. You can have a decent meal in about every tavern, from small snacks to a complete dinner. Just pop into one of those and enjoy it. \n\n* If you want to eat really well for not too much money, ask the local people or the hotel manager (that is, supposing he does not have a brother restaurant-manager) to give some advice for a good restaurant. Not a bad idea is to find a restaurant or tavern a little bit outside of the cities (if advised by some locals) they are usually not too expensive but deliver decent -> high quality food. And ordering the specialties during the season will be both beneficial for your wallet and the quality of the food.\n\n* Quality has its price: since the introduction of the euro, price for eating out in Belgium nearly doubled. Expensive food like lobster or turbot will always cost a lot of money at any restaurant. But you can also find some local and simple dishes, rather cheap and still very tasty (such as sausages, potatoes and spinach). Normally a dinner (3 dishes) will be around 30 - 50 euros depending on your choices of food and restaurant. And for cheap, greasy food, just find a local 'frituur', it will be the best Belgian Fries you'll have had in ages.\n\n===Specialities===\n[[Image:AuPreSale Moules.JPG|thumb|240px|''Moules et frites/Mosselen met friet'', [[Brussels]]]]\n\nA number of dishes are considered distinctly Belgian specialities and should be on every visitor's agenda.\n\n'''Mussels''' are a firm favorite and a side-dish of ''Moules et frites/Mosselen met friet'' (Mussels with French fries).  The traditional way is to cook them in a pot with white wine and/or onions and celery, then eat them up using only a mussel shell to scoop them out. The top season is September to April, and as with all other shellfish, do '''not''' eat the closed ones. Belgium's mussels always come from the nearby Netherlands. Imports from other countries are looked down on.\n\n'''Balletjes/Boulettes''' are meatballs with fries. They will either be served with a tomato sauce or with the sauce from Liège, which is based on a local syrup. For this reason they will often be introduced as ''Boulets  Liégeois.''\n\n'''Frikadellen met krieken''' are also meatballs, served with cherries in a sauce of cherryjuice. This is eaten with bread.\n\n'''Stoemp''' is mashed potatoes and carrots with bacon and sausages. It is a typical meal from Brussels.\n\n'''Stoofvlees''' is a traditional beef stew and is usually served with (you have guessed it already) fries.\n\n'''Witloof met kaassaus/Chicons au gratin''' is a traditional gratin of chicory with ham and a cheesy bechamel sauce, usually served with mashed potatoes or croquettes.\n\n'''Konijn met pruimen''': rabbit cooked in beer and dried plums.\n\nDespite the name, '''french fries''' (''frieten'' in Dutch, ''frites'' in French) are proudly claimed as a Belgian invention. Whether or not this is true, they certainly have perfected it &mdash; although not everybody agrees with their choice of '''mayonnaise''' over ketchup as the preferred condiment (ketchup is considered to be \"for kids\").\n\nEvery village has at least one ''frituur/friterie'', an establishment selling cheap take-away fries, with a huge choice of sauces and fried meat to go with them. The traditional thing to try is ''friet met stoofvlees'', but remember the mayonnaise on it .\n\n'''Steppegrass''' is originally speciality from '''[[Limburg]]'''. Steppegrass is traditionally served as a mountain of very thin fries, crispy and golden yellow on your plate. It is usually served with steak or pork tenderloin underneath this golden mountain of fries.\n\n'''Waffles''' (''wafels'' in Dutch, ''gaufres'' in French) come in two types:\n* ''Gaufres de Bruxelles''/''Brusselse wafels'' : a light and airy variety.\n* a heavier variety with a gooey center known as ''Gaufres de Liège''/''Luikse wafels''.\nThe latter are often eaten as a street/ take-away snack while shopping and therefore can be found at stands on the streets of the cities.\n\nLast but not least, Belgian '''chocolate''' is famed around the world. Famous ''chocolatiers'' include Godiva, Corné, Leonidas, Guylian, Galler, Marcolini and Neuhaus, but the best stuff can be found at tiny boutiques, too small to build worldwide brands. In nearly all supermarkets, you can buy the brand Côte d'Or, generally considered the best 'everyday' chocolate (for breakfast or break) among Belgians.\n\n=== International ===\nAs a small country in the centre of western Europe, the cuisine is influenced not only by the surrounding countries but also by many other countries. This is also emphasized by many foreigners coming to this country to make a living here, for instance by starting a restaurant. You can find all types of restaurants:\n\n* French/Belgian: A traditional Belgian restaurant serves the kind of food you will also find in the best French restaurants. Of course there are local differences: at the coast (in France as well as in Belgium) you have a better chance to find some good seafood, like mussels, turbot, sole or the famous North Sea shrimp. In the southern woods of the Ardennes (remember the battle of the Bulge?), you are better off choosing game or local fish like trout.\n\n* English/Irish: There are Irish bars and pubs everywhere and Belgium is no exception, try the Schuman area of Brussels for more Irish pubs than you can shake a stick at. There is also an English pub just off of Place de la Monnaie in central Brussels.\n\n* American: There are McDonald's or lookalikes in most every town. The Belgian variant is called \"Quick\". You may also find a local booth serving sausages, hot dogs or hamburgers. Try it: the meat tastes the same, but the bread is much better. Ketchup in this region is bland and made with less sugar (even the Heintz brand).  Pizza Hut, Domino's, and Subway also have establishments. There are no real American restaurants, although there is an American bar on the Toison d'Or in Brussels that serves food.\n\n* Mexican: Only in the cities and rather costly for only medium quality. ChiChi's (near Bourse) and Pablo's (near Port des Namur) serve Mexican American food, neither of which would be considered a good value by American standards.  ChiChi's uses reconstituted meats.  Pablo's uses higher quality meat, but you pay a premium for it.\n\n* Chinese: They have a long tradition of restaurants in Belgium. Rather cheap, but an acceptable quality.\n\n* German/Austrian: Maxburg in the Schuman area (next to Spicy Grill) makes a good schnitzel.\n\n* Greek/Spanish/Italian: Like all over the world, nice, rather cheap, with a good atmosphere and typical music (Greek: Choose meat, especially lamb) (Spanish: Choose paella and tapas) (Italian: Choose anything).\n\n* Japanese/Thai: You usually find them only in the cities and they are rather expensive, but they give you great quality. The prices and the quality are both satisfying in a concentrated cluster of Thai restaurants near Bourse station.  Avoid Phat Thai though if you don't want disruptions - as they let pan handlers and flower pushers enter and carry out their \"work\".\n\n* Arabic/Moroccan: Rather cheap, with a great variety of local dishes, especially with lamb; no fish or pork or beef.\n\n* Turkish: Rather cheap, with a great variety of local dishes, especially with chicken and lamb and also vegetarian dishes, dishes with fish are rare; no pork or beef.\n\n* Belgium offers a wide selection of other international restaurants.\n\n==Drink==\n\n===Water===\nTap water is drinkable everywhere in Belgium, but most restaurants do not serve it.  Hot spring or some other mineral water is typically served and costs about 4 euro per 1 litter bottle.\n\n===Beer===\nBelgium is to beer what France is to wine; it is home to one of the greatest beer traditions in the world. Like other European countries in medieval times, beers were brewed in a huge variety of ways with many different ingredients. In addition to the standard ingredients of water, malted barley, hops and yeast, many herbs and spices were also used. This activity was often done in monasteries, each developing a particular style. For some reason, uniquely in Belgium many of these monasteries survived almost into modern times, and the process was handed over to a local commercial brewer if the monastery closed. These brewers would often augment the recipe and process slightly to soften the taste to make it more marketable, but the variety survived in this way. These beers are called '''Abbey beers''' and there are hundreds and hundreds with a range of complex tastes unimaginable until you've tried them. \n\nThe '''Trappist''' label is controlled by international law, similar to that of '''Champagne''' in France.  There are only six Trappist Abbeys in Belgium that produce beer qualified to be called '''Trappist'''. In order to carry the '''Trappist''' label, there are several rules that must be adhered to during the brewing process. The beer must be fermented within the walls of the abbey, the monks of the abbey must be involved in the beer-making process, and profit from the sale of the beer must be directed towards supporting the monastery (similar to a non-profit organization).\n\nBelgium offers an incredible diversity of beers. Several well known mass-produced Belgian beers are Stella Artois, Duvel, Leffe, Jupiler, Hoegaarden. The names given to some beers are pretty imaginative: eg Verboden Vrucht (Forbidden Fruit), Mort Subite (Sudden Death), De Kopstoot (Head Butt), Judas and Delirium Tremens. \n\nWarmly recommended are also Kriek (sweet and sour cherry beer) and, for the Christmas season, Stille Nacht (Silent night).\n\nPlain blond draughts (4%-5,5%): Stella Artois, Jupiler, Maes, Cristal, Primus, Martens, Bavik, Remise56.\n\nTrappist ales (5%-10%): Achel, Chimay, Orval, Rochefort, Westvleteren, Westmalle.\n\nGeuze: Belle-Vue, the lambic Mort Subite (Sudden Death), Lindemans in [[Sint-Pieters-Leeuw]], Timmermans, Boon, Cantillon, 3 Fonteinen, Oud Beersel, Giradin, Hanssens, De Troch.\n\nWhite beers: Hoegaarden, Dentergemse, Brugse Witte.\n\n===Jenever===\nThe city of '''Hasselt''' is well known in Belgium for it's local alcoholic beverage, called '''jenever'''. It is a rather strong liquor, but it comes in all kinds of tastes beyond your imagination, including, but not limited to, vanilla, apple, cactus, kiwi, chocolate and much more. Hasselt lies in the east of Belgium, and is about one hour away by train from Brussels or Antwerp.\n\n=== Pubs ===\nPubs, or '''cafés''', are wide spread. They all have a large variety of alcoholic and non-alcoholic, hot and cold beverages. Some serve food, others don't. Some might be specialised in beer, or wine, or cocktails, or something else.\nAs from July 1st 2011, smoking in pubs is forbidden by law.\n\n==Sleep==\n\n===Budget===\n\n* <sleep name=\"Couchsurfing\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"http://www.couchsurfing.org\" checkin=\"\" checkout=\"\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"\">has a lot of members in Belgium</sleep>\n* <sleep name=\"Vrienden op de fiets\" alt=\"\" address=\"\" directions=\"\" phone=\"\" email=\"\" fax=\"\" url=\"http://www.vriendenopdefiets.nl\" checkin=\"\" checkout=\"\" price=\"\">If you are travelling in Flanders by bicycle or by foot, there is a list of 260 addresses where you can stay at private homes with bed and breakfast for no more than €19,00 per person per night, although you must also pay €8 for membership of this scheme.</sleep>\n\n===Aparthotel===\nAnother good option is the aparthotels, where you can feel at home with the comfort of an hotel. Cheaper, more relaxed, with personality and often with autonomous access to the apartments, without the need for check-in or schedules. \n\n===Hotels===\n\nBelgium has many fine hotels.  Capital [[Brussels]] has  countless rather expensive business hotels catering to the European Union's bureaucrats, and while you can usually get a good room for under &euro;100, prices can spike if there's a big EU shindig in town.\n\n==Learn== \n\nThe different stages of education are the same in all communities:\n* Basic education (Dutch: ''basisonderwijs''; French: ''enseignement fondamental''), consisting of\n** Pre-school (''kleuteronderwijs''; ''einseignement maternel''): -6 years\n** Primary school (''lager onderwijs''; ''enseignement primaire''): 6-12 years\n* Secondary school (''secundair onderwijs''; ''enseignement secondaire''): 12-18 years\n* Higher education (''hoger onderwijs''; ''enseignement supérieur'')\n** University (''universiteit''; ''université'')\n** Polytechnic (''hogeschool''; ''haute école'')\n\nEducation is organized by the regions (Dutch-speaking Flanders on the one hand, French and German speaking Wallonia on the other) and the small federal district of Brussels has schools run by both the Flemish and Walloon authorities. Both states recognize independent school networks, which cater to far more students than the state schools themselves. Most Flemish students go to a Flemish Catholic school. However, every independent school needs to follow the official state curriculum, and catholicism in Flanders has long been extremely liberal anyway.\n\n==Work==\nHaving one of the highest labour taxes in Europe, Belgium is struggling to reposition itself as a high-tech country.  In that struggle, Flanders is far ahead and much wealthier than Wallonia, in contrast to the previous decades, where Wallonia's steel industry was the main export of Belgium.  Highly skilled people will have the most chance to find work, and knowing multiple languages (Dutch, French, English and perhaps German) is almost a standard requirement. Interim offices providing temporary jobs are flourishing in a search to avoid the high labour taxes.\n\nBelgium has one of the highest tax rates in the world. An employer who pays a salary about €1500 a month actually pays another €1500 or more in taxes. Where does this money go to? It goes to the social network.  People only pay a small charge for healthcare, for example. And the budget for education, arts and culture is enormous. The budget for defense is however very tiny.\n\nAlthough Belgium is undesirable for building wealth, it's a good place for someone who already is wealthy to reside because there is very little capital gains tax (some forms of capital gain is not taxed at all). \n\n\n\n==Stay safe==\nExcept for certain neighbourhoods in Brussels and the outer edge of [[Antwerp]] (the port and docks), Belgium is generally a safe country. Belgians are somewhat shy and introverted, but generally helpful towards strangers. \n\nFor those landing in [[Charleroi]] and [[Liège]], those are the regions that boast the highest crime rates in Southern Belgium (Especially aggravated assault). But if you keep an eye on your belongings, and avoid wandering alone at night, nothing really serious is likely to happen to you.\n\nMuslims and people of North African ancestry may experience mild resentment, a problem that is particularly acute in [[Brussels]] and [[Antwerp]]. The Burqa is illegal in public.\n\nMarijuana laws are quite lenient - possession of up to 5 grams or one female plant is decriminalised but confiscated.\n\nThe '''emergency''' phone number in Belgium (fire, police, paramedics) is '''112'''.\n\n==Stay healthy== \nIn the winter, like most other European countries, only influenza will cause you a considerable inconvenience. No inoculations are needed to enter or leave Belgium.\n\n==Contact==\nBelgium has a modern telephone system with nationwide cellular telephone coverage, and multiple internet access points in all cities, free in most libraries. Also in multiple gas stations, Main NMBS/SNCB train stations and all Brussels Metro stations offer free WiFi.\n\n* Many cafés offer free WiFi nowadays, but don't write it on the door for whatever reason...\n\n* if you can't find any you can always fall back on '''Quick''' or '''McDonalds''' which both offer free WiFi.\n\n==Respect==\n\n* Comparable to other Western European countries, Belgium has a tolerant, open minded and liberal society in terms of political freedom, freedom of speech, religion and sexual orientation. However, politeness, modesty and respect for one's privacy and private space are extremely valued in its culture which is partly rooted in how the country historically developed. This might sometimes cause a Belgian to come accross as shy, closed and calm (especially at first encounter), but this is rather an interpretation of being polite meaning not being intrusive to what other people are doing and at the same time keeping personal affairs for oneself.  \n\n* Don't solely associate the country with the European Union. Although the EU has chosen to put most of its headquarters in Belgium due to historic and strategic reasons (Belgium was one of the 'founding fathers' and still strongly supports it), the majority of the Belgian citizens don't have anything to do with it in a direct way. Most Belgians are involved in the EU as any other person in another region of the union. In general, they have positive and supportive feelings towards it.\n\n* Language is a complex and sensitive subject in Belgium, which is rooted in how Belgium as a nation was founded unifying different (ethno)cultural groups. An important rule of thumb among Belgian citizens is the renowned linguistic 'principle of territoriality', which implies that, in theory, the official language of the region (Dutch in Flanders, French in Wallonia and German in Eupen-Malmédy) needs to serve as the lingua franca amongst Belgians with different mother tongues or linguistic backgrounds in the public space. Thus, insisting on speaking French in Flanders and Dutch in Wallonia could be considered offensive as it is associated to a lack of respect or effort from the other side. The situation is less intense within the legally bilingual Brussels (though Frenchification is nowadays becoming an issue). In addition, these feelings are especially prevalent in Flanders, since in practice most Flemings speak French on a good to advanced level, due to a more thorough implementation in the educational system. In Wallonia, speaking a language which is more globalized but actually a minority language in Belgium, this is less the case which sometimes feeds signals of disrespect coming from the French speaking community. The latter doesn't include compulsory Dutch courses in its educational system whereas in Flanders, French is taught as an obliged course for over 8 years in primary and secondary school. The Wallonian educational regulation is what most Flemings stumble upon and by some people it still awakens feelings of the overruling of a French speaking elite over Flemish people in the early days of Belgium, amongst other small elements that still have remnants in today's political and economical system that 'favor' Walloons. Of course, it does not counteract common sense or pragmatic reasons. Moreover, this sensitivity to language typically applies among Belgians mutually and it doesn't count a lot for tourists or foreigners since they will always prioritize communicating with you whatever language you are trying to speak. It's best is to mention that you're a foreign tourist for that reason. As language is sometimes described as 'being in the DNA' of Belgians and especially of Flemings, you can expect a decent to excellent profiency in English from the vast majority of Flemish people, regardless of educational background. In Wallonia, since economically less developed and in general more rural, this can sometimes still be a problem, however this is rapidly improving, especially among the younger generations and people of higher education.\n\n* Although it's perfectly legal and very common to publically criticize the government and political leaders, you might wind up having lengthy discussions unless you ardently follow Belgian news and politics. Know the risks that being a foreigner presents you before discussing the more 'controversial' and hard-to-understand-unless-you're-Belgian topics such as language and inter-regional relations, cultural differences and economical imbalances. In general, you will be exposed to a plethora of different opinions and feelings that vastly vary from different points of view, inherent to people from a country that hails one of the most complex political systems in the world.\n\n* Modesty is a virtue in Belgium. Bragging about, showing off your wealth is by no means a part of Belgian culture. Depending on context and personal relations, it's often times impolite to ask a Belgian how much they earn or how much their things cost. Finances are a private matter. In Belgium, there is nothing wrong with making money as long as it isn't offensive to people making less or insufficient money.\n\n* Sarcasm, irony and cynical twists to opinions are a common feature Belgians tend to have. For small problems, it is mostly a way of minimizing or ridiculizing a certain subject which helps to process or 'digest' it better. Apart from being a trick to ease emotional pain, in general sarcasm is the backbone of most of the Belgian humor, which is sometimes hard to spot and misinterpreted as a serious (whilst in reality the opposite) opinion on a certain subject by people that come from sometimes less sarcasm driven cultures. Pay attention to body language, facial expressions, tone of voice etc... whenever a Belgian gives you an opinion on a subject in a less serious, informal conversation.\n\n* Privacy is highly valued in Belgium. Do not be nosy about one's personal affairs or occupations when you are not close to them.\n\n* Belgium is one of the least religious countries in Europe and the world, however Roman Catholicism had a strong impact on the roots of some parts of their culture, morals and values.\n\n* Do not tell the Walloons (and most of the people of Brussels) that they are French. Walloons, despite speaking French, are not and do not consider themselves French and often times dislike being classified as French. Same goes for associating Flemings too much to the Dutch.\n\n* Belgians in general are very proud of their comic book artists. The \"Belgian school of comic books\" is hailed as a national pride. In Belgium, comic books are valuable books printed with a hard cover. There are dozens of beautiful yet expensive merchandizing items, and the Belgians are fond of them. A plastic figurine of a comic book character or a special artwork of a hailed comic book artist would be a perfect gift for your Belgian friends and in-laws, for example.\n\n* Giving tips shows that you were content with the service given, but you are certainly not obliged to do so. It is sometimes done in bars and restaurants. Depending on the total, a tip of €0,50 to €2,50 is considered generous. People working in restaurants and bars have decent salaries and don't depend on tips to generate a liveable income.\n\n* Have respect for the things that are made in Belgium. For instance, showing an appreciation for the Belgian made fries, beers, chocolates, comic books and so on will be met with the upmost praise. Such things are also good conversation topics as well\n\n==Get out==\nFor party-minded people, Belgium can be great. Most cities are close to each other and are either large urban areas (Brussels, Antwerp) or student areas (Leuven, Liège, Ghent), etc. In this little region, you will find the most clubs, cafés, restaurants per square mile in the world. A good starting point can be places with a strong student/youth culture : Leuven around its big university, Liège in the famous \"carré\" district, etc. You can expect a wide variety in music appreciation, going from jazz to the better electronic music. Just ask around for the better clubs and there you will most likely meet some music fanatics who can show you the better underground parties in this tiny country.\n\nThe government has a mostly liberal attitude towards bars, clubs and parties. They acknowledge the principle of \"live and let live\". As long as you don't cause public disturbance, vandalize property and get too drunk, the police will not intervene.\nThis also one of the main principles of Belgian social life, as this sort of behaviour is generally considered offensive. Of course, in student communities this is more tolerated, but generally, you are most respected if you party as hard as you like- but with a sense of discretion and self-control.\n\nOfficially, drugs are not allowed. But as long as you respect the aforementioned principles, you are not likely to get into serious trouble. Beware though, that driving under the influence of alcohol and drugs is not tolerated and traffic laws are strictly enforced in this matter. Especially in the weekends on main roads, you have a good chance of being stopped for an alcohol control.\n\n{{isPartOf|Benelux}}\n{{countryguide}}\n{{outline}}\n\n\n[[ca:Bèlgica]]\n[[de:Belgien]]\n[[eo:Belgio]]\n[[es:Bélgica]]\n[[fi:Belgia]]\n[[fr:Belgique]]\n[[hu:Belgium]]\n[[it:Belgio]]\n[[ja:ベルギー]]\n[[nl:België]]\n[[pl:Belgia]]\n[[pt:Bélgica]]\n[[ro:Belgia]]\n[[ru:Бельгия]]\n[[sv:Belgien]]\n[[zh:比利時]]\n[[wts:Category:Belgium]]\n\n\n[[WikiPedia:Belgium]]\n[[Dmoz:Europe/Belgium/]]\n[[World66:europe/belgium]]"
        }
    }
}