{
    "parse": {
        "title": "Bolivia",
        "pageid": 241,
        "wikitext": {
            "*": "{{pagebanner|Bolivia banner.jpg}}\n{{cautionbox|The CDC has identified [[Bolivia]] as an affected area of the Zika outbreak. Pregnant women are advised to be cautious as the virus can lead to birth defects. Adults affected by the virus experience fever, rash, joint pain, and conjunctivitis (red eyes) typically lasting a week.  You can learn more by visiting [http://www.cdc.gov/zika/index.html the official CDC website].}}\n{{quickbar\n| image=Plaza Murillo, La Paz, Bolivia.JPG\n| caption=Plaza Murillo, Laz Paz\n| location=Bolivia in its region.svg\n| flag=Flag of Bolivia.svg\n| capital=[[La Paz]] (administrative & governmental); [[Sucre]] (legal capital & judicial seat)\n| government=Republic\n| currency=Boliviano (BOB)\n| area=1,098,580km²<br />''water: 14,190km²<br />land: 1,084,390km²''\n| population=8,989,046 (July 2006 estimate)\n| language=[[Spanish]] (official), [[Quechua phrasebook|Quechua]] (official), [[Aymara]] (official)\n| religion=Roman Catholic 95%, Protestant (Evangelical Methodist)\n| electricity=220V, 50HZ <small>(but 115V in [[La Paz]] & [[Viacha]]</small> ([[Electrical_systems#Plugs_and_adapters|A & C]] type plugs)\n| callingcode=+591\n| tld=.bo\n| timezone=UTC-4\n}}\n\n'''Bolivia''' is a beautiful, geographically diverse, multiethnic, and democratic country in the heart of [[South America]]. It is surrounded by [[Brazil]] to the northeast, [[Peru]] to the northwest, [[Chile]] to the southwest, [[Argentina]] and [[Paraguay]] to the south. It shares with Peru control of [[Lake Titicaca]] (''Lago Titicaca''), the world's highest navigable lake (elevation 3,805m).\n\nSometimes referred to as the [[Tibet]] of the Americas, Bolivia is one of the most \"remote\" countries in the western hemisphere; except for the navigable Paraguay River stretching to the distant Atlantic, Bolivia and [[Paraguay]] are the only two landlocked nations in the Americas. It is also the most indigenous country in the Americas, with 60% of its population being of pure Native American ancestry.\n\n==Understand==\n\n===Climate===\nBolivia's climate varies drastically with altitude and from one climatic zone to another. It ranges from humid and tropical to cold and semiarid. In most parts of the country winters are dry and summers are somewhat wet. Despite its tropical latitude, the altitude of cities like La Paz keeps things cool, and warm clothing is advised year-round. The summer months in Bolivia are November through March. The weather is typically warmer and wetter during these months. April through October, the winter months, are typically colder and drier.<br clear=\"all\" />\n\n==Regions==\n{{Regionlist\n| regionmap=Bolivia regions map.png\n| regionmaptext=\n| regionmapsize=upright=1.7\n\n| region1name=[[Altiplano (Bolivia)|Altiplano]]\n| region1color=#88b1cd\n| region1items=[[La Paz (department, Bolivia)|La Paz]], [[Oruro (department)|Oruro]], [[Potosí (department)|Potosí]]\n| region1description=\n\n| region2name=[[Sub-Andean Bolivia]]\n| region2color=#cc9070\n| region2items=[[Cochabamba (department)|Cochabamba]], [[Chuquisaca (department)|Chuquisaca]], [[Tarija]]\n| region2description=\n\n| region3name=[[Tropical Lowlands (Bolivia)|Tropical Lowlands]]\n| region3color=#9dc490\n| region3items=[[Santa Cruz (department, Bolivia)|Santa Cruz]], [[Beni (Bolivia)|Beni]], [[Pando]]\n| region3description=\n}}\n\n==Cities==\n* [[La Paz]] — the administrative city and seat of the government\n* [[Sucre]] — the constitutional capital and seat of the judiciary\n* [[Rurrenabaque]] - a small town in tropical surrounding close to the Madidi National Park\n* [[Cochabamba]] — Bolivia's third-largest city, with a pleasant, moderate climate\n* [[Oruro]] — famous for its carnival\n* [[Potosí]] — once one of the wealthiest cities in the world due to its silver mines\n* [[Santa Cruz (city, Bolivia)|Santa Cruz]] — the second-largest and most affluent city of Bolivia\n* [[Tarija]]\n* [[Tupiza]] Capital of Sud Chichas Province, it is known for it's beautiful red rock formations, mild climate, and many tourists attractions.\n* [[Riberalta]] Capital of the Bolivian Amazon - it isn't very touristy but there is unique nature around\n\n==Other destinations==\n* [[Amboró National Park|Amboró]] & [[Carrasco National Park]]s &mdash; twin national parks in the most bio-diverse section of the country full of rivers, waterfalls, mountains, and canyons\n* [[Chacaltaya]] & [[Huayna Potosi]] &mdash; the world's highest ski resort and Bolivia's most popular mountain climb\n* [[Jesuit Missions of the Chiquitos]] &mdash; six remote towns of the Gran Chaco founded by the Jesuits in the 17th and 18th centuries\n* [[Madidi National Park]] &mdash; Located a few miles North of [[Apolo (La Paz)|Apolo]], is one of the '''world's most extensive biodiversity reserves.''' Its humid tropical climate has spawned one of Bolivia’s richest woodlands.\n* [[Noel Kempff Mercado National Park]] &mdash; impossibly remote and even more impossibly beautiful Amazonian park, home to the stunning Cataratas Arcoiris waterfall\n*[[Quime]] - Spectacular hidden valley town surrounded by high mountains of the Cordillera Quimsa Cruz, between La Paz & Cochabamba, with mines, waterfalls, native cloud forest and 31 Aimara indigenous communities. Most convenient of Bolivia's valley towns to get to. \n* [[Sajama National Park]] &mdash; beautiful Andean landscapes and Bolivia's highest mountain, Nevada Sajama\n* [[Salar de Uyuni]] &mdash; the spectacular landscapes along the largest salt flats in the world\n* [[Sorata]] &mdash; Hikers' destination, also close to San Pedro caves, which host a nice lagoon\n* [[Tiwanaku]] &mdash; Ancient ruins, a [[UNESCO World Heritage list|UNESCO World Heritage site]]\n* '''Yungas Road''' &mdash; El Camino de Muerte, the World's Most Dangerous Road, leading through dramatic high altitude cliffside jungle terrain in the [[Yungas and Chapare|Yungas region]] from [[La Paz]] to [[Coroico]]\n[['''Kaa Iya National Park''']] - Part of the 2nd largest forested area in the world, this remote and rarely visited National Park '''is the best place in Bolivia to see big mammals, especially Jaguar, Tapirs and Pumas.'''\n[['''Samaipata''']] - Just 3 hours drive from Santa Cruz Bolivia, this inter Andean Town is the base for amazing adventures which include trekking Amboro National Park, The worlds best Condor trek, El Fuerte Ruins, Multiple Waterfalls, Che Guevara Route and more.\n[['''Utuquis National Park''']] - Bolivian Pantanal / Remote yet an amazing place to see Anacondas, Capybara, Birdwatching and the Marsh Deer\n[['''Lomas de Arena''']] - Protected area outside Santa Cruz , this 14,000 hectare desert offers excellent hiking, wildife viewing, birding and Sand boarding \n[['''Santiago de Chiquitos''']] - This incredible small town is host to a huge variety of adventures which include rock climbing, thermal rivers, waterfalls, rock paintings, music festivals, jungle treks and much more\n* [http://www.sustainablebolivia.org/aquicuana-reserve.html The Aquicuana Reserve] - a natural reserve right outside of the city of Riberalta where you can hike or do boat tours\n\n==Get in==\n[[File:Bus stop in Atoche, Bolivia.jpg|thumb|upright=1.3|Bus stop in Atoche, Bolivia with food vendors.]]\nThe [http://www.embassyofbolivia.nl/node/907 following nationalities] will '''not''' need a visa for short stays of less than 90 days as tourists:\nAndorra, Argentina, Australia, Austria, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Croatia, Czech Republic, Denmark, Ecuador, Estonia, Finland, France, Germany,Greece, Hungary, Iceland, India, Ireland, Israel, Italy, Japan, Latvia, Liechtenstein, Lithuania, Luxembourg, Mexico, Monaco, Norway, New Zealand, Netherlands, Panama, Paraguay, Peru, Philippines, Poland, Portugal, Slovakia, Slovenia, Spain, Sweden, Switzerland, Turkey, United Kingdom, Uruguay, Vatican City and Venezuela.  \n\n[https://www.timaticweb.com/cgi-bin/tim_website_client.cgi?FullText=1&COUNTRY=BO&SECTION=VI&SUBSECTION=00&user=KLMB2C&subuser=KLMB2C Canadians do not need a visa] to visit Bolivia but can only stay a maximum of 30 days without a tourist visa and 90 with a tourist visa.\n\nVisitors from countries from [http://en.wikipedia.org/wiki/Visa_policy_of_Bolivia#Group_2_-_Visa_on_arrival Group 2] can obtain a visa on arrival for a fee of around USD100. This fee is estimated in UFV (UNIDAD DE FOMENTO DE VIVIENDA) and it costs 300 UFVs (according to [http://dgfm.minedu.gob.bo/index.php/archivo/descargarESFM/297 INSTRUCTIVO ITA/ESFP/DGFM No. 0097/2015]). Banco Central de Bolivia calcultates [https://www.bcb.gob.bo/?q=cotizaciones_tc UFVs to Bs rate] every day.\n\nAlternatively, obtained at a Bolivian consulate in advance, the visa is free (photo, yellow fever vaccination, photocopies of some passport pages, etc.). It takes between five minutes and 24 hours to obtain the visa at the consulate. The visa is for 30 days. Extensions are possible at immigration offices in Bolivian cities, but not at immigration offices at border crossings. An extension for 30 more days costs BOB210. The immigration office in [[La Paz]] is pretty busy and bureaucracy and photocopies rule the day. You will need a photo of yourself and photocopies of a few things, depending on who you talk to. Then you need to come back 24 hours later to pick up your passport. Extensions in smaller cities might be less hassle. Depending on how many days more you need to stay in Bolivia, you might be better off overstaying your visa and paying a fine at the border (BOB20 per day). This way you also save a page in your passport. All prices are as of June 2013. \n\nThe following nationalities normally cannot obtain a visa on arrival:\nAfghanistan, Angola, Bhutan, Cambodia, Chad, East Timor, Indonesia, Iraq, Libya, Pakistan, Nigeria, Somalia, Sudan, Yemen, and those from the West Bank and Gaza Strip. However, under urgent and special circumstances, foreigners in this group can obtain visas at the port of entry. US citizens will normally receive a triple-entry visa valid for 3 entries per year over a 5-year period.\n\nHolders of Indian passports can obtain a visa on arrival or advanced at any Bolivian Embassy or Consulate - the visa will not take more than 24h to be issued and most times are issued on the spot, as long as the applicant presents the following documents: passport, photos, itinerary of travels in Bolivia, photocopy of credit cards and hotel reservations. And Indians also walk away with [http://bkpk.me/bolivia-visa-for-indians/ no visa fees (gratis visa)]. \n\nNote that ''all'' business travellers and persons wishing to stay longer than 90 days in a year must obtain a visa in advance.\n\nUnless you are under the age of 1, you will need a yellow fever vaccination certificate to apply for a visa.\n\nArriving overland from Peru, US citizen tourist visas can be obtained at the border. [http://travel.state.gov/travel/cis_pa_tw/cis/cis_1069.html Officially], they require a visa application form, a copy of the passport, a copy of yellow fever vaccination (no longer needed in spring 2016), a copy of an itinerary showing departure from Bolivia, evidence of economic solvency (usually credit card suffices, or a printed statement, but they rarely ask for this), a hotel reservation or written invitation, and a 4cm X 4cm or \"passport sized\" photo (they sometimes take photos there so the photos may not be required). A USD160 fee (as of August 2015) is also required, payable in freshly minted cash. Any old or marked bills will not be accepted. There are photocopy machines at border crossings. They also may ask for a second copy of the passport in order to get the entrance stamp.  Allow at least 30-45 minutes to get through from exiting plane to getting baggage.  Another 20-30 after getting baggage to leave the airport.\n\nArriving overland from Chile on 4WD tours from San Pedro de Atacama to Uyuni in Bolivia, US citizens can obtain a visa at the Hito Cajon border crossing. As of April 2017, a tourist visa can be obtained at Hito Cajon with a valid passport, one copy of passport, yellow fever vaccination proof, two passport sized color photographs of the applicant, and $160 in good-condition US dollars. The copy of the passport and the photographs will be taken by Bolivian immigration control.\n\n===By plane===\nAir travel is the obvious way to get to Bolivia, the main airports are located in [[La Paz (Bolivia)|La Paz]] to the western side of the country and in [[Santa Cruz (city, Bolivia)|Santa Cruz]] to the east. The arrival plan must be based mostly in the purpose of your visit to the country; you have to remember that [[La Paz]] receives most of their visitors due to the immense culture and heritage from the Incas and other indigenous cultures from the Andean region, and therefore from La Paz it is easier to move to the [[Tiwanaku]] ruins, [[Oruro]]’s carnival, [[Potosí]]’s  mines, [[Uyuni]], [[Lake Titicaca]], [[Coroico|Los Yungas]] valley and the [[Andes]] Mountains; since La Paz is the seat of government all the embassies and foreign organizations have their headquarters in the city, which is useful in case of an emergency. On the other side, Santa Cruz with a warmer weather could become a good location for doing business visit other alternatives in tourism like the Misiones, the [[Noel Kempff Mercado national park]] or visit the eastern cities. There are also some foreign consulates in Santa Cruz. But don’t forget that the cities in the south and central Bolivia, like [[Cochabamba]], [[Tarija]] and [[Sucre]] also offer a very rich experience; there are several ways to get to these cities from La Paz or Santa Cruz.\n\n====From [[Europe]]====\nFollowing on from Aerosur's demise in September 2012, the best options from Europe to Bolivia are now with Air Europa or Boliviana de Aviacion from Madrid to Santa Cruz. Other connections can be made in neighbouring countries such as Brazil or Peru, or in the US. The cost could go from €1000-1200 to other higher prices depending on the class and duration.\n\n====From [[Latin America]]====\nAirlines that fly into Bolivia from other Latin American countries include LAN from Santiago via Iquique and from Lima, and TACA Perú from Lima to La Paz. Amaszonas flies from Cuzco to La Paz. Avianca flies from Bogotá to La Paz. TAM Mercosur flies from São Paulo and Buenos Aires to Santa Cruz via Asunción. Copa Airlines has begun to fly to Santa Cruz from Panama City. Gol Airlines (from São Paulo and Campo Grande, Brazil) and Aerolineas Argentinas (from Buenos Aires) also fly directly to Santa Cruz. Boliviana de Aviación flies from Buenos Aires and São Paulo to Santa Cruz.\n\n====From the [[USA]]====\nThere are departures from Miami to La Paz and Santa Cruz on American Airlines. Connections are also possible on Latin American airlines such as LAN, Copa, Avianca, and TACA.\n\nOnce you have your international flight booked, it's far easier and cheaper to organize your internal flights from the point of departure.\n\n===By train===\nThere are many train lines in Bolivia, each with varying degrees of quality and efficiency. However, adequate transportation via train can be found.\n\nThe FCA timetable can be found at [http://www.fca.com.bo/Servicios_archivos/Pasajeros/itinerario.jpg their website]. \n\nWatch your belongings.\n\n===By car===\nIt is common for tourists to travel through a land border at the north-east of Chile/ South-West of Bolivia.\n\nKeep in mind that only about 5% of all the roads in Bolivia are paved. However, most major routes between big cities such as Santa Cruz, La Paz, Cochabamba and Sucre are paved. A 4x4 is particularly required when off the flatter altiplano. Be aware that in mountainous regions traffic sometimes switches sides of the road. This is to ensure the driver has a better view of the dangerous drops.\n\nAn international Driving Permit (IDP) is required but *most* times EU or US driving licences will be accepted. There are frequent police controls on the road and tolls to be paid for road use.\n\n===By bus===\nThere are many options for travelling from Argentina to Bolivia by bus. Check out the [http://www.embajadadebolivia.com.ar/turismo/acceso.htm Bolivian Embassy's website] in Argentina for specific options.\nThere is also a bus that runs from Juliaca and Puno in Peru to Copacabana\n\nFrom Brazil there is a painful 30+ hours bus from La Paz to Guayaramerín. Be aware that the border controls are only during the day, and that if the Bolivian side is fixed schedules, the Policia federal has scarce hours on the weekend and also during schedule times they might tell you they are busy etc so plan in abundance.\n\n===By boat===\nIt is common for tourists to arrive in Bolivia by boat, by navigating from the port city of Puno, Peru, over Lake Titicaca.\n\n==Get around==\nTransportation strikes (''bloqueos'') are a common occurrence in Bolivia, so try to keep tuned to local news. Strikes often affect local taxis as well as long-distance buses; airlines are generally unaffected. Do not try to go around or through blockades (usually of stones, burning tires, or lumber).  Strikers may throw rocks at your vehicle if you try to pass the blockade.  Violence has sometimes been reported.  Many strikes only last a day or two.\n\nThere is a [http://www.abc.gob.bo/Transitabilidad,40 government website] with a live map showing which roads are closed or affected by landslides.\n\n===By bus===\n\nBuses in Bolivia are a nice cheap way to get to see the beautiful scenery while travelling to your destination. Unfortunately the buses often travel solely at night. There are different types of buses: \"bed bus\" with fully reclining seats and leg platform (bus cama), \"semi-bed bus\" (semi cama), normal. Keep in mind that roads are occasionally blocked due to protests, often for several days. So ask several companies at the terminal if you hear about blockades, unless you are willing to spend a few days sleeping on the bus.\n \nBus travel is usually pretty cheap. Estimate that it will cost you about USD1 for every hour of travel (it's easier to find travel times online than actual price quotes). Prices do change based on supply and demand. Sometimes you can get a deal by waiting until the last minute to buy. Hawkers are constantly crying out destinations in the bigger bus stations cajoling potential riders to take their bus line. There is a negligible tax for using bus terminals, you pay it as you leave.\n\nUsually you have to \"check-in\" your big bags for the travel - they get a tag and get to the baggage compartment and you get a copy of tag. Overhead reading lamps and air conditioners on buses rarely work (if at all). There usually technically is a WC on board, but it's never open. Rather the bus stops in some predefined \"stations\" for WC (baño) and eating. On longer journeys they'll start some movie on TV in the bus - most are brutal ones. Sometimes (usually when leaving) people gather around or enter the bus to sell food (cuñape, salteña, pollo) to the travellers. At times \"brainwashers\" enter the bus to sell some books (i.e. health-related) - they tell (using their \"plastic\" voice) people different things to persuade them to buy their stuff.\n\nOn average, bus companies are not-that-great to decent, but some are just really bad. It is recommended not to travel with Urus, as they drive less safely than others, and include many many stops which unnecessarily prolong the ride.\n\n===By plane===\nFlying within Bolivia is quick and fairly economical.\n\n*[http://www.aerocon.bo '''Aerocon'''] - flies from [[Trinidad (Bolivia)|Trinidad]] to the harder to reach places of in northeastern Bolivia like Cobija, Guayaramerin, Riberalta and Santa Ana (La Paz region). They also fly to La Paz, Cochabamba, Tarija, Yacuiba, and Santa Cruz. In Santa Cruz, their office is in Aeropuerto El Trompillo.\n\n* <listing name=\"Amaszonas\" alt=\"\" address=\"Av. Saavedra Nº 1649, Miraflores, La Paz\" directions=\"\" phone=\"+591 2 222-0848\" url=\"http://www.amaszonas.com/index.php?id=English\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"info@amaszonas.com\">Most famous for their La Paz to Rurrenabaque route but also fly to Uyuni, Trinidad, Guayaramerin, Riberalta, Cobija, San Borja, Cochabamba and Santa Cruz. Fares are listed under \"tarifas\" on their website, listed below. Their office in Santa Cruz is in El Trompillo airport.</listing>\n\n* '''Boliviana de Aviación - BoA''' [http://www.boa.bo/] - the national airline of Bolivia. Provides economical and reliable travel between the main cities of Bolivia. You can book your tickets online or at BoA-offices in Santa Cruz, La Paz or Cochabamba. Main office in Cochabamba, Calle Jordán #202 esq. Nataniel Aguirre. email: ventasweb@boa.bo phone: +591 901 10 50 10 fax: +591 4 4116477  \n\n* <listing name=\"Gol\" alt=\"\" address=\"\" directions=\"\" phone=\"+55 11 3169-6100\" url=\"http://www.voegol.com\" hours=\"\" price=\"\" lat=\"\" long=\"\"> - has a nightly flight from Santa Cruz into [[Campo Grande]], [[Brazil]] for just US$100. </listing>\n\n* <listing name=\"TAM\" alt=\"Transporte Aéreo Militar\" address=\"Montes n 738, La Paz\" phone=\"+591 3 352-9669\" phoneextra=\"+591 2 284-1884\" url=\"http://www.tam.bo/\">Not to be confused with the homonymous Brazilian-Paraguayan airline, this airline is operated as a civilian service of the Bolivian Air Force and is one of the most well organized and reliable. Their office in Santa Cruz is in El Trompillo Airport, where all of their planes leave from. They fly between La Paz, Cochabamba, Santa Cruz, and Sucre daily. Among internal airlines, they are usually the cheapest. Weight restrictions are 15kg checked and 3kg carry on. They will take bags heavier than this for 5 Bs. per kilo over. </listing>\n\n===By train===\nOn some routes, the roads are in such a dire condition that the train becomes the alternative of choice. Trains are more comfortable than one would expect, having for example reclinable seats. The trip from [[Oruro]] to [[Uyuni]] is especialy beautiful, with the train going literally through an Andean lake on the way.\nThe train is especially good for trips to the Salar de Uyuni and the Pantanal.\n\nComing from [[La Paz]], you need to take a three hour bus ride to [[Oruro]] to catch the train. You best book your tickets a few days before your trip. In La Paz booking office is at Fernando Guachalla No. 494, at the corner with Sánchez Lima (between the Plaza del Estudiante and Plaza Abaroa). Main stops are [[Uyuni]], [[Tupiza]] and [[Villazon]], on the Argentine border. Travel times here. [http://www.fca.com.bo/Servicios_archivos/Pasajeros/itinerario.jpg].\n\nBetween Santa Cruz and the Pantanal it is more straightfoward to organize a trip. Just go to the Terminal Bimodal in Santa Cruz (see the [[Santa_Cruz_(city,_Bolivia)|Santa Cruz]] page for details), or the train station on the border in Puerto Quijarro. The train is also convenient for trips to the Jesuit Missions. Check the website [http://www.ferroviariaoriental.com/] for timetables.\n\n===By taxi===\nShared taxis are common for longer trips between towns and cities that aren't served by bus. \n\n==Talk==\nBolivia has 37 official languages -of which [[Spanish phrasebook|Spanish]] (often called ''Castellano''), [[Quechua phrasebook|Quechua]], and [[Aymara phrasebook|Aymara]] are the main ones. In rural areas, many people do not speak Spanish. Nevertheless, you should be able to get by with some basic Castellano. Bolivia is one of the best places in which to learn or practice your Spanish because of their very clean, deliberate accent. There are many options for studying Spanish in Bolivia, and they are usually very good (often, the program includes a very good homestay component).\n\n==See==\n\n==Do==\n[[Image:141 - down the road of North Yungas.jpg|thumb|right|160px|The old section of North Yungas road]]\n\n* '''The Death Road''' (North Yungas Road including the old section): from La Cumbre to Coroico. A mountainbike tour of 64km where you'll be able to see the diversity of Bolivia. Leave from La Cumbre at 5000mts, in a cold and windy environment, and get to Coroico, in a wet and tropical environment. You can take an organized tour with one of the companies (i.e. Downhill Madness) from La Paz or ride it on your own bike. If you ride on your own, be very careful (ride down in-line one after another, keep safe distance from the rider in front of you, slow down before the turns), use a good mountain bike (at least with front shock absorber), helmet. If you take the tour, you'll get the equipment, instructions and guiding, but you probably won't be allowed to stop to take pictures wherever you want.\n\n* '''Explore the Provinces''': Bolivia is a place to explore; it is mostly still untouched. The people are friendly in the countryside. There are hundreds of off the map, mostly out-of-the-guide places to go in Bolivia, and far more exciting than what the tour agencies and guide books offer. In the La Paz department for example you can easily catch transport to places like Pelechuco, the east side of Lake Titicaca, Achacachi, Isla del Sol, or [[Quime]]... not to mention scores of other villages and small towns. The free govt. tour agencies at the Plaza Estudiantes or Prado can help you find transport anywhere and tell you about it.\n\n==Learn Spanish==\n[http://www.sustainablebolivia.org/ Sustainable Bolivia] is an organization that co-ordinates volunteers and grassroots organizations in Riberalta, and also offers Spanish, and indigenous languages classes. You can live in a house offered by Sustainable Bolivia, stay with a family, or live in a hostel while volunteering or taking classes. \n\n==Buy==\n{{infobox|Foreign currency|It can be difficult to change money other than euros and US dollars, even currency from neighbouring countries! You might find more flexible exchange offices at airports, but be prepared for service fees and poor exchange rates. USD bills smaller than $100 can also be hard to break without accepting a lesser exchange rate.}}\nCAUTION: As of May 2015, it is almost impossible to change US dollars that have the slightest tear or marking, even at the airport. Banks supposedly have to accept them, but locals advise that some banks take 20% discount for such bills.  Make sure your dollar bills are crisp and new.  USDs are NOT widely accepted in hotels, tourist shops, and for large purchases, anymore.  \n\nThe national currency is the ''boliviano'' ('''BOB'''). As of January 2010, the exchange rate is generally USD1 = BOB6.97 or €1 = BOB10. Banknotes come in denominations of BOB200, BOB100, BOB50, BOB20, and BOB10; coins are in BOB5, BOB2, and BOB1 and BOB0.50, BOB0.20, and you will find sometimes BOB0.10 (ten centavos or one-tenth of a boliviano). Bills larger than BOB50 can be hard to split, but a quick phone call or internet session at an Internet Café (see [[#Contact]], below) will usually get you change.\n\nIf you take a bank card with you, make sure your bank card can be used abroad (ask your bank if you are not sure). You don't need a credit card - debit cards work too. If you find your card doesn't work and you are running out of cash, think of your relatives wiring you some money via, eg, Western Union.\n\nCurrency can be exchanged for US dollars and most South American currencies at ''Casa De Cambio'' agencies or street vendors. Expect to negotiate for a favourable exchange rate, as most vendors will try to make money off a tourist.\n\nBanco de Credito (BCP) is a good bank to take cash from. Banco Union should be avoided if possible as it charges a 5% surcharge (as of May 2012), although they do not make any mention of this. Banco Fie doesn't charge any extra fee on atm withdrawals but it lets you take only up to BOB2000 at time (March 2014), it has branches in all bigger cities.\n\n* <buy name=\"Traditional music\" alt=\"\" address=\"\" directions=\"Markets and street kiosks in El Alto, La Paz and other cities and towns\" phone=\"\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"BOB1.5-5\">Bolivian music is very lively and colourful. The CDs are very cheap.</buy>\n\n==Eat==\n{{infobox|Coca leaves|Coca has been part of Andean culture for centuries, and chewing is still very common (and perfectly legal) in Bolivia. You should be able to buy a big bag of dried leaves at the local market. Coca is a stimulant, and it also suppresses hunger. Chewing a wad of leaves for a few minutes should bring slight numbness to your lips and throat. Remember the slogan (printed on souvenir T-shirts): ''Coca no es Cocaina'' (\"The coca leaf is not cocaine\"). But cocaine most definitely is an illegal drug.}}\n\nThe cuisine of Bolivia might be called the original \"meat and potatoes\" -- the latter (locally called ''papas'' from the Quechua) were first cultivated by the Inca before spreading throughout the world. The most common meat is beef, though chicken and llama are also easily found. Pork is relatively common. Deep frying (''chicharron'') is a common method of cooking all sorts of meat, and fried chicken is a very popular quick dish; at times the smell permeates the streets of Bolivian cities. Guinea pigs (''cuy'') and rabbits (''conejo'') are eaten in rural areas, though you can sometimes find them in urban restaurants as well. A common condiment served with Bolivian meals is ''llajhua'', a spicy sauce similar to Mexican ''salsa''.\n \nSome notable Bolivian dishes:\n* '''Pique a lo macho''' - grilled chunks of meat in a slightly spicy sauce with tomatoes and onion, on potatoes \n* '''Silpancho''' or '''Milanesa''' - beef pounded to a thin, plate-sized patty, served on a bed of rice and potatoes, with a fried egg on top (Similar to wiener schnitzel).\n\nStreet food and snacks:\n* '''''Anticucho''''' - Beef hearts grilled on a skewer, served with potatoes and a spicy corn sauce\n* '''''Salchipapa''''' - Thinly sliced sausage fried with potatoes\n* '''''Choripan''''' - Chorizo (spicy sausage) sandwich, served with grilled onions and lots of sauce\n\nMid-Morning snacks typically consists of any of several of meat-filled buns:\n* '''''Salteña''''' - A baked bun filled with meat and potatoes in a slightly sweet or spicy sauce. Be careful when you take a bite, as the sauce will drip all over!\n* '''''Tucumana''''' - Like a salteña but fried\n* '''''Empanada''''' - Similar to a saltena, often filled with cheese as well as meat\n* '''''Cuñape''''' - A small roll filled with cheese, similar to Brazilian ''pão de queijo''. The bread is made from cassava flour.\n\nMany people also start off the day with some concoction involving fruit:\n\n* '''''Ensalada de frutas''''' - Many different fruits chopped in a bowl of yogurt. Very filling. Some stalls may have honey, nuts or gelatin on top, if you like.\n\nVegetarians will find decent to very good options in Gringo-places around the country. But also at market places, there are good vegeratian options on offer (usually potatoes, rice, fried egg and salad for about 7Bs.) In bigger cities, there are some (decent to good) fully vegetarian restaurants.\n\n==Drink==\nJuice bars appear at most markets. Shakes (either with water or milk) are 2-3Bs. Locals can be seen drinking Vitaminico, an egg, beer, and sugar concoction or \"Vitima\" which includes coca leaves.\n\n* '''''Licuado''''' - Water or milk blended with your favorite fruit combination. A big spoonful of sugar will be added unless you specifically ask them not to. Try the milk and papaya licuado.\n* '''''Vitaminico''''' - Don't ask what's in here. Many fruits, milk, sugar, a shot of beer, and, if you wish, a whole egg (with shell).\n* '''''Mocochinchi''''' - A drink made by brewing peaches and spices  together in water. Very good but some people are turned off by the shriveled peach which is typically served with each glass.\n* '''''Api''''' - A traditional corn base drink usually found in the open-air markets. If you didn't know it was corn you'd never guess it though because this stuff is good.\n* '''''Chicha de camba''''', '''''chicha de maiz''''', '''''chicha de mani''''' - non-alcoholic ''chichas'', made from corn and similar stuff. Very popular in the East of the country.\n\n===Alcohol===\nThe legal drinking/purchasing age is '''18''', however enforcement is lax. But in bars and clubs, expect harsh treatment if you're not the legal age, as the age limit is a lot more enforced in those places; bar and club owners can get fined.\n\n* Bolivia Altiplano traditional alcoholic drink is ''chicha de colla'', a whitish, sour brew made from fermented corn and drunk from a hemispherical bowl fashioned from a hollowed gourd (round-bottomed so you can't put it down). It's customary to spill a bit of chicha on the ground before and after drinking it as an offering to ''Pachamama'', the Inca earth godess.\n\n* '''''Singani''''' is a grape liquor that's mixed with Sprite or ginger ale with lime garnish to make a cocktail called ''chuflay''.\n\n* There are a number of local beers, the largest being '''Pace&ntilde;a''' and its high-end brand '''Huari'''. '''El Inca''' is a very sweet low-alcohol dark beer (think Guiness with sugar and a lower alcohol content). Orange Cocktails are a popular drink too!\n\nTarija is located at 1924 meters above sea level, and is known for its wine-making, vast vineyards, and award-winning wines. Hence you can visit and taste wine at its beautiful wineries, such as: '''Campos De Solana''', '''Kohlberg''', '''Casa Vieja''', '''Valle De Concepción''', and '''Casa Real''', where the famous Singani is made.\n\n==Sleep==\nOffering a favorable exchange for Western tourists, lodging can be found at very reasonable prices throughout the country, from [[hostels]] to luxury hotels.  One traveller to Bolivia reports that during a 4 week trip in 2012 they stayed mainly in hostels with the average rate per night c. USD6.50. The most basic accomodation facilities are Alojamientos (at BOB20/25 per night).\n\n==Learn Spanish==\n*<do name=\"ABC Spanish Tuition School\" alt=\"\" address=\"Miraflores, Avenida Simon Bolivar 1880 (At the end of the alley Nº 1785)\" directions=\"opposite Rent a car Oscar Crespo Maurice\" phone=\"+591 2 2220582\" phoneextra=\"+591 72552871\" url=\"http://abc-spanishtuition.tk\" hours=\"Mon-Sun 8AM-8PM\" price=\"\" lat=\"\" long=\"\">Teaching Spanish since 1992. \nShort-term Intensive lessons - Lessons start any day of the week - No registration fees - Flexible schedules - Individual/Tailor-made & Collective Lessons - Family Homestay - Volunteer Work - Educational Tours - Intensive and Super Intensive Lessons 3-10 hrs/day from 1-16 weeks - Free Hostal pick up.\nThe school and the families are located near the parks, in Miraflores, the greenest part of La Paz. </do>\n* '''i.e. Language Institue:''' Custom language learning programs. [http://www.instituto-exclusivo.com]\n*<do name=\"Bolivian Spanish School\" alt=\"\" address=\"Kilometro 7 Street, Nº 250\" directions=\"across from Parque Bolivar\" phone=\"+591 4 6443841\" url=\"http://www.bolivianspanishschool.com/\" hours=\"Mon-Fri 8:30AM - 12:30PM and 2:30PM - 6:30PM, and Sat 8:30AM- 12:30PM\" price=\"\" lat=\"\" long=\"\">Teaching Spanish since 2004. \nFlexible programs for 20 hours per week, 30 hours per week, or custom-made – One-on-one or group lessons - Professional, experienced teachers – Activities like salsa lessons, cooking classes, and city tours –Help with homestays or local accommodations – Connections to volunteer work – Latinamerican movies, free internet and WiFi – coffee breaks and more.\nThe school is located across from the beautiful and tranquil Parque Bolivar. </do>\n\n* '''Fox Language Academy''' [http://www.foxacademysucre.com/]\n\n==Work==\n\nWhile Bolivia is one of the poorest nations in all of South America, this country is rich in culture, natural beauty and wild animal diversity. One possibility to work in here is as a '''volunteer'''. Whether you want to express your love for animals or support the local community, you will get plenty of opportunities to do good in this country. To get an overview over all the volunteering possibilities in Bolivia, it's best to visit a [https://www.volunteerworld.com/volunteer-in-bolivia comparison platform].\n\n==Stay safe==\nApply common sense and take precautions that apply elsewhere. All tourists should be careful when selecting a travel guide and never accept medication from unverifiable sources. At night try to use \"radio taxis\" as fake cabs are common and robbings and even rapes do occur. It is a good idea to register with the consulate of your country of residence upon entry into the country. And it is also helpful learn at least basic Spanish to keep yourself a little safe.\n\nBeware of a scam involving 'non-uniformed' policemen asking for your passport and permit; official policemen will always be satisfied with a copy of your passport and a copy of your Bolivian visa on your passport.  In the event that the con-artists requesting this get aggressive do not hesitate to scream, yell, or do something to attract the attention of passers by.  This will usually be enough to scare them away.\n\nThe 'improvements' made to Yungas Road (the famous highway to death) have made the experience of traversing it go from emotionally harrowing to finger-biting, and Bolivian bus drivers seem all too confident when crossing it. Make sure to look for a reputable driver/bus line from other travelers if you do decide to make this trip.\n\nBe careful of cars when crossing the streets (particularly at roundabouts). Cars go quite \"chaotic\". There are usually no lane marking and minimal signage.\n\nIt may be not safe to carry a big amount of cash with you. Instead, consider carrying just enough cash for a couple of next stops and a bank card to \"fill up the tank\" (be careful: smaller and not-so-touristy towns have no ATMs). Take some \"international\" (i.e. $US or €) currency for a safe start. As a safety measure you can take \"secondary\" bank card with you (leaving \"primary\" at home) pre-filling it with amount of money according to your travel estimate (and adding some more - for unexpected cases). If you are running out you may contact your relatives at home to log in into your e-bank account and move some more money to your \"secondary\" card. It may be wise to attach some sticky stripes of paper to your card with some fake PIN written in unclear manner (i.e. only segments of digits visible - other segments are to \"guess\") - if you lose your card and somebody enters a wrong PIN 3 times, your bank will probably block the card.\n\n===Annoyances===\nBeware that many vendors will try to overcharge you. This is not specific to Bolivia, so just deal with it, of course. However, it's more perfidious here. Don't read on if it's not important to you. Coming from the North (Peru, etc.)  Luckily  price tags are more common in Bolivia. However, many times they quote inflated prices. So, they are only there to give tourists a false sense of control. \nThus you not only need to check for price tags, but also if the quoted prices seem sensible. Of course, when there are no price tags it gets worse. Markups of 100% or more are not uncommoin. Why you should care?  The locals will respect you more if you deal with money in a responsible way like they have to. Also, it's a good idea supporting honest vendors. \n\n===Consulates===\n* [[Image:pl-flag.png|20px]] '''Honorary Consulate of Poland''', consuladopolonia@yahoo.com. Honorary Consul: Esther Caroly Salzmann Donig (speaks Polish, Spanish, English, French and German), esthersalzmann@yahoo.com. Calle Capitan Ravelo #267, tel. (00-591-2) 291 1754, (00-591-2) 291 1751.\n\n==Stay healthy==\nSome parts of Bolivia like La Paz (3650), Potosí (4010), Oruro (3950) and the Lake Titicaca region are high altitude, so adequate precautions against \"sorojchi\" [[altitude sickness]] should be taken. \n\nAt local pharmacies they sell sorojchi pills, that are supposed to help with altitude problems. It has painkillers as well as natural herbs to help cope with the symptoms of \"sorojchi\". In many parts of the Altiplano you can purchase coca leaves, which are reputed to be useful against soroche.  Coca tea (\"mate de coca\") is available in tea bags in many markets. \n\nHowever, severe cases of high altitude disease can be treated at the High Altitude Pathology Institute at Clinica IPPA [http://altitudeclinic.com]. This Clinic has the most advanced technology including a hyperoxic/hypoxic adaptation chamber. In addition, the sun's ultraviolet rays are much stronger -- up to 20 times -- than at sea level. A sun hat, sunglasses, and skin protection (sunblock or long sleeves) are advised.\n\nYou can't usually drink tap water in Bolivia. There's plenty of bottled water being sold in the stores. One note though: if you're not a Coca-Cola company (very strong in Bolivia) fan, in some towns you may have trouble getting water from other manufacturer.\n\n* ''' Yellow fever''' vaccination is recommended for those who plan on spending time in the Bolivian Amazon. It ''must'' be taken 10 days prior to the person’s arrival into the country if the visitor plans to visit rural areas. \n\n* '''Malaria''' prophylaxis is recommended if the visitor plans to visit tropical-rural areas. \n\n* As a preventive measure, taking the following vaccines is recommended: Hepatitis A, Hepatitis B and Tetanus, Diphtheria and Measles Booster-Vaccines.\n\n==Respect==\nDo not use the word \"indio\" in Bolivia to describe indigenous people. It is considered offensive. The term they use is \"campesino\" which translates to peasant or \"indígena\". \"Cholo\" is a campesino who moved to the city, and though originally derogatory, has become more of a symbol of indigenous power. Nevertheless, some locals still use the word cholo as a derogative term.\n\nAlso, keep in mind the stark cultural and racial differences between the \"cambas\" of the Llanos in the east, and the \"collas\" of the Andes in the west who are Native American. They may not always tend to not be on good terms and have been even more fiercely divided in recent years since the election of Evo Morales, the country's first indigenous president. The two peoples tend to be very defensive about their side of Bolivia, so discussing your travel to the other cultural region of the country may be seen as insulting. In Santa Cruz, a city more industrialized, associating with indigenous culture is frowned upon, whereas in La Paz and elsewhere, it is quite the contrary.\n\nIt is also good to keep in mind that the Bolivian culture is very warm and friendly. That being said, it is very rude not to say Buen Día or Buenos Días to passerbys in the streets. It also customary give up your seat on a city bus for someone older than you, or a woman. Which people will do for you if you look a little bit older.\n\n==Contact==\nBolivia has three cellphone companies, '''Entel''', '''Tigo''', and '''Viva'''. All three have outlets on practically every block in major cities. There are internet cafés practically everywhere, they typically cost about BOB3/hour, or about USD0.50/hour.\n\nIf you have a smartphone (unlocked if you bring it from home) it can be quite affordable to buy a local SIM card and use the internet from the cellular network (pretty good quality 3G most of the time, don't expect any coverage in the most remote areas). You can always use your phone to make a Wi-Fi hotspot and share the connection to your computer (watch carefully how much you use if you don't want to bust your budget!). If you don't have a smartphone, you can still buy packages for minutes to call. Please note that SMS messages sent from Bolivia to other countries don't always get delivered. Buy your SIM card (called ''chip'' in Spanish) at an official outlet of the company. Entel seems to be the most popular one. SIM cards can be bought elsewhere but cost more. At the outlet they will also help you set up your phone. Be advised that you will need a \"2G chip\" for a normal phone and a \"4G chip\" for a smartphone if you want to use the internet.\n\nWhile traditional payphones still exist, you can also make local calls for BOB1 (USD0.15) from cellular phones at kiosks.\n\nIf you are staying for a while, consider buying SIM cards for your cellphones. They are quite cheap and you get good network coverage in all main cities and towns. Bolivia uses GSM 1900 frequency, so check, if your cell phone supports this one (older European phones don't). You can buy a cell phone in Bolivia for as cheap as BOB200.\n\nTo call from Entel use:\n* For local landline - 010-citycode-number, i.e. for La Paz 010-2-number.\n* For international landline or mobile - 0010-countrycode-number.\n\nEntel offers something similar to \"packages\" - these may be cost savers, ie if you mainly want to use cell phone to call international mobiles. A \"package\" entails you a fixed number of minutes of a smaller rate to call some area. To buy such a \"package\" you have to have required amount of cash in your phone card. You call a special number (some automatic service) and make a sequence of choices (by reading instructions on the screen and pressing numbers). After buying you have to use your minutes the same day. Call gets automatically disconnected when minutes expire.\n\nUsing Skype from Internet cafes (there are a lot of these) may be an option, but microphones are screwed-up in most places thus making this option difficult. In [[Uyuni]], for example, most internet cafés will not allow using Skype or, in case it is a Wi-Fi network, they will switch it off if they see you using Skype. They want you to use their phone service instead.\n\nYou can send a postcard (BOB9 to Europe) to your loved ones from post offices.\n\n===Adventure Travel=== \nThere is a number of adventure activities to do when in Bolivia. Paragliding can be done in both Cochabamba and La Paz. There is also the possibility of doing some mountain climbing, mountaineering and trekking. It is recommended when participating in these type of activities to use companies with a known safety record. Andesxtremo has offices both in Cochabamba and La Paz. In Cochabamba you can find them at calle la paz # 138 entre ayacucho y junin Phone: 4523392, 70721520, 60365816. In La Paz Francisco Bedregal 2962, entre Victor Sanjinés y Pedro Guerra, Nuestra Señora de La Paz Phone:70193392. Other adventure activities that can be done while in Bolivia include white water rafting in and around el Chapare three hours from the city of Cochabamba. If you find yourself in Santa Cruz you can also go skydiving, there is only one company that does this and they can be found at El Trompillo airport in Santa Cruz.     \n \n[[Category: Bolivia]]\n[[Category: Countries]]\n\n\n[[ca:Bolívia]]\n[[de:Bolivien]]\n[[eo:Bolivio]]\n[[es:Bolivia]]\n[[fi:Bolivia]]\n[[fr:Bolivie]]\n[[hu:Bolívia]]\n[[it:Bolivia]]\n[[ja:ボリビア]]\n[[nl:Bolivia]]\n[[pl:Boliwia]]\n[[pt:Bolívia]]\n[[ro:Bolivia]]\n[[ru:Боливия]]\n[[sv:Bolivia]]\n[[wts:Category:Bolivia]]\n\n\n[[WikiPedia:Bolivia]]\n[[Dmoz:South America/Bolivia/]]\n[[World66:southamerica/bolivia]]\n\n{{isPartOf|South_America}}\n{{outline}}\n{{countryguide}}"
        }
    }
}