{
    "parse": {
        "title": "Botswana",
        "pageid": 220,
        "wikitext": {
            "*": "{{pagebanner|Botswana banner.jpg}}\n\n{{quickbar\n| image=Onkovango_delta_Botswana_Afrika_november_2004.jpg\n| caption=Okavango Delta\n| location=Botswana in its region.svg\n| flag=Flag of Botswana.svg\n| capital=[[Gaborone]]\n| government=Parliamentary republic\n| currency=Pula (BWP)\n| area=600,370km²\n| population=1,639,833 (July 2006 est.)\n| language=English (official), Setswana (official and national)\n| religion=Christian 70%, others including indigenous beliefs 30%\n| electricity=0 kWh\n| callingcode=+267\n| tld=.bw\n| timezone=UTC+02\n}}\n[http://www.botswana-tourism.gov.bw/ '''Botswana'''] is a land-locked country located in [[Southern Africa]] and bordering on [[Namibia]], [[South Africa]], [[Zimbabwe]] and [[Zambia]]. \n\nBotswana is famous for its wildlife, areas like the [[Chobe National Park]], [[Moremi National Park]] in the [[Okavango Delta]] and the [[Central Kalahari Game Reserve]] have a very high concentration of game. \n\nThe bulk of the Kalahari desert falls within Botswana's borders and Botswana is home to most of the world's San (bushman) population.\n\n==Understand==\nThe economy, one of the most robust on the continent, is dominated by diamond mining and tourism.  \n\nAs a tourist destination, Botswana has traditionally opted for a high price / low numbers formula, in part as a conservation strategy, and also to differentiate itself from neighbouring tourist countries who follow a mass market tourism policy. However, that isn't to say that Botswana is an expensive high end destination. In many respects costs and quality compare to neighbouring South Africa. However the two jewels in Botswana's tourism crown (the Okavango delta and Chobe National Park) are quite exclusive, although there are budget options.\n\nFor independent travellers touring the region Botswana offers an interesting contrast to the poverty of its northern neighbours, and is free from the apartheid hangover that still blights South Africa. Botswana has a long established tourism industry and levels of service are good, hassles are low and tourist numbers minimal away from the main parks, allowing for some magical 'off the beaten path' experiences.\n\n===History===\nFormerly the British protectorate of Bechuanaland, Botswana adopted its new name upon independence on 30 September 1966\n\n===Public Holidays===\nThe public holidays in Botswana are:\n*1 Jan '''New Years' Day'''\n*'''Easter weekend''' of \"Good Friday\", \"Easter Saturday\", \"Easter Sunday\" and \"Easter Monday\"; a four day long weekend in March or April set according to the Western Christian calendar.\n*1 May '''Workers Day'''\n*1 July '''Sir Seretse Khama Day'''\n* <listing name=\"Mid July\">President's Day</listing>\n* <listing name=\"September 30\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">Botswana Day</listing>\n* <listing name=\"December 25\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">Christmas Day</listing>\n* <listing name=\"December 26\">Day of Goodwill</listing>\n\n==Regions==\n{{Regionlist|\n\nregionmap=Botswana.png |\nregionmaptext=Regions of Botswana |\n\nregion1name=[[Kalahari (Botswana)|Kalahari]] |\nregion1color=#C99933 |\nregion1items= |\nregion1description= The sparsely populated Kalahari Desert and its fringe.|\n\nregion2name=[[Okavango-Chobe]] |\nregion2color=#996666 |\nregion2items= |\nregion2description= The northern part of the country with the [[Okavango Delta]] and good game reserves like [[Chobe National Park|Chobe National Park]] and [[Moremi National Park]].|\n\nregion3name=[[Southeast (Botswana)|Southeast]]  |\nregion3color=#669999  |\nregion3items=  |\nregion3description=Home to the capital, [[Gaborone]], and most of the country's population.|\n}}\n\n==Cities==\n* [[Gaborone]] \n* [[Francistown]]\n* [[Ghanzi]]\n* [[Kasane]]\n* [[Maun]]\n<!--Smaller towns and villages, need to be moved off to regions when they're created -->\n* [[Nata]]\n* [[Gweta]]\n* [[Kanye]]\n* [[Tsabong]]\n<!-- I believe there is a maximum of 9!\n* [[Mogapi]]\n* [[Palapye]]\n* [[Serowe]]\n -->\n\n==Other destinations==\n* [[Okavango Delta]] - A unique geological formation where a delta is formed by a river (the Okavango) flowing into the Kalahari desert instead of the ocean. Part of the Delta is designated as [[Moremi National Park]]\n* [[Central Kalahari Game Reserve]] \n* [[Chobe National Park]] - A great place to see wildlife, and a good point from which to move on to [[Victoria Falls]].\n* [[Kgalagadi Transfrontier Park]] \n* [[Nxai Pan National Park]]\n* [[Northern Tuli Game Reserve]] - a unique corner of Africa where nature & culture combine in spectacular wildlife, stunning scenery and fascinating history\n* Khama Rhino Sanctuary [http://www.khamarhinosanctuary.org.bw/home] - a good stop between Gaborone & Maun where you can do a rhino tracking with rangers (Mmupi is one the most experienced rangers)\n\nSee also [[African National Parks]]\n\n==Get in== \n{{VisaRestriction|Entry will be refused to citizens of [[Democratic Republic of the Congo]], [[Guinea]], [[Liberia]], and [[Sierra Leone]], and those who recently visited those countries  due to the current ebola virus outbreak.}}\n\n===Entry requirements===\n\nNationals of all [[Europe|European Union]] member states, plus [[Angola]], [[Antigua and Barbuda]], [[Argentina]], [[Australia]], the [[Bahamas]], [[Bahrain]], [[Barbados]], [[Belize]], [[Brazil]], [[Brunei]], [[Canada]], [[Chile]], [[Costa Rica]], [[Cuba]], [[Dominica]], the [[Dominican Republic]], the [[Gambia]], [[Grenada]], [[Guyana]], the [[Rome/Vatican|Holy See]], [[Hong Kong]], [[Iceland]], [[Israel]], [[Jamaica]], [[Japan]], [[Kenya]], [[Kiribati]], [[Kuwait]], [[Lesotho]], [[Liechtenstein]], [[Malawi]], [[Malaysia]], [[Maldives]], [[Mauritius]], [[Mexico]], [[Monaco]], [[Mozambique]], [[Namibia]], [[Nauru]], [[New Zealand]], [[Norway]], [[Oman]], [[Papua New Guinea]], [[Paraguay]], [[Peru]], [[Qatar]], [[Russia]], [[Samoa]], [[Saint Kitts and Nevis]], [[Saint Lucia]], [[Saint Vincent and the Grenadines]], [[San Marino]], [[Saudi Arabia]], [[Seychelles]], [[Sierra Leone]], [[Singapore]], [[Solomon Islands]], [[South Africa]], [[South Korea]], [[South Sudan]], [[Swaziland]], [[Switzerland]], [[Tanzania]], [[Tonga]], [[Trinidad and Tobago]], [[Turkey]], [[Tuvalu]], [[Uganda]], [[United Arab Emirates]], [[United States]], [[Uruguay]], [[Vanuatu]], [[Venezuela]], [[Zambia]] and [[Zimbabwe]] may enter Botswana visa-free for up to 90 days within a 12-month period.\n\nFor citizens of other nations, a visa must be obtained prior to arrival. As of February 2009, a visa from the Botswana Embassy in the US costs USD107; for more information and a complete list of countries which do/don't require visas, see: [http://www.botswanaembassy.org/page/guidelines-for-completing-a-visa-application].\n\nIf you require a visa to enter Botswana, you might be able to apply for one at a British embassy, high commission or consulate in the country where you legally reside if there is no Botswana diplomatic post. For example, the British embassies/consulates in Al Khobar[http://www.ukba.homeoffice.gov.uk/countries/saudiarabia/commonwealth-bots/?langname=null], Almaty[http://www.ukba.homeoffice.gov.uk/countries/kazakhstan/commonwealth-bots/?langname=null], Amman[http://www.ukba.homeoffice.gov.uk/countries/jordan/commonwealth-bots/?langname=null], Belgrade[http://www.ukba.homeoffice.gov.uk/countries/serbia/commonwealth-bots/?langname=null], Damascus, Geneva[http://www.ukba.homeoffice.gov.uk/countries/switzerland/commonwealth-bots/?langname=null], Guatemala City[http://ukinguatemala.fco.gov.uk/en/visiting-uk/visas/countries-issue], Jakarta[http://www.ukba.homeoffice.gov.uk/countries/indonesia/commonwealth-bots/?langname=null], Jeddah[http://www.ukba.homeoffice.gov.uk/countries/saudiarabia/commonwealth-bots/?langname=null], Kiev[http://www.ukba.homeoffice.gov.uk/countries/ukraine/commonwealth-bots/?langname=null], Pristina[http://www.ukba.homeoffice.gov.uk/countries/kosovo/commonwealth-bots/?langname=null], Rabat[http://www.ukba.homeoffice.gov.uk/countries/morocco/commonwealth-bots/?langname=null], Riyadh[http://www.ukba.homeoffice.gov.uk/countries/saudiarabia/commonwealth-bots/?langname=null], Rome[http://www.ukba.homeoffice.gov.uk/countries/italy/commonwealth-bots/?langname=null], Sofia[http://www.ukba.homeoffice.gov.uk/countries/bulgaria/commonwealth-bots/?langname=null] and Zurich[http://www.ukba.homeoffice.gov.uk/countries/switzerland/commonwealth-bots/?langname=null] accept Botswana visa applications (this list is '''not''' exhaustive). British diplomatic posts charge £50 to process a Botswana visa application and an extra £70 if the authorities in Botswana require the visa application to be referred to them. The authorities in Botswana can also decide to charge an additional fee if they correspond with you directly.\n\n===By plane=== \n\nBotswana's main airport is Sir Seretse Khama in Gaborone. Most flights arriving in Botswana are from [[Johannesburg]] in South Africa, but routes from Cape Town, Harare and Nairobi are also available.  [[Maun]] also has a limited number of international flights (Cape Town, Windhoek). The distance between Gaborone and Maun is more than 1,000km. Maun is very much a tourist attraction spot.\n\n===By train===\nTrains to/from [[South Africa]] have been withdrawn since 1999. A rail link from from Francistown [[Bulawayo]], [[Zimbabwe]] was started in June 2006 [http://www.seat61.com/Botswana.htm].\n\n===By car=== \n\nThere are several entry points by road to Botswana: In the south at [[Gaborone]], providing access from [[Johannesburg]]; in the west providing access from [[Namibia]]; the north providing access from [[Namibia]], [[Zambia]] and [[Zimbabwe]]; and at [[Francistown]] in the east, providing access from [[Harare]]. All road access is good and the primary roads within Botswana are paved and well maintained.\n\nComing from [[Namibia]], you can either go north to [[Maun]], or south along the Trans-Kalahari Highway to [[Lobatse]].\n\n===By bus=== \nThere is regular bus service from Johannesburg to Gaborone, which takes six hours. There is also service from [[Windhoek]], Namibia via the [[Caprivi Strip]] which will drop you in Chobe National Park, in northern Botswana. There is also bus service from [[Victoria Falls]] in Zimbabwe. See Intercape Mainliner [http://www.intercape.co.za/] for information on service from Namibia and Zimbabwe.  Private shuttles ran until 2004 from Windhoek directly to Maun and in late 2005, such a service was starting up again. Alternatively, there is a public bus that runs from Windhoek to Gaborone every Sunday morning via Ghanzi, where you can catch another public bus that reaches Maun by Sunday evening.\n\n==Get around==\nVery few locals know street names and addresses, and you are likely to have to get directions in terms of landmarks.  Botswana doesn't have a postal delivery system to addresses (just to centralised mail collection points), so even when streets are well-marked, the names may be unfamiliar to residents.\n\nThrough a combination of coaches and combies, you can get anywhere in Botswana without any trouble, though public transport is spotty away from big cities and major axes but hitchhiking is popular and very easy. However, hitchhiking should only be done in desperate circumstances, as Botswana driving is often very erratic and it can be a harrowing experience to have a stranger drive you somewhere. It is advisable to arrive at the bus station quite early, as the busses do fill up quickly, and it is not uncommon to spend several hours standing in the aisle waiting for a seat to free up (remember to bring water, as the buses are often not air conditioned). \n\n===Maps===\n'''Online maps''' for Botswana seem to have errors and omissions. Google is particularly worrisome in that it includes tracks that are actually fences, or are incomplete (eg the bridges haven't been built) - for example if you plot the route from Gaborone to Maun it will suggest you drive via the Central Kalagadi Games Reserve fence, hmmm. Untarred roads present the most uncertainty for the driver, a good option is to look on Google Earth and measure the width of the track, if it is 3 metres wide then it is likely to be a sandy track where you won't get above 20kph.  If it is 15 metres wide it'll be a graded gravel road where you may get up to 100kph.\n'''Paper maps'''.  A good wall map can be purchased from the Dept. of Surveys and Mapping in Gaborone (near the train station) for P80.  Edition 6 (2010) is the latest version.\n\nFinally map reading skills are not high for the Batswana, navigation via landmarks is the norm.\n\nA new system called PlotFind (plotfind.co.bw) was developed for Botswana. It currently contains the addresses (plot numbers) of locations in Gaborone. This system is the best solution for online maps in Gaborone\n\n===By car===\nThe roads are paved and well maintained, so travel by car is also not a problem, provided that one keeps a close eye out for the cows, donkeys and goats that spend much time in the middle of the road.\n\nThe Trans-Kalahari Highway is an old cattle route, now newly paved and easiy drivable with a 2-wheel drive. It runs from [[Lobatse]] to [[Ghanzi]] in [[Botswana]], making the connection from [[Windhoek]], [[Namibia]] to [[Gaborone]], Botswana. It is a long and uneventful drive, but you get a good feel for the Kalahari Desert. Fuel is available in [[Kang]] at the Kang Ultra Shop, which also offers a respectable selection of food, overnight chalets, and inexpensive camping.\n\nBe aware that the road from Maun to Kasane (through Chobe national park) is an unpaved sandy track, even though some maps show it as a proper road.  You need a 4x4 for this route.  Going via Nata to / from Kasane/ Maun is much quicker and easier.\n\n'''Buying a car'''.  Botswana isn't a bad place to buy a vehicle for a multi-month long trip around southern Africa, which you can then sell at the end. Botswana is considerably cheaper than South Africa and Gaborone is swamped with second-hand Japanese and UK imports. The paperwork is not too daunting and the dealer can do most of it for you.  Websites like [http://want-a-car.co.bw/ Want a Car] can give you a good idea of prices.\n\nBeware of the many corrupt police officers which are posted at check points, as they often try and claim fines of up to Pula 1000,00 for allegedly ignoring a stop sign or other offenses. Be polite, stay calm and respect their (assumed) authority when being pulled over.\n\nAlso, the country is divided by many veterinarian fences, which are set up to break the spread of cattle diseases (foot and mouth and so on). There, you are required to surrender all fresh meat products, drive through a disinfectant pit to cleans your tyres and rub your shoes on a disinfectant solution too. Depending on the month and situation, sometimes these posts are not manned, but at times the checks here can be thorough.\n\n===By bus===\nThere are many bus companies in Botswana. One of the biggest is Seabalo[http://www.seabelo.bw]. From Gaborone you can travel by bus to any bigger city in Botswana.\n\n===By train===\nBotswana Railways operates Botwana's railways. The main line goes from [[Lobatse]], near the South African border, via [[Gaborone]] to [[Francistown]] at the Zimbabwean border. As of March 2016 the trains are running and have been refurbished on the Lobatse - Francistown route.\n\n==Talk==\n\nThe official languages of Botswana are '''English''' and '''[[Tswana phrasebook|Tswana]]'''. [http://en.wikipedia.org/wiki/Kalanga_language Kalanga] is spoken near the Zimbabwe border areas, and is similar to Shona.\n\nThe language of business in Botswana is English and most people in urban areas speak it, although in the more rural areas many people do not speak English, particularly the older generations. The primary indigenous tongue is Tswana, and is the first language of the overwhelming majority of the population. It is not difficult to learn basic greetings and such, and using these in conversation will make people very happy.\n\n==See==\nWildlife is Botswana's main draw. Wildlife parks compose nearly one-fifth of the country. In these parks you will find lions, cheetahs, crocodiles, hippos, elephants, antelope, wild dogs, and hundreds of species of birds. Visitors can take safaris and stay in lodges running the gamut from inexpensive dorms for backpackers with tour buses to $1,000+/night private lodges with your own maid & driver.\n\nAmong southern Africa's most impressive&mdash;and popular&mdash;wildlife destinations is the '''Okavango Delta''' where the Okavango River widens into the world's largest inland delta. Lying in the middle of the arid Kalahari, the swamps & water channels attract animals from thousands of kilometers around and triples in size (to 100 000 sq. km.!) during floods in July and August. Nearby '''Chobe National Park''' has a large population of elephants and it's also easy to spot many of Africa's well-known species, especially zebras and lions. The bleak salt pans of '''Makgadikgadi Pans National Park''' attract a large number and variety of birds year-round. Other great game parks include '''Nxai Pan National Park''', '''Mokolodi Nature Reserve''', & '''Gemsbok National Park'''. \n\nMost of the native tribes in Botswana only dress in traditional outfits and perform rituals for tourists. Nevertheless, for the culture-cravers, the villages of '''D'Kar''' and '''Xai-Xai''' have many offerings, including arts, crafts, and the opportunity to participate in various rituals. '''Tsodilo Hills''' contain one of the largest collections of rock art on the continent.\n\n==Do==\nOne of the most interesting ways to get to know a country and its people, and which has become increasingly popular,  is to  '''volunteer'''. As a volunteer you can support Botswana in terms of community development, wildlife conservation or education.\nTo get a broad overview of all the organizations that offer volunteer opportunities in Botswana, you can also see [[Volunteering|the volunteering page]].\n==Buy==\nBotswana's currency is the ''pula', often locally symbolised as \"P\"; its ISO 4217 code is '''BWP''' placed directly before the amount with no intervening space. \n\nBanknotes circulate in denominations of BWP10, BWP20, BWP50, BWP100 and BWP200. You can find 5, 10, 25, and 50 thebe coins, together with BWP1, BWP2 and BWP5 pieces and 100 thebe equals one pula. In Setswana, pula means \"rain\" and thebe means \"shield.\" Rough conversions were BWP10.61=USD1,  BWP11.35=€1, BWP13.13=GBP1 and BWP0.78=ZAR1 in Jan 2017.\n\n===Shopping===\nFor the independent traveller prices in Botswana compare to neighbouring South Africa. Notable exceptions are petrol and diesel which are about a third cheaper in Botswana, and alcohol, which is about a third more expensive.\n\n==Eat==\nIndigenous Botswana cuisine is similar to the rest of southern Africa and offers little to inspire. Beef is taken seriously and can be of exceptional quality. The braai is a popular cuisine.\n\n==Drink==\n\nThe legal drinking/purchasing age of alcoholic beverages is '''18'''.\n\nThroughout Botswana the tap water is safe to drink (this general advise is taken with care, as it varies considerably depending on the area - so make sure you ask locals and travelers alike before drinking it!). Good fruit juice is hard to find (South African 100% juice blends are the norm) although Spar do a range of good juices.  The national beer, St Louis, is often derided by foreigners as being worse than domestic US lagers. Most opt for Namibian or South African imports.\nBottle stores are widely found in most places, and even regular, slightly bigger supermarkets are allowed to sell booze.\n\n==Sleep==\nMost of the accommodation establishments in Botswana are located near the larger towns and cities, but there are also many secluded game lodges tucked away in the wilderness areas. In the towns it is rare for accommodation to be booked up. For the lodges it is safer to book your accommodation well in advance before travelling to Botswana. This can be done on-line or via travel agents that have the knowledge of the country. As with many safari destinations booking through an agent in your own country may work out cheaper than booking direct - shop around with different agents to get the best price.\n\nAs a rule of thumb P400 (US$50) should get you an acceptable en suite room in most of the towns.  In the smaller towns away from the tourist routes quality and prices will be lower.\n\n==Cope==\n===Newspapers===\nBotswana has several English language daily and weekly newspapers.  [http://www.mmegi.bw/ Mmegi], [http://www.gazettebw.com/ Botswana Gazette], [http://www.botswanaguardian.co.bw Botswana Guardian] and [http://www.sundaystandard.info/ Sunday Standard] being the most respected. The Government produces the [http://www.dailynews.gov.bw/ Daily News], which is distributed free and invariably has a picture of the President on the front cover.  For quality international news the South African [http://mg.co.za Mail & Guardian] is available in Gaborone, Pick'n'Pay sells this for a discounted P17, rather than the P24 cover price.\n\n==Contact==\nBotswana uses GSM900 and has three mobile operators, [http://www.orange.co.bw/mobile/coverage.php Orange], [http://www.mascom.bw/home/ Mascom] an MTN offshoot, and [http://www.bemobile.co.bw BEMobile] run by Botswana telecom. Mascom has the worse reputation for customer service. When topping up try and wait for the end of the month when all three operators offer top-up specials.  Coverage is restricted to the towns and highways, out in the bush there is generally nothing.\n\nFor internet, internet cafes are present in most towns, and have useable speeds. Wifi is available in the pricier / expat orientated cafes and restaurants, but game lodges tend to be internetless.  In general speeds are noticeably slower in Botswana than South Africa - do any serious downloading before you arrive.\n\n==Learn==\nThe University of Botswana [http://www.ub.bw/] is in Gaborone, they participate in several university exchange programmes.\n\n==Stay safe==\nPeople in Botswana are very friendly and the crime rate is low. There isn't much to worry about on this front. Nevertheless, crime has been on the rise over the past several years, so always be aware of your surroundings. Basic common sense will keep you safe from the predatory wildlife in rural areas. Botswana happens to be one of the safest countries in Africa, no civil war, less corruption, human rights, no natural disasters e.g earthquakes or tsunamis.\n\n=== LGBT travellers ===\nWhile there are technically laws against homosexuality, they are unenforced and Botswana is among the most tolerant of African nations for the LGBT community.\n\n==Conservation==\nBotswana is an eco-friendly tourist destination.   The country and it's travel board focus on sustainable things for tourists to do.  The fees for Botswana's Safari parks go right back into the parks.\n\n==Stay healthy== \nBotswana's HIV infection rate, estimated at 24.1%, is the 2nd highest reported in the world. Exercise regular universal precautions when dealing with any bodily fluid and remain aware of this high rate of infection. Take precautions accordingly. Wear rubber gloves when dressing someone else's cut, even if they are a child.\n\nThe northern part of Botswana, including Chobe National Park and the Okavango Delta is in a [[malaria]] zone, so it is advisable to take the relevant precautions. Seek medical advice before travelling to these areas.\n\nWater in urban areas is chlorinated, and is drunk from the tap by the local population.  Still, short term visitors with sensitive stomachs may feel more secure drinking bottled water.  Outside of urban areas, the water is untreated and straight from the borehole and poses a slightly higher risk to the traveller. \n\n{{isPartOf|Southern_Africa}}\n{{outline}}\n{{Countryguide}}\n\n[[WikiPedia:Botswana]]\n[[Dmoz:Africa/Botswana/]]\n[[World66:africa/botswana]]\n\n{{related|African_National_Parks}}\n{{related|African_flora_and_fauna}}\n{{related|Discount_airlines_in_Africa}}\n\n[[wmc:category:Botswana]]\n\n[[ca:Botswana]]\n[[de:Botsuana]]\n[[eo:Bocvano]]\n[[es:Botswana]]\n[[fi:Botswana]]\n[[fr:Botswana]]\n[[hu:Botswana]]\n[[it:Botswana]]\n[[ja:ボツワナ]]\n[[nl:Botswana]]\n[[pt:Botsuana]]\n[[ro:Botswana]]\n[[ru:Ботсвана]]\n[[sv:Botswana]]\n[[zh:博茨瓦纳]]\n[[wts:Category:Botswana]]\n{{title-icons|dotm-icon}}"
        }
    }
}