{
    "parse": {
        "title": "Burundi",
        "pageid": 274,
        "wikitext": {
            "*": "{{pagebanner|Burundi Banner.jpg}}\n   \n|australia=http://www.smartraveller.gov.au/zw-cgi/view/Advice/Burundi\n|us=http://travel.state.gov/content/passports/english/alertswarnings/burundi-travel-warning.html\n|uk=https://www.gov.uk/foreign-travel-advice/burundi\n|canada=http://travel.gc.ca/destinations/burundi \n|nz=http://www.safetravel.govt.nz/burundi\n|ireland=http://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/burundi}}<br clear=\"all\" />\n{{quickbar\n| image=BujumburaView.jpg\n| caption=Bujumbura \n| location=Burundi in its region.svg\n| flag=Flag of Burundi.svg\n| capital=[[Bujumbura]]\n| government=Republic\n| currency=Burundi franc (BIF)\n| area=''total:'' 27,830km²<br />''water:'' 2,180km²<br />''land:'' 25,650km²\n| population=8,090,068 (Jul 2006)\n| language=Kirundi (official), French (official), Swahili (along Lake Tanganyika and in the Bujumbura area)\n| religion=Christian 67% (Roman Catholic 62%, Protestant 5%), indigenous beliefs 23%, Muslim 10%\n| electricity=\n| callingcode=\n| tld=\n| timezone=\n}}\n\n[http://www.burunditourisme.com/ '''Burundi'''] is a small country in [[East Africa]], although it has some cultural and geographical ties with [[Central Africa]]. It is surrounded by [[Rwanda]], [[Tanzania]] and the [[Democratic Republic of the Congo]].\n\n==Understand==\nBurundi covers 27,834 km² with an estimated population of almost 8.7 million. Although the country is landlocked, much of the south-western border is adjacent to Lake Tanganyika, one of the deepest lakes in the world.\n\nBurundi is one of the ten least developed countries in the world and it has the lowest per capita GDP of any nation in the world. Cobalt and copper are among the nation's natural resources. Other resources include coffee, sugar and tea. \n\nBurundi possesses all the elements of a young nation with ancient traditions that constitute its very rich culture: art, dance, music, and handicrafts. Its aim is to ensure the transmission of the cultural inheritance from the forefathers and ancestors evidenced by belongings and objects they revered and favoured, the dances and rhythmic music they composed.\n\nBurundi is an off the beaten path destination for most visitors to East Africa, and one should consider the cost/benefit calculation before travelling to this friendly, if limited in options destination. Travelling outside the capital of Bujumbura at all, or even within the city after nightfall, comes with considerable risk. A jovial time can be had here, for a price, and with an understanding of French you will have a better chance of enjoying your time here. Plan ahead to avoid risks of malaria, and drink plenty of water. As of March 2014, the nation is still recovering from catastrophic flooding and is embroiled in a conflict over if and when the next elections will be held.\n\nComforts found in Rwanda will be much harder to come by here. \n\n===History===\nThe earliest known people to live in Burundi were the Twa, pygmy people who remain as a minority group there.  The people currently known as Hutu and Tutsi moved into the region several hundred years ago, and dominated it.  Like much of Africa, Burundi then went through a period of European colonial rule. At the beginning of the twentieth century, Germany and Belgium occupied the region, and Burundi and Rwanda together became a European colony known as Ruanda-Urundi.\n\nThis ended with its independence from [[Belgium]] in 1962.  In the decades since then, Burundi has known civil wars between the Hutu and Tutsi populations (much like the better-known genocide in Rwanda to the north), and a series of political assassinations. Peace and the (re)establishment of civil democracy took place in 2005 with a cease-fire and the election of former Hutu rebel Pierre Nkurunziza as president who intends to stand for a controversial third term.\n\n===Climate===\nBurundi in general has a tropical highland climate. Temperature varies considerably from one region to another as a result of differences in altitude. The central plateau enjoys pleasantly cool weather, with an average temperature of 20°C. The area around Lake Tanganyika is warmer, averaging 23°C; the highest mountain areas are cooler, averaging 16°C. Bujumbura’s average annual temperature is 23°C. Rain is irregular, falling most heavily in the north-west. Dry seasons vary in length, and there are sometimes long periods of drought. However, four seasons can be distinguished: the long dry season (June–August), the short wet season (September–November), the short dry season (December–January), and the long wet season (February–May). Most of Burundi receives between 1,300 and 1,600mm of rainfall a year. The Ruzizi Plain and the north-east receive between 750 and 1,000mm.\n\n==Regions==\n[[Image:Burundi Regions map.png|thumb|upright=2|Map of Burundi]]\n\nThe country is divided into 16 provinces ( a few are: Bubanza, Bujumbura, Bururi, Cankuzo, Cibitokeas), communes in rural areas and 'quartiers' in the capital. There are a total of 117 of such groupings. There are several lower level designations of administration, including the 'sector', the 'colline', or 'hillside', and the smallest grouping, the \"Nyumba Kumi\" or 'group of 10 houses.'\n\n==Cities==\n*[[Bujumbura]] - the capital and largest city, situated on the north-eastern shore of Lake Tanganyika\n*[[Bururi]] - southern city\n*[[Cibitoke]] - northwestern city\n*[[Gitega]] - the former colonial capital, second largest city, in the centre of the country\n*[[Muyinga]] - northeastern city\n*[[Ngozi]] - northern city\n\n==Other destinations==\n* '''Kibira National Park''' - Situated at the top of the apex Zaire-Nile, with its 40,000 ha (hectares) of preserved forest land, is the largest completely untouched natural area in Burundi. Its forest constitutes a real shelter for chimpanzees, baboons, and monkeys (cercophitecus and colobus) scattering away at the approach of human beings and defying all laws of equilibrium and gravity. The park is criss-crossed by a network of 180km of tracks and paths mainly used by guard car patrols and motorized tourists. The guards of the park will scout for you in the wood undercover and you will be able to discover the fascinating attraction of the primeval forest and the varied, melodious songs of birds. Mountain chains hide thermal springs, and access to the park is made through the tea plantations of Teza and Rwegura which count among the top scenic beauties of this region.\n\n*'''Ruvubu National Park''' - The National Park of Ruvubu lies on both sides of the Ruvubu River and is limited by high rise mountains. It was freed from human inhabitants and returned to the wild completely. The track and length of the path network is approximately 100km and includes many observation lookouts. You will be accommodated in your newly erected chosen camp, then you will be able to tell your friends when you are back home about tracking buffaloes along these trails where the joyful, gleeful songs of all the African birds accompany you. You may think of it as springing forth at every winding turn on the path.\n\n*'''Rusizi Natural Reserve''' - The Natural Reserve of Rusizi may be your first nature trek in Burundi as it is very near the capital city of Bujumbura. The River Delta extends over 500ha of vegetation made of ''Phragmites mauritianus''. It is a natural shelter for families of antelopes and hippopotamuses that come here in quest of grazing land. At the end of the track if you are lucky enough you may meet with a few crocodiles fast asleep on the golden sand of the river banks. The Rusizi Palmgroves (situated on the Cibitoke road 10km away from Bujumbura) is an exceptional landscape that will no doubt make your mind drift away from your day to day preoccupations. It offers to the visitor rich vegetation made of euphorbia, thorny bushes and tall palm trees of the ''Hyphaena bengalensis var ventricosa'' specie, and a completely adapted environment gratified by only a few sparse rains. Right in the deepest part of the reserve you will be able to admire the natural ponds left by the Rusizi meanders. This place is a paradise for birds which come there by the hundreds and feed themselves by dive-fishing. If you are patient enough you will be able to see some hippopotamuses paddling in the shallow waters feeling at home as well as on the ground.\n\n*'''Bururi Natural Reserve''' - The Natural reserve of Bururi is a 3,300ha expanse of altitude damp forest. The town of Bururi offers visitors this wonderful panorama. To visit the park first go to the INECN office in Bururi, it's not common knowledge among Bururians that you have to do this first. If you are told that there is no entry fee and no guides are available, this is not true. At the office you can pay the entry fee of BIF5,000 and arrange a guide (BIF5,000). In this place there are about 117 different species of birds, and 25 different species of mammals have been identified in a forestland surrounding of multifarious vegetation. On a walking circuit along the botanical lanes and trails of this forest the visitor will fully enjoy the wild coolness of mountains densely covered with trees of many different species. This region is only 33km distant from Roumonge. The road through it will take you from the lakes along miles of breathtaking panoramas.\n\n*'''Vyanda Natural Reserve''' - This is a forest reserve that can be accessed from the town of Rumonge.  The main attraction here is the ability to see chimpanzees.  Currently the facilities for visitors are almost non-existent but if you go to the INECN office (remember to pronounce it the French way when asking for directions, roughly \"ENCN\" pronounced the English way) in Rumonge you should be able to organise a visit.  It's generally set up for people with their own transport but a visit by local transport can be arranged.  Expect to pay BIF10,000 for entry and guide if you see chimps, BIF5,000 if you don't.  You should be able to arrange transport from Rumonge for around BIF15,000 for a return trip. The chimps here are not habituated to humans so don't come expecting the close encounters that are possible in some places.\n\n*'''Rwihinda Lake Natural Reserve''' - The Rwihinda Lake Natural Reserve is a real sanctuary for migratory aquatic birds which come to the site by the thousands to reproduce.  All these now protected birds can nest more and more on these green swamps and islets of the lake. Crested cranes and herons live a peaceful life there. The visitor can drift along on barges to approach many species of birds without risk of frightening them.\n\n*'''Nyakazu Break and the Karera Falls'''\n\nThe natural Forest Reserves of Roumonge, Kigwena and Mugara are in process of development to enable chimpanzees and cercopithecus monkeys to find enough food to stay there and procreate. The thermal waterfalls situated in the Mugara reserve will give you a natural massage. The beaches of Tanganyika nearby will welcome you for a well deserved swim and rest.\n\n==Get in==\n\nAll nationalities require a visa to visit Burundi, except citizens of the [[Democratic Republic of the Congo]], [[Kenya]], [[Rwanda]], [[Tanzania]] and [[Uganda]]. In Europe, visas are available from the [http://www.burundi-embassy.be/ Burundi Embassy in Belgium].\n\nTwo types of visa are available at Bujumbura airport and (in theory, but with problems in reality) at borders.  A 3 day transit visa costs USD40.  A multiple entry 1 month visa costs USD90 on arrival or can be obtained from embassies prior to travel.\n\n===By plane===\nBujumbura International Airport is served by the following passenger airlines:\nKenya Airways (Nairobi); Fly 540 (Nairobi);\nRwandair Express (Kigali, Johannesburg);\nEthiopian (Addis Ababa);\nBrussels Airlines (Brussels);\nAir Burundi is currently not operating (March 2010);\nSouth Africa Airlines;\nUgandan Airlines\nA taxi from airport is 30.000 BF, (11-12 US$), according to exchange rates at july 2017 1 us$: 2600 BF\n===By bus===\nBuses are available mainly from Bujumbura, around the central market. There are only international buses to Rwanda,DRC and Uganda. Companies include Amahoro, Belveder, Otraco and Yahoo. It is also possible to get into Burundi in the east. To do this take a bus to Kabanga (Tanzania), and from there take a shared taxi to the Burundian border. From the south, minibuses run from Kasulu to Manyovu, from where boda-bodas take you through to the Burundi border post. Shared taxis continue from there to Mabanda. Minibuses also run from Gatumba on the DRC border to Bujumbura.\n\n===By boat===\nYou can use the ferries to travel along Lake Tanganyika, but they do not operate regularly.\n\n==Get around==\n\n==See==\nBujumbura is in the western part of the country. Moving towards the east, travelers will be able to visit Gitega; it’s a large market right in the center of the town with a Museum of Traditions (ancient utensils, pictures, commentary). Travellers will have to make advance bookings to be able to watch an extraordinary and fascinating show unique in the world: “The Drummers of Giheta” playing in their traditional environment. Then you will be making headway towards Rutana to see the admirable panorama of the Karea Falls and the Nykazu Break, called the “Break of the Germans”, which is an exceptional lookout that oversees the Kumoso plain. You will be ending your tour by the visit of Gihofi, a booming town with its new sugar refinery in the heart of the sugar cane plantations country.\n\nTowards the Southeastern part of the country, don’t miss by any means a visit to the Nile Sources near Rutovu. Don’t forget to take your swimming gear with you; otherwise, you may miss the benefit of the hot springs in charming surroundings. You will also be able to see on your way the last traditional enclosed villas (round habitations surrounded by wooden fences in turn surrounded by grazing meadows and ploughed fields).\n\nFurther south, you will be able to cross a line of villages succeeding one after another and wedged between the lake and abrupt mountains. Fortunately, you will be able to stop and have a rest, or enjoy nautical sports and have a meal in restaurants or simply stop for a drink, on nicely arranged fine sand beaches. Still further south is the Nyanza Lake. Why not to take a boat and go to Tanzania on the other side of the lake and visit Gombe Natural Park?\n\nTowards the north just before reaching Bugarama, there is an important market centre of high quality fresh foodstuffs. You can walk across the primeval forest of Kibira which has difficult access. Carry on towards Kayanza and Ngozi, two big agricultural production and trade villages. At Kirundo, near the border with Rwanda, you will discover the small lakes of the North, the peacefulness and serenity of their jagged borders. Take a boat and drift on the Rwihinda Lake to admire numerous bird species (crested cranes, wild ducks, fishing eagles, etc.).\n\nOn the road from Muyinga to Cankuzo, a visit to the Natural Park of the Ruvuvu Rivers is a must now that it is endowed with accommodation infrastructure; there you’ll be able to admire Burundi protected buffaloes and dorcas (gazelles). The surrounding primeval forest will no doubt leave you with an unforgettable memory.\n\n===Landmarks and Monuments===\nIn Bujumbura, climb to the “Belvedere” on the top of the hill, a dominating point of the town. You’ll be able to visit the mausoleum of Prince Louis Rwagasore, founder of the Uprona party and Hero of the independence of Burundi.\n\nTen kilometres south of Bujumbura at Mugere is the Livingstone-Stanley Monument, a stone marking a spot where the two famous explorers David Livingstone and H. M. Stanley spent two nights on 25-27 November 1871 as guests of Chief Mukamba during their joint exploration of the northern end of Lake Tanganyika, following their first meeting at Ujiji, Tanzania 15 days previously.\n\n114 km away from Bujumbura, on the Bujumbura-Ijenda-Matana road lays Rutovu, a town where a pyramid was erected at the southernmost source of the Nile, at an altitude of 2,000m.\n\nIt is impossible to make a list of all the places worth making a stop, as Burundi is a real Garden of Eden of irresistible attraction. When arriving in Bujumbura, for information on all your circuits, itineraries and tours go to the National Office of Tourism where a variety of choices are available to you. You will be able to see everything: the Nyakazu Break to the east, the Karera Falls, the Tanganyika Lake panoramas at Vyanda and Kabonambo, the tea plantations of Teza or Rwegura. The reservoir built at this place is surrounded by beautiful scenery. All mentioned are a wealth of natural wonders to which it is worth devoting your time and attention.\n\n===Museums===\nThere are two museums in Bujumbura and Gitega.\n\nThe second largest town in the country, Gitega, has the National Museum founded in 1955 where there is an exhibition of a magnificent ethnographic collection of objects owned by the Crown and that could be seen at the Court in the first part of the 20th century, together with an archaeological collection and historical photographs.\n\nYou will enjoy the old photographs of our kings, princes and queens of the 19th century, surrounded by a lot of objects owned by men and women of those days; jewellery, baskets from all regions, earthenware for many uses, calabashes to keep water or for churning, war and hunting spears, ploughing instruments, iron-working and sculpting instruments.\n\nIn Bujumbura, the '''Musée Vivant''' near the lake presents a great part of the treasures in a wider place surrounded by magnificent gardens. Old and modern crafts are presented in beautiful small cabins. However, the masterpiece of this museum is the reconstruction in real dimensions of a royal habitation. The entire surrounding courtyard can be visited and the main hut topped by an interlaced dome covered by a thatched roof.\n\nThe Musée Vivant keeps a bird house, where a few local species can be seen and a herpetological centre, where there are displays of snakes and many species of reptiles. This living museum was regarded as one of the most renowned centres in Africa since its collection was opened to the public in 1988.\n\nNot all visitors will enjoy it, but it is possible to feed the crocodiles, leopard and some of the snakes in the Musée Vivant. For BIF2,000 you can buy a live guinea pig and select your recipient to feed.\n\nWatch out for Tina the chimpanzee when visiting the Musée Vivant; she frequently escapes from her cage and can follow visitors around, this can be misconstrued as chasing. Her handlers assure that she is not dangerous and just wants to play.\n\n* <buy name=\"\" alt=\"\" address=\"\" directions=\"\" lat=\"\" long=\"\" phone=\"\" tollfree=\"\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\"></buy>\n\n===Travel agencies===\nThe careful attention, local knowledge and planning given you by a local travel agency can make your visit to this small country better as many visitors have discovered.\n\n*[http://www.augustinetours.com Augustine Tours]\nbased in Burundi offers Gorilla Safaris Travel Tour Holidays-Mountain trekking safaris-Culture and history-Primate tracking-Birding and Eco-tours in Burundi, Rwanda and Uganda\nTel +257 22 27 80 00\nEmail:info@augustinetours.com\n\n*[http://www.burundi-travel.com  Burundi Travel] \nTel: +257 79 980 180 ou 78 980 180 \nEmail: info@burundi-travel.com\n\n==Do==\n\n==Talk==\nAlthough most travellers will find that they can pass through with a working knowledge of [[French]] and/or English, some familiarity with [[Swahili]] or the related local language, [[Kirundi phrasebook|Kirundi]], is helpful, particularly in rural areas. The problem is that Kirundi is extremely difficult to learn. Kirundi and [[Kinyarwanda]] (the official language in Rwanda) are quite similar in their complexity.\n\n==Buy==\n[[File:Burundi 20 Franc Obverse.jpg|thumb|BIF20 banknote obverse]]\nThe currency is the ''Burundian franc'' ('''BIF'''). \n\nAs july 2017 the exchange is: 2.600 to us $, don't accept less than 2.400 not even in the airport office, despite the offical rates posted.\n\n===Shopping===\nBurundi is endowed with a tradition of flourishing craftsmanship specialising in unique, delicate and attractive shapes and designs. Burundi has developed plastic arts only very recently. The visitor will be able to find Gitega and Bujumbura artists who are very talented and able to carve scenery on wooden boards and paint landscapes with their trademark beautifully shaded bluish backgrounds.\n\nA great place to find these is an outdoor market right across from the ''Musée Vivant'', which also has other traditional crafts of wood or cotton, as well as baskets.\n\n==Eat==\nFor the international traveller, Burundi offers some culinary surprises -- fresh fish from Lake Tanganyika and produce from the nation's rich volcanic soil are particularly notable.  There is a sizeable South Asian community, offering curried dishes alongside the more traditional rice and beans, and French-inspired European offerings.  For lighter meals, samosas and skewered meats are common, and bananas and fresh fruit are often served as a sweet snack.\n\nThe national dish is beef brochettes (kebabs) and grilled plantains (cooking bananas) available almost everywhere.\n\n==Drink==\nSoft drinks and beer are readily available. As in Rwanda & DRC, big 72cL Primus bottles are available for between USD1-2 as well as Amstel, which is about USD2. Both are locally produced and of good quality.\n\n==Sleep==\nAlthough accommodation in rural areas can be basic, Bujumbura hosts a number of international-grade hotels, catering to needs of international clientèle including the UN.\n\n==Learn==\n\n==Work==\nEducation is now compulsory for children between the ages of 7 and 13. Primary education lasts for six years. The languages of instruction in schools are Kirundi and French. General secondary education lasts for seven years, while vocational secondary education usually lasts for five. The percentage of eligible children attending school decreased from 28% in 1967 to 18% in 1975 before rising to 51% in 1992. As of 1999, 45% of primary-school-age children were enrolled in school, while only about 5% of eligible young people attend secondary or technical schools\n\n==Stay safe==\nAlthough some semblance of normalcy has returned to much of the country with the conclusion of the nation's democratic transition and a democratically chosen head of state in August 2005, travellers should be warned to exercise extreme caution. The still active rebel group, Forces Nationales de la Libération (FNL) continues to attack government forces and civilians. Threats posed by banditry and armed robbery, as well as petty crimes, remain. Avoid travelling after dark; be aware of curfew laws. Many roads close at night as some villages and neighbourhoods, most embassies and some organizations have curfews. As in any other conflict or post-conflict situations, visitors should consult their embassy to be apprised of the latest local developments, and be sensitive to the changing needs regarding the security of the local environment.\n\n===Homosexuality===\nIn 2009 the Burundian government criminalized homosexual acts between males; LGBT people should avoid all travel to Burundi.\n\n==Stay healthy==\nBe careful of kiosk foods and avoid unboiled water. Also ensure you have been vaccinated.\n\nAs in many other African countries, HIV infection is widespread.\n[http://www.scienceinafrica.co.za/2002/february/burundi.htm One source] suggests 18.6% in the cities and 7.5% in the countryside as of 2002.\n\n==Respect==\nRespect for the Burundian Elders is a requirement. The younger people of the villages with kinship systems show respect to parents, grandparents, aunts, uncles and to strangers. The Burundians also show respect to younger and of same age. The Burundians show respect and appreciate it in return.\n\n==Contact==\n\n{{outline}}\n{{isPartOf|East_Africa}}\n{{Countryguide}}\n\n[[WikiPedia:Burundi]]\n[[Dmoz:Africa/Burundi/]]\n[[World66:africa/burundi]]\n\n[[ca:Burundi]]\n[[de:Burundi]]\n[[eo:Burundo]]\n[[es:Burundi]]\n[[fi:Burundi]]\n[[fr:Burundi]]\n[[hu:Burundi]]\n[[it:Burundi]]\n[[ja:ブルンジ]]\n[[nl:Burundi]]\n[[pl:Burundi]]\n[[pt:Burundi]]\n[[ru:Бурунди]]\n[[sv:Burundi]]\n[[wts:Category:Burundi]]"
        }
    }
}