{
    "parse": {
        "title": "Cameroon",
        "pageid": 306,
        "wikitext": {
            "*": "{{pagebanner|Cameroon Banner.jpg}}\n{{quickbar\n| image=Cameroon house.jpg\n| caption=A house in Cameroon\n| location=Cameroon in its region.svg\n| flag=Flag of Cameroon.svg\n| capital=[[Yaoundé]]\n| government=Unitary republic; multiparty presidential regime (opposition parties legalized in 1990)\n| currency=communaute financiere africaine franc (XAF) \n| area=475,440km²\n| population=17,340,702 (July 2006 estimate)\n| language=4 major African language groups, English & [[French]] official\n| religion=indigenous beliefs 40%, Christian 40%, Muslim 20%\n| electricity=\n| callingcode=+237\n| tld=.cm\n| timezone=\n}}\n\n[http://www.cameroun-infotourisme.com/english/index.html '''Cameroon'''] is in [[West Africa]]. It borders [[Nigeria]] to the west, [[Chad]] to the northeast, the [[Central African Republic]] to the east and [[Equatorial Guinea]], [[Gabon]], and the [[Republic of the Congo]] to the south. \n\nWhile Cameroon is not the largest country in Africa, in some ways it's as large as Africa itself. Known as \"Africa in miniature\" it features French and English speaking portions, Muslim and Christian dominated regions, the tallest mountain in West Africa and terrain that includes rain forest, desert plains, mountains and high plateau.\n\n==Understand==\nCameroon is a diverse and multi ethnic country. American tourism is rare; most of the country's tourists come from Europe (predominantly Belgium).\n\n===History===\nThe territory of present day Cameroon was first settled during the Neolithic period. Portuguese sailors reached the coast in 1472. Over the following few centuries, European interests regularised trade with the coastal peoples, and Christian missionaries pushed inland. In the early 19th century, Modibo Adama led Fulani soldiers on a jihad in the north against non-Muslim and partially Muslim peoples and established the Adamawa Emirate. Settled peoples who fled the Fulani caused a major redistribution of population.\n\nThe German Empire claimed the territory as the colony of Kamerun in 1884 and began a steady push inland. With the defeat of Germany in World War I, Kamerun became a League of Nations mandate territory and was split into French Cameroun and British Cameroons in 1919. The French carefully integrated the economy of Cameroun with that of France and improved the infrastructure with capital investments, skilled workers, and continued forced labour.\n\nThe British administered their territory from neighbouring Nigeria. Natives complained that this made them a neglected \"colony of a colony\". The League of Nations mandates were converted into United Nations Trusteeships in 1946, and the question of independence became a pressing issue in French Cameroun. France outlawed the most radical political party, the Union des Populations du Cameroun (UPC), on 13 July 1955. This prompted a long guerilla war. In British Cameroons, the question was whether to reunify with French Cameroun or join Nigeria.\n\nOn 1 January 1960, French Cameroun gained independence from France under President Ahmadou Ahidjo, and on 1 October 1961, the formerly British Northern Cameroons became a part of Nigeria, while the formerly British Southern Cameroons united with its neighbour to form the Federal Republic of Cameroon.\n\n===People===\n\n===Climate===\nVaries with terrain, from tropical along the coast to semiarid and hot in the north. If you are going during the summer, plan on lots of rain every day. It might be cold up in the mountains, especially at night.\n\n===Holidays===\n'''January 1:''' New Year's Day\n\n'''January 1:''' Independence Day\n\n'''February 11:''' Youth Day\n\n'''May 1:''' Labour Day\n\n'''May 20:''' National Day\n\n'''August 15:''' Assumption\n\n'''October 1:''' Unification Day\n\n'''December 25:''' Christmas Day\n\n==Regions==\n\n{{Regionlist\n| regionmap=Cameroon regions map.png\n| regionmaptext=\n| regionmapsize=upright=1.7\n\n| region1name=[[Adamaoua]]\n| region1color=#ae829f\n| region1items=\n| region1description=\n\n| region2name=[[Coastal Cameroon]]\n| region2color=#79b482\n| region2items=\n| region2description=\n\n| region3name=[[Northern Cameroon]]\n| region3color=#a5a881\n| region3items=\n| region3description=\n\n| region4name=[[Northwest Highlands]]\n| region4color=#a0c486\n| region4items=\n| region4description=\n\n| region5name=[[South Cameroon Plateau]]\n| region5color=#729da2\n| region5items=\n| region5description=\n\n}}\n==Cities==\n* [[Yaoundé]] (French speaking)\n\n* [[Bamenda]] (English speaking)\n* [[Buea]] (English speaking)\n* [[Douala]] — the largest city and main centre of trade in [[Cameroon]]. (French speaking)\n* [[Ebolowa]] (French speaking)\n* [[Garoua]] (French speaking)\n* [[Kribi]] (French speaking)\n* [[Limbe]] (English speaking)\n* [[Ngaoundere]] (French speaking)\n\n==Other destinations==\n\n* [[Dja Faunal Reserve]] is on the [[UNESCO World Heritage List]].\n* [[Korup National Park]]\n* [[Mt. Cameroon]], the highest mountain in West Africa\n* [[Ngoketunjia]] in the North West Province is a bastion of culture and tradition\n* The 360-km [[Ring Road]]\n* Lake Oku (Inside the Ring Road)\n* Oku Village\n* Kumbo\n* Tado Dairy Co-op\n\n==Get in==\n{{warningbox|Cameroon has closed its borders with the [[Central African Republic]] due to violence raging there. Travel within 40km of this border is not advised, nor in the border region with north-east [[Nigeria]] (''Jan 2015'')}}\n\n{{VisaRestriction|Entry will be refused to citizens citizens of [[Guinea]], [[Liberia]], [[Nigeria]] and [[Sierra Leone]], and those who recently visited those countries due to the current ebola virus outbreak.}}\n\nAll foreigners, except citizens of [[Central African Republic]], [[Chad]], [[Republic of the Congo|Congo-Brazzaville]] and [[Nigeria]], must obtain a visa to visit Cameroon. It is '''very''' advisable to obtain it before arriving.\n\nThere any many types of visa:\n'''airport transit visa''' for airport transit;\n'''visitor visa''' for visiting friends and family in Cameroon;\n'''business visas''' for work-relating activity in Cameroon; \n'''tourist visa''' for tourism purposes;\n'''student visa''' for studying abroad and learning at the universities; \n'''employment visa''' for taking up work in Cameroon;\nand '''permanent residence visa''', which is issued if you a marry a Cameroonian.\n\nWhat you will need to get the visa:\n\nFor all visas:\n*A '''yellow fever vaccination certificate''', regardless of what country you're from. You must also show this to the authorities at the airport once arriving in Cameroon. \n\n*The '''application form''' and '''2 passport-size photographs'''.\n\n*The '''application fee''' (ex: In March 2011, this was USD141 for citizens of all countries except the visa waiver countries mentioned above).\n\n*Your '''passport''' with at least six months remaining before expiration.\n\nThen, depending on whether you are requesting a Visitor Visa or a Tourist Visa, you will need:\n\nFor a Visitor Visa:\n*A '''letter of invitation''' (for a visitor's visa) and a reservation confirmation from your hotel (for a tourist's visa). If you need a visitor visa, the person you're visiting must create the letter invitation, and get it approved and stamped by the local authorities before sending it to you. The letter must state that you have a place to stay during your trip (e.g. the home of your hosts). If you're staying in a hotel, a hotel reservation will suffice.\n\nOR\n\nFor a Tourist Visa:\n*A '''consular letter''' from your bank stating your current balance. It must be signed by the bank for it to be valid. \n*A '''reservation confirmation''' from your hotel.\n\nCheck the Cameroon Embassy website in your country of residence (or closest) for more up-to-date information. Map of embassies and other [http://www.diplocam.cm/minrexsite/diplocam/index.php?option=com_gmapfp&view=gmapfplist&id_perso=0&Itemid=78&lang=en diplomatic missions of Cameroon]\n\n===By plane===\nFrom Europe, Cameroon can only be reached via:\n* [[Paris]] (Air France)\n* [[Brussels]] (Brussels Airlines)\n* [[Istanbul]] (Turkish Airlines)\n\nThere are several more options connecting through African cities, including though not limited to:\n\n* [[Lagos]] (Virgin Nigeria and Bellview Airlines)\n* [[Nairobi]] (Kenya Airways)\n* [[Casablanca]] (Royal Air Maroc)\n* [[Addis Ababa]] (Ethiopian Airlines)\n\nSometimes airport staff try to help with the luggage in order to get extra euros/dollars from travellers.\n\nThere is also an official airport tax (10.000 CFA) for outgoing flights.\n\n===By train===\n\n===By car===\n\n===By bus===\n\n===By boat===\nIt is probably possible to travel by boat from the island of Bioko(Equatorial Guinea).\n\n==Get around==\n\nTour Operators in Cameroon:\n*'''BERUDEP''' Is a local organization that offers volunteer opportunities for responsible travelers. They have very experienced guides and can arrange for CAR RENTAL at a local price.\n\n*'''Heritage Tours Cameroon'''  Heritage Tours offers experienced guides and activities that range from eco-tourism to safari-tourism  to cultural tourism to volunteer activities and homestays. Heritage Tours can arrange tours through Cameroon’s equatorial rainforests in search of the pygmies and gorillas, through the plantations and cultural manifestations of Cameroon's diverse ethnic groups, and to the north to explore Cameroon's pristine Safari parks. '''Heritage Tours offers free tourist information:''' Heritage Tours holds a database of local information with up to date prices, opening and closing times, seasonal activities etc. \n\n===By plane===\n\nCamair-Co [http://www.camair-co.cm/en.html] is currently operating as a national carrier and on domestic flights.\n\n===By train===\n\nTrain service, Camrail [http://www.camrail.net/], exists from the capital, Yaoundé, to the port city of Douala and the northern city of Ngaoundéré. While bus service is quicker and more reliable to Douala, the overnight train is the best mode of ground transport to the north. Check for current schedules and pricing.\n\n===By bus===\n\nBetween major cities you can get a ride on modern, comfortable buses, sometimes with air conditioning. Away from the larger centers you will most likely end up on the ever-present Toyota bush taxis. These are slightly elongated Toyota minivans that can hold up to 20 people (or more if necessary) along with their luggage piled up on top. Safety can be a concern with dangerous roads, overworked/drunk/hungover drivers and poorly-maintained vehicles the norm. However, other than extending your stay an extra day or 2, in bad weather your options are limited.\n\nNote that buses rarely leave at a set time; instead, they wait until they are full and then depart. Later in the day, buses sometimes never fill up. When this happens, the operator will normally set you up with a bush taxi to take you to your destination. If you do not want to take the bush taxi and are persistent enough, the operator will normally refund your money. The point is that you should leave plenty of time to get to your destination, because sometimes the wait will take hours and you are never guaranteed a departure.\n\n===By car===\n\nRental cars are available although a bit expensive compared to car renting in major cities in the Western world. As paved roads are rare away from the major cities of the west and northwest, a 4 x 4 is a necessity when traveling to the eastern or central areas of Cameroon. The roads in the north are paved between cities and even the dirt roads tend to be in decent condition due to the lack of rain.\n\nFew of the car renting companies in Yaounde include [https://secoursauto.com secoursauto.com]. They claim to be professional, affordable and can provide advice for the type of car depending of the travel location.\n\n==Talk==\n\n'''[[French phrasebook|French]]''' and '''English''' are the country's two official languages. Two of the ten regions of Cameroon - in the north-west and the south-west of the country - are primarily Anglophone, representing 17% of the country's population. The ''lingua franca'' in these areas, however, is Cameroonian Pidgin English.\n\nThe remainder of the country is primarily Francophone. , Most Cameroonians speak either French or English and a third indigenous language. Cameroon is home to 230 languages, with Fulfulde being the lingua franca in the north, and Ewondo in much of the Centre, South, and East provinces.\n\n==See==\nVisit the Limbe Botanic Garden, Benedictine Museum of Mont Febe, National Museum of Yaounde and the Kribi. These are famous attractions in the city of Yaounde, meant for tourists.\n\n==Do==\n\nTours to each region of Cameroon - CamTT (www.cameroontravelandtours.com) is the local operator (the actual guides) who arranges budget tours to the region for most travel agencies.\n\nCameroon has 4 differents cultural areas:\n\n– the “fan-béti” cultural area including the Regions of Centre, South and East. It is characterized by the rain forest and mostly inhabited by the beti tribe, the “bantou” people and pygmies.\n– the “Littoral” cultural area including the Regions of Littoral, South- East and the division of “Ocean”(head quarter, Kribi). It’s characterized by water(the atlantic ocean) and mount Cameroon(for trekking). It’s mostly inhabited by the “sawas people”.\n– the “Grassfield” cultural area, including the Regions of West and North-West. It’s characterized by it’s  Kingdoms that are important artistic and cultural centers. It’s mostly inhabited by the “Bamileke” people, the “Bamoun” people and the anglophone community.\n– the “Soudano-Sahelian” cultural area, including the Regions of Adamaoua, North and Far-North. It’s characterized by the Savannah landscape, and mostly inhabited by “foulbe people”.\n\n==Buy==\n\nLocal handicrafts in Marché de Fleurs (Douala - Bonapriso quarter)\n\nFresh fish and prawns in Youppe village, close to Douala (early morning)\n\nCash machines - Visa cash machine withdrawals are possible at many banks - for example, SGBC - which can be found in most major cities. Cash machines in the Mastercard/Maestro/Cirrus network are nonexistent. Master Card cash machines are available at SCB bank. Cash advances are NOT available as of December 2007.\n\n==Costs==\n\nUnless you are in stores and restaurants, you must bargain for everything. Offer 20-50% of the first price requested.\n\n==Eat==\n\nThere are plenty of good restaurants:\n* Bonapriso quarter: Sorento, Bistrot Latin, Peche Mignon, Bombay Masala (Indian, Oriental), Oriental Garden (chinese), Alladin (lebanese), Paradise (nice English bar), Piccolla Venezia (italian), Ovalie (classy, expensive), Le Bouchon Lyonaise (French), Le BOJ (French), Le Cabanon\n* Bonanjo quarter: Chez Wou (chinese), La Cigalle \n* Akwa quarter: Le Senat (great jazz in the evening), White House (local), Mediterrannee (greek, good pizzas), La Fourchette (French), Le Foyer du Marin aka German Seamen's Club (german)\n* by the waterfront: Le Mangrove (fresh fish & prawns), Le Dernier Comptoire Colonial (last slave trading post)\n\nIf you are on a very low budget, try Chez Kali in Bonapriso (towards the Energy Club - fitness). Safe food at very low price.\nMont Febe, Hilton Hotel and hotel le depute in Yaounde, Atlantic Beach Hotel, Mirama hotel, Guest House hotel and Park hotel in Limbe, 3813 in Tiko, Miss Bright in Buea and Meridien hotel Douala.\n\n==Drink==\n\n[[Image:Hut Cameroon.jpg|thumb|180px|Hut in the small village of Bana]] \n\nAlways check “best before” when buying a bottle - some drinks are way out of date.\n\nAvoid drinking tap water, even in restaurants. Bottled water can be found most anywhere at reasonable prices. Expect to pay 400 cfa for 1.5l in the major cities, more in more remote areas.\n\nCoca-Cola is available everywhere. For something different try one of the flavourful TOP sodas. They are much sweeter than most European or North American sodas but they are very tasty.\n\nCameroon is rich with choice when it comes to good beer due to its past as a German and later French colony. Bottled Guinness can be found everywhere although in the heat, try one of the excellent lighter beers such as Castel, Beaufort, Mützig, Isenbeck, Satzenbrau or 33. These are inexpensive and excellent in the heat. Castel Milk Stout is an excellent choice for those who like darker beer. Outside of the cities you will sometimes be hard pressed to find them chilled (due to a lack of electricity).\n\n==Sleep==\nHotels in the major cities will range from XAF6000 up to and in excess of XAF50,000. Clean and safe rooms can usually be found for under XAF11,000. \n\nIn more rural areas, prices vary wildly depending on demand and local economy. It is not uncommon to find comfortable accommodation for XAF2000-3000 per night.\n\nUnless you are with a guide on a trek it is '''not recommended that you camp''' due to security concerns.\n\n==Learn==\n[[Image:University_of_Buea_campus.jpg|thumb|upright=1.3|University of Buea campus]]\n<!--This section is to explain what can be learned in a few weeks by travellers, NOT for a list of schools and universities which offer nothing of interest to travellers as opposed to locals -->\n\n==Work==\nVolunteer opportunities\n* Volunteer with chimpanzees at Sanaga-Yong Chimpanzee Rescue Center in Cameroon. [http://www.ida-africa.org/volunteer_215.html]\n* Volunteer in Health Care, Environmental Conservation and Education \n* [http://www.berudep.org/cms/home.html]\n* [http://www.rudec.org/]\n* [http://www.pcdi-cameroon.org/visitcameroon]\n* [http://www.pcdi-cameroon.org]\n* [http://www.fap-cameroon.page.tl]\n*Volunteer World [https://www.volunteerworld.com/volunteer-in-cameroon]\n\n==Stay safe==\nViolence is rare, but be smart about wearing jewelry or anything else that would make you stand apart from the crowd. Take a taxi after dark if you're unsure of the area. Be aware that Boko Haram, a Nigerian jihadist group, operates with other Islamists and Salafists in the north of Cameroon, and they have kidnapped Europeans, Canadians, Americans and other Westerners there. Boko Haram may implement very harsh forms of sharia law including amputation for theft. Churchgoers should not proselytize to Muslims, gathering in large groups should be avoided due to possible suicide bombings, and alcohol should not be consumed in public. Boko Haram usually travel on motorbikes and in pick-up trucks. An offshoot with links to al-Qaeda, the ''Ansar Muslimeen fi Biladi Sudan'', which translates as \"Protection of Muslims in Black Lands\", also carries out attacks and harsh sharia-compliant punishments.\n\n===Homosexuality===\nHomosexuality is '''illegal''' in Cameroon and penalties range from 5 years imprisonment to a '''death sentence''' LGBT should avoid Cameroon at all costs.\n\n==Stay healthy==\n\nYellow Fever certificates are required for travel to Cameroon.\n\nMalaria is common, especially in the central and southern parts of the country; the risk is much lower in the mountains of the Northwest Province and the arid areas in the extreme north. Prophylactics are recommended because of the severity of some strains of malaria in the country.\n\nOther tropical diseases are also common, including dysentery, bilharzia, hepatitis, and giardia. There are occasional outbreaks of cholera in Yaounde and Douala, but these rarely affect travelers. \n\nThere are several good-quality hospitals in the country. Most are located in Douala or Yaounde, but Kumbo has two very good private hospitals as well.\n\nIt's highly recommended that you receive required vaccinations beforehand.\n\n==Contact==\n\n[[Image:Internet in Cameroon.jpg|thumb|250px|Internet access point]]\n\nTo make local and international calls you need to buy a pre-paid SIM\ncard. Check if your cell phone has a compatible GSM standard (Africa/Europe) - if not, in addition to a SIM card\nyou probably need to buy a new phone. \"MTN\" and \"Orange\" are two\nmajor telephone companies in Cameroon.\n\nYou can find Internet access all over the place, but the speed might be slow.\n\nNational post service is considered to be unreliable.\n\n*Cameroon Tourism (Montréal) [http://www.cameroon-tourism.webs.com] -Tourism office in North America.\n\n==Respect==\n\nIt is disrespectful to shake hands with your left hand, so use only your right. If you have something in your right hand or your right hand is dirty or wet, it is polite to extend your wrist for the person to shake with his right hand. If both of your hands are occupied, it is polite to touch wrists. \n\n{{isPartOf|West_Africa}}\n{{Countryguide}}\n\n\n[[ca:Camerun]]\n[[de:Kamerun]]\n[[eo:Kameruno]]\n[[es:Camerún]]\n[[fi:Kamerun]]\n[[fr:Cameroun]]\n[[hu:Kamerun]]\n[[it:Camerun]]\n[[ja:カメルーン]]\n[[nl:Kameroen]]\n[[pl:Kamerun]]\n[[pt:Camarões]]\n[[ru:Камерун]]\n[[sv:Kamerun]]\n[[zh:喀麦隆]]\n[[wts:Category:Cameroon]]\n\n\n[[WikiPedia:Cameroon]]\n[[Dmoz:Africa/Cameroon/]]\n[[World66:africa/cameroon]]\n\n{{Wikipedia|Cameroon}}\n{{outline}}"
        }
    }
}