{
    "parse": {
        "title": "Croatia",
        "pageid": 469,
        "wikitext": {
            "*": "{{pagebanner|Croatia Banner.jpg}}\n\n\n{{quickbar\n|image=594px-Sibenik_Croatia_Cathedral_of_St_Jacob.jpg\n|caption=Šibenik Cathedral, Šibenik\n|location=Croatia in its region.svg\n|flag=Flag of Croatia.svg\n|capital=[[Zagreb]]\n|government=parliamentary democracy\n|currency=kuna (HRK)\n|area=56,542km²\n|population=4,493,312 (July 2007 estimate)\n|language=[[Croatian phrasebook|Croatian]] 96%, other 4% (including [[Slovenian]], [[Serbian]], and [[Bosnian]]\n|religion=Roman Catholic 87.8%, Orthodox 4.4%, Muslim 1.3%, other Christian 0.4%, others and unknown 6.1%\n|callingcode=+385\n|tld=.hr\n|timezone=UTC +1\n|electricity=230V, 50Hz (European plug)\n}}\n\n[http://www.croatia.hr '''Croatia'''] (Croatian: ''Hrvatska'') is a country situated in south central Europe and Mediterranean region. It is to the east side of the Adriatic Sea, to the east of [[Italy]]. It is also bordered by  [[Slovenia]] to the northwest, [[Hungary]] to the north, [[Bosnia and Herzegovina]] to the southeast, [[Serbia]] in the east, and [[Montenegro]] to the south.\n\n==Understand== \n\n===Climate===\nNorthern Croatia has a temperate continental climate whereas the central and upland regions have a mountainous climate. The entire Adriatic coast has a pleasant Mediterranean climate. Spring and autumn are mild along the coast, lies while winter is cold and snowy in central and northern regions. The average temperature inland in January ranges from -10° to 5°C (14° to 41°F) and in August, from 19° to 39°C (66° to 102°). The average temperature at the seaside is higher: in January, from 6°C to 11°C (43° to 52°F) and in August from 21°C to 39°C (70° to 102°F).\n\n===Terrain===\nGeographically diverse; flat agricultural plains along the Hungarian border (Central European area), low mountains and highlands near the Adriatic coastline and islands. There are 1,246 islands; the largest ones are [[Krk]] and [[Cres]], [[Korčula]] is the most populated island. The highest point is Dinara, at 1,830m.\n\n===History===\nThe Croats settled in the region in the early 7th century and formed two principalities: Croatia and Pannonia. The establishment of the Trpimirović dynasty ca 850 brought strengthening to the Dalmatian Croat Duchy, which together with the Pannonian principality became a kingdom in 925 under King Tomislav. Independent Croatian kingdom lasted until 1102 when Croatia, after a series of dynastic struggles entered into a personal union with Hungary, with Hungarian king ruling over both countries. In 1526, after the Battle of Mohács, where Hungary suffered a catastrophic defeat against Ottoman Turks, Croatia severed its relationship with Hungary and its parliament (Sabor) voted to form a new personal union with the Habsburg Monarchy. Croatia remained an autonomous kingdom within the Hapsburg state (and later Austria-Hungary) until the empire's dissolution following defeat in World War I.\n\nIn 1918, a short-lived State of Slovenes, Croats and Serbs (carved out of south Slavic parts of Austria-Hungary) joined the Kingdom of Serbia to form the Kingdom of Serbs, Croats and Slovenes, later renamed Yugoslavia in 1929. The new state was unitarist in character, erasing all historical borders within its new territorial division, which resulted in a strong movement for more autonomy for Croatia. This was achieved in 1939, only days before the start of World War II, when Croatia was granted broad autonomy within Yugoslavia as Banovina of Croatia. When Germany and Italy attacked Yugoslavia in 1941, the state was dissolved, parts of it annexed to Germany and Italy, and puppet governments installed in Croatia and Serbia - in the \"Independent State of Croatia\"'s case, said the government was led by a nationalist group known as the Ustasha. Almost immediately, a strong resistance movement was formed, led by communist leader Josip Broz \"Tito\", which gained broad popular support. \n\nAfter the end of World War II, a new, communist Yugoslavia was formed with Tito becoming \"president for life\". Tito ruled with a strong hand, using political repression and secret police to quell any separatist sentiments, with the official motto of the new country being \"Brotherhood and Union\". Still, due to the fact that Yugoslavia didn't belong to the Warsaw Pact, having broken off political ties with USSR in 1948, it was by far the most open socialist country in Europe and its citizens enjoyed more civil liberties and a higher living standard compared to the rest of the Communist bloc.\n\nAfter Tito's death in 1980, the weakening of political repression led to a period of political instability. Faced with the rise of nationalist sentiment, a decade-long recession, and the weakening of communist grip on power on the eve of the fall of communism in Eastern Europe, first free elections were held in Yugoslavia in almost 45 years. In these elections, nationalist options won power in all Yugoslav republics, which led to a rise in inter-ethnic tensions, culminating when Croatia and Slovenia declared their independence from Yugoslavia in 1991. This led to open war in newly independent Croatia and later in Bosnia and Herzegovina which declared its independence in 1992. The wars ended four years later, in 1995, with decisive Croatian victory in operation Storm, bringing peace to both countries. The anniversary of operation Storm is celebrated as Thanksgiving Day in Croatia every August 5th.\n\nAfter a period of accelerated economic growth in the late 90's and 2000's Croatia joined NATO in 2009 and the EU in 2013. Croatia today is a functioning liberal democracy, with a free market system and a robust welfare state.\n\n==Regions==\n[[Image:Croatia Regions map.png|thumb|upright=1.6|Map of Croatia]]\n\nThere are three distinct areas of Croatia: Lowland Croatia (cr: ''Nizinska Hrvatska''), Littoral Croatia (''Primorska Hrvatska'') and Mountainish Croatia (''Gorska Hrvatska'') and these can be neatly split into five travel regions:\n\n{{Regionlist\n| region1name=[[Istria]]  \n| region1color=#cba46b\n| region1items=\n| region1description=(cr. ''Istra'') a peninsula in the northwest, bordering [[Slovenia]]\n\n| region2name=[[Kvarner]]\n| region2color=#83aec9\n| region2items= \n| region2description=seashore and highlands north of Dalmatia, includes subregions; Bay of Kvarner and Highlands (Lika and Gorski Kotar)\n\n| region3name=[[Dalmatia]] \n| region3color=#71b37b\n| region3items=\n| region3description=(cr. ''Dalmacija'') a strip of mainland and islands between the Adriatic Sea and [[Bosnia and Herzegovina]]\n\n| region4name=[[Slavonia]] \n| region4color=#aac496\n| region4items=\n| region4description=including subregions Slavonija and Baranja(north of river Drava) (cr. ''Slavonija'') northeastern area of forests and fields, bordering [[Hungary]], [[Serbia]], and [[Bosnia and Herzegovina]]\n\n| region5name=[[Central Croatia]] \n| region5color=#b5af99\n| region5items=\n| region5description=(cr. ''Središnja Hrvatska'') north central highlands, location of [[Zagreb]]\n}}\n\n[[Image:800px-Dubrovnik_Croatia.jpg|thumb|upright=1.3|Dubrovnik]]\n\n==Cities==\n* [[Zagreb]] - the capital and largest city\n* [[Dubrovnik]] - historic coastal city and UNESCO World Heritage site\n* [[Split]] - ancient port city with Roman ruins\n* [[Kaštela]] - town formed around old forts, known as 7 pearls of the Adriatic\n* [[Pula]] - biggest town in [[Istria]] with the Roman amphitheatre (commonly called Arena)\n* [[Osijek]] - capital of [[Slavonia]] and an important city\n* [[Slavonski Brod]] - \n* [[Rijeka]] - Croatia's largest and main port\n* [[Varaždin]] - Croatia's former Baroque capital\n* [[Zadar]] - biggest city of north-central Dalmatia with rich history\n\n==Other destinations==\n[[File:Krk waterfalls.jpg|thumb|upright=1.2|[[Krka National Park]]]]\n* [[Krka National Park]] - a river valley near [[Šibenik]]\n* [[Kornati National Park]]\n* Island of [[Cres]]\n* Island of [[Solta]]\n* Island of [[Hvar]]\n* Island of [[Brac]]\n* Island of [[Korčula]]\n* Island of [[Krk]]\n* Island of [[Solta]]\n* [[Plitvice National Park]] - home of the magnificent Plitvice Lakes (UNESCO world heritage site) \n* [[Vrsar]]\n* [[Salona]]\n* [[Žumberak]] is a mountainous region that spans the border between Slovenia and Croatia\n\n==Talk==\n\n[[Croatian phrasebook|Croatian]] is, of course, the country's official language and as such is known by everybody. [[Italian phrasebook|Italian]] is not only widely spoken and understood but is also recognised as a co-official language in most of [[Istria]], due to that region's history and the presence of ethnic Italian communities; '''English''' is commonly spoken, particularly by the younger generation and by those who work in tourism or live in tourist areas such as the coastline from [[Istria]] to [[Dubrovnik]] and the capital city of [[Zagreb]]; [[German phrasebook|German]] is also commonly spoken, particularly by older Croatians, given both the volume of German tourists and the historical relationships with German-speaking regions; [[Polish phrasebook|Polish]] and [[Czech phrasebook|Czech]] have some mutual intelligibility with Croatian, so you may wish to try these as well.\n\nThis said, Croatian is not an easy language to learn - but making an effort to learn a few basic phrases such as greetings and thanking will result in a positive response from most Croats, who will usually see it as a show of respect. Small gestures of this type do not go unnoticed, and travellers who engage in local culture will usually find that Croats who may seem somewhat reserved will open up much more readily, thus making the interaction much more enjoyable for the traveller.\n\n==Get in==\n[[Image:Croatian National Theatre Zagreb 1.jpg|thumb|300px|right|Croatian National Theatre in [[Zagreb]]]]\n\n===Entry requirements===\n\n{{Schengen-not-implemented}}\nHolders of valid travel documents for refugees or stateless persons issued by an EU member state, Andorra, Canada, Iceland, Japan, Liechtenstein, Monaco, Norway, San Marino, Switzerland, the United States or the Vatican City can enter Croatia '''visa-free''' for up to 90 days.\n\nMore information about visa exemptions and the visa application procedure is available at the website of the Croatian Ministry of Foreign and European Affairs [http://www.mvep.hr/en/consular-information/visas/visa-requirements-overview/].\n\n===By plane===\n\nCurrently, the only non-European flights to Croatia are from [[Qatar]], [[Dubai]] and [[Tel Aviv]]. There are occasional charter flights from [[Tokyo]] and [[Seoul]]. If coming from North America, you will have to transfer at a hub such as [[London]] or [[Frankfurt]].  From Asia, Africa or Australasia, transferring in [[Doha]] or [[Istanbul]] will be quicker than back-tracking through the main European hubs.\n\n* Croatia Airlines [http://www.croatiaairlines.com/], the national carrier and a member of Star Alliance,  flies to [[Amsterdam]], [[Athens]], [[Berlin]], [[Brussels]], [[Düsseldorf]], [[Frankfurt]], [[Istanbul]], [[London]], [[Nice]], [[Madrid]], [[Milan]], [[Moscow]], [[Munich]], [[Paris]], [[Prague]], [[Tel Aviv]], [[Rome]], [[Sarajevo]], [[Skopje]], [[Vienna]], [[Zurich]] and - during the tourist season - [[Manchester]].\n* Aegean Airlines [http://en.aegeanair.com/] - Greek national carrier flies from [[Athens]] to [[Dubrovnik]] and [[Split]].\n* Adria Airways [http://www.adria-airways.com/] - Slovenian national carrier flies from [[Ljubljana]] to [[Split]] and [[Dubrovnik]] (note: there are no flights from Ljubljana to Zagreb as the two are located close together and are around 2 hours by car/train/bus)\n* Aer Lingus [http://www.aerlingus.com/] [[Dublin]] - [[Dubrovnik]]\n* Air Transat [http://www.airtransat.com/] [[Toronto Canada]] - [[Zagreb]] \n* Austrian Airlines [http://www.austrian.com/] flies from [[Vienna]] to Zagreb, Split and Dubrovnik\n* Alitalia [http://www.alitalia.com/] flies from [[Milan]] Malpensa to Zagreb and Split.\n* British Airways [http://www.britishairways.com/travel/home/public/en_gb] flies from London Heathrow to Zagreb, and London Gatwick to Dubronik\n* CSA Czech Airlines [http://www.czechairlines.com/] - SkyTeam member; flies from [[Prague]] to [[Zagreb]] all the year, and to [[Split]] during summer.\n* Darwin Airline [http://www.darwinairline.com/?ln=d] flies between [[Geneva]] and [[Dubrovnik]] (Thursdays and Sundays) as well as [[Zurich]] and [[Dubrovnik]] (Saturdays).\n* EasyJet [http://www.easyjet.com/en/book/index.asp] has flights to the following destinations in Croatia: \n** [[London|London Gatwick]] - [[Split]] \n* Emirates [http://www.emirates.com]is flying every day from [[Dubai]] to [[Zagreb]].\n* Estonian Air [http://www.estonian-air.ee] is flying every Wednesday and Saturday from [[Tallinn]] to [[Dubrovnik]].\n* FlyBe [http://www.flybe.com/] operates routes between [[Dubrovnik]] and two UK destinations [[Exeter]] and [[Birmingham (England)|Birmingham]].\n* GermanWings [http://www.germanwings.com/] - cheap connection from [[Berlin]], [[Cologne]], [[Stuttgart]] and [[Hamburg]], to [[Zagreb]], [[Split]], [[Zadar]] and [[Dubrovnik]]\n* HLX (Hapag-Lloyd Express) [http://www.hlx.com/] - flies to [[Rijeka]] and [[Dubrovnik]] from [[Germany]], has good overview of cheaper flights [http://book.hlx.com/de/offers/tiefstpreise.jsp?currency=EU]\n* Intersky [http://www.intersky.biz/] flies from [[Friedrichshafen]] to [[Zadar]]\n* Jat Airways [http://www.jat.com/] flies from [[Belgrade]] to [[Dubrovnik]] and [[Pula]]\n* KLM http://www.klm.nl/] connects [[Amsterdam]] with [[Zagreb]]\n* Norwegian [http://www.norwegian.no/] connects [[Oslo]] with [[Rijeka]], [[Split]], [[Pula]] and [[Dubrovnik]]; [[Bergen]] with [[Split]] and [[Dubrovnik]]; [[Stavanger]] with [[Split]] and [[Dubrovnik]]; [[Trondheim]] with [[Split]] and [[Dubrovnik]]; [[Stockholm]] with [[Pula]], [[Split]] and [[Dubrovnik]]; [[Copenhagen]] with [[Split]], [[Dubrovnik]] and [[Zagreb]]; [[Helsinki]] with [[Split]] and [[Dubrovnik]]; and [[London]]-Gatwick with [[Split]] and [[Dubrovnik]]\n* Qatar Airways [http://www.qatarairways.com/] flies daily from Zagreb via Budapest to Doha, and onwards through their network to the Middle East, Asia, Australaisa and Africa.\n* Ryanair [http://www.ryanair.com/] flies from Dublin and Karlsruhe-Baden to Zadar.\n* Scandjet [http://www.scandjet.se/index.asp?lang=uk] is a Scandinavian low fare airline that connects [[Sweden]], [[Norway]] and [[Denmark]] with Croatia. It flies from: \n** [[Oslo]] to [[Split]]\n** [[Stockholm]] to [[Pula]], [[Split]] and [[Dubrovnik]]\n** [[Gothenburg]] to [[Zagreb]], [[Pula]], [[Zadar]] and [[Split]]\n** [[Copenhagen]] to [[Pula]], [[Split]].\n* TAP Portugal [http://www.flytap.com/USA/en/Homepage] is flying from [[Zagreb]] to [[Lisbon]] via [[Bologna]] three times a week (Wednesdays, Fridays, Sundays).\n* Turkish Airline [http://www.turkishairlines.com/] flies daily from Zagreb to Istanbul.\n* Vueling [http://www.vueling.com], a Spanish low-cost carrier flies between [[Dubrovnik]] and [[Barcelona]].\n* Wizz Air [http://www.wizzair.com/index.shtml] flies between [[Zagreb]] and [[London]] (Luton Airport)\n\n* Additionally you can use airports in neighbouring countries which are within few hours of reach from [[Zagreb]] and [[Rijeka]] (apart from some of the listed options in Italy): \n** [[Ljubljana]] (for EasyJet flights to London Stansted or other Adria Airways flights)\n** [[Graz]] and [[Klagenfurt]] (for Ryanair flights from London Stansted)\n** [[Trieste]] (for Ryanair flights from London Stansted). You can also use [[Venice|Venice Marco Polo]] (for British Airways flights from the UK) or [[Venice|Venice Treviso]] (Ryanair from Stanstead). [[Ancona]] is also an option (Ryanair from Stanstead) for those who want to take ferry [http://www.jadrolinija.hr] or hydrofoil [http://www.miatours.hr] to [[Zadar]] and [[Split]]. Ryanair also flies to [[Pescara]] which is a short drive away from [[Ancona]].\n** Some may decide to use Tivat Airport (in Montenegro) which is within easy reach from [[Dubrovnik]].\n\n===By train===\nThe rail network connects all major Croatian cities, except [[Dubrovnik]] (you can take a train to Split then take one of the frequent buses or the more scenic ferry to Dubrovnik, the train station is at the pier). There are direct lines from [[Austria]], [[Czech Republic]], [[Switzerland]], [[Germany]], [[Hungary]], [[Slovenia]], [[Italy]], [[Bosnia and Herzegovina]], [[Serbia]], and [[Greece]]. There are indirect lines from almost all other European countries.\n\nTourists coming from or going to neighbouring countries should note the following EuroCity and InterCity railway lines: \n* EC \"Mimara\": [[Berlin]] - [[Leipzig]] - [[Munich]] - [[Salzburg_%28city%29|Salzburg]] - [[Ljubljana]] - [[Zagreb]] \n* IC \"Croatia\": [[Vienna]] - [[Maribor]] - [[Zagreb]] \n* IC \"Kvarner\": [[Budapest]] - [[Zagreb]] - [[Rijeka]]\n\n'''NB:''' While Croatia (paired with Slovenia) is covered on some Eurail passes, staff at domestic ticket windows will tend to have no idea about validating the pass on the first day of use. There are recorded instances of staff saying that the conductor would validate the pass, and the conductor simply treating it as a regular ticket. Fortunately, the international ticket staff (particularly in Zagreb) are aware of how to validate the pass, and have been known to validate it retroactively where necessary. They even ask for the details of the domestic ticket seller who gave the wrong information.\n\nThe traveller is therefore recommended to have already validated their Eurail pass on arrival in Croatia, or to have it validated at an international window even if the first trip on it will be domestic.\n\n===By car===\nTo enter Croatia, a driving licence, a vehicle registration card and insurance documents are required. If you need road assistance, you should dial 1987. The following speeds are permitted:\n\n* 50km/h - within built-up areas\n* 90km/h - outside built-up areas\n* 110km/h - on major motor routes\n* 130km/h - on motorways\n* 80km/h - for motor vehicles with a caravan trailer\n* 80km/h - for buses and buses with a light trailer\n\nWhen driving in the rain, you should adjust speed to conditions on wet roads. Driving with headlights is not obligatory during the day (during Daylight Savings Time; it is obligatory during winter months). Use of mobile phones while driving is not permitted. Maximum permitted amount of alcohol in blood is currently 0.5 ‰ (matching neighbouring Slovenia and Bosnia Herzegovina) although this has varied recently and was down to 0.0 ‰ until that was found to not be tenable in the country.  Use of seat belts is obligatory.\n\nHrvatski Auto Klub [http://www.hak.hr] is the Croatian Automobile Club dedicated to assisting drivers and promoting greater traffic security. Its site offers minute-by-minute updates, status of national traffic, weather, numerous maps and webcams located all over Croatia. Content is available in Croatian, English, German and Italian.\n\n===By bus===\nVery good network of buses once in the country - cheap and regular.\n\nIf you are coming from [[Italy]] there are two buses daily from [[Venice]] leaving at 11:00 and 13:45 going to Istria, with a final stop in [[Pula]].  These are operated by two different bus companies, but you can buy tickets for both buses at the A.T.V.O bus office at the [[Venice]] bus station.  The office is in the bus station, but located outside on the ground level across from where all the buses park.  Both buses pick up at spot b15.  It is roughly a 5 hour bus ride, with stops in [[Trieste]] and [[Rovinj]].  You can also pick up the bus at the bus station in Mestre, fifteen minutes after the scheduled bus leaves [[Venice]]. Coming in from [[Trieste]], [[Italy]] is popular among Europeans, for [[Trieste]] is a Ryanair destination. You cross the Italian-Slovenian border first, followed by the Slovenian-Croatian border, but they are very close to one another. \n\n[[Dubrovnik]] and [[Split]] are the main destinations of international buses from [[Bosnia and Hercegovina]] or [[Montenegro]], with daily buses  traveling to cities such as [[Sarajevo]], [[Mostar]] and [[Kotor]] (some lines such as Split-Mostar operate every few hours). Seasonal lines also extend through to [[Skopje]] from Dubrovnik. Border formalities on the buses are extremely efficient, and do not involve leaving the bus (previous services from Dubrovnik to Kotor involved changing buses at the Croatian border).\n\n[[Osijek]] is a very big bus hub for international travel to [[Hungary]], [[Serbia]] and [[Bosnia]] in addition to its local buses, and the station is located conveniently next to the railway station. Many buses heading from Zagreb north into Hungary or [[Austria]] will pass through [[Varaždin]].\n\n* From [[Germany]] with [http://www.cazmatrans.hr/njem-zg.html Čazmatrans].\n\n===By boat===\nFerries are cheap and go regularly between various places by the coast. Although not the fastest, they are probably the best way to see the beautiful Croatian islands of the Adriatic Sea. \n\n[http://www.jadrolinija.hr/default.aspx?lang=2 Jadrolinija] is the main Croatian passenger shipping line that maintains the largest number of regular international and domestic ferry and shipping lines. The following international lines are serviced by car ferries:\n\n* [[Rijeka]] - [[Zadar]] - [[Split]] - [[Hvar]] - [[Korčula]] -[[Dubrovnik]] - [[Bari]]\n* [[Split]] - [[Ancona]] - [[Split]] \n* [[Korčula]] - [[Hvar]] - [[Split]] - [[Ancona]]\n* [[Zadar]] - [[Ancona]] - [[Zadar]]\n* [[Zadar]] - [[Dugi otok]] - [[Ancona]]\n* [[Dubrovnik]] - [[Bari]] - [[Dubrovnik]]\n\n[http://www.blueline-ferries.com Blue Line International] operates the international route:\n* [[Split]] - [[Ancona]] - [[Split]]\n\n[http://venezialines.com Venezia Lines] has regular catamaran connections between [[Venice]] and the Croatian cities of [[Poreč]], [[Pula]], [[Rovinj]] and [[Rabac]].\n\n==Get around==\n\n===By plane===\nNational airline company '''Croatia Airlines''' [http://www.croatiaairlines.hr/] connects major cities in Croatia to each other and foreign destinations. Due to the comparatively short distances and relatively high hassle of air travel - especially when you travel with luggage - domestic air travel is used mostly for getting to end points - eg, Zagreb to Dubrovnik (see map) and vice-versa. There is a daily link between Pula and Zadar (continuing to Zagreb) - the 20 minute flight saves a long road journey, though has very awkward flight times.\n\nAnother popular flight (available in the summer months only) is between Split and Osijek, saving a long trip back through Croatia, or alternatively through the middle of Bosnia.\n\n===By train===\nTrain travel has definitely improved in Croatia, with all the money that has been invested in updating the aging infrastructure and train cars. Trains are clean and mostly on time.\n\nCroatia's rail network connects all major Croatian cities, except [[Dubrovnik]]. If you want to visit Dubrovnik, you will have to travel by train to [[Split]], and then go on the bus for [[Dubrovnik]]. Trains to [[Pula]] are actually connected via [[Slovenia]] due to historical accident, though there are designated connecting buses from [[Rijeka]].\n\nRail is still the cheapest connection between inland and coast, though not the most frequent. As of 2004, the new 160kph \"tilting trains\" that connect [[Zagreb]] with [[Split]] and other major cities in Croatia such as [[Rijeka]] and [[Osijek]] have been progressively introduced, resulting in higher levels of comfort and significantly faster journeys between cities (Zagreb-Split is now 5.5h from 9, Osijek is now 3 when other trains take around 4.5h). If you make a reservation early enough you can get a substantial discount, or if you are a holder of an ISIC card etc. \n\nInformation for the trains can be found on the Hrvatske željeznice - Croatian Railways [http://www.hznet.hr] site in Croatian and English has timetable and prices.\n\nTickets are not usually sold on-board, except if you happen to get on the train on one of the few stations/stops without ticket sales. However, only local trains stop on such stations. In all other cases, a ticket bought on the train will cost considerably more than the one bought outside the train.\n\n===By bus===\nA very comprehensive coach network connects all parts of the country. Bus service between major cities (intercity lines) is quite frequent, as well as regional services. The most frequent bus terminal in Croatia is Bus Terminal Zagreb (in Croatian \"Autobusni kolodvor Zagreb\"). Despite the recent improvements in the railway network, buses are faster than trains for inter-city travel. See [[Bus travel in the former Yugoslavia]] for more information.\n\n* Autobusni kolodvor Zagreb [http://www.akz.hr/] - Bus Terminal Zagreb, timetable information, content in Croatian, English\n* CroatiaBus [http://www.croatiabus.hr/] - bus company - timetable information, prices, content in Croatian and English.\n* Arriva Croatia [http://www.arriva.com.hr] - bus companies: Autotrans, Panturist, APP - timetable information, prices, content in Croatian, English, German, Italian.\n* Autobusni promet Varazdin [http://www.ap.hr/] - bus company - timetable information, prices, content in Croatian, English and German.\n* Contus [http://www.contus.hr/] - bus company - timetable information, prices, content in Croatian and English.\n* Libertas Dubrovnik [http://www.libertasdubrovnik.hr/] - bus terminal and company information in Dubrovnik, with international and domestic information. Content mostly in Croatian.\n* Eurobusways [http://www.eurobusways.com/] - door to door transfer service, Croatia from Budapest, Vienna, Ljubljana. Door to door bus service.\n\n===By boat===\nCroatia is blessed with a beautiful coastline which is best explored by ferry to access the hundreds of islands.\n\nFerries run more frequently in the summer months, and service varies by day of the week and by season. Many lines are designed to suit commuters rather than tourists, so be sure to check the schedule in advance. The CroatianFerries.com website [http://www.croatiaferries.com] is a good resource to check lines and schedules.\n\n* [http://www.jadrolinija.hr/en/ferry-croatia Jadrolinija] is the Croatian National ferry company. It operates among the coastal cities and islands of Croatia, and it runs several routes between Italy and Croatia. Schedules vary by day of the week and by season. Coastal ferries include two types of boats. \"Car ferries\" are larger boats designed to transport vehicles and passengers. They are slower, and more expensive, but with more extensive facilities (e.g. restaurant) than the smaller boats. \"Foot ferries\" (also called fast ferries, fast boats, passenger ferries, or catamarans) are less expensive and faster, and they do not carry vehicles. Bicycles can be transported on car ferries only.\n* [http://www.gv-line.hr/index.php?lang=E G&V Line] is a Croatian company based out of Dubrovnik. It runs fast ferries/catamarans along the Croatian coast. Bicycles may be accepted at the captain's discretion.\n\nIn addition to ferries, private transportation by boat can be arranged through boat taxi services or private charter.\n\n* [http://www.sail-croatia.com/yacht-charters/catamaran-charter-croatia Catamaran Charter] Wide range of Lagoon catamarans for charter in Split area, bareboat and skippered.\n* [http://www.dalmatia-express.com/ Split Hvar taxi boat] Taxi boat service that works 0-24/7 and can take you anywhere you want.\n* [https://europe-yachts.com/ Luxury Yacht Charter Croatia] offers a wide range of Luxury Mega Yachts, sailing Yachts, Catamarans for charter in Croatia. \n* [https://www.catamaran-croatia-charter.com/ Catamaran Charter Croatia] offers a wide range of catamarans for charter in Croatia \n* [http://www.chartercroatia.net/ CharterCroatia] CharterCroatia is an online yacht charter company where you can easily choose from the best yachts in Croatia, and get a wide range of prices.\n* [http://www.lion-queen.com/ Cruising in Croatia] The professional company LION QUEEN provides all the information on Cruising in Croatia\n* [http://www.adventuresmithexplorations.com/mediterranean-small-ship-cruises-to-turkey-greece-istanbul-cyclades-croatia-montenegro-dalmation-coast-corfu Croatia Small Ship Cruises] AdventureSmith Explorations is an American company specializing in small ship and yacht cruises in Croatia. Cruises depart from Split or Dubrovnik and include domestic Croatia itineraries or nearby Mediterranean countries.\n* [http://www.yachtholiday.com/ YachtHoliday] YachtHoliday offers more than 2500 yachts at a wide range of prices. You can find a yacht, destination on the website, and book a yacht completely online.\n* [http://www.polaris-yachting.com Polaris yachting] The best place for booking all types of gulet cruises, yacht charters, boat transfers and excursions, weddings on a boat. Only family owned and run boats in offer.\n* [http://www.sail-croatia.com/croatia-cruises/elegance-cruises Luxury Croatia Cruises] Sail Croatia offers luxury small ship cruises for mature trevellers. Their Elegance cruise has 4 different itineraries, Split - Dubrovnik - Split, Split - Dubrovnik, Split - Zadar - Split and Dubrovnik - Split.\n* [http://www.navisyacht.com/ Navis Luxury yacht Charter] offers Luxury yachts in Croatia for charter.\n* [http://five-islands-tour.com/ Five Islands Tour] daily speedboat tours of 5 Dalmatian islands.\n* [http://www.pinkuin.com/yachtcharter-kroatien/ Pinkuin - Yachtcharter Kroatien] is a great place to find yachts for rent. Easy, safe and fast booking.\n* [https://wake-riders.com/ Wake Riders - Wake Surfing] Wake surf and day trips from Split and surrounding islands.\n* [https://croatiaguletcruises.com/ Gulet charter Croatia] Croatia Experts specializing in original luxury Croatia gulet cruises and providing these amazing voyages in the Adriatic, custom tailored just for you.\n\n===By car===\nRoads in Croatia are usually well maintained, but usually very narrow and full of curves. Some local roads in Istria have been worn down to a smooth surface from regular wear and tear, and can be extremely slippery when wet. It's difficult to find a true highway with more than one way per direction, the only exceptions being the ones connecting Rijeka, Zagreb, Zadar and Split. Speed limits are thus low (60-90km/h), and it's not recommended to drive faster (although most locals do), especially at night. Be aware of animals crossing the road.\n\nRenting a car is around the same price as in the EU (from around €40). Almost all cars have a manual transmission.  Most rental agencies in the Balkans allow you to rent a car in one country and drive in the neighbouring countries however try to avoid a renting a car in Serbia and driving it into Croatia (or vice versa) in order to avoid negative attention from nationalists.  \n\nOn the recently built Croatian Motorways [http://www.croatia-expert.com/2009/03/toll-croatian-highway/] toll fees apply (and may be paid in either HRK or EUR), the motorway A6 between Zagreb and [[Rijeka]] was finished end of 2008, the main motorway A1 from [[Zagreb]] to [[Dubrovnik]] is still under construction the current ending point is in Ravča, which is 140km from Dubrovnik. Notice that to reach south Dalmatia including Dubrovnik, you need to cross a short portion of Bosnia-Herzegovina, '''so check if you need a visa or other special requirements for entry into Bosnia.''' Crossing into non-EU countries like Bosnia and Montenegro requires you technically to buy a 'green card' for the car which will cost 50 euros. This includes even crossing the narrow bit of Bosnia one needs to transit on the way down to Dubrovnik.\n\nWhen exiting a toll motorway, ask the receipt at toll booth if it is not given to you to be sure you do not get overcharged (you could receive along with the receipt some unexpected change compared with the price you were given verbally)\n\nIf an unknown person flashes their car lights at you it may be a sign that they've recently passed a police unit doing speed limit checks. Ensure you are on compliance with all the traffic rules and regulations to ensure that you are not stopped.\n\nBe advised that reckless endangerment of traffic (e.g. driving > 50km/h over the posted speed limit, driving under the influence of a blood alcohol content > 0.5 ‰) may, under some circumstances, be prosecuted as a felony offence punishable by up to 3 years of incarceration.\n\n===By taxi===\n\nAll major cities in Croatia are served by taxi. They should be reasonably easy to pick up at airports, bus stations, and city centres. Hotels, hostels, and the apartment you are staying in will call the cab company for you, if they have one with which they work closely, but check first. You can also find the phone numbers for taxis in any city on internet. [http://www.hbtransfer.com/ See taxi prices] Some taxi companies, particularly in larger towns, require the cab to be ordered online. It is recommended to call a cab company in advance, if possible, and give them time to pick you up. Prices may vary from company to company, but the average price is 3 euro per km. + 0.70 cent every next kilometre. To avoid being overcharged always ask for the price before you get in cab.\n\nThe best situation for choosing a taxi service is certainly in the form of airport transfers and transfers from all travel terminals, where is always a circulation of a large number of passengers.[http://www.taxicroatiatransfer.com/en/royal-taxi-croatia/136/33 Taxi Croatia] service and transfer have evolved substantially in the last 10 years and spread throughout the major croatian cities, which are visited by many tourists from around the world. In most cases taxi is a the better choice of public transport, with which over the years had become almost equalized in the price.\n\n===By thumb===\nHitchhiking is generally good. If you can get to a highway toll stop simply ask people to take you with them as they open their windows to pay the toll. The toll collectors usually won't mind. The tricky part, of course, is to get to the toll stop. If you are in [[Zagreb]] and you are, like most people, heading south, take the bus 111 from the Savski most station in [[Zagreb]] and ask the bus driver where to get off to get to the toll stop. Next best place to ask people to pick you up are gas stations. And finally, just using the good old thumb will work too if everything else fails.\n\n===Cultural heritage===\nCroatia has an impressive history, a fact that is best explained through the vast array of sites worth visiting. Most towns have a historical center with its typical architecture. There are differences between the coast and the continental part, so both areas are a must. The most famous place is Dubrovnik, a prime example of the coastal architecture, but by no means the only one worth visiting. Equally important is the capital and largest city, Zagreb, with a population of about 1 million. It is a modern city with all the modern features, yet it has a laid back feel. In the east, in the region of Slavonija with its regional capital Osijek and the war-torn Vukovar are awe-inspiring. Scattered throughout the region are vinyards and wine cellars, most of which offer tours and tastings.\n\n===Sailing===\nSailing is a good way to see the coastal islands and networks of small archipelagos. Most charters leave from [[Split]] or the surrounding area on the North or the South circuit, each offering its own pros and cons. A good way is to book a package with a company at home, but many Croatian companies also offer both bareboat and crewed charters.\n\nBooking of a charter vessel is basically done in two parts. Fifty percent of the charter price is paid right away, after which the booking is confirmed. The other fifty percent of the charter fee is usually paid four weeks before the charter date. Before the first payment of the charter fee you should request to see the charter contract from the agency where you chartered a boat. Pay close attention to cancellation fees because many times if you cancel your charter vacation you could lose the initial fifty percent you already paid when you booked a charter so take a close look at that in the charter contract. After that you are set for a sailing vacation.\n\nWhen you arrive to marina where your chartered yacht is situated you need to do the check in (usually Saturday around 16:00) and you have to do the shopping for the charter vacation. Don't neglect the groceries shopping because the sea is unpredictable and you don't want to get stuck on the boat without anything to eat or drink.\n\nYou can do the shopping in a marina (although the prices are much higher there) or you can order from yacht provisioning services who usually deliver the products to your chartered yacht at no extra fee. This is convenient because it takes the load off you and the things you must do when you arrive at the marina for your sailing holiday.\n\n===Active & Adventure trips===\nCroatia offers amazing weather conditions and incredible scenery for various activities throughout the year. Water sports, mountain and rock activities, biking and many more.\nThere are several tour companies organizing various outdoor activities, as sea kayaking, biking, hiking, canyoning, rock climbing, etc.\n\n=== Rock Climbing ===\nWith more than 70 routes rock climbing on Marjan is must do outdoor adventure.\n\n=== Beaches ===\nBeaches in Croatia are abundant and every village along the coast has its own little beach. But, although Croatia is not lacking in beaches, many are pebbled, which is not preferable choice for many travelers.\n\n==Buy==\nCroatia's  currency is the ''kuna'' ('''HRK'''). Although many tourist business owners may accept euros, Euros are not legal tender in Croatia. Any amount of kuna you have left at the end of your stay can be converted to euros at a local bank or exchange office.\n\nPrices are around 10% to 20% lower than most EU countries. Touristic destinations and articles are much more expensive.\n\n{| class=\"wikitable\" border=\"1\" cellspacing=\"0\" cellpadding=\"3\"\n|-\n! Currency\n! Amount\n! Kuna\nConversion\n|-\n| Euro\n| 1\n| 7.40\n|-\n| [[Image:Us-flag.png|border|24px]]Dollar (US)\n| 1\n| 6.30\n|-\n| [[Image:Uk-flag.png|border|24px]]Pound (UK)\n| 1\n| 8.37\n|-\n| [[Image:As-flag.png|border|24px]]Dollar (AU)\n| 1\n| 4.68\n|-\n| [[Image:Ca-flag.png|border|24px]]Dollar (CA)\n| 1\n| 4.81\n|}\nUpdated 07 July 2018\n\n===ATMs===\nATMs (in Croatian ''bankomat'') are readily available throughout Croatia. They will accept various European bank cards, credit cards (Diners Club, Eurocard/MasterCard, Visa, American Express etc.) and debit cards (Cirrus, Maestro, Visa electron etc.). Read the labels/notices on the machine before using.\n\n===Tax-free shopping===\nIf you buy goods worth more than 740 kuna you are entitled to a PDV (VAT) tax return when leaving the country. Note that this applies to all goods except petroleum products. At point of purchase ask the sales person for a PDV-P form. Fill it out and have it stamped on the spot. On leaving Croatia the receipt will be verified by the Croatian Customs service. A PDV refund in Kunas can be obtained within six months, either at the same shop where you bought the goods (in that case the tax will be refunded to you immediately), or by posting the verified receipt back to the shop, together with the account number into which the refund should be paid. In this case the refund is dealt with within 15 days of receipt of the claim. There is another, much easier way to receive the refund. Buy your goods in shops with a \"CROATIA TAX-FREE SHOPPING\" label. This label is displayed on the shop's entrance, usually next to the labels of credit and debit cards this particular shop accepts. Using an international coupon, refund is possible in all countries-members of the TAX-FREE international chain. In this case the service charge is deducted from the tax refund amount.\n\nCroatia now uses the Global Blue system. They will do the refund and take a commission off the price. You can do this at the airport or post it once you get home.\n\n===Natural cosmetics===\nThe ingredients used (herbs, olive oil, etc.) are grown in Croatia. In comparison to some world famous beauty products, Croatian natural cosmetics present real value for the money. \n\n'''Ulola''' [http://www.ulola.com/] manufacturers soaps, bath salts, body butters and more. It's all natural and comes in combinations like: orange and cinnamon, goats milk and almond oil, etc</buy>\n\n'''S-Atea''' [http://www.atea.hr/] manufacturers soaps, shower gels, body butter and more. Seaweed, olive oil, rosemary and lavender are some of their main ingredients. \n\n'''Brac fini sapuni''' [http://www.bracfinisapuni.com/bfs_eng/index.html] (Brac quality soaps) manufacturers a wide range of natural soaps, the lastest addition to their bath line is Aurum Croaticum made from virgin olive oil and thin leafs of 23 carat gold!\n\n\n===Croatian clothing designers===\nThere are many Croatian designers and clothing specialists.\n\n'''Etnobutik \"Mara\"''' [http://etnobutik-mara.com/] (designs by Vesna Milković) offers a range of really unique clothing and accessories inscribed with \"glagoljica\" (glagolitic script; old Slavic alphabet). Some of her designs are protected as Authentic Croatian produce. \n\n'''I-gle''' Fashion Studio by two female designers Nataša Mihaljčišin i Martina Vrdoljak-Ranilović. Their clothing is sold in Harvey Nichols in Knightsbridge (London).; \n\n'''Nebo''' (\"Sky\") is a fashion house that makes really nice, funky clothes and shoes.\n\n'''Nit''' (\"Thread\") is definitely not widely known even among Croats but is definitely worth visiting as they have some \"funky and arty but serious\" clothing items that are \"value for money\".\n\n==Eat==\n[[File:Kuhane strukle 0210 1.jpg|thumb|250px|štrukli]]\n[[File:Skripavac 0808.jpg|thumb|250px|škripavac]]\nCroatian cuisine is quite diverse so it is hard to say what meal is most typically Croatian. In the eastern continental regions (Slavonija and Baranja) spicy sausage such as ''kulen'' or ''kulenova seka'' is a must-try. ''Čobanac'' (\"shepherd's stew\") is a mixture of several different kinds of meat with a lot of red spicy paprika. In Hrvatsko Zagorje and Central Croatia pasta filled with cheese called ''štrukli'' is a famous delicacy (it is said that the best štrukli in Croatia is served in the Esplanade Hotel restaurant in Zagreb), as is ''purica s mlincima'' (baked turkey with a special kind of pastry). ''Sir i vrhnje'' (sour cream with cottage cheese) can be bought fresh on the Zagreb main market Dolac. Croats love a bit of oil and you will find plenty of it in ''piroška''. In mountainous regions of Lika and Gorski Kotar meals made of mushrooms, wild berries and wild meat are very popular. One of typical dishes in Lika is ''police'' (oven-baked potatoes covered with bacon) and several kinds of cheese (smoked cheese and ''škripavac'').\n\nThe coastal region is well known for truffle delicacies and soup ''maneštra od bobić'' (Istria), Dalmatian ''pršut'' (dry-cured ham) and ''paški sir'' (Pag-island cheese). Dishes made of fresh fish and other products of the sea (calamari, octopus, crabs, scampi) shouldn't be given a miss!  Many places serve fish delivered from the local fisherman the night before - find out which ones! Croatian cost offers a wide range of restaurants that are excellent quality with relatively affordable prices (higher prices in restaurants can be found in the city centre). There is a great number of a restaurant along the coast that can be found in the prestigue Michelin guide. Dalmatian cuisine is definitely something that you will remember from your trip to Croatia.\n\nCroatian cuisine has yet to come up with a Croatian fast food representative. The market is dominated by globally ubiquitous hamburgers and pizzas but you will also find \"burek\" and \"ćevapčići\" imported from the medieval Ottoman empire which stretched from Turkey to neighboring Bosnia. The latter two dishes are widely popular in the entire South and Eastern Europe. Burek is a type of cheese-pastry whereas ''ćevapčići'' are seasoned minced meat shaped in finger-size portions served in bread and often covered with onions. Although definitely not a fast meal (takes several hours to prepare) also foreign in origin is the so-called ''sarma'' or sauerkraut rolls filled with minced meat and rice.  For those coming back from nightclubs at 4 or 5AM as is common in Croatia, it is popular to go to the local bakery and get fresh bread, burek or krafne (Croatian chocolate filled donuts) straight out of the oven. Delicious!  As far as fast food goes, who needs it when you can buy delicious prsut during the day and warm bread at night to compliment it.  Most Croatians generally look down at fast food.\n\nDesserts: What it lacks in the fast food department Croatia makes up with a myriad of desserts. Probably the most famous is its delicious creamy cake called ''kremšnite'' but different kinds of ''gibanica'', ''štrudla'' and ''pita'' (similar to strudel and pie) such as ''orehnjača'' (walnut), ''makovnjača'' (poppy) or ''bučnica'' (pumpkin and cheese) are also highly recommended. ''Dubrovačka torta od skorupa'' is delicious but hard to find. ''Paprenjaci'' (pepper cookies) are said to reflect the Croatian tumultuous history because they combine the harshness of the war periods (pepper) with the natural beauties (honey). They can be bought in most souvenir shops though fresh-made are always a better choice. ''Rapska torta'' (The Rab island cake) is made with almonds and locally famous cherry liquor ''Maraschino''. It should be noted that this is hardly an exhaustive list and even a casual glimpse in any Croatian cookbook is likely to be worth the effort.\nChocolate candy ''\"Bajadera\"'' is available throughout shops in the country and along with ''\"Griotte\"'' is one of the most famous products of the Croatian chocolate industry.\n\nAn unavoidable ingredient in many meals prepared in Croatia is \"Vegeta\". It is a spice produced by \"Podravka\".\n\nOlives: a lot of people claim that Croatian olives and their olive oil are the best in the world, which is not even well known in Croatia and less worldwide. Many brands exist and some of them have several world awards. Try to buy olive oil from Istra (although oil from Dalmatia is also excellent) and choose only Croatian brands for olives (most notable sms, few times awarded as the world's best!). Try to read the declaration before buying to ensure you are buying Croatian olives and oil, since there are a lot of imports (usually cheap products from Greece). All of this can be found in most of the supermarkets, but you should be really aware of the imports, most of the Croatian people aren't experts and prefer cheaper products, so they dominate.\nThe olive oil is a irreaplaceable \"ingredient\" in the coastal cuisine, but you should be aware of the use of cheaper, not Croatian, oil in restaurants because most of the tourists don't notice the difference so the restaurants don't find it profitable to use excellent oil; they rather use cheaper Spanish or Greek. Usually, asking the waiter for a better oil (and looking like an expert) helps, and soon he gets you a first-class oil from a hidden place.\n\n==Drink==\n\nAlcoholic: Try many different kinds of wines. Also worth trying is '''rakija''', a type of brandy which can be made of plum (''šljivovica''), grapes (''loza''), figs (''smokovača'') and many other types of fruit and aromatic herbs. '''Pelinkovac''' is a bitter herbal liquor popular in Central Croatia, but is said to resemble cough-medicine in flavor. Famous '''Maraschino''', a liquer flavored with Marasca cherries, which are grown around Zadar, [[Dalmatia]]. \nNon-alcoholic: Sometimes although very rarely you may find \"sok od bazge\" (elderflower juice) in the continental region. Worth trying! Also, in Istria there is a drink called \"pašareta\" and it is a sparkling red drink with herbal extracts. Very sweet and refreshing!\nIn some parts of Istria (especially south) in local basements, you can try 'smrikva' - a non alcoholic refreshing drink made out of berries which grow on one sort of pine tree. The taste is a bit sour but very refreshing.\n \nOn a more general note, Croatia produces a broad palette of high quality wines (up to 700 wines with protected geographic origin) and brandies, fruit juices, beers and mineral water. On the coast people usually serve \"bevanda\" with meals. Bevanda is heavy, richly flavored red wine mixed with plain water. Its counter-part in northern parts of Croatia is \"gemisht\". This term designates dry, flavored wines mixed with mineral water.\n\nTwo most popular beers are \"Karlovačko\" and \"Ožujsko\", but \"Velebitsko\" and \"Tomislav pivo\" have received a semi-cult status in the recent years. It is served only in some places in Zagreb and Croatia.\n\nOfficially, alcoholic drinks can't be sold or served to anyone under 18. However, this rule is almost never enforced.\n\n==Sleep==\n\n===Naturist resorts===\nCroatia was the first country in [[Europe]] to start with the concept of commercial [[naturism|naturist resorts]]. According to some estimates about 15% of all tourists that visit the country are naturists or nudists (more than one million each year). There are more than 20 official naturist resorts as well as a very large number of the so-called free beaches which are unofficial naturist beaches, sometimes controlled and maintained by local tourist authorities. In fact, you are likely to find nudists on any beach outside of town centers. Naturist beaches in Croatia are marked as \"FKK\".\n\nThe most popular nudist destinations are [[Pula]], [[Hvar]] and island [[Rab]].\n\n===Health tourism===\nIncreasingly Croatia is becoming a popular place for health tourism. A number of dental surgeries have experience in treating short term visitors to Croatia.\nCroatian dentists study for 5 years in Zagreb or Rijeka. Harmonization of training with EU standards has begun, in preparation for Croatia's accession.\n\n===Croatia for the disabled===\nFacilities for the disabled are not as developed as elsewhere, but there are exceptions to this and certain hotels, campsites and beaches have facilities for the disabled and wheelchair access. A more comprehensive guide to Croatia for the disabled, including contact details or various associations, can be found  [http://www.total-croatia.com/disabled-in-croatia.html here]\n\n===Lighthouses===\nOne of Croatia's more \"wild\" holiday offers are the lighthouses. Most of them are situated on a deserted coastline or in the open sea. The speciality of this is that you are able to cut yourself off from the rest of the world and take the time to \"smell the roses\". Sometimes the best way to relax is to take part in a Robinson Crusoe style holiday.\n\nCroatia has 11 rent-a-lighthouses along the Adriatic coast: Savudrija, Sv. Ivan, Rt Zub, Porer, Veli Rat, Prisnjak, Sv. Petar, Plocica, Susac, Struga and Palagruza.\n\n==Work== \n\n===Volunteering===\nCroatia is the destination of many worldwide volunteer organizations that send groups of volunteers throughout the year to help with agriculture, community development, education, animal welfare, and more. These programs are put together by nonprofits, community groups and volunteers to help locals improve their economy and way of life.  With rich cultural history and stunning coastline, Croatia is truly is the jewel of  Europe. If you would like to travel to Croatia as a volunteer, visit these websites for volunteer programs, accommodations, travel dates, and tours.  \n\n* Essential Croatia [http://www.essentialcroatia.com]\n* ISV Croatia [http://www.isvonline.com/croatia.html]\n* Volunteers Centre Zagreb [http://www.vcz.hr]\n\n==Stay safe==\n\nDuring summer make sure you use adequate SPF to protect yourself from sunburn. There are no ozone holes over Croatia but it's fairly easy to burn in the sun. If this happens make sure you get out of the sun, drink plenty of fluids and rehydrate your skin. The locals will often advise covering the burnt spot with cold yogurt bought from the supermarket.\n\nIn case of an emergency you can dial 112 - responsible for dispatching all emergency services such as fire departments, police, emergency medical assistance and mountain rescue.\n\nSince the hostilities ended in 1995, there remain an estimated 90,000 landmines in Croatia. However these are not to be found in areas visited by tourists. If you plan to hike consult locals before you go. The mine suspected areas are marked with 16.000 mine warning signs.\n\nDo not stray from marked roads or known safe areas. For further advice refer to Wikitravel's [[war zone safety]] section.\n\nWatch out for Bura wind danger signs. Bura is known in Velebit area, can blow up to 200 km/h and is known to have thrown lorries on the sides.\n\n'''Avoid strip clubs at all costs'''. They are often run by very shady characters, and often overcharge their guests. Recent cases include foreigners that were charged 2000 euros for a bottle of champagne. These clubs overcharge their customers to the extreme, and their bouncers will not have any mercy if you tell them you are unable to pay. You will soon find yourself in a local hospital. Using common sense is essential, but due to the nature of the clubs this may be in short supply, and you may be better advised simply to steer well clear of these clubs.\n\n==Stay healthy==\n\nThere are no vaccinations required to enter Croatia. \n\nIf you're going camping or hiking in continental Croatia during summer, you should be aware of ticks and tick-carrying diseases such as ''encephalitis'' and ''lyme-disease''. Approximately 3 ticks in 1000 carry the virus.\n\nIn Eastern Slavonia (particularly around the Kopacki Rit near Osijek) wear long sleeves and take insect repellent.\n\nTap water in Croatia is perfectly safe, and in some areas considered the best in the world. However, you can still choose from several brands of excellent bottled water (Jamnica being the most popular, and Jana, several times awarded as the world's best bottled water).\n\n==Respect==\nCroatia's centuries long struggle for political independence defines political discourse in Croatia. Some Croats are fiercely patriotic and immensely proud of their cultural heritage, their language and their history. Keep in mind that 1990s, marked with ethnic conflict and the following war between Croatia and the separatist Republika Srpska Krajina, are still a painful subject, but generally there should be no problem if you approach that topic with respect. Visitors will find that domestic politics and European affairs are everyday conversation subjects in Croatia.\n\nSocially, displays of affection among the younger generation are the same as Western European standards, but the older generation (over 65) still are quite conservative.\n\nWhen driving on rural roads, particularly where a driver has to pull in to allow you to pass, it is customary to wave a thanks to the other driver, by raising your hand from the steering wheel.\n\nMost Croats will respond to \"thank you\" with something along the lines of \"It was nothing\" or \"not at all\" which is equivalent to English \"Don't mention it\".\n\n==Cope==\n\n===Telephone===\n\nCroatia uses the GSM 900 (T-Mo, Vip) /1800 (Tele2) system for mobile phones. There are three providers, T-Mobile (also operates the Bonbon and MultiPlus Mobile prepaid brand), Vip (also operates the Tomato prepaid brand) and Tele2. Over 98% of the country's area is covered. 3G (UMTS 900, 2100) has been available since 2006, while 4G (LTE 800, 1800, 2600MHz) has become available in 2012. Nowdays 4G is available through Croatia. If you have an unlocked phone, you can buy a Tele2 prepaid SIM card for 25 kn. GSM phones (Nokia 1200, Nokia 2610, Motorola F3, LG KG130 or Samsung C170) bundled with T-Mobile or Vip prepaid SIM cards can be found in post offices, grocery stores and kiosks at prices between 50 and 200 kn.\n\nAn alternative to using mobile phones is Calling Cards which can be bought in postal offices and kiosks. There are two providers - Dencall and Hitme. The cheapest cards' price is 25kn.\n \n\n'''Area Codes:'''\nWhen calling between cities you must dial specific city area codes:\n(area code)+(phone number)\n\nZagreb (01)\nSplit (021)\nRijeka (051)\nDubrovnik (020)\nSibenik/Knin (022)\nZadar (023)\nOsijek (031)\nVukovar (032)\nVarazdin (042)\nBjelovar (043)\nSisak (044)\nKarlovac (047)\nKoprivnica (048)\nKrapina (049)\nIstria (052)\nLika/Senj (053)\n\n===Internet===\nBroadband is widespread in Croatia. The most common ways of connecting to the internet are ADSL(2+), cable (EuroDOCSIS), FTTH and VDSL.\n\nBroadband connections start at just 79kn for ADSL (BTnet 4/0.384, unlimited) and 99kn for FTTH (BTnet 10/10, unlimited).\n\nHowever, the cheapest ISPs are usually available only in the largest towns, while the most widespread ISP is T-Com, with very high prices but wide coverage - prices start around 180kn for unlimited 4/0.5.\n\nThe fastest private internet package available in Croatia is Amis' 100/100 package which costs 880kn, and it also includes a landline.\nThe more economically feasible high-speed broadband is H1's 50/15 VDSL for 300kn, which includes (unlimited) landline calls as well.\n\nInternet cafés are available in all major cities. They are relatively cheap and reliable. A free Wi-Fi signal can be found virtually in every city (cafés, hotels, private unsecured networks...)\n\nOne of the leading cellular network providers has a deal which provides a tourist SIM card with unlimited data for 7 days at the cost of HRK 85 or EUR 11.\n\n\n[[Category: Countries]]\n[[Category: Croatia]]\n\n[[ca:Croàcia]]\n[[de:Kroatien]]\n[[eo:Kroatio]]\n[[es:Croacia]]\n[[fi:Kroatia]]\n[[fr:Croatie]]\n[[hu:Horvátország]]\n[[it:Croazia]]\n[[ja:クロアチア]]\n[[nl:Kroatië]]\n[[pl:Chorwacja]]\n[[pt:Croácia]]\n[[ro:Croaţia]]\n[[ru:Хорватия]]\n[[sv:Kroatien]]\n[[wts:Category:Croatia]]\n\n\n[[WikiPedia:Croatia]]\n[[Dmoz:Europe/Croatia]]\n[[World66:europe/croatia]]\n\n{{isPartOf|Balkans}}\n\n{{countryguide}}"
        }
    }
}