{
    "parse": {
        "title": "Denmark",
        "pageid": 119,
        "wikitext": {
            "*": "{{pagebanner|Denmark Banner.jpg}}\n\n{{otheruses}}\n\n{{quickbar\n|location=Denmark in its region.svg\n|flag=Flag of Denmark.svg\n|capital=[[Copenhagen]]\n|area=''total:'' 43,094km²<br />''water:'' 660km²<br />''land:'' 42,434km², excluding the [[Faroe Islands]] and [[Greenland]]\n|population=5,475,791 (January 2008 est.)\n|language=[[Danish]]\n|religion=Evangelical Lutheran 82%, Non-religious 13%, other Protestant and Roman Catholic 3%, Muslim 2%\n|government=Parliamentary Constitutional Monarchy\n|currency=Danish Krone (DKK)\n|timezone=UTC+1\n|callingcode=+45\n|tld=.dk\n|electricity=230V/50Hz (European plug)\n}}\n[[File:Kingdom of Denmark on the globe (Faroer special) (Europe centered).svg|thumb|320px|Map of the Kingdom of Denmark.]]\n\n[http://visitdenmark.com/ '''Denmark'''] is a country in [[Scandinavia]]. The main part of it is [[Jutland]], a peninsula north of [[Germany]], but also with a number of islands, including the two major ones, [[Zealand]] and [[Funen]], in Østersøen Sea between Jutland and [[Sweden]].\n\nOnce the seat of Vikings and later a major north European power, Denmark has evolved into a modern, prosperous nation that is participating in the general political and economic integration of Europe. However, the country has opted out of parts of the European Union's Maastricht Treaty, the European monetary system (EMU), and issues concerning certain internal affairs.\n\nDenmark is also the birthplace of one of the world's most popular toys, Lego. There is no other better place in the world where one can buy Lego bricks than at the Legoland theme park in [[Billund]].\n\nToday Denmark is a society that is often seen as a benchmark of civilization; with progressive social policies, a commitment to free speech so strong it put the country at odds with much of the world during the 2006 cartoon crisis, a liberal social-welfare system and, according to The Economist, one the most commercially competitive. Top it off with a rich, well-preserved  cultural heritage, and the Danes legendary sense of design and architecture, and you have one intriguing holiday destination.\n\n==Understand==\n:''“My life is a lovely story, happy and full of incident.”'' <small>&mdash; Hans Christian Andersen</small>\n\n===History===\n\n\n===Terrain===\nDenmark is home to the lowest 'highest point' in Europe; but what that exactly entails is somewhat uncertain. '''Ejer Baunehøj''', in the Lake District region south-west of [[Aarhus]], seems to be the highest natural point (171m with a large tower built on top to commemorate the fact), although '''Yding Skovhøj''', some 3km away stands 2m higher owing to an ancient burial mound. Either way, the 213m tall Søsterhøj Transmission Tower (1956), with its top 315m above sea level is technically the highest point in Denmark!\n\nOverall, the terrain is dominated by mildly undulating agricultural landscapes, forests, minor lakes, extensive costal dunes, and marshes. Also, there are some scattered moors, especially in Jutland. The coastal scenery can be quite varied, and it includes the white cliffs of Møn, forested and deserted dune areas such as those near Skagen (including Råbjerg Mile and Rubjerg Knude), the cliffs of the Stevns peninsula and those of Bulbjerg and the Fur island. In Denmark, decidedly rocky scenery can only be found on Bornholm and nearby Ertholmene.\n\n===Culture===\n'''Sports''' are popular in Denmark, with football reigning supreme in popularity and counted as ''the'' national sport, followed by Handball, Gymnastics and Golf.\n\nAnother trait of Danish culture as any tourist pamphlet will tell you, is \"'''Hygge'''\", translating into cosy or snug.  Danes will be quick to point out that this is a unique Danish concept. However true, it does take a more prominent place in the culture compared to other countries.  Hygge usually involves low key dinners at home with long conversations over candlelight and red wine in the company of friends and family, but the word is broadly used for social interactions.\n\nAnother important aspect of Danish culture, is '''understatement''' and modesty, which is not only prominent in the Danish behavioural patterns.  It is also very much an important trait in the famous Danish design, which dictates strict minimalism and functionalism over flashiness.\n\nThe Danes are a fiercely '''patriotic''' bunch, but in a sly, low-key kind of way. They will warmly welcome visitors and show off the country, which they are rightly proud of, but any criticism - however constructive - will not be taken lightly. However, most Danes will happily spend hours to prove you wrong over a beer without becoming hostile. For the same reasons, outsiders on long term stays can be viewed with a certain amount of suspicion, as the '''homogeneous''' society is often thought to be the key to Denmark's successes. You will often hear resident foreigners complain about a constant pressure to become ever more Danish and the anti-immigrant Danish Peoples Party have seen increasing popularity over the years, taking 20% of the votes at the latest election which makes it Denmark's 2nd largest political party. \n\n==== Environment ====\n[[Image:Rapeseedandwindmills.jpg|thumb|upright=1.3|Rapeseed fields and windmills are a common sight in the Danish summer. pictured: [[Ærø]]]]\nDenmark is often praised as being one of the greenest countries in the world but apart from the ubiquitous bikes, the individual Danes are surprisingly nonchalant about the environment despite their reputation. As with so many other things, environmentalism is viewed as a collective responsibility. The Social Democratic leadership enacted a series of reforms, mainly ''green taxation'', between 1993-2001, that made Danish society as a whole (especially in industrial production) one of the most energy efficient in the world. As a result, these technological advances has become of the country's largest export. Examples include thermostats, wind turbines and home insulation. Because of this, green policies enjoy unusually broad support among the people and the entire political spectrum. 20% of energy productions come from renewable energy, mainly wind power. This is made possible by the common Nordic energy market and the massive hydro energy resources in Norway and Sweden, which can easily be regulated up and down to balance the unreliable wind production.\n\nAll these green visions do have a few tangible implications for travellers:\n* Plastic bags cost money; DKK1-5 - non refundable, so bring a bag for shopping groceries.\n* Cans and bottles have DKK1-3 deposit, refundable everywhere that sells the given product. This is why you´ll see some people having made a supplementary income or a \"profession\" of collecting empty bottles.\n* Many toilets have half and full flush buttons, now - you figure out when to use which.\n* There is a roughly 100% (DKK4) tax on gasoline, the total price usually hovers between DKK 9-11 per litre. (USD7-8 per gallon).\n* In many counties you need to sort your waste in two separate 'biological' and 'burnable' containers.\n\n==Regions==\nThough not immediately obvious on a map, Denmark comprises more than 400 islands, of which 72 are populated. The peninsular of Jutland and the main islands comprise the regions we use in this guide. Nearly 40% of the country's population live on the island of Zealand, though it only accounts for ⅙ of the country.\n{{Regionlist|\n\nregionmap=Denmark regions map1.png |\nregionmapsize=300px |\nregionmaptext=Regions of Denmark |\n\nregion1name=[[Jutland]] |\nregion1color=#659965 |\nregion1items= |\nregion1description=The European mainland. Home to [[Skagen]] - the beautiful old holiday town, Denmark's oldest town of [[Ribe]], Legoland and the rugged west coast. |\n\nregion2name=[[Funen and Surrounding Islands]] |\nregion2color=#a06464  |\nregion2items= |\nregion2description=Homeland of the world famous author H.C. Andersen, and his childhood house in [[Odense]] as well as the picturesque [[Sydfynske Øhav|island sea]]. |\n\nregion3name=[[Zealand]]  |\nregion3color=#b8991c  |\nregion3items= |\nregion3description=Denmark's largest island, and seat of the capital [[Copenhagen]], Hamlet's [[Elsinore]] and the vikings' [[Roskilde]] |\n\nregion4name=[[Lolland-Falster]]  |\nregion4color=#d5dc76  |\nregion4items= |\nregion4description=Islands south of Zealand. Home to Denmark's greatest nature scenery, The Cliffs of Møn.|\n\nregion5name=[[Bornholm]]  |\nregion5color=#5f4eff  |\nregion5items= |\nregion5description=The vacation island, also known as the \"rock\" island, home of the fabled roundhouse churches connected to the crusades, and some excellent beaches. |\n}}\n\n<br clear=\"all\" />\n\n==Cities==\n[[Image:Tornbystrand_cropped.jpg|thumb|240px|Hirtshals]]\nThese are the regional centers in Denmark plus a couple of most interesting towns:\n\n* [[Copenhagen]] (''København'') &mdash; Denmark's capital and largest city with a population of 1.9 million in its metropolitan area and a vast amount of offers for cultural experiences, shopping and inspiration of Danish design traditions.\n* [[Aarhus]] &mdash; the largest city on the Jutland peninsular and Denmark's second largest city, with a population of 1.2 million in its metropolitan area, a brilliant historic Open Air Museum of how the city looked in the 1800's, a cathedral and the AROS museum of modern art.\n* [[Aalborg]] &mdash; home of a historic and picturesque city centre and the rowdy ''Jomfru Ane Gade'', which features some of country's most vibrant night life \n* [[Elsinore]] (''Helsingør'') &mdash; famous as the home of Shakespeare's 'Hamlet''s castle of Kronborg, and with a nice old district.\n* [[Esbjerg]] &mdash; Denmark's centre for the fishing and offshore industry, and a short 15 minute ferry ride away from the cozy island of [[Fanø]]\n* [[Ribe]] &mdash; Denmark's oldest town and best preserved medieval town. Nearest neighbour to The Wadden Sea National Park. 2 stars in the Michelin Guide of Attractions\n* [[Herning]] &mdash; this small but ambitious town is an excellent entry point to the spectacular beaches of Jutland's western coast\n*[[Kalundborg]] &mdash; ancient town with several medieval brick houses, ruins of two medieval castles and not least the magnificent Church of our Lady with its five towers. The church is strong crusader symbol picturing the medieval imagination of the heavenly Jerusalem. Interesting historical museum with rich finds from the viking age and the medieval period. \n* [[Nykøbing Falster]] &mdash; nestled by a picturesque fjord, you can explore the old abbey, the castle, or set out to the spectacular chalk cliffs of ''Møn'' or the island's good beaches\n* [[Odense]] &mdash; the main city of the island of Funen, and Denmark's third largest city, known as birthplace of H.C. Andersen, but the nearby ''The Funen Village'' open air museum of 18th Century farm buildings, and the nearby Egeskov Castle, one of the best-preserved Renaissance castles in Europe are also good attractions.\n* [[Randers]] &mdash; The sixth largest city, and home of the biggest artificial rainforest in Northern Europe, called \"Randers Regnskov\". Also home of \"Graceland\", a copy of the home of Elvis, build for the purpose of hosting a Museum and eventhouse. The city was previously known for its Beer, Gloves and Rope production.\n* [[Roskilde]] &mdash; The old capital of Denmark, close to Copenhagen. Seat of Denmark's largest cathedral, Roskilde Domkirke, and world famous Viking Ship Museum.\n* [[Rønne]] &mdash; capital and entry point for the intriguing holiday island of [[Bornholm]], with its cozy villages, mystic round churches and the spectacular castle ruin of Hammershus\n* [[Silkeborg]] &mdash; main town of the lake district. By many Danes viewed as the most beautifully situated town in Denmark, surrounded by forests and lakes. You can jump onboard the world's oldest paddle steamer, 'Hjejlen', and sail to the famous viewpoint, 'Himmelbjerget'. Interesting historical museum with collection of 2500 years old, naturally preserved bog-mummies, e.g. the world famous 'Tollundmanden'. Also famous art museum with collection of the the contemporary artist, Asger Jorn.\n* [[Skagen]] &mdash; Scandinavia's most classic holiday town, famous for its yellow houses and the special light which made it the hometown of many famous artists in the 19th century.\n* [[Sønderborg]] &mdash; discover Danish mentality in a city where Denmark finally conceded its superpower ambitions, and wander through the old castle or the royal palace of ''Gråsten''\n\n==Other destinations==\n[[Image:Moens_klint2.jpg|thumb|250px|The majestic chalk cliffs at [[Møn|Møns Klint]]]]\n* [[Anholt]] &mdash; more than 45 kms from nearest mainland an pretty much right between Sweden and Denmark, this secluded island offers the largest desert in Northern Europe and one of Scandinavias largest seal populations.\n* [[Ertholmene]] (includes ''Christiansø'') &mdash; this small group of islands, under the governing of the Danish Defence, makes up for Denmarks most eastern land and home to a large a bird reserve, as well as old defence installations.\n* [[Fanø]] &mdash; a 16 km long and 5 km wide island, with an unusual large mount of different natural environments on a small area: Sand, heath, meadow and pine wood.\n* [[Femø]] &mdash; most famous for being one of the first bastions for the women's rights movement, it now attracts both lesbians and feminists, though priding itself of welcoming all women.\n* Hirsholm &mdash; one of six small islands 7 km to the northeast of [[Frederikshavn]], noted for its high population of birds, but also home to some excellent beaches and a relatively large number of bunkers, dating back to World War II.\n* [[Læsø]] &mdash; get away from it all in this remote island in Denmark's \"desert belt\", ride through the sand dunes on horseback and see unique farmhouses with seaweed roofs. \n* [[Kongernes Nordsjælland National Park]] &mdash; brand new national park covering the old hunting grounds of ancient kings.\n* [[Samsø]] &mdash; probably Denmark's \"greenest\" island which has recently garnered international attention since the heat and energy used on the island is exclusively produced by renewable sources, as well as home to the annual music festival ''Samsø Festival'', sporting itself as Denmark's \"hyggeligste\".\n* [[Stevns Cliff]] &mdash; a 65 million year old cliff made up of lime an chalk, which stretches more than 12 km on the shoreline and up to 41 metres above sea-level, at one point with the picturesque Højerup Kirke church balancing on the edge above the water.\n\n==Get in==\n[[File:Border control at Copenhagen Airport.jpg|thumb|right|The border control in Copenhagen Airport]]\nDenmark is not only a gateway to Scandinavia in cultural terms, but also geographically. As such, the country is well connected with the rest of the European continent and Scandinavia. A plethora of ferries connect Denmark with Europe and Scandinavia. The Copenhagen Airport serves as a main Scandinavian hub because its southern latitude makes it a natural stopping point for flights between Scandinavia and the rest of Europe. \n\n===Visas===\n{{Schengen}}\n\nAdditionally, citizens of the United States, Canada, Australia, Chile, Israel, Japan, Malaysia, New Zealand, Singapore, and South Korea are permitted to remain in Denmark for 90 days without a visa ''regardless of the amount of time spent in other Schengen countries'' (except Nordic Passport Union countries). However, time spent in Denmark ''does'' count as time spent in the Schengen area. [http://www.nyidanmark.dk/NR/rdonlyres/444448FA-19E5-4AEC-A91C-80C16F70D977/0/en_kundgoerelse_pas_og_visumforhold_01012014.pdf]\n\nIn July 2011, however, customs controls were increased along all Danish borders. While not all travelers are stopped, they should be prepared to show identification. Citizens from outside the EU should always carry a passport on them when using the German/Danish border crossing. Danish customs can be very strict and will always ask for identification documentation.\n\nCitizens of the above countries are permitted to work in Denmark without the need to obtain a visa or any further authorisation for the period of their 90 day visa-free stay. However, this ability to work visa-free does not necessarily extend to other Schengen countries. \n\nYou can apply for a visa at your local Danish embassy ([http://www.um.dk/en/servicemenu/Contact/MissionsAbroad/ list]), but in many countries where Denmark has no consular representation, other Nordic (Scandinavian) embassies (Sweeden, Norway or Finland) are usually authorized to handle visa applications (see [http://www.um.dk/en/menu/ConsularServices/ShortStayVisas/WhereDenmarkIsRepresentedByAnotherSchengenCountry/ list]). Further details are available at the Danish Immigration Services [http://www.nyidanmark.dk/en-us/coming_to_dk/visa/visa.htm].\n\nThe other nations of the Danish commonwealth, [[Greenland]] and the [[Faroe Islands]], are ''not'' Schengen or EU members. If you can visit the Schengen area without a visa, you can visit Greenland and the Faeroe Islands under the same rules (90 days in a half year), citizens of the EU/EEA have unlimited access. If you need a visa for the Schengen Zone, you'll need a ''separate'' visa for Greenland or the Faroe Islands - be sure to inform the Danish Embassy when you apply for your Schengen visa that you're also visiting these areas.\n\n===By plane===\nDenmark is served by two major and several minor airports who nearly all offer international connections. Most European airlines offers routes to Copenhagen, and many also to Billund, but [http://www.flysas.com SAS Scandinavian Airlines] remains the dominant carrier. Key players in the low-cost market include [http://www.norwegian.com/ Norwegian], [http://www.easyjet.com Easyjet], [http://www.transavia.com Transavia] and, finally, [http://www.ryanair.com Ryanair] which has services only to provincial airports.\n\n*[http://www.cph.dk/CPH/UK/MAIN/ '''Copenhagen Airport'''] ({{IATA|CPH}}) is the largest airport in [[Scandinavia]]. The airport is located at the town Kastrup on the island [[Amager]], 8km from central [[Copenhagen]]. The airport is connected by train to Copenhagen Central Station and beyond as well as [[Malmo]] and other towns in [[Sweden]]. One way fare to Copenhagen Central station is DKK34. and the train leaves every 10min. Buses and taxis are also available.\n\n*[http://www.bll.dk/''' Billund Airport'''] ({{IATA|BLL}}) in South-Central Jutland is Denmark's 2nd largest airport, and the main airport for the entire peninsula. It fields flights to major European hubs; Frankfurt, London and Amsterdam, as well as most western European capitals. Located in the town Billund, 29km from [[Vejle]], 65km from [[Esbjerg]], 104km from [[Odense]], 100km from [[Aarhus]], 210km from [[Aalborg]], and 262km from Copenhagen. The airport is connected by buses to major cities and towns in the region. Taxis are also available.\n\n*[http://www.aal.dk/ '''Aalborg Airport'''] ({{IATA|AAL}}) about 7km east of the city centre, is Denmark's 3rd largest airport with flights to around 20 European destinations, including Oslo, Reykjavik and the Faroe Islands as well as major hubs like London, Paris, Amsterdam and Istanbul. There is also a semi direct connection from New York with Iceland Express every Wednesday. Major carriers includes Norwegian, SAS and Atlantic Airways.\n\n*[http://www.aar.dk/ '''Aarhus Airport'''] ({{IATA|AAR}}) is on the [[Djursland]] peninsula 44km north east of [[Aarhus]], 50km from [[Randers]], 90km from [[Silkeborg]], 99km fra [[Horsens]], 98km from [[Viborg]] and 138km from Aalborg. An airport shuttle bus connects the airport to Aarhus Central Station from where you can reach the rest of Jutland by Train. Non national carriers serving Aarhus airport are Ryanair, British Airways and Finnair. \n\n*[http://www.sturup.com '''Malmö-Sturup Airport'''] ({{IATA|MMX}}) is located 61km from [[Copenhagen]] and offers low-fares flights with [http://www.wizzair.com/ Wizzair] to Eastern Europe. An Airport shuttle bus connects the airport with Copenhagen central station. FlyBus charges GBP10 / DKK100 for the ride.\n\n===By train===\n[[image:Map_trains_dk.png|thumb|250px|Map of train lines in Denmark]]\n\n* Rejseplanen travel planner [http://rejseplanen.dk/bin/query.exe/en?]\n\nThere are five direct trains per day (six from June 16th) from [[Hamburg]] to [[Copenhagen]], approximately every two hours, one of these trains extends to [[Berlin]]. These trains are loaded onto a ferry for the sea passage from Puttgarten to [[Rødby]], and the total journey time is around 4.5 hours (6.5 hours to Berlin). There are also two trains daily to [[Aarhus]] from Hamburg via Padborg. Other trains from Germany include trains from [[Flensburg]] to Copenhagen and trains from Niebüll to [[Esbjerg]].\nFrom Sweden there are hourly direct trains from [[Gothenburg]] and up to five direct trains from [[Stockholm]] to Copenhagen. In addition to the direct trains the Øresund trains connect Copenhagen with trains terminating in [[Malmö]] every 20 minutes, taking 35 minutes to cover the distance.\n\n===By car===\nDenmark is directly connected to the German Autobahn on route E45 (German route 7), which passes close to [[Hamburg]] and runs along the east coast of the [[Jutland]] peninsular, all the way to [[Frederikshavn]] in the North, passing through Denmark's second city [[Aarhus]] along the way. Many drivers going from Germany to the Danish capital opt for one of the regular car ferries, which shortens the trip by 137km from Hamburg and 309km from [[Berlin]] respectively, and avoids the 215 DKK bridge toll, so the price of the ferry crossing is nearly offset by extra gas needed to take the long way around.\n\nVisitors without their own wheels coming in from Germany can try their luck with the German [http://www.mitfahrgelegenheit.de/ Mitfahrgelegenheit] a '''ride-sharing''' website run in conjugation with the German Automotive organisation, which fairly frequently have rides to Denmark available. It is in German only but pretty self explanatory, if you know Denmark is called ''[[:de:Dänemark|Dänemark]]'' and International is ''Ausland'' in [[German Phrasebook|German]]. \n\nFrom Sweden catch route E20 from [[Gothenburg]] (312km) or E4 from [[Stockholm]] (655km) to [[Malmö]] and connect with the Øresund bridge [http://oresundsbron.com] (150 DKK). Many Norwegians also opt for this route when going to Copenhagen, but there are several car ferries crossing the strait between the two countries, especially to [[Hirtshals]] on the north tip of [[Jutland]], which is connected to the Danish highway network.\n\n===By bus===\nIf you are in one of the neighbouring countries, long distance buses offer a good economical alternative to trains. From Germany serveral bus companies operate routes from Hamburg and Berlin to Copenhagen and Aarhus. A trip from Berlin to Copenhagen can cost as little as 200 DKK, but normally will set you back around 300 DKK (40€) and take around 8 hours, another popular route Hamburg to Aarhus takes around 5½ hours. Check out the search engine for intercity bus connections busliniensuche.de [http://www.busliniensuche.de]. It's in German but just type in the Data, it will redirect you to the websites of the buscompanies.\n\nFor Scandinavia there are three daily connections and a night-bus from Gothenburg (4½ hours) and Oslo (8 hours), and two daily buses from Stockholm (9 hours) divided into a day and a night bus, check out GoByBus [http://www.gobybus.dk] and Swebus [http://swebusexpress.com/] for prices and schedules - when searching it might be useful to know Copenhagen is ''Köpenhamn'' in Swedish.\n\nDue to the Bosnian war in the 1990s there are several bus companies serving the Bosnian diaspora, which provide a cheap and [[Ecotourism#CO2_emissions|clean]] way of getting to the other side of the European continent. \n\n===By boat===\nThe fastest way between Norway and the continent are through the Danish highways, this has ensured frequent ferry connections to Norway, with the busiest port being [[Hirtshals]], from where a trip to Norway takes as little as 3½ hours. Other busy routes are the Rødby-Puttgarden ferry - the fastest route between Sweden and Copenhagen to continental Europe - which remains one of the busiest ferry crossings in the world (though a bridge is on the drawing board). And though it has been waning for years, with the ever increasing competition of low cost carriers, Denmark also have the only remaining ferry routed between the UK and Scandinavia  Immingham - Esbjerg, about 20 hours, (carries freight but with no passenger services). Ferries are generally of a very high standard and safety regulations are strictly adhered to. \n\n{| \n|-\n| style=\"vertical-align:top;width:50%;\" |\n\n*'''Bornholmstrafikken''' [http://www.bornholmstrafikken.dk/] \n** [[Ystad]] ([[Sweden]])  - [[Rønne]]\n** [[Sassnitz]] ([[Germany]]) - [[Rønne]]\n\n*'''Color Line''' [http://www.colorline.no/] \n** [[Kristiansand]] ([[Norway]]) -  [[Hirtshals]]\n** [[Larvik]] ([[Norway]]) -  [[Hirtshals]]\n \n*'''DFDS Seaways''' [http://www.dfdsseaways.co.uk/] \n** [[Oslo]] ([[Norway]]) - [[Copenhagen]]\n\n*'''Fjordline''' [http://www.fjordline.no/] *\n**[[Bergen]] via [[Stavanger]] ([[Norway]]) - [[Hirtshals]]\n**[[Kristiansand]] ([[Norway]]) - [[Hirtshals]]\n**[[Langesund]] ([[Norway]]) - [[Hirtshals]]\n\n| style=\"vertical-align:top;width:50%;\" |\n\n*'''HH-Ferries''' [http://www.hhferries.se/] *\n** [[Helsingborg]] ([[Sweden]]) - [[Elsinore]]\n\n*'''Polferries''' [http://www.http://www.polferries.pl/] \n** [[Swinoujscie]] ([[Poland]]) - [[Ystad]] ([[Sweden]], with transfer to Copenhagen)\n\n*'''Scandlines''' [http://www.scandlines.dk/] \n** [[Rostock]] ([[Germany]]) - [[Gedser]]\n** [[Puttgarden]] ([[Germany]]) - [[Rødby]]\n** [[Helsingborg]] ([[Sweden]]) - [[Elsinore]]\n\n*'''Stena Line''' [http://www.stenaline.se/] \n** [[Oslo]] ([[Norway]])  - [[Frederikshavn]]\n** [[Göteborg]] ([[Sweden]]) - [[Frederikshavn]]\n** [[Varberg]] ([[Sweden]]) - [[Grenå]]. \n|}\n\n*'''Smyril Line''' [http://www.smyril-line.fo/] \n** [[Seyðisfjörður]] ([[Iceland]]) via [[Tórshavn]] ([[Faroe Islands]]) - [[Hirtshals]]\n\n==Get around==\n[[Image:Ribe.jpg|thumb|250px|Ribe is Denmark's oldest city]]\nLong distance train travel is done with DSB, the Danish State Rail system. [http://www.dsb.dk] A number of long distance bus companies also operate. Each region in Denmark has its own local public transportation company. For public transportation (trains, buses and ferries) use the online travel planner Rejseplanen [http://www.rejseplanen.dk/bin/query.exe/en?]. \nThere are two ways to buy tickets. For local trips you can buy a ticket from the regional transportation company based on a zone system. This ticket is valid on all public transportation including DSB trains for one to two hours (depending on the number of zones you travel). Most public transportation companies offer a number of passes which can save you a substantial amount on transportation.  \n\nEach region has a ticket app for smartphones, as does DSB, and these usually offer concessionary prices as well.  You must have a valid ticket downloaded to your device before boarding. Remember to have your phone topped up with power, as a dead battery is no excuse for not having a ticket, and fines hover around the 100 euro mark.\n\n===By bus===\n[[Image:Fano_busstop.jpg|thumb|250px|right|A good bus stop for warm summer days on [[Fanø]]]]\nLong distance bus-service between Jutland and Copenhagen is possible with the company '''Abildskou''' (line 888) [http://www.abildskou.dk/], and while cheaper than the train, the difference is less pronounced than in many other countries, A ticket between the country's two largest cities; Aarhus-Copenhagen for instance, is DKK 270 one way for adults with Abildskou versus DKK 350 with the train. If you are flexible there is considerable discounts available in certain departures, where tickets can get as low as DKK 180, if you buy your tickets in advance.\n\nSee also the overview at: [http://www.fjernbusser.dk/ Fjernbusser.dk].\n\n===By train===\nThe primary Danish train company is '''Danish State Railways''' or '''DSB''' [http://www.dsb.dk]. Many feeder lines for the principal train line in eastern Jutland are now operated by British company Arriva. Other small rail lines are operated by other companies. DSB also operates the S-Tog commuter rail system around the greater Copenhagen area. Eurail passes are valid on all DSB trains. Danish trains are very comfortable, very modern and very expensive. Tickets can be purchased in stations, from vending machines in the stations and via DSB's website. In addition to a ticket, some trains require a seat assignment. Most trains have 230V power outlets.\n\nIf you are not travelling on a rail pass, try asking for a '''Orange''' ticket, these are a limited number of heavily discounted tickets that are available on most departures. They are often sold out way in advance, but it never hurts to ask - and you ''do'' need to ask, in order to get the discount. Unfortunately due to worn out rails, the intercity trains are often late, though as many other railways suffer from similar issues, this is of course very relative, and both funding and a comprehensive DKK 36 billion plan to deal with the problem, has passed through parliament, although it will take many years to remedy years of neglect. All trips with trains and local buses can be scheduled electronically through Rejseplanen.dk [http://www.rejseplanen.dk/bin/query.exe/en?].\n\n===By ferry===\nThe only way get to most of the smaller islands, is by ferry. There are 55 domestic ferry routes in the country. The two most important ferry companies are Nordic Ferry [http://www.nordic-ferry.com/] and Mols Linien [http://www.mols-linien.dk/english].\n\nFerries are the best way to get to [[Bornholm]], a Danish island in the Baltic Sea, although it also can be reached by plane.  Since the opening of the bridge to Sweden, the easiest route from Copenhagen to Bornholm is by train and then ferry from Ystad. Through tickets are available from Copenhagen and Ronne - booking is mandatory. There is also a bus that serves this route - Gråhund Bus 886 from Copenhagen to Ystad, where it links with the ferry to Bornholm\n\n===By car===\n[[File:Marguerite_road.jpg|thumb|right|The ''Marguerite Route'' sign - and indication of a scenic route.]]\nDriving in Denmark between cities is very easy, with well-maintained roads everywhere. Danes generally drive by the rules, but may not be very helpful to other drivers in ceding right of way, etc and stick very rigid to keep to their rights. There are no toll-roads except the two big bridges: Storebæltsbroen [http://www.storebaelt.dk/] between [[Zealand]] and [[Funen]] (DKK 215 one way), and Øresundsbron [http://www.oeresundsbron.dk] between [[Copenhagen]] and [[Malmö]] (DKK 235 one way).\n\nTouring Denmark by car can be a wonderful experience and highly recommended. ''Margueritruten'' (The ''Marguerite Route'') [http://www.visitdenmark.com/danmark/da-dk/menu/turist/oplevelser/attraktioner/sightseeing/margueritruten.htm] is a 3500 km long connected route of small scenic roads passing 100 important Danish attractions. It is marked by brown signs with the white Marguerite Daisy flower and is also marked on most roadmaps.\n\n==== Driving ====\n[[File:Denmark traffic border sign.svg|thumb|right|upright|When entering Denmark by motor vehicle, you'll be met by a sign like this, with simple instructions, at the border.]]\nUnless otherwise posted, speed limits are 130 km/h (80mph) on the motorways, 80 km/h (50 mph) outside build-up areas and 50 km/h (30 mph) in built-up areas. Although the limit goes up to 130 on intercity stretches, large stretches of motorway around cities, major junctions and on the inter-island bridges have limits of 110 km/h or lower. Vehicles with caravans or trailers as well as trucks are limited to 80 km/h on motorways, 70 km/h on roads outside build-up areas and 50 km/h in build-up areas, even though other speed limits may be indicated. Speeding occurs frequently, especially on motorways, though recent years dedicated effort by the Danish police on speeding, has made more people aware of speed limits. Trucks in Denmark generally do 90-ish km/h on motorways and trucks overtaking each other on long stretches of motorway (collegially known as ''elephant races'') occurs frequently. Fines ranges between DKK 500 (€ 70) and 10,000 (€ 1,370) and driving ban in Denmark.\n\nDriving across the over-sea bridges can subject your car to very strong gusts of wind, and when overtaking lorries or close to bridge support columns the suddenly changing strength of the crosswinds should be anticipated. You may need to steer reactively and precisely to stay in your lane.\n\nWearing seatbelts in cars and vans is compulsory (if fitted), and children under 135 cm and or under 3 years of age, must use approved safety seating devices adapted to their height and weight.\n\nHeadlights must be switched on when driving at all times (and dipped during sun hours), regardless of weather conditions or whether it is a night or day, so switch them on. If your car has the new Daytime Running Lights, which are small but bright lights on the front only, that are different from headlights, these are enough until twilight. But turn on your headlights in fog or rain, and know that DRLs only light the front.\n\nDrivers and passengers of motorcycles and mopeds must all wear ECE22.05 approved helmets.\n\nThough required under law, little use is made of indicators on roundabouts, so generally if the car isn't indicating it is leaving the roundabout, give way as it is invariable going round. When changing lane on motorways use of turn signals prior to- and during overtaking is mandatory. \n\nOn open roads, especially those with an accompanying cycle path, expect drivers turning right to come to almost a dead stop, which they check to see they are not cutting up a cyclist, even if there is no way even an Olympic cyclist could appear from nowhere on an entirely cycle free horizon.\n\nDenmark allows drivers to have 0.05 percent alcohol in the bloodstream while driving (for most people this is  equivalent to having consumed one drink or less), and Danish police is very aware of possible drunken drivers. Fine is calculated as ''(percent of alcohol in blood) × 10 × (your monthly salary before tax)''.\n\nWatch out for the bicycles in the cities, especially when turning across bicycle lanes, the bicycles always have right of way. Special care should be taken at Roundabouts !.<br />\nCyclists in general seem suicidal to drivers from other countries, as they will not look, or slow down if turning onto the road in front of you. After sun hours, lights on bikes seem to be voluntary - especially in the bigger cities - even though it is in fact compulsory.\n\nYou must always carry your driving licence, vehicle registration document, and certificate of motor insurance in the car. It is compulsory to have a Warning triangle in the car, and to use it if you experience breakdowns on highways or on regular roads where you are not able to move your car out of the way.\n\n==== Parking ====\n[[File:Parkeringsskive.jpg|thumb|right|Parking disc set for 02:50 or 14:50]]\nEase of driving inside cities is a different story. Congestion in and around the major cities, especially during rush hours can be a trial for some people. If you are in your own car, it is wise to park it in a convenient central place and walk or use public transport, bike or taxi to get around the big cities. Most parking areas requires the use of parking discs/parking clock faces (in Danish ''parkeringsskiver'' or \"P-skiver\" in short) which must be placed in the right side of the front window, with the clock facing out of the window and the hour hand set to the time you park (there is no minute hand).\n\nSome places require a parking ticket from a nearby parking ticket vending machine to be placed in the car, in the lower right corner of the dash-board, readable from outside the car. Some more modern parking ticket systems allow the purchase of parking tickets using text-messages from cell-phones, though this can be a very expensive affair from foreign numbers. The majority of the parking ticket vending machines, accepts international credit and debit cards, however this is still a large quantity that only accepts Danish national credit cards or coins. Note that in some areas - especially in the Copenhagen area - have multiple vending machines with different parking coverage. In this case the coverage is indicated with a map on left or right side of the machine. Be sure to check that the machine you purchase a ticket from, actually covers the area you have parked.\n\n==== Hiring a car ====\nThough hiring a car in Denmark is a relatively expensive way to explore Denmark, it is convenient, efficient and particularly useful if you intend to visit more remote areas, where train and bus services may be less frequent. Prices starts a approx. 120€/day at the big car hire firms, but with limited mileage, typically 100 km per lease and an additional 25 km/day. It is not uncommon for car hire firms to require drivers to be at least of 21 years of age and request that payment be done with an international credit card.\n\nBe aware that Scandinavia is no exception to the widespread European scam of adding hidden charges to your car rental bill, and not including services like auto assistance. Also, unlike other goods and services, quoted car rental rates may not include the 25% V.A.T. or sales tax for purchases by private people. Carefully read the rental agreement before you accept your car.\n\nIf possible renting a car in Sweden (just across the Sound from Copenhagen and Elsinore) or Germany (just south of the border in Jutland) can be an economically sound move. Car rentals in Sweden and Germany are less than half the price of Danish rentals and mostly comes with free mileage. Remember to check with the company to see if you're allowed to drive in Denmark and what auto assistance is included.\n\n==== Auto assistance ====\nIf you need auto assistance, you should generally enquire with your insurance company, as they will usually have made arrangements with a local company. If they haven't try one of the following companies, but expect to pay € 100-300 for a simple service like towing to nearest shop.\n\n* <listing name=\"Falck\" alt=\"\" directions=\"\" address=\"\" phone=\"+45 70 10 20 30\" email=\"\" fax=\"\" url=\"http://www.falck.dk/\" hours=\"\" price=\"\"></listing>\n* <listing name=\"Dansk Autohjælp\" alt=\"\" directions=\"\" address=\"\" phone=\"+45 70 10 80 90\" email=\"\" fax=\"\" url=\"http://www.dah.dk/\" hours=\"\" price=\"\"></listing>\n\n===By bicycle===\nBiking in Denmark is, in general, safe and easy. Drivers are used to bikes everywhere, and all major cities have dedicated, kerbed bike lanes along the main streets.  Denmark is quite flat, but can be windy, cold or wet on a bike. Bikes are generally allowed on trains (separate ticket sometimes needed). \n\nNote that biking on the expressways (Da: motorvej) is prohibited, and that this also includes the Great Belt Bridge and the Øresund Bridge. Trains can be used between [[Nyborg]] and [[Korsør]] and between Copenhagen and Malmö if you need to cross the bridges. \n\nOfficial marked routes across the country can be found in the guides on this page: [http://www.trafikken.dk/wimpdoc.asp?page=document&objno=78593]\n\n===By thumb===\nIt is quite easy to hitchhike in Denmark. People who pick up hitchhikers usually speak English. \nDestination boards are recommended.  It is illegal to hitchhike on the highways, so it is better to use highway-entrances and gas stations.  When crossing by ferry, try to get into a car that already paid for the ticket.\n\nIf you hitchhike from the southern part of Denmark (direction from Hamburg or Kiel, Germany), and continue in direction to Copenhagen, make sure the driver doesn't stop in Kolding. If he does, ask him to stop at the last gas station before Kolding. On the Kolding highway crossing there is no place to hitchhike and it is one of the worst places in Europe for hitchhikers.\n\nCheck out the [[Tips_for_hitchhiking|Tips for hitchhiking]] article here on wikitravel if you are new to hitchhiking.\n\n===By plane===\nScandinavian Airlines [http://www.scandinavian.net/], Norwegian [http://www.norwegian.com] and Cimber Air [http://www.cimber.dk/] all operate domestic routes, all of them either from or to Copenhagen Airport, there is no domestic routes between regional airports. Since most of the country's airports were build as military airfields during the second world war, they are often inconveniently located far from town centres, which as a general rule make train travel nearly as fast from town centre to town centre for destinations less than 3 hours by train from Copenhagen. For destinations further afield trains will often get you where you want to go a lot cheaper, albeit competition is heavy, and it is indeed sometimes possible to find plane tickets cheaper than the train, if you book well ahead of your planned departure - this is especially true for the Copenhagen - Aalborg route, where both traffic and competition is heaviest. \n\nAirports with domestic traffic are: [[Copenhagen]], [[Billund]], [[Aarhus]], [[Aalborg]], [[Karup]], [[Sønderborg]] and [[Bornholm]].\n\nSome of the more remote islands, if there is any such thing in a country as small as Denmark, also sees regular taxi flights from [[Roskilde]] airport to their small airfields, on-board small propeller aircraft. The most traficed route are between Roskilde and the islands of [[Læsø]] and [[Anholt]], where there are daily flights bookable on-line or by phone. These flights tend to be fairly expensive though, with the price hovering around 1000 DKK for a one way ticket.\n\n==Talk==\nDenmark's national language is [[Danish phrasebook|Danish]], a member of the Germanic branch of the group of Indo-European languages, and within that family, part of the North Germanic, East Norse group. It is, in theory, very similar to [[Norwegian phrasebook|Norwegian]] Bokmål and also to [[Swedish phrasebook|Swedish]], and is to some extent intelligible to speakers of those languages, especially in written form.  However, it sounds different from Norwegian and Swedish.  It is also more distantly related to [[Icelandic phrasebook|Icelandic]] and [[Faroese phrasebook|Faroese]], though spoken Danish is not mutually intelligible with these languages.\n\n'''English''' is widely spoken in Denmark (close to 90% of the population speaks it, making Denmark one of the most English proficient countries on the planet where English is not an official language), and many Danes have near native fluency. Danish school children start their English lessons in third grade (when they're 8 years old), and regular English lessons continue until students finish high school, and many Danish university courses are fully or partially taught in English. In this regard, it is worth noting that Denmark is probably one of very few countries in the world, where you get no extra points for trying to speak the language, and Danes in general have very little patience with non-fluent speakers. So except for a few words like ''Tak'' (thank you) or ''Undskyld'' (excuse me), English-speakers are much better off just speaking English than fighting their way through a phrasebook. If you do try, and the person you are talking to immediately switches to English, don't feel bad as it is not meant to condescend or belittle. Also of note, the Danish language has no equivalent to the English word \"please\" so at times it may seem as though Danes are rude when speaking English. This is not their intention.\n\nMany Danes also speak '''German'''. Denmark is one of the top countries in Europe when it comes to knowledge of the German language, since more than 58% of the population has a good knowledge of the language. It is widely spoken in areas that attract many tourists from Germany, i.e. mainly the Jutland West Coast, the southern part of Funen and nearby islands (e.g. [[Langeland]] and [[Ærø]]), and also especially in Southern Jutland (Sønderjylland / Northern Schleswig), where it has status of a minority language. Elsewhere in the country, many people prefer to avoid speaking it, even when they do have some command of the language, and you will have a hard time convincing anyone to (outside the tourist industry) otherwise: this has nothing to do with history but is merely a result of the high fluency in English, making the locals less inclined to struggle through a language they are not entirely comfortable with. In a pinch or emergency though, people will probably step up, and do their best to help.  There is a native or indigenous German speaking minority along the southern border to Germany (Sønderjylland / Northern Schleswig) and vice verse across the frontier there is a small community of Danish speakers to be found in Germany.\n\n'''French''' is also spoken to some degree, as all Danish students have received at least three years of lessons in either German or French, but given the Danes' limited contact with the French language, fluency tends to be lagging.\n\nForeign television programmes and films are almost always shown in their original language with subtitles. Only children's programmes are dubbed into Danish.\n\n==See==\n{{infobox|Denmark's top tourist attractions (2008)|\n# '''Tivoli''', [[Copenhagen]], Amusement park - 3.9 mio.  \n# '''Dyrehavsbakken''', [[Copenhagen]], Amusement park - 2.6 mio.\n# '''Legoland''', [[Billund]], Amusement park - 1.6 mio. \n# '''Copenhagen Zoo''', [[Copenhagen]], Zoo - 1.4 mio.\n# '''Faarup Sommerland''', [[Blokhus]], Amusement park - 0.6 mio, \n# '''Louisiana''', [[Humlebæk]], Art museum - 0.5 mio.\n# '''Djurs Sommerland''', [[East Jutland]], Amusement park - 0.5 mio.\n# '''BonBon-Land''', [[Næstved]], Amusement Park - 0.4 mio.\n# '''Odense Zoo''', [[Odense]], Zoo - 0.4 mio\n# '''The National Museum''', [[Copenhagen]], Museum - 0.3 mio.\n}}\n\n===The Danish Islands===\n\nThough not well known to casual visitors Denmark is an island nation, with 72 inhabited islands and a further 371 uninhabited ones. Apart from the well known blockbuster [[Bornholm]], with its rich history, mystic round churches and links to the Knights Templar, many of the small islands are rarely visited by tourists, even though they make up for some of the country's most intriguing destinations. An excursion to the [[Christiansø]] islets from Bornholm is highly rewarding. \n[[Møn]] has a good density of sights: varied landscapes with good hiking and biking possibilities, the famous white cliffs, plus hilly woods, lonely coasts (such as at Pomlerende) and coastal marches, plus a collection of frescoed medieval churches, including [[Elmelunde]] and [[Fanefjord]]; the lovely [[Liselund Gamle Slot]] castle (free)and its enchanting park; old town environment in [[Stege]], and nice village environments like that of [[Nyord]], known for local agricutural products. A good deal of ancient farms and antique shops etc. are scattered throughout the island too. \nSome remote islands in the Kattegat sea also have a lot of character - [[Læsø]] and [[Anholt]], which locals jokingly refers to as the \"Danish desert belt\" since it sees much less rainfall than the rest of the country, and have large swaths of sand dunes covering much of the two islands, peculiar architecture and a laid back vibe. \nAlso worth considering is the [[Sydfynske Øhav|Island sea]] south of Funen, one of the country's most beautiful areas, which also includes the larger islands of [[Langeland]] and [[Ærø]] with some impossibly picturesque villages, lush green and hilly farmland and wild horses, and [[Samsø]], geographically in the centre of the country, which boasts numerous beautiful villages and a yearly festival (''Samsø Festival''). \nFinally in [[South Jutland]], the islands of [[Fanø]], [[Mandø]] and [[Rømø]] are located in the Wadden sea, a intertidal zone forming a shallow body of water with tidal flats and wetlands. It is rich in biological diversity, with seals and an amazing range of birds, but also have some spectacular beaches and cute villages.\n\n===Viking heritage===\nMuch has happened since the Danes were wreaking havoc to much of Northern Europe, but the more peaceful modern version of the Danes still take immense pride in their Viking heritage. The most visual heritage is the burial mounds dotting the landscape everywhere in the country (actually, most of these are from the earlier Bronze Age period), but there are a few attractions for the inclined to visit. Easiest and perhaps most interesting are the two museums near [[Roskilde]], easily reached on a day trip from [[Copenhagen]] - the Viking ship museum is extraordinary with some well preserved ships and the Lejre Experimental Centre Sagnlandet, a living history museum with a recreated Viking village. Still on [[Zealand]] but a further west in [[Slagelse]], is the remains of the once mighty Trelleborg viking ring castle and some reconstructed long houses. In [[Jutland]] there is another ring castle ruin near [[Hobro]], Fyrkat, and 9 reconstructed farmhouses. Further south is [[Jelling]], home of a pair of massive carved runestones from the 10th century, one of them celebrating Denmark's conversion to Christianity - the end of the Viking age. The National Museum in Copenhagen, also has a good collection of Viking artefacts.\n\n===World Heritage Sites ===\n[[Image:Kronborg canons.jpg|thumb|250px|\"''Something is rotten in the state of Denmark''\". There are many fine castles and palaces throughout the country, like Hamlet's [[Elsinore|Kronborg]].]]\nMainland Denmark has 3 world heritage sites; The [[Jelling]] rune stones date back to 900's have been called \"Denmark's Birth Certificate\", testamenting to Denmark's conversion to Christianity around that time, it was erected by what is considered the first official king of Denmark, Gorm The Old, whose son is buried in another of the sights, [[Roskilde]] Cathedral, the first Gothic church in Northern Europe build of brick, and the final resting place for most Danish kings and queens ever since. The third, and possibly most famous, is Kronborg castle in [[Helsingør]], home of Shakespeare's Hamlet, prince of Denmark, but also an impressive castle in its own right, guarding the main route to the Baltic sea.\n\n==Do==\n===Beaches===\nWith a 7400 kilometre coastline, almost the same as Brazil's and longer than India's, you are never far from a beach in Denmark. And each summer, particularly the west coast of Jutland, is subjected a veritable invasion of more than 13 million German tourists, usually in the many vacation homes dotting the coast from north to south. And while the weather can be tricky in Denmark, the beaches are world class, with unbroken white sand for miles to an end, if you are fortunate enough to run into sunny weather.\n\n===Music Festivals===\n[[Image:Roskildefestival-orange.jpg|thumb|250px|Roskilde festival's signature Orange stage]]\nDenmark has a long running and proud tradition in music festivals, dating back to the first Woodstock inspired Roskilde festival in 1972, they have become an all important fixture of the Danish summer, and there is one to fit almost every age and music preference going on between June and August, and with very impressive attendances considering the country's size. There are actually so many that listing each and everyone of them would be ridiculous, but some of the most important ones are:\n\n* '''Skive Festival''' (previously Skive Beach Party) attracts nearly 20,000 spectators to [[Skive]] every year, mainly features Danish bands and attracts a mostly local crowd.\n* '''Roskilde Festival''' (June/July)[http://roskilde-festival.dk] - one of the ''big four'' rock festivals in Europe, run by non-profit organisation. 80,000 tickets sold and more than 110,000 participants in [[Roskilde]].\n* '''Copenhagen Jazz Festival''' - (July)[http://www.jazzfestival.dk] - One of the worlds top Jazz Festivals, with small and big concert all over the [[Copenhagen]], attracts over 20,000 spectators. \n* '''Langelands Festival''' (July/August)[http://www.langelandsfestival.dk/] - A family oriented festival on the island of [[Langeland]], 15,000 participants.\n* '''Skanderborg Festival''' (August)[http://www.smukfest.dk/] - the 2nd largest rock festival with 45,000 participants, in a unique location inside a historic forest by the lake shore near [[Skanderborg]].\n* '''Tønder Festival'''(August)[http://www.tf.dk] -A large folk and country music festival held in [[Tønder]] in [[South Jutland]].\n* '''Aarhus Festuge''' (August/September)[http://www.aarhusfestuge.dk] - 10 days of music and cultural events in the city of [[Aarhus]], with a different theme each year.\n\n===Amusement Parks===\n[[Image:Nyhavn_lego.jpg|thumb|250px|As Danish as it gets, Copenhagen's Nyhavn canal built in LEGO bricks in [[Billund|Legoland]]]]\nDenmark is teeming with amusement parks, and indeed features some of the most famous in world; Copenhagen's '''Tivoli''' is one of the oldest of such parks in world, and by Walt Disney's own admission a major source of inspiration for his own Disneyland. Also in Copenhagen, nestled among majestic beech trees '''Dyrehavsbakken''' ''is'' the worlds oldest operating amusement park, and both of these parks features some of the oldest still operating rollercoasters in the world dating back to 1914 and 1932 respectively, and both receiving the ACE Coaster Classic Award. Just as famous is '''Legoland''' in Billund, the largest and the oldest of the now global franchise, with its spectacular miniature LEGO sceneries the star attraction, and a good selection of thrill rides to entertain kids. And while outshined by its world famous rivals, there are four other major amusement parks in the country: Sommerland Sjælland[http://www.sommerlandsj.dk/], Bonbonland [http://www.bonbonland.dk/], Fårup Sommerland [http://www.faarupsommerland.dk/], Djurs Sommerland [http://www.djurssommerland.dk/], and a host of smaller one.\n\n===Fishing===\nWith its large coastline, Denmark offers ample opportunity for coastal fishing - this, however requires a permit that is available from all post offices at a rate of DKK 100+ for a year with no possibility for shorter periods of time. On the accompanying slip, however, you are immediately informed of the allowed seasons and allowed sizes of the most common species encountered on the Danish coastline. Sea Trout is common, as is Cod and Plait, and save for a few inland fjords, water quality and thus fish populations are reasonable.\n\nAs for freshwater fishing, Denmark offers a diverse number of streams and brooks (no actual rivers, though), that host Salmon, Brown, Rainbow and Sea Trout (in the season), and Grayling, as well as Pike, Perch and Roach, as do a number of inland lakes which also host Zander, Bream and Tench. Freshwater fishing is a bit more complicated than coastal fishing in Denmark, however, as there is a host of local communities presiding over the rights to fish in the specific waters, usually in agreement with the land owners where the waters are situated if they aren't owned by the state, but that also means that some stretches of a specific stream or brook may be off-limits, due to the land owner's ownership. Regulations for seasons and sizes are mandated by the state, but prices and terms for permits are regulated by the communities. Local tourist offices are usually well informed and mostly allowed to sell permits, which may be daily, weekly, monthly or yearly.\n\nLastly, there is a significant number of \"Put-and-Take\" facilities that doesn't require a permit as such, but where you purchase the right to fish for a number of hours, but where the owner of the facility guarantees that there are fish present - usually Rainbow Trout - but whereas many facilities are \"self-serve\" in the sense that you fill out a form and dump it, and the corresponding payment, in a post box, don't be surprised if the proprietor comes by at some time to ask if you are in luck, at the same time keeping track of the number and times of the forms, hours and payments that he has collected from the box.\n\n===Hunting===\nHunting in Denmark is done on the basis of land owners retaining the right to hunt on their premises and then, possibly renting it out to interested parties, keeping a close check on who hunts where and when.\n\nThus, whereas it is relevant to note that a general hunting permit (DKK 500,-) is required, hunting is almost exclusively done with people that you know, who have the hunting rights to the land in question, so if you want to go hunting in Denmark, you would most probably need to befriend a land owner or a friend of one beforehand.\n\nNote that danish weapons legislation is extremely restrictive. Generally any type of weapon is illegal to own or carry anywhere! There are exceptions for hunting and weapons clubs, but this requires a special permit, and outside the shooting area (hunting grounds or club) the weapon must be concealed and not loaded. Many types of knives are also illegal. Weapon types which cannot be used for hunting or shooting contents - such as knuckles - are just outright illegal anytime and anywhere. The fine for carrying an illegal weapon, especially if it is ready to use, may be severe: A heavy fine and possibly some weeks in prison.\n\n===Hiking===\nHiking in Denmark is easy as there are many trails allover the country. Many of the trails are interconnected. You may find many of the trails here: [http://hiking.waymarkedtrails.org/en/?zoom=7&lat=56.34923&lon=10.61325&route=1&hill=1.03 waymarkedtrails.com]\n\nYou may also find trails, accomodation, attractions at [http://friluftsguiden.dk/?lng=en Zealand (Sjælland) here].\n\n==Buy==\n\nThe national currency is the Danish ''krone'' (DKK, plural \"kroner\"). In the more \"touristy\" shops in Copenhagen, and at the traditional beach resorts along the Jutland West Coast and Bornholm Island it will often be possible to pay in Euro. The Danish krone is pegged to the Euro to an accuracy of 2.25%. In the 12 months from Aug 2005 to Aug 2006 the average exchange rate was 1 EUR = 7.46 DKK. The Kroner comes in 50 øre (½ kroner) copper coins, 1, 2 and 5 kroner silver nickel coins with a hole in the centre, and finally solid 10 and 20 kroner bronze coins. Notes comes in nominations of 50 (Purple), 100 (Orange), 200 (Green) 500 (Blue) and 1000 (Red) kroner. Note that the 1997 series of banknotes are being replaced with a new series, starting with the 50 kroner note in 2009 and ending with the 1000 kroner note in 2011, hence you can expect to see two types of bank notes circulating in the coming years, both are legal tender. \n\nFaroese króna and the coming series of Greenlandic bank notes, while of exactly the same face value, are not legal tender in Denmark (and vice-versa), but can by law be exchanged in any bank free of charge at a 1:1 ratio.  \n\nAutomatic teller machines are widely available even in small towns, but some '''ATM''''s are closed during night time out of security reasons. The Danish word is ''Dankort/hæve-automat'', and might be useful to remember as the term ATM is not universally known. \n\nNearly all machines regardless of operator will accept the Danish ''Dankort'', MasterCard, Maestro, Visa, Visa Electron, American Express, JCB og China UnionPay (CUP). While the majority of retailers accept International credit- and debit cards, many still only accept the local Dankort. Virtually everywhere you are required to use a '''PIN-code''' with your card, so if this is not common practice in your country, remember to request one from your bank before leaving home. Also beware that most retailers will add a 3%-4% transaction charge (often without warning) if you pay with a foreign credit card.\n\nNote that a few machines will '''not''' accept '''PIN-codes''' longer than 4 characters, which can create problems for north-american or other european users. Ask the clerk operating the machine if it accepts 5-digit PIN-codes before attempting to operate the machine. Your card may be rejected even without entering the PIN if it is incompatible. \n\n===Prices===\nYou should note that almost everything in Denmark is expensive. All consumer sales include a 25% sales tax (''Moms'') but displayed prices are legally required to include this, so they are always exact. If you are from outside the EU/Scandinavia you can have some of your sales tax refunded [http://www.tax.dk/ukpjecer/refund.htm] when leaving the country.\n\nThe average price of Hotel accommodation was around 900 DKK ($160) according to the annual 2009 Hotels.com price index, a hostel bed hovers around 200 DKK ($35), but can be found cheaper in Copenhagen. While a three course meal at a standard restaurant will usually set you back around 200 DKK ($35), this can be done cheaper if you eat cafés or pizza joints, 30-70 DKK ($5.50 to 12.50). Sundries like a 1½l bottle of Coca Cola costs 25 DKK ($4.50), while a beer will cost you 4 DKK (70 cents) in a supermarket, and 25-50 DKK ($4.50 to 9) in bar. If you are a bit careful about your expenses a daily budget of around 600 DKK ($110) per day is not unrealistic.\n\n===Tipping===\nIn Denmark service charges are automatically included in the bill at restaurants and hotels, and tips for taxi drivers and the like are included in the fare. Therefore tipping is not necessary.\n\n===What to buy===\nNaturally what to buy remains highly subjective, and in an expensive country like Denmark, also largely depends on the size of your pocket, but here are some suggestions: \n{| \n|-\n| style=\"vertical-align:top;width:50%;\" |\n* Designer eyewear by Lindberg [http://www.lindberg.dk/]\n* Skagen designer watches [http://www.skagen.com]\n* Royal Copenhagen porcelain [http://www.royalcopenhagen.dk/]\n* Bang & Olufsen electronics [http://www.bang-olufsen.com/]\n* Georg Jensen silverware and jewelry [http://www.georgjensen.com/]\n* Kay Bojesen silverware [http://www.kaybojesensilver.com/]\n| style=\"vertical-align:top;width:50%;\" |\n* LEGO building brick toys [http://lego.com]\n* ECCO shoes [http://www.ecco.com]\n* Aalborg Akvavit spirits [http://www.aalborgakvavit.dk]\n* Danish Fashion [http://www.danishfashioninstitute.dk/23618/Members]\n* Danish Design [http://www.ddc.dk/ddc]\n* Danish Cheese [http://www.arla.com/products/cheese/]\n\n|}\n\n==Eat==\n{{infobox|Smørrebrød|[[Image:Smorrebrod.jpg|right|175px]]\nPopular and traditional choices are:\n* '''Pickled herring''', plain, curry, or with red spices.\n* '''Liver Paté Sandwich''', probably the most popular.\n* '''Stjerneskud''',  salad, one fried and one boiled plaice fillet, shrimp and mayonnaise.\n* '''Røget ål og røræg''', smoked eel and scrambled eggs\n* '''Pariserbøf''',  beef patty cooked rare with capers, horseradish, raw onions, and a raw egg yolk on top.\n* '''Dyrlægens natmad''', liver pate, slices of corned beef, onion rings and aspic (''sky'').\n* '''Beef tartar''', raw lean ground beef served with raw egg yolk, onions, horseradish and capers.\n* '''Flæskesteg''', Slices of pork roast with pickled red cabbage. \n* '''Roastbeef''', with remoulade, fried onion, horseradish.\n* '''Kartoffel''', sliced potatoes, tomatoes, crispy fried onions, and mayonnaise.\n* '''Hakkebøf''', pan fried ground beef patty with soft fried onions, a fried egg and pickles.\n* '''Shrimps''', you get a generous portion of just shrimp with a little mayonnaise.\n* '''Ost''', Cheese. Try a very old cheese served with raw onions, egg yolks and rum.\n}}\nApart from the ubiquitous kebab shops and pizza stands, dining in Denmark can be fairly expensive, but a worthwhile cost.  Traditional Danish fare includes items as pickled herring, fried plaice, and other assorted seafood items.  Hearty meat dishes are also prevalent, as seen in items such as frikadeller (pork only or pork and veal meat balls topped by a brown sauce) and \"stegt flæsk og persillesovs\" (thick pork bacon slices topped by a parsley cream sauce).  Many meals are also accompanied by a beer, and shots of aquavit or schnapps, though these are mainly enjoyed when guests are over. Drinking along with meals is encouraged as the foods are enhanced by the drinks, and vice versa. If looking for a quick snack to grab on the go, try the traditional Danish hot dog, served in a bun with a variety of fixings, including pickles, fried or raw onions as well as ketchup, mustard and remoulade (a Danish invention in spite of the French name, consisting of mayonnaise with the addition of chopped cabbage and turmeric for color). For dessert, try either \"ris à l'amande\" (rice pudding with almonds and cherries, again a French name with no relation to French cuisine) or æbleskiver (ball-shaped cakes similar in texture to American pancakes, served with strawberry jam), both normally only available in November and December. For candy try a bag of \"Superpiratos\" (hot licorice candy with salmiakki).\n\nIn the past few years, Copenhagen has emerged as a very happening place for food enthusiasts and gastronomic travelers, the highlight being the world-renowned restaurant ''Noma''.\n\nDo avoid touristy places where no Danes are to be found, popularity amongst locals is almost always an indicator of quality.\n\nRestaurants offering examples of international cuisine are common, mostly in major cities, especially Italian, Turkish and Chinese restaurants, though Japanese, Indian and even Ethiopian restaurants can be found too. Quality is generally high, as the competition is too sharp for low-quality businesses to survive.\n\n===Smørrebrød===\nThe traditional Danish lunch is '''smørrebrød''', open sandwiches usually on rye bread - fish except herring, plaice and mackerel are served on white bread, and many restaurants give you a choice of breads. Smørrebrød served on special occasions, in lunch restaurants, or bought in lunch takeaway stores, are piled higher than the daily fare.\nThe Danish rye bread (''rugbrød'') is dark, slightly sourish and often wholegrain. It is a must for all visitors to try.\n\n==Drink==\n''Danes are rightly famous for their good looks, but unlike most other places, their lucky draw at the gene pool hasn't translated into the self assertion and confidence you normally see. And the Danes have become infamous for being closed and tight lipped, bordering on outright rude. So while it is by no means impossible, you will still be hard pressed to find a Dane readily engaging in casual conversations with strangers. That is, until you hit the country's bars and nightclubs''. \n\nAs any foreigner who has spend time observing the Danes will tell you, alcohol is the fabric that holds Danish society together. And when they are off their face in the dead of night, they suddenly let their guard down, loosen up, and while a bit pitiful, they somehow transmorph into one of the most likable bunch of people on Earth. Rather than the violence associated with binge drinking elsewhere, because it seems to serve a very important social purpose, the natives get very open, friendly and loving instead. It takes some time getting used to, but if you want to form bonds with the Danes, this is how you do it - God help you if you are abstinent. This also means Danes have a very high tolerance for drunk behavior, provided it takes place in the weekends. Drink a glass or two of wine for dinner during the week is normal, as well as 20 pints on a Saturday night, and puke all over the place.\n\nThere is '''no legal drinking age''' in Denmark, although a legal purchase age of 16 is in effect in shops and supermarkets, and 18 in bars, discos and restaurants. The enforcement of this limitation is somewhat lax in shops and supermarkets, but quite strict in bars and discos, as fines of up to DKK 10,000 and annulment of the license can incur on the vendor. The purchaser is never punished, although some discos enforce a voluntary zero-tolerance policy on underage drinking, where you can get kicked out if caught with no ID and an alcoholic beverage in your hand. Some would claim that the famous Danish tolerance towards underage drinking is waning in light of recent health campaigns targeting the consumption of alcoholic beverages amongst Danes. As adult Danes do not approve of the government interfering with their own drinking habits, the blame is shifted towards adolescents instead, and proposals of increasing the legal purchase age to 18 overall have been drafted, but have yet to pass Parliament, neither is it likely too in the foreseeable future. \n\nDrinking alcoholic beverages in '''public''' is considered socially acceptable in Denmark, and having a beer out in a public square is a common warm weather activity there, though local by-laws are increasingly curbing this liberty, as loitering alcoholics are regarded as bad for business. Drinking bans are usually signposted, but not universally obeyed and enforced. In any case, be sure to moderate your public drinking, especially during the daytime. Extreme loudness may in the worst case land you a few hours in jail for public rowdiness (no record will be kept, though). Most police officers will instead ask you to leave and go home, though.\n\nDanish beer is a treat for a '''beer enthusiast'''.  The largest brewery, Carlsberg (which also owns the Tuborg brand), offers a few choices, as well as a delicious \"Christmas beer\" in the 6 weeks leading up to the holidays.  Other tasty beverages include the Aquavit (Snaps) and Gløgg - a hot wine drink popular in December. Danish beer is mostly limited to lager beer (''pilsner''), which are good, but not very diverse. However in the last few years Danes have become interested in a wider range of beers, and Danish microbreweries' excellent products are increasingly available. The Danish Beer Enthusiasts [http://www.ale.dk/] maintain a list of bars and restaurants with a good selection of beers as well as a list of stores with a good selection.\n\n==Sleep==\n\nDue to the compact size and dense population, unlike the other Scandinavian countries, Danes and visitors does not enjoy the [[Right to access]] in Denmark, visitors who want to enjoy the outdoors can overnight in one of the more than 500 '''camping''' grounds, most are well equipped with up to date facilities. The Danish Camping Board[http://www.danskecampingpladser.dk/] maintains a list of official camping grounds on their website. It is also possible to do '''wildlife camping''' in forests or other untouched sights, but only in designated areas (there is about 800 of them). Unfortunately the digitalized information of the locations are in Danish only, but it can be found at the Danish Forest and Nature Agency [http://www.friluftskortet.dk/], another option to find these sights are to buy a printed guide book which costs DKK 98, and is available from many tourist informations desks or the Danish Cyclist Union[http://www.dcf.dk/] You are allowed to sleep on the beach (but not to pitch a tent).\n\nFor '''Budget''' accommodation, Danhostel[http://www.danhostel.dk] is the national accredited '''[[Hostels|Hostelling]]''' International network, and operate 95 hotels throughout the country. Only the country's two largest cities - Copenhagen and Aarhus, have a few independent youth hostels. It is worth noting that the Danish word for hostel is ''Vandrerhjem'',  which also what hostels in Denmark are usually signposted as. Another option is one of the '''[[Hospitality exchange]]''' networks, which is enjoying growing popularity among the Danes, with couchsurfing reporting a doubling of available hosts every year.\n\n'''Hotels''' are expensive in Denmark, with an average price of a double room hovering around 847 DKK ($158/€113) in 2007, hotels are mostly off limits to shoestring travellers, although cheaper deals can most certainly be found, especially for online bookings done in good time before arriving. National budget hotel chains include Zleep [http://zleep.dk/] and Cabb-in  [http://www.cabinn.com/]. Alternatives to hotels include a well developed network of '''Bed & Breakfasts''' which are bookable through the national tourism organisation VisitDenmark [http://www.visitdenmark.com] (Click on Accomodation > Private accomodation) - or in country famous for its bacon, butter and cheese - what better way to dive into Danish culture than on a '''Farm Holliday'''? the National organisation [http://www.bondegaardsferie.dk] maintains an online catalogue of farms offering stays all over the country in both English and German. Another alternative to hotels are the many historic '''Old inn's''' - or ''Kro'' in Danish - dotting the towns and villages, most of them are organized though a national organisation called ''Danske Kroer og Hoteller'' [http://www.krohotel.dk].\n\nAnother option is to rent a private apartment when visiting Copenhagen which gives you the opportunity to stay in comfortable surroundings with facilities such as your own kitchen and Wi-Fi. The company Apartment in Copenhagen [http://www.apartmentincopenhagen.com] offers 1-4 bedroom apartments at rates from 85 Euros per night.\n\n\n\n\n AIRBNB\nFurthermore the cheapest is definetly some of the airbnb options in the neighborhood, but please then dont treat them poorly because of this, they really dont make alot of money on this and mostly does it for a little xtra income, so please be the perfect guest for such perfect host in the area. \nLess demanding more loving <3\n\n==Stay safe==\nGenerally: Denmark is a country with almost no risk of natural disasters or animal attacks. Compared to most other European countries crime is average and common sense should keep you out of any trouble.\n\n* '''Animals''': There is one relatively timid poisonous snake, the European viper (''Hugorm''), whose bite very rarely is lethal. If you are walking in the woods or open areas with some ground cover during the summer, closed footwear is recommended. There is also a fish, the greater weever (''Fjæsing''), with poisonous spines, that buries iself in the sand. The sting is painful, much worse than a sting from wasps or bees but is almost never lethal. The pain can be reduced by submersing the injury in hot water for at least 15 minutes. Once the pain has eased, the injury should be checked for any remaining spine fragments, and any such should be removed. If the pain does not mostly fade away within a few hours, you should seek medical attention. Medical attention should also be sought if the pain spreads to other areas than the original injury and if one experiences servere symtoms such as abnormal heart rhythms, weakness, shortness of breath, seizures, decreased blood pressure, gangrene, tissue degeneration and/or unconsciousness.\n* '''On foot''' in cities Danes drive by the rules, and they have every expectation that pedestrians do the same. Therefore, it is important to obey '''Walk/Don't Walk''' signals and avoid jaywalking in cities, simply because cars will not slow down since you're  not supposed to be there. Also, take good notice of the dedicated bike lanes when crossing any street to avoid dangerous situations as bikers tend to ride fast and have right of way on these lanes.\n* On the '''beach''': Don't bathe alone. Don't get too far away from land. Swim along the coast rather than away from it. In some areas undertow is a danger, and kills a number of tourists every year, but will mostly be signed at the beach. If you get caught by the undertow, do '''NOT''' fight the current. Instead use only as much energy as you need to stay afloat and let the current carry you out. Once the current dies out, swim parrallell to the beach for some time, before swimming back. On many beaches, flags inform of water quality. A blue flag means excellent water quality, green flag means good water quality, red flag means that bathing is not advised. A sign with the text \"Badning forbudt\" means that bathing is forbidden. Obey these signs, as it often means that the water is polluted with poisonous algae, bacteria, or chemicals, or that there is a dangerous undertow.\n* In the city: A few districts in major cities are probably best avoided at night by the unwary - but reverse of the trends in North America, it is often the ghettos in the suburbs that are unsafe, rather than the downtown areas. \n\nIn an emergency dial '''112''' (medical help/fire brigade/police). This is toll free, and will work even from cell phones even if they have no SIM card. For the police in not-emergencies call '''114'''.\n\n==Stay healthy==\nHealth services in Denmark are of a high standard, although waiting times at emergency rooms can be quite long for non emergencies, since visitors are prioritized according to their situation. Except for surgical procedures there is no private healthcare system to speak of, all is taken care of by the public healthcare system and general practitioners. ''All'' visitors are provided with '''free emergency care''', until you are deemed healthy enough to be transported back to your home country. Citizens from EU countries, Norway, Iceland, Switzerland and certain British dependencies are all entitled to additional basic medical services during their stay, other nationalities should have a valid travel insurance for transportation home and any additional medical care needed after any emergency is dealt with, as this is not provided free of charge. As in the rest of the country, English speakers should not have any trouble '''communicating''' with staff in English.\n\nOne thing worth noting for several nationalities, is that Danish doctors don't strew out prescriptions or pills out at the rate common in North America, Japan and Southern Europe. There is a general trend of letting the body's own immune system take care of diseases, rather than using '''medicines'''. So if you show up at the local GP with minor illnesses like the common flu, expect to be send back to your bed to rest, rather than receiving any treatment, if you are otherwise of good health. '''Pharmacies''' (Danish: Apotek) are usually well stocked, but brand names may differ from those in your own country. Staff is highly trained, and major cities usually have one 24 hour pharmacy. Many drugs that are prescription-free in other countries, require prescription in Denmark, which is not trivial to get (see above), and medicines available in supermarkets and drug stores are very limited; i.e. allergy drugs and light painkillers; Paracetamol based (Panodil, Pamol & Pinex), acetylsalicylic based (Treo, Kodimagnyl & Aspirin) and Ibuprofen based (Ipren)\n\n'''Dentists''' are only partly covered by the public healthcare system, and everyone, including Danes pay to visit their dentist. Danes and other Nordic citizens have some of the expenses covered by the public healthcare system, while non Scandinavian visitors, should generally be prepared to foot the entire bill themselves, or forward the expenses to their insurance company. Prices are notoriously high compared to the neighbouring countries, so unless it is urgent to see a dentist, it will probably be more economical to wait until you return home, or pass into Germany or Sweden.  \n\n'''Tap water''' is potable unless indicated. The regulations for tap water in Denmark even exceeds that of bottled water in general, so don't be offended if you notice a waiter filling a can of water at the sink. Restaurants and other places selling food are visited regularly by health inspectors and are awarded points on a 1-4 \"smiley scale\". [http://www.findsmiley.dk/en-US/Forside.htm] The ratings must be prominently displayed, so look out for the happy face when in doubt. While pollution in the major cities can be annoying it doesn't pose any risk to non-residents. Nearly all beaches are fine for bathing - even parts of the Copenhagen harbour recently opened for bathing (read the Stay safe section).\n\n===Smoking===\n\nAs of 15 August 2007, it is illegal to smoke in any indoor public space in Denmark. This includes: government buildings with public access (hospitals, universities, etc), all restaurants and bars larger than 40 sq m and all public transport. You have to be at least eighteen years of age to buy cigarettes in Denmark.\nAs of 1 July 2014, smoking is technically forbidden on all railway platforms in Denmark; however, the law has not been enforced, and both travellers and railway staff can regularly be seen smoking on the platform. However, it's important to remember that it is still illegal - put out your cigarette if asked by personnel; unless you want to get kicked off the platform.\n\n==Respect==\n\nIn a country which has no direct equivalent to ''please'' in their vernacular, where the local version of ''Mr.'' and ''Ms.'' has all but disappeared from common usage, and where the people can hardly muster a sorry if they bump into you on the streets, you could be forgiven to think they are the rudest people on earth and that you can get away with pretty much anything. You'd be wrong. Most of the behaviour many tourists consider appalling can be attributed to either the Danes' blatant - and when you get to understand it, quite sympathetic - '''disregard for formality''', or their unfortunate '''shyness''' (see [[#Drink|drink]] section), and there are rules to the madness, way too complex to get into here, but some of the most important ones can be summed up as follows: \n[[Image:Oesterlars Kirke Bornholm Denmark.jpg|thumb|250px|right|Though officially Lutheran, Denmark is largely agnostic. Pictured: Østerlars Church, [[Bornholm]]]]\n\n* It is generally not considered impolite to '''omit verbal formalities''' common in other cultures, such as generic compliments or courteous bromides. Likewise, Danes almost never use ''Sir'' or ''Madame'' to address each other, as it is perceived as distancing oneself. On the contrary, addressing (even a stranger) by first name is considered a friendly gesture.\n\n* '''Be punctual''', few things can make the Danes more annoyed than showing up later, even by a few minutes, than the agreed time, save social gatherings at people's homes, where the requirement for punctuality is much more relaxed.\n\n* If there are free seats on a bus or train, it's not customary to seat yourself next to strangers if you can avoid it. It is also a nice gesture to offer your seat for the elderly and the disabled. In many busses, the front seats are usually reserved for them.\n\n* Be aware that there are marked \"quiet zones\" on each train: one in the back of the back wagon and one in the front of the front wagon. Don´t talk on the phone there. In fact, don't talk at all. These are for people who want a quiet trip, usually people who need to go far, and may want to sleep, read, or work on their laptop or other things in peace.\n\n* Danes try to abridge differences between social classes. '''Modesty is a virtue''' - bragging, or showing off wealth, is considered rude, as is loud and passionate behaviour. Economic matters are private - don't ask Danes questions like how much they earn or what their car costs. As in Germany, Britain, and the rest of the Nordic countries, weather is a good conversation topic.\n\n* Greetings between people who know each other (e.g. are good friends, close relatives, etc.) are often in the form of a '''careful hug'''. It is rare to see a peck on the cheek as a form of greeting, and it might be taken as way too personal. A handshake is customary for everyone else, including people you aren't close to and people you are being introduced to.\n\n* When invited by a Dane - to visit their home, join them at their table or engage in an activity - don't hesitate to accept the invitation. Danes generally don't strew invitations out of politeness, and only say it if they mean it. The same goes for compliments. Bring a ''small'' gift; chocolate, flowers or wine are the most common, and remember despite their disregard for formality, to practice good table manners while at restaurants or in people's homes.\n\n* Even though 82% of the population is officially Lutheran, Denmark is by and large an '''agnostic country'''. Investigations into people's faith are usually unwelcome. Saying grace for example, is likely to be met with bewilderment and silence. Religious attire such as Muslim headscarfs, kippahs or even t-shirts with religious slogans, make make some Danes feel uncomfortable. If someone sneezes '''do not''' say \"Bless you\" under any circumstances, instead say \"Prosit\" or \"Gesundheit\" (\"Prosit\" is higly recommended since it's the Danish way of saying it) However, words like \"Oh my god\" are welcome.\n* If in Denmark on business, it's important to note that family nearly without exception takes priority over work. So don't be surprised if Danes excuse themselves from even the most important of meetings by 4PM to pick up kids, a burden equally shared between the sexes.\n\n==Contact==\n=== Internet ===\nWhile Internet cafés are present in most larger cities, they are usually not geared for tourists and hence they can be a bit tricky to find. Hotels usually provide both wireless internet and computers with internet access, but whether this service is provided for free, varies greatly - many cafés and bars also provide free wireless internet for paying customers, even when it is not signposted, so it is always a good idea to ask. The easiest way to get online is often the public library, as there is one in almost every town, they are usually centrally located, well signposted (look for ''Bibliotek'') and always free - there can be a bit of waiting time to get a free computer though, but there will normally also be some sort of reservation system in place, so you can time it better.\n\nIf you are staying for more than a few weeks, you may also consider getting a mobilt broadband connection - most of the country has excellent coverage and speeds rivaling those of a fixed connection in the major cities and plenty for surfing the web, even in many of the more remote areas. Unfortunately the Danish ISPs generally don't have up to date English versions of their websites, so getting information about coverage and store location can be tricky. If you don't have a residents permit, a CPR and a local address you will not be able to buy a subscription, but Telia, TDC and Telenor offer prepaid packages you can buy as a foreigner. Telia's prepaid package starts at 50 DKK per GB while TDC's and Telenor's are quite expensive at 1000 DKK per GB. You can buy the Telia package in their stores located in the largest towns - if you have a modem that support UMTS/HSPA+/LTE you will most likely be able to use it, otherwise you can buy one for 500 DKK.[http://www.bredbaandsmatch.dk/english/tourist/]\n\n=== Phone ===\nBring your own unlocked GSM phone to make calls. Prepaid SIM cards are available at most shops and international calling can be reasonably priced. Any prepaid credit generally only valid for calls made in Denmark, but can be purchased in small amounts to avoid waste when you leave. Data access on prepaid cards is very expensive as the 4 major Danish providershave locked out the monthly subscription market that include generous data allowances to Danish resident holders only; a rule enforced by local government.\n\nInternational collect calls are not allowed from phone booths, which are all ran by the TDC company. You should be able to make international call with the prepaid SIM cards anyways.\n\nDenmark's international phone country code is '''45'''. The prefix for international dialing is  \"00\" or '+' (on a mobile phone).\n\nWhen calling a Danish company expect to be connected directly to a Danish phone operator or digital system in Danish; if you wait till the end of the introduction and available options there's usually a separate English option, otherwise hit #.\n\n=== Mail ===\nMost towns of any size have a post office or a supermarket licensed to handle mail and parcels. Service is efficient but slower now, and you can expect mail posted in the post office, or in a mailbox before it is emptied (hours are no longer posted on the mailbox, just a promise to collect every 5 days) to arrive within 5 days in Denmark and Southern Sweden. Mail to the rest of Europe, the United States and Canada needs one extra day, while delivery time to the rest of the world varies greatly, and mostly depends on the postal service in the receiving country. Most post offices in Denmark also handle Western Union money transfers, ticket sales for events, currency exchange and sell phone cards for international calls. Standard prices for postcards and standard letters are 8 DKK within Denmark (27 DKK if you want it to go quickly and can post it at a post office rather than in a mailbox), 25 DKK to Europe and all other countries (as of 2017, the rates are higher and likely to rise, but as any current info as of the time of writing is likely to be outdated soon, do ask at the post office).\n\nIf you need to have parcels or mail sent to you in Denmark, you can receive it as ''Poste Restante'' at most major post offices (General Delivery in the US). The post office will only hold such mail in one month, after which it will be returned to the sender. The address format is:\n Name\n c/o Poste restante\n Hovedpostkontoret (''General Postoffice'')\n Postal-Code City\n Denmark\n\nMajor international parcel services like UPS or Fedex, while present in Denmark, do not offer any holding service.\n\n== Cope ==\n\n=== Consular assistance ===\nNearly all developed nations have embassies in Copenhagen, and most other countries have embassies in either Stockholm or Copenhagen responsible for consular services to the whole [[Scandinavia|Scandinavian]] region. EU member nations often maintain consulates in the provinces. At present, there are 71 foreign embassies in Copenhagen and more than 100 consulates in Copenhagen and larger cities, such as Aarhus, Aalborg, Odense, Vejle etc. [http://www.embassypages.com/denmark.php].  If you fall victim to serious criminal injuries while in Denmark, you might be eligible to financial compensation. If you wish to file a claim you must report the incident to police within 24 hours, and file a form obtainable from the police to Erstatningsnævnet; Gyldenløvesgade 11, 1600 Copenhagen V. Tel +45 33 92 33 34, Fax: +45 39 20 45 05, Email: ''erstatningsnaevnet@erstatningsnaevnet.dk''. Claim processing time is a minimum of 3 months.\n\n=== Customer Service ===\nBy most standards the Danes have a great deal to learn about customer service, and many visitors may initially be appalled by the low standards present outside upmarket establishments, used to dealing with international expectations. Many attribute this to the high equality not only being present in practice, but also mentally - \"you are not worth any more than me, so why should I treat you any different\". By and large it is just one of those cultural differences you have deal with while visiting another country, and throwing a hissy fit or demanding to speak to the supervisor, is unlikely to get you anywhere. On the upside; tipping is neither expected - nor required, and when you ''do'' bump into good service, it tends to be truly genuine helpfulness, rather than an expectation for tips, or employee training courses - so savour such moments, remember to tip, and forget about the rest.\n\nOn a practical level, this means that you should only expect table service in restaurants. In café's and bars you usually order in the bar or counter and pay immediately when ordering, even if you intend for a 2nd order. It is also common that staff doing other duties than serving customers will happily keep the customer waiting, until he or she is finished with with whatever needs doing. Also don't expect any sir or madam's, verbal bromides seems awkward to most Danes, including those behind a counter.\n\n=== Media ===\nApart from children's programmes, nothing gets dubbed into Danish, although a sizeable portion of broadcasts in Denmark are American and British productions - so even with no English channels, there will usually be something shown in a comprehensible language, same goes for cinemas - so you should be safe for a lazy rainy day. Nearly all hotels will have CNN and the BBC World Service available.\n\nIf you want updated with local news, the '''Copenhagen Post''' is the country's sole English language newspaper, it is published weekly and available in many bars and cafés in Copenhagen, while much harder to find in the rest of the country.\n\n==Get out==\n\n====North Atlantic====\n\nFor historical reasons, Denmark is a central hub for access to the truly fascinating North Atlantic region, with direct flights to and from several cities on [[Iceland]], [[Faroe Islands]] and [[Greenland]]. [[Hirtshals]] in Northwestern [[Jutland]] has weekly ferry services to [[Torshavn]] on the [[Faroe Islands]] and [[Seyðisfjörður]] on [[Iceland]]. [[Longyearbyen]] on [[Svalbard]] can be reached from several cities, once or twice weekly with a single stopover in [[Oslo]].\n\n[[ca:Dinamarca]]\n[[de:Dänemark]]\n[[eo:Danio]]\n[[es:Dinamarca]]\n[[fi:Tanska]]\n[[fr:Danemark]]\n[[hu:Dánia]]\n[[it:Danimarca]]\n[[ja:デンマーク]]\n[[nl:Denemarken]]\n[[pt:Dinamarca]]\n[[ro:Danemarca]]\n[[ru:Дания]]\n[[sv:Danmark]]\n[[zh:丹麦]]\n[[wts:Category:Denmark]]\n\n[[WikiPedia:Denmark]]\n[[Dmoz:Europe/Denmark/]]\n[[World66:europe/denmark]]\n\n{{isPartOf|Scandinavia}}\n{{outline}}\n{{countryguide}}"
        }
    }
}