{
    "parse": {
        "title": "Dominican Republic",
        "pageid": 343,
        "wikitext": {
            "*": "{{pagebanner|Dominican Republic Banner.jpg}}\n\n{{quickbar\n| location=LocationDominicanRepublic.png\n| flag=Flag of the Dominican Republic.svg\n| Website=http://www.dominicanfun.net\n| capital=[[Santo Domingo]]\n| government=Representative democracy\n| currency=Dominican peso (DOP)\n| area=48,730km²<br />''land: 48,380km²<br />water: 350km²''\n| population=9,904,000 (2008 estimate)\n| language=[[Spanish]]\n| religion=Roman Catholic 95%\n| electricity=110/60Hz (USA plug)\n| callingcode=+1 809, +1 829, +1 849\n| tld=.do\n| timezone=UTC/GMT -4 hours\n| emergencies=dial '''911'''\n}}\n\n''Not to be confused with the [[Caribbean|Caribbean island]] Commonwealth country of [[Dominica]].''\n\nThe Dominican Republic is a [[Caribbean]] country that occupies the eastern two-thirds of the [[Caribbean|Caribbean island]] of [[Hispaniola]].  The western one-third of Hispaniola is occupied by the country of [[Haiti]]. To the north lies the North Atlantic Ocean, while the Caribbean Sea lies to the south.\n\n==Understand==\nAs part of the Caribbean the Dominican Republic has the North Atlantic Ocean lying to its north and the Caribbean Sea to its south. It's situated on the island of Hispaniola and occupies the eastern two-thirds of the island while Haiti occupies the western third. \n\nAfter attaining independence in 1844 the Dominican Republic endured many years of a largely non-representative rule until Joaquin Balaguer became president in 1966 holding office until 1996. Today regular elections are held and the Dominican Republic now has an impressive and fast growing economy with tourism playing a major role.\n\nFor the adventure tourist this Caribbean country offers a diverse countryside comprising tropical rainforests, arid desert expanses, alpine ranges and steamy mangrove swamps. It's a playground for trekkers, mountain bike enthusiasts and water-sport junkies. \n\nThe northern and eastern coasts are dotted with many luxurious resorts however the Dominican Republic has much more to offer than this. There is the wonderful Caribbean music and dance, exotic foods and drink, popular local baseball games, and the remarkable colonial architecture found in the capital Santo Domingo’s Zona Colonial. There are also sugar plantations, small quaint villages and wonderful mountain retreats to explore and enjoy in Jarabacoa and Constanza. If you're looking for a hassle free holiday that's big on relaxation then the Dominican Republic is the place to be!\n\n===History=== \nExplored and claimed by Columbus on his first voyage on December 5th, 1492, the island of Quisqueya, named by Columbus as La Hispaniola, became a springboard for Spanish conquest of the Caribbean and the American mainland.  \n\nThe island was first inhabited by the Taínos, an Arawakan-speaking people who had arrived around 10,000 BC. Within a few short years following the arrival of European explorers, the population of Tainos had significantly been reduced by the Spanish conquerors.  Based on Fray Bartolomé de las Casas (''Tratado de las Indias'') between 1492 and 1498 the Spanish conquerors killed around 100,000 Taínos. Today little remains of their culture aside from artifacts.\n\nThe first European settlement founded on the America continent was on La Isabela, Puerto Plata (19º53'15.08\" N 71º04'48.41\" W) founded in 1493 using a XV century style. The City of Santo Domingo was founded by Bartolomé Colón, on 5 Aug, 1496 and later that was moved by Frey Nicolás de Ovando to the west side of Ozama river in 1502.\n\nIn 1606, the King of Spain ordered the depopulation of the west part of the island due to high rates of piracy and smuggling. That measure was the cause of French invasion and, after that, the rise of the Republic of Haiti. \n\nIn 1697, Spain recognized French dominion over the western third of the island, which in 1804 became [[Haiti]]. The remainder of the island, by then known as Santo Domingo, sought to gain its own independence in 1821, but was conquered and ruled by the Haitians for 22 years; it finally attained independence as the Dominican Republic in 1844. \n\nA legacy of unsettled, mostly non-representative rule for much of its subsequent history was brought to an end in 1966 when Joaquin Balaguer became president. He maintained a tight grip on power for most of the next 30 years when international reaction to flawed elections forced him to curtail his term in 1996. Since then, regular competitive elections have been held in which opposition candidates have won the presidency. The Dominican economy has had one of the fastest growth rates in the hemisphere.\n\n===Climate===\nTropical maritime with little seasonal temperature variation. There is a seasonal variation in rainfall. The island lies in the middle of the hurricane belt and is subject to severe storms from June to October.  It experiences occasional flooding and periodic droughts.\n\n===Landscape===\nRugged highlands and mountains with fertile valleys interspersed. \n\n===National parks===\n*Los Haitises National Park\n*Jaragua National Park \n*Armando Bermudez National Park\n*Parque Nacional del Este\n*Jose Del Carmen Ramirez National Park\n*National Park Isla Cabritos\n*Sierra del Bahoruco National Park\n*Monte Cristi National Park\n*Parque Historico La romana\n\n==Regions==\n{{Regionlist\n| regionmap=Dominican Republic Regions Map.png\n| regionmaptext=\n| regionmapsize=upright=2\n\n| region1name=[[Greater Santo Domingo|The Metropolitan Area]]\n| region1color=#b383b3\n| region1items=\n| region1description=The cosmopolitan capital and its surrounding beaches.\n\n| region2name=[[Eastern Dominican Republic|The Eastern Plains and the East Coast]]\n| region2color=#d5dc76\n| region2items=\n| region2description=Home to the world-famous all-inclusive hotels of Bavaro and Punta Cana, and the major resorts of Casa de Campo and Cap Cana.\n\n| region3name=[[Eastern Cibao|The Eastern Cibao and the Bay of Samaná]]\n| region3color=#4da9c4\n| region3items=\n| region3description=A beautiful bay often described as a \"Paradise on Earth\"\n\n| region4name=[[Western Cibao|The Western Cibao and the North Coast]]\n| region4color=#71b37b\n| region4items=\n| region4description=The second largest city, the highest mountains in the Caribbean, and the popular beaches of the Atlantic Coast.\n\n| region5name=[[Southern Dominican Republic|The Enriquillo Valley and the South]]\n| region5color=#d09440\n| region5items=\n| region5description=The most secluded area of the country, almost untouched by tourism, with a unique scenery and wildlife.\n}}\n\n==Cities==\n[[File:Dominicana-Punta Cana.jpg|thumb|upright=1.3|beach in Punta Cana]]\n*[[Santo Domingo]] - Capital.\n*[[Punta Cana]]\n*[[Higüey]]\n*[[San Pedro de Macoris]]\n*[[Juan Dolio]]\n*[[Puerto Plata]]\n*[[La Vega]]\n*[[Paraiso]]\n*[[Santa Barbara De Samana]]\n*[[Santiago de los Caballeros]]\n*[[Sosua]]\n*[[Rio San Juan]]\n*[[La Romana]]\n\n==Other destinations==\n*[[Bayahibe]]\n*[[Bonao]]-- secluded village\n*[[Cabarete]]\n*[[Dominicus]]\n*[[Jarabacoa]]\n*[[Las Terrenas]]\n*[[Constanza]]\n*[[Las Galeras]]\n*[[Miches]]\n*[[Bahia de las Aguilas]]\n*[[Playa Bonita]]\n*[http://ntripping.com/best-secluded-beaches-dominican-republic/ Best secluded Dominican Republic beaches]\n\n==Get in==\n{{VisaRestriction|Entry will be refused to citizens of [[Guinea]], [[Liberia]], [[Nigeria]], [[Senegal]] and [[Sierra Leone]], as well as anyone who recently visited those countries due to the current ebola virus outbreak.}}\nNationals of all [[European Union]] states, plus [[Albania]], [[Andorra]], [[Antigua and Barbuda]], [[Argentina]], [[Australia]], the [[Bahamas]], [[Bahrain]], [[Barbados]], [[Belize]], [[Bolivia]], [[Bosnia and Herzegovina]], [[Botswana]], [[Brazil]], [[Brunei]], [[Canada]], [[Chile]], [[Colombia]], [[Costa Rica]], [[Dominica]], [[Ecuador]], [[El Salvador]], [[Fiji]], [[Grenada]], [[Guatemala]], [[Guyana]], [[Honduras]], [[Hong Kong]], [[Iceland]], [[Israel]], [[Jamaica]], [[Japan]], [[Kazakhstan]], [[Kiribati]], [[Kuwait]], [[Liechtenstein]], [[Macau]], [[Macedonia]], [[Malaysia]], the [[Marshall Islands]], [[Mauritius]], [[Mexico]], [[Federated States of Micronesia|Micronesia]], [[Monaco]], [[Namibia]], [[Nauru]], [[New Zealand]], [[Nicaragua]], [[Norway]], [[Panama]], [[Papua New Guinea]], [[Paraguay]], [[Peru]], [[Qatar]], [[Russia]], [[Saint Kitts and Nevis]], [[Saint Lucia]], [[Saint Vincent and the Grenadines]], [[San Marino]], [[Serbia]], [[Seychelles]], [[Singapore]], the [[Solomon Islands]], [[South Africa]], [[South Korea]], [[Suriname]], [[Switzerland]], [[Taiwan]], [[Thailand]], [[Tonga]], [[Trinidad and Tobago]], [[Turkey]], [[Tuvalu]], [[Ukraine]], [[United Arab Emirates]], [[United States]], [[Uruguay]], [[Vanuatu]], [[Rome/Vatican|Vatican City]] and [[Venezuela]], in addition to those holding British Overseas Territories passports, may enter the Dominican Republic visa-free.\n\nVisa exemption also applies to residents and valid visa holders of, as well as refugees and stateless persons with travel documents issued by, Canada, the United States and any country in the European Union.\n\nAs of the 1st of January 2018, visitors to the Dominican Republic are no longer obliged to purchase a tourist card, as this fee is now incorporated into their airfare.\n\nSee [http://www.godominicanrepublic.com/rd/index.php?option=com_content&view=article&id=57&Itemid=78&lang=en Entry Requirements] for the latest details.\n\n===By plane===\nThe main airports (in alphabetical order) are:\n\n*(AZS) Samana, also known as \"El Catey\", located between the towns of Nagua and Samana on the north coast.\n*(EPS) Samana, also known as \"Aeropuerto Internacional Arroyo Barril\" between Sanchez and Samaná\n*(JBQ) \"La Isabela\" airport in [[Santo Domingo]], mainly for domestic flights but also receives some flights from other Caribbean islands\n*(LRM) La Romana on the southeast coast\n*(POP) Puerto Plata, also known as \"Gregorio Luperon\" on the north coast\n*(PUJ) [http://www.puntacanainternationalairport.com/ Punta Cana International Airport] in the east, the busiest in the country\n*(SDQ) Santo Domingo, also known as \"Las Americas\" on the south coast close to the capital city [[Santo Domingo]]\n*(STI) Santiago also known as \"Cibao International\" in [[Santiago de los Caballeros]] (the country's 2nd largest city).\n*(COZ) Constanza, a domestic airport to all Dominican destinations.\n*(BRX) Barahona, also known as \"Aeropuerto Internacional María Montez\" this airport was reopened during the earthquake in Haiti, in order to bring the primary aid to the Haitians.\n*(CBJ) Cabo Rojo, Pedernales, only for domestic use, located near Cabo Rojo port facility.\n\nYou can get flights from Europe at least via Madrid (MAD), Paris (CDG) and Munich (MUC). From the US, you can fly from [[Houston]], [[New York City|New York]], [[Ft. Lauderdale]], [[Miami]], [[Philadelphia]], [[San Juan]], [[Atlanta]] or [[Charlotte]]. Most European and Canadian cities have charter flight connections, which operate seasonally.\n\nA departure tax of USD20 cash is payable on most charter and some scheduled flights. If you are flying on a US carrier, the departure tax is always included in the taxes when you purchased your ticket, so you will not have to pay anything when leaving.\n\nTaxi fares to nearby hotels are posted just outside the airports. From the airport to Santo Domingo (Ciudad Colonial) it's about USD40.  There are no hotel \"courtesy shuttles\" at airports in the Dominican Republic.\n\nAt the airport, you can change your US dollars and euros in Dominican Pesos. Note that you may not be able to exchange back local money to  US dollars and euros, so do it before leaving.\n\n===By car===\nAlthough the Island is large, the only land border that the Dominican Republic shares is Haiti. Only 4 borders crossings exist, including one between Dajabón and Ouanaminthe, another west near Elías Piña, another one near Jimaní, and another one between Pedernales and Anse-à-Pitres. Some of those crossings can be open 08:00-18:00.\n\n===By boat===\nThere is a ferry that travels between Mayagüez in [[Puerto Rico]] and [[San Juan]] in the Dominican Republic. The website says the journey takes 12 hours, leaves Puerto Rico on Mondays, Wednesdays and Fridays at 20:00, and arrives in the Dominican Republic at 08:00 the next morning. For prices and bookings, visit the [http://www.ferriesdelcaribe.com/ Ferries Del Caribe page].\n\n===By bus ===\nThere are regular bus connections from and to Haiti. You can either take an international operation bus with Caribe Tours from Port-au-Prince to Santo Domingo or from Cap-Haitien to Santiago or Santo Domingo. You can also cross the border into the Dominican Republic via public transport, which is cheaper. If you’re coming from Cap-Haitien simply take a tap-tap to Ouanaminthe, walk or take a mototaxi to the border and walk across the border into the DR. Be aware that you have to pay a 10$ exit fee for leaving Haiti and 10$ fee for buying a tourist card when entering the DR.\n\n==Get around==\nOptions for getting around the country include bus service, 'gua-guas' (pronounced \"Gwa-Gwas\": small battered vans or trucks that serve as a collective taxi running fixed routes that are very cheap but can also be very overloaded), domestic air flights and charter air service. There is no rail system in the country.  Most towns and cities have regularly scheduled bus service, if not by one of the big bus companies, then by gua-gua [http://horariodebuses.com/do]. The bus lines are most often simple, independently run operations, usually only connecting two cities within a region (Southwest, East, North) or between one city and the capital (with stops made for any towns on the route). Because of the geography of the country, to get from one region of the country to another you have to go through the capital. \n\n===Guaguas (local buses)===\nGuaguas are the traditional means of transport in the Dominican Republic. Guaguas will be filled to the brink with people and luggage;  expect to squeeze to fit more people who will be picked up en route.  If you prefer authentic experience over comfort, travelling by guagua is the right choice (see [http://horariodebuses.com]).\n\nGuagua comfort can range from air conditioned with leather seats to a bit worn down with open window air breeze cooling.  Traveling with guaguas is safe, and tourists are treated friendly and get helped out.\n\nYou can also hop on mid way if you know where to stand on the route and gesture the driver; tell the conductor your destination and he'll tell you where to get off and how to switch guaguas; sometimes you'll have to ride across town to another bus station.\n\nPrices are modest, around 100-150 pesos for a 1-2 hour ride.  Since most guaguas are minibusses, you might have to stow your luggage on a seat; in this case you might have to pay a fee for the occupied seat.  Larger routes get serviced by normal sized buses with a separate storage compartment.\n\nBe aware that guaguas stop operating at dusk.  Plan your trip with enough slack that you will be able to catch your last guagua when the sun is still up.\n\nThe guagua network is organic and does not require you to go through the capital;  you might have to change several times though, as guaguas usually only connect two major cities.\n\n===Long-haul buses===\nCaribe Tours [http://www.caribetours.com.do/], based out of the capital, is the biggest bus company, and has coverage in most regions that are not well-served by the other 'official' bus companies. Unlike taxis and gua-guas, Caribe Tour rates are fixed by destination and are extremely reasonable due to government subsidies.  Expect to pay under 250 pesos (Dom) or US$10 for even the longest trips. Caribe Tour buses typically run from 7AM to 4PM (with departures approx. every two hours) and cover most major cities.  On longer trips, expect a short (10 minute) stop for coffee and lunch.  Buses are fairly luxurious with movies playing for the entire trip and air conditioning (which can be extremely cold - bring a sweater). Another option is the slightly more expensive Metrobus bus company [http://www.metroserviciosturisticos.com/]. Metrobus serves the northern and eastern part of the country. There are also much more bus companies, which are also safe and comfortable, but they don’t have an online presence, like for example AETRA. If you ask taxi drivers or locals they will usually bring you to caribe bus, because that’s what gringos usually take. Tell them that you don’t need caribe bus and that you would rather save a few pesos, then they will tell you about the other bus companies. \nThe 'unofficial' gua-gua system covers nearly every road on the island for some moderate savings (if you don't mind being packed in).\n\nIn short, bus services across the country are comfortable and a good value. The buses are clean, air conditioned (bring sweater), usually play a VHS movie, and are pretty inexpensive, costing no more than $300 pesos one way cross-country (less than $10).\n\n<gallery>\n[[File:Long Haul Bus Times from Santo Domingo.jpg|thumb|Long Haul Bus Times from Santo Domingo]]\n[[File:Long Haul Bus Times from \"Interior\".jpg|thumb|Long Haul Bus Times from \"Interior\"]]\n</gallery>\n\n===Taxis===\nTaxi services are available but potentially dangerous when dealing with unlicensed drivers. In all cases, it's a good idea to go with a licensed driver and negotiate a price for your destination before you leave.  Good drivers are often easy to identify by licenses worn around the neck, uniforms, and clean air conditioned vehicles.  When calling a taxi company, you will be given a number to verify your driver. When being picked up, make sure your driver gives you the right number as 'false pickups' are often a prelude to robbery.\n\n===By Car===\nCars may be rented through Hertz, Avis, Prestige Car Rentals, [http://www.transekur.com Transekur] or other agencies in Santo Domingo and other major cities. Gasoline, unlike most countries that were converted to an Metric System (like the Dominican Republic), is sold in US Gallons. However, it's expensive and often costing upward of US$4.51/gallon (as of September 2018).  Some roads, especially in remote areas, are fairly dangerous (often without lane divisions) and many people tend not to respect oncoming traffic. However, road conditions on most major highways are roughly similar to road conditions in the United States and western Europe. However, potholes and rough spots are not rapidly repaired and drivers must be aware that there are a significant number of rough spots even on some major highways. Don't assume a pothole wont bottom-out your vehicle. However, there are a number of very good roads such as DR-1 which is a four lane highway connecting the cities of Santo Domingo and Santiago and can be traveled with no trouble. Highway DR-7 is an excellent toll road opened in late 2008. It goes from just east of Santo Domingo north to near Sanchez. From there, you can go east to the Samana peninsula or west along the northern coast of the DR and costs about US $11. \n\nProbably the biggest challenge that an international visitor to the Dominican Republic will face if he or she chooses to rent a car is not so much dealing with automobile traffic, but rather avoiding accidentally running over pedestrians who cross poorly-lit streets and highways in the evening and night time hours. Lack of head/taillights on cars and especially motorcycles is also not unusual and with motorcycles this makes them extremely hard to spot. The best recommendation is not to drive after dusk.  Outside of Santo Domingo, the motorbike (motoconcho) is an extremely common form of travel. If lost, you can hail a motorbike driver (motochonchista) and ask for directions. You will be taken to your destination by following the bike. A tip is appropriate for such help. Remember that many of these motorbike drivers look upon road rules as only recommendations. However, driving in the Dominican Republic should not be particularly difficult for experienced drivers from North America or Europe, though local drivers in the Dominican Republic are often reckless and undisciplined and accidents, even fatal ones, are relatively common, especially with big cities with few traffic lights, often either malfunctioning, non-functional or simply dissregarded.\n\nBe aware of the police bribery-scam. If pulled over by the policia nacional (khaki uniforms) and the violations seem flimsy or confusing it's likely because you're a mark for a quick bribe. It is unlikely they will write you a real ticket, or take you to the police station though they may threaten to do that if you refuse to pay the on-the-spot fee. Paying the bribe will end the fiasco but may contribute to a bad practice and cost substantial money. You will likely find you can negotiate. See the discussion page for an account of this type of encounter including the details and final outcome.\n\n==Talk== \nThe official language of the Dominican Republic is '''[[Spanish phrasebook|Spanish]]'''. You will find some Spanish-English bilingual locals, especially in Santo Domingo and tourist areas. Many Dominicans have spent considerable time in the United States, especially New York City, and enjoy speaking English with foreigners in order to keep their language skills sharp. If you speak some Spanish, most Dominicans will try hard to meet you half way and communicate. If you have a problem, you can probably find someone who speaks sufficient English (or probably French and possibly German or Italian in tourist areas) to help you out. Dominicans are quite friendly and will be quite helpful if you are polite and respectful. The large community of Haitians living in the DR speak Haitian Creole and in some cases French, and most speak Spanish well. In rural areas, you may hear a few African and Arawakan words interspersed with the Spanish, but standard Spanish is universally understood. Communication should not be a problem even for those who speak only a minimum of Spanish. If you are traveling to one of the large all-inclusive hotels, you will have no language problems.\n\n==See==\n\n==Do==\n*<do name=\"Kayak Limon\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"1000 pesos\" lat=\"\" long=\"\">Kayak Ecotourism Project</do>\n*<do name=\"Carnival\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">Every weekend in February a lot of Dominican cities are going to celebrate carnival. You’ll have street parades and huge parties on the streets, with a lot of food stalls and alcohol selling stalls. The biggest celebrations are held in Santo Domingo, Santiago, la Vega. Smaller cities are celebrating carnival as well. Don’t go to carnival celebrations in punta cana, as they’re only organized for tourists. Rather go to local celebrations in Santiago or Santo Domingo.</do>\n\n\n==Buy==\nThe Dominican currency is the Dominican peso ('''DOP'''). In Oct 2018, USD1 bought DOP 49.25. In February 2018 1 € bought 60,56 DOP.\n\n===Shopping===\nOne of the best spots in the Colonial District of Santo Domingo to shop is the several blocks long outdoor mall, El Conde Street. It offers everything from street vendors (it is not recommended to eat off these) to knock-off name brand clothing for extremely inexpensive prices. There are some very pleasant outdoor restaurants that serve as perfect spots to people watch and drink Presidente (their most popular beer).\n\nDuring the day, there are also several touristy shops where you can buy cheap presents for the family back home including authentic paintings and beautiful jewellery. There is also a very nice cigar shop at the end of the mall across from the cathedral. Clothes, however, are generally very economical and often of good quality. Most prices can be negotiated. US dollars are accepted in most areas.\n\nYou can also buy things at local shops, all the major cities have streets packed with different shops, shopping malls or huge shops where you can buy all kind of things for a few pesos.\n\n===Internet===\nDon't forget about the internet. There are various solutions available on the market. The best are eSim based connectivity hubs, such as Nommi. It provides internet in over150 countries at a nearly local price and gives free access to over 4 million Wi-Fi networks around the world which are available via Nommi App as a Wi-Fi map. Additionally, the device functions as a power bank, able to charge a smartphone a few times. Nommi also has a built-in VPN that works in China.\n\n== Eat ==\n\n<!-- This section should provide general information about food. List specific businesses in the city articles. -->\n\nFood in the Dominican Republic is typical Caribbean fare, with lots of tropical fruits, rice, beans, and seafood.  Most tourist restaurant meals will cost an additional 18% tax plus 10% service: for very good service, it is customary to leave an additional 10%. Other options include local Comedors or Cafeterias. These are small local restaurants that will serve you huge portions of food for 100 DOP - 250 DOP. Sometimes you also get a drink. Street food is also everywhere in the DR (except for the tourist areas). You’ll get empanadas, yucca empanadas, sausages, yucca balls, hamburgers and lots of other fried things for 20-40 pesos. Fruit vendors are also very present. They don't just sell whole fruits, they also cut and prepare them, so that you can eat them right away.\n\n==Drink==\n\n*Beer: '''Presidente''', '''Brahma''', '''Bohemia'''\n*Rum: '''Brugal''', '''Barcelo''', '''Bermudez''', '''Macorix''', '''Siboney''', '''Punta Cana'''. \n*Mama Juana: a mixture of bark and herbs left to soak in rum, red wine and honey.\n\nAdditionally, other imported drinks are available for purchase--at least in the towns and cities--they might not be as readily available out in the countryside.\n\n'''Do not drink tap water!''' Locals, even in the most rural areas, will either boil their water or purchase bottled water. Eating salads or other food that may be washed in tap water is not advisable. Ice is a bad idea as well, except in luxury hotels and restaurants (which produce ice from bottled water). If you plan on cooking or washing dishes for longer stays, it is a good idea to rinse everything with bottled or boiled water before use. In every community, there will be one or more colmados (the same as what are called bodegas in Puerto Rico) where you can buy small amounts of everything. Water is sold in bottles at 15 pesos and up; it is also sold in plastic bags (fundas) at 2 for 5 pesos. But the best way (by ecologic and economic means) to buy drinkable water in Dominican Republic is to buy whole ''botellon'' - which is BIG, refilable bottle of water. It costs 50 pesos for refil of 17 litres (5 galons), and the cannister (''botellon)'' itself costs around 200 pesos. But if you stay somewhere you for few days, you may ask the guys that you will buy it just for few days and they will give you back the money for the cannister.\n\n==Sleep==\n<!-- This section should provide general information about lodgings. List specific businesses in the city articles. -->\nAccommodations in the Dominican Republic are plentiful, with options ranging from huge, all-inclusive beach resorts to more personal options scattered along the coasts and in the cities. Hotels charge a 25% room tax, so inquire beforehand to determine if that tax is included (often the case) in the listed room price.\nThere is plenty of cheap hotels in the Dominican Republic - usually in every city and town there are hotels under 10 $/ night for double room.\n\n==Learn==\n\n<!-- This section should provide general information about learning opportunities. List specific businesses in the city articles. -->\n\nMany US universities offer study abroad options for the Dominican Republic. The two most common cities hosting exchange students are Santo Domingo and Santiago. Check with local universities for programs and prices. Spanish language schools are located in major cities and on the north coast as well.\n\n==Work==\n\nMost companies do not require anything more than a passport to work. There are a lot of US companies in the country, especially in Santo Domingo and DN (the National District). There are good opportunities for English speaking employees. The country has several free zones, lots of them in the call center area.\n\n===Volunteering===\n\nThere are several volunteer opportunities in the Dominican Republic. Many worldwide organizations offer extended travel for anyone willing to volunteer their time to work with locals on projects such as community development, conservation, wildlife sanctuary maintenance & development, scientific research, and education programs.\n\n* Orphanage Outreach [http://www.orphanage-outreach.org]\n* Dominican Foundation [http://www.dominicanfoundation.com]\n* International Student Volunteers Dominican Republic [http://www.isvonline.com/dominicanrepublic.html]\n* The DREAM Project [http://www.dominicandream.org/volunteering]\n* Peace Corps Dominican Republic [http://dominican.peacecorps.gov]\n* IDDI [http://www.iddi.org]\n* Volunteer World [https://www.volunteerworld.com/volunteer-in-dominican-republic]\n\n==Stay safe== \n{{warningbox| Much tension exists regarding migration from the neighboring country of Haiti. Demonstrations are happening in certain areas of the country, which can turn violent. It's best not to get involved, and avoid talking about Haiti.}}\n\nThe emergency number in the Dominican Republic is '''911''' and can be used for all emergency services. It's reliability, however, is ''very'' questionable, and no English-speaking operators exist. The system currently covers at least 50% of the country's population and works in most major cities, including Puerto Plata, Punta Cana, Santiago, and Santo Domingo. The service will work on all phones regardless of whether or not the device has service. Services provided through 911 are free and do not occur any charge. In areas where the 911 system has not been implemented, assistance will be made to transfer your call to local emergency services. It is important to know where you are and to provide an address to the operator, as E911 does not exist in the Dominican Republic. Misuse of the system will resort in heavy fines and even arrests, which are taken seriously in the Dominican Republic.\n\nThe Dominican Republic is generally a safe country (though this is not always the case). Although the major cities of Santo Domingo and Santiago have experienced the growth of a thriving middle class, construction booms and reached a high level of cosmopolitanism, the Dominican Republic remains a third world country and poverty is still rampant so you need to take common-sense precautions:\n\n*Try to avoid being alone in cities as muggings are very common.\n\n*Very few streets are lit after dark, even in the capital of Santo Domingo. Those that are lit are subject to routine power outages.\n\n*Wild dogs are common throughout the country but largely ignore people (feeding these dogs is not recommended as this may induce aggressive behavior).\n\n*Western travelers should dress casually and remove rings and other jewelry when away from tourist destinations, but common tourist destinations, particularly the more expensive and the luxury hotels and areas, are very safe.\n\n*Sex tourism is prevalent in the Puerto Plata province of the country, so you may be hassled by young men or women trying to offer you 'services'. A firm 'No' is good enough. The age of consent is 18, and tourists who have sex with minors may also be prosecuted by their home country.\n\n*There are no laws dictating the maximum amount of alcohol that can be drunk prior to driving. However, there is a 0.05% limit for professional drivers. Be wary of vehicles, especially during the late evening, as there is a much higher possibility at that time that the driver is intoxicated. It is illegal for tourists and visitors to drink and drive and you may be penalized for doing so. However, it is rarely enforced.\n\n*The level of professionalism of the National Police is somewhat debatable. To protect income from tourism, the government has established the Politur or [http://www.politur.gov.do/ \"tourist police\"] for the safety of foreign tourists. Travellers should contact this agency if any problems are encountered as they will have a much more positive response than with the national police.\n\n*Avoid the following neighborhoods in Santo Domingo: Capotillo, 24 de Abril, Gualey, Guachupita, Ensanche Luperón, Domingo Savio, María Auxiliadora, Villa Consuelo, Los Alcarrizos (and all of their subneighborhoods), La Puya, El Manguito, La Yuca, Santa Bárbara, Los Tres Brazos. These are some of the poorest parts of the city, and while Dominicans are very friendly, it is best to avoid these areas, as tourist may be associated with money. In Santo Domingo, the Zona Metropolitana (Piantini, Naco, Evaristo Morales, etc.) and Zona Colonial (excluding Santa Bárbara) are safer areas.\n\n* Probably the most important tip on safety in the Dominican Republic is: DON'T FLASH what you have, as this makes you a potential target for theft.\n\n==Stay healthy==\n'''Malaria''' can be a '''rare''' issue around rainforests if travelers don't take protective measures such as repellents against mosquito bites. No cases have been reported over the past 8 years within the tourist areas. Be sure to consult with a physician before departure. [http://wwwnc.cdc.gov/travel/destinations/traveler/none/dominican-republic  '''The US \"Centers for Disease Control and Prevention\" (CDC) also have recommendations for vaccines and other tips for staying healthy when travelling in the Dominican Republic.'''] \n\nThere is a risk of [[dengue fever]] which is contracted through mosquitoes that bite during the day and during some seasons of the year. No vaccine is available, so again '''using mosquito repellent is advisable'''.\n\nMany of the local foods are safe to eat including the meats, fruits, and vegetables.\n\nAvoid drinking local tap water and only drink bottled water or other beverages. It is important for visitors to stay hydrated in the hot, humid climate.\n\nSunburn and sun poisoning are a great risk. The sun is very bright here. Use at least SPF30 sunblock. '''Limit sun exposure'''.\n\nThe country's adult HIV/AIDS prevalence is reaching '''2.0%''' or '''1 in 50''' adults, which is almost 3 times higher than the USA. If you engage in a sexual relationship, always use protection.\n\n==Respect==\nDominicans are kind and peaceful people. Attempts at speaking Spanish are a good sign of respect for the local people. Be polite, show respect, and do your best to speak the language, and you will be treated with kindness.\n\n'''Avoid talking about Haiti.''' Although relations have improved, many Dominicans, particularly of the older generations, harbor resentment towards Haitians. Santo Domingo was invaded and occupied by Haiti for a good part of the 19th century, and the Dominican Republic actually fought its first war of independence against Haiti, not Spain, after which the Dominican Republic faced several other invasions from its neighbor.\n\nIn the 20th century, Trujillo's dictatorship massacred tens of thousands of Haitians in the 1930's, which fueled into the resentment between both nations. Nowadays, about a million Haitians live in the Dominican Republic, most of them illegally. Some Dominicans' opinions towards illegal immigrants from Haiti are similar to some Americans' attitudes towards Mexican illegal immigrants, with the major difference that, unlike the US, the Dominican Republic is a small and poor country by world standards. Gang wars can erupt along the border, so stay cautious and be sensitive. \n\nStill, the issues remain very complex and Dominicans often find their position to be misunderstood by foreigners. For example, Dominican Republic was the first country to come to Haiti's aid in the 2010 Haitian earthquake and has made impressive efforts to help its neighbor during this crisis. This shows that despite their historical, linguistic, religious, cultural and racial differences, Haitians and Dominicans still consider each other to be brotherly, yet proudly independent, nations.\n\nWhen staying at the luxury resorts or really any place in the Dominican Republic, it is advisable to tip for most services. The Dominican Republic is still a fairly poor country and tipping the people who serve you helps them be treated well.\nAs for the tips: nobody demands them from you, but of course it is nice to do so. Especially if you stay in all inclusive hotels or eat some fancy dinners for 20 usd/ person.\n\n==Contact== \n\n===By Phone===\nThe Dominican Republic is part of the North American Numbering Plan Area (NANPA) and shares the Country Code of +1 with all the NANPA territories. Area codes used are '''809''', '''829''', and '''849'''. Local phone numbers are basically the same format as in the United States and Canada with a 3 digit area code and 7 digit subscriber number.\n\nIf you're planning to use a GSM cell phone here, Viva, Claro, and Altice are the only companies that have GSM plans and SIM cards and operate LTE Networks. Claro and Altice cover most of the country while Viva is limited to large cities in the country.\n\n{{outline}}\n\n{{isPartOf|Hispaniola}}\n\n{{Countryguide}}\n\n[[Category: Countries]]\n[[Category: Dominican Republic]]\n\n[[de:Dominikanische Republik]]\n[[eo:Domingo]]\n[[es:República Dominicana]]\n[[fi:Dominikaaninen tasavalta]]\n[[fr:République dominicaine]]\n[[hu:Dominikai Köztársaság]]\n[[it:Repubblica Dominicana]]\n[[ja:ドミニカ共和国]]\n[[nl:Dominicaanse Republiek]]\n[[pl:Dominikana]]\n[[pt:República Dominicana]]\n[[ru:Доминиканская Республика]]\n[[sv:Dominikanska republiken]]\n[[wts:Category:Dominican Republic]]\n\n\n[[WikiPedia:Dominican Republic]]\n[[Dmoz:Caribbean/Dominican Republic/]]\n[[World66:centralamericathecaribbean/thecaribbean/dominicanrepublic]]"
        }
    }
}