{
    "parse": {
        "title": "Ecuador",
        "pageid": 346,
        "wikitext": {
            "*": "{{pagebanner|Ecuador Banner.jpg}}\n\n{{quickbar\n| image=Tungurahu viewed from Riobamba.jpg\n| caption=Tungurahu, Riobamba\n| location=Ecuador in its region.svg\n| flag=Flag of Ecuador.svg\n| capital=[[Quito]]\n| government=Republic\n| currency=US dollar ($, USD)<br>Ecuadorian Centavo coins(Alongsinde U.S. coins)\n| area=283,561km²<br />''water: 6,720km²<br />land: 276,841km²\"\n| population=14,573,101 (July 2009 estimate)\n| language=[[Spanish]] (official), Amerindian languages (especially Quechua)\n| religion=Roman Catholic 95%\n| electricity=110-220V/60Hz (USA & European plugs)\n| callingcode=+593\n| tld=.ec\n| timezone=UTC-5\n}}\n'''Ecuador''' is a country in Northwestern [[South America]], with a Pacific Ocean coastline, lying on the Equator between [[Colombia]], to the northeast, and [[Peru]], to the south and east.\n\n\n\nCotopaxi is the world's highest active volcano. Many cities and sites in Ecuador are listed as UNESCO World Heritage Sites.\nSuch cities and best known places are the [[Galapagos Islands]], and the city of [[Cuenca (Ecuador)|Cuenca]].\n\n==Understand==\nEcuador is one of the most biodiverse countries in the world. Ecuador has over one hundred different types of hummingbirds and thousands of orchid varieties. [[Cuyabeno Wild Life Reserve]], [[Mindo]] and [[San Luis de Pambil]] are all good places to see many types of flora and fauna. The [https://gulliver.com.ec/ Galapagos Islands] are justly famed for their wildlife.\n\nThe [[Cuyabeno Wild Life Reserve]] is probably the best place to see the '''Amazon Rainforest''' in Ecuador, even though there are other national parks which are also interesting (such as the Yasuni National Park). It's a place of high biodiversity and nature lovers should feel in paradise. That's a good way to discover the indigenous communities of Ecuador and to eventually meet a local shaman. It's necessary to get to Lago Agrio to reach the reserve. Private transportation is made possible by the local accommodation, which is provided by eco-lodges.\n\nThe beaches in Ecuador are amazing, including: Salinas, Bahia de Caraquez, Manta, Crucita, San Jacinto, and San Clemente. They offer very inexpensive hotel accommodations, great food and friendly people. But there are also very upmarket establishments as well. \n\n===History===\nThe \"Republic of the Ecuador\" was one of three countries that emerged from the collapse of Gran Colombia in 1830 (the others being Colombia and Venezuela). Between 1904 and 1942, Ecuador lost territories in a series of conflicts with its neighbors. A border war with Peru that flared in 1995 was resolved in 1999.\n\n===Climate===\nEcuador has many climate zones, from tropical along coast to cooler and dryer inland at higher elevations; tropical in Amazonian jungle lowlands. Ecuador is unusual in that one can choose any climate one wishes by where in the country one travels to. Lying on the equator means there is no summer or winter; however, there are typically wetter and drier seasons. The 'wetter' season is usually between December - June , while the drier season runs from July - November.\n\n===Crime===\n[https://www.osac.gov/Pages/ContentReportDetails.aspx?cid=23368 Ecuador 2018 Crime & Safety Report: Quito], by  U.S. Department of State Travel Advisory\n\n===Environment===\nThe Environment of Ecuador contains almost 20,000 species of plants, 1,500 species of birds, 341 species of mammals and more than 840 species of reptiles and amphibians.[1] It includes World Heritage Sites like the Galápagos Islands, and magnificent parks such as the Yasuni National Park. It is known for their very amazing places to visit popular places to visit are Ambato and Quito.\n\n===Tourist===\nEcuador’s official tourism organization is launching the second phase of its “All You Need Is Ecuador” campaign, in 2015 the first-ever foreign-sponsored Super Bowl ad was launched, at a cost of $3.8 million. The organization is committing $9 million of a $28 million global budget to an integrated marketing campaign in the U.S., including TV, print, online, and public events in New York, Massachusetts, Connecticut, Florida, and California which kicked off in 2015.\n\n===Electricity===\nThe power sockets in Ecuador are type A and type B. The voltage is 120V and the frequency is 60 Hz. Europeans must use an adapter to power their appliances.\n\n===Time Zone===\nContinent: UTC/GMT -5 hours.\nGalapagos: UTC/GMT -6 hours.\n\nThere is no Light Saving Time, Ecuador has the same Time (ECT) all year.\n\n==Regions==\n{{Regionlist\n| regionmap=Ecuador regions map.png\n| regionmaptext=\n| regionmapsize=upright=2.7\n\n| region1name=[[Amazon (Ecuador)|Amazon Rainforest]]\n| region1color=#78b080\n| region1items=\n| region1description=\n\n| region2name=[[Andean Highlands (Ecuador)|Andean Highlands]]\n| region2color=#78abb1\n| region2items=\n| region2description=\n\n| region3name=[[Coastal Lowlands (Ecuador)|Coastal Lowlands]]\n| region3color=#a9ca90\n| region3items=\n| region3description=\n\n| region4name=[[Galapagos Islands]]\n| region4color=#df8a78\n| region4items=\n| region4description=Isolated archipelago that is world-renowned for its unique wildlife and Darwin's evolution research.\n}}\n\n==Main Cities==\n\n==== In the Coast ====\n*[[Guayaquil]] - Largest city in the country and largest port city\n\n*[[Manta]] - Largest coastal city and fourth largest city in Ecuador.  Fastest growing city in Ecuador. Home to the second largest port in Ecuador.\n\n*[[Portoviejo]] - Is the capital of the province of Manabi. Know as the city of the \"Reales Tamarindos\".\n\n*[[Esmeraldas]] - It has the major seaport of northwestern Ecuador and a popular beach.\n\n*[[Quevedo]] - Is the biggest city and the economical capital of the province of Los Rios.\n\n*[[Babahoyo]] - Is the capital of the province of Los Ríos.\n\n*[[Machala]] - Is the capital of the province of El Oro. Know as the banana capital of the world.\n\n==== In the Highlands ====\n\n*[[Quito]] - Quito, the capital of Ecuador stands at an altitude of 2,850 m. The city has the best-preserved, least altered historic centre in Latin America.  \n\n*[[Ambato]] - The central city of Ecuador. Special celebrations during Carnival time. \n\n*[[Baños]]- The adventure capital of Ecuador at the foot of an active volcano having small eruptions of ash and lava. Volcano Tungurahua. There are also many hot spring mineral baths as its name would imply.\n\n*[[Cuenca (Ecuador)|Cuenca]] - The third largest city in Ecuador and listed as a UNESCO World Heritage Trust site.\n\n*[[Loja]] - The oldest colonial city.\n\n*[[Ibarra]] - The biggest city of the north of the country, capital of the province of Imbabura.\n\n*[[Riobamba]] - Starting point of the famous train ride down the '''Nariz del Diablo''' and gateway to Mount Chimborazo, Ecuador's highest peak.\n\n*[[Guaranda]] - Capital of the province of Bolivar, famous for its Carnival.\n\n*[[Otavalo]] - Small town only two hours north of the capital famous for its Saturday market of indigenous crafts and livestock.\n\n*[[Tulcan]] - Capital of the province of Carchi, is the biggest city located on the border with Colombia.\n\n==Other destinations==\n\n* [[Maquipucuna]] - cloud forest Reserve and the closest pristine rainforest to Quito.\n\n* [[Canoa]] - Small Beach Town, a great surf spot.\n\n* [[Guamote]] - A cosy and authentic Andean village, though easy accessible.\n\n* [[Zaruma]] - Beautiful colonial city located on a top of a hill, famous for the gold mines and for its tasty coffee.\n\n* [[Mindo]] - Excellent bird watching in a cloud forest setting.\n\n* [[Mirador San Jose]] - Largest ecological residential development on the coast of Ecuador.\n\n* [[Misahualli]] - Startpoint for jungle-trips\n\n* [[Montanita|Montañita]] - World Famous Surfing Beach with a vibrant nightlife\n\n* [[Puerto López]] - \"Poor Man's Galapagos\"\n\n* [[Puyo]] - Jungle town\n\n* [[La Isla Corazon]] – Island with the mangrove ecosystem, located in Manabi9, between Bahia de Caraquez y San Vicente, at the river delta Chone. Posibilities to discover the traditions and do some activities with the locals with the community eco-tourism guided tours. \n\n* [[Archipielago de Jambeli]] – Island in the region El Oro built by 5 diferent islands – Payana, Tembleque, San Gregorio, Pongal, Costa Rica. Beautiful surroundings and posibilities to discover the traditions and do some activities with the locals with the community eco-tourism guided tours. \n\n* [[Quilotoa Loop]]\n\n* [[Salinas (Ecuador) | Salinas]] - Beautiful beaches, and great little ocean-front restaurants\n\n* [[Tena]] - Jungle town\n\n* [[Vilcabamba]]\n\n* [[Intag]] - A river valley near Otavalo known for its coffee, cloud forest and hot springs \n\n* [[Puyango Petrified Forest]] - A fossil deposit of petrified wood located in the southern part of Ecuador. \n\n===National Parks===\n* [[Cotopaxi|Parque Nacional Cotopaxi]]\n* [[Pululahua Geobotanical Reserve]]\n* [[Cuyabeno Wild Life Reserve]]\n* [[Podocarpus National Park]]\n* [[El Cajas National Park]]\n* [[Machalilla National Park]]\n* [[Yasuni National Park]]\n* [[Llanganates National Park]]\n* [[Sangay National Park]]\n* [[Yacuri National Park]]\n* [[Cayambe-Coca National Park]]\n\n==Get in==\n\n===Entry requirements===\nCitizens of nearly '''any country''' can visit Ecuador for a stay of 90 days or less. The exceptions are the citizens of [[Afghanistan]], [[Bangladesh]], [[Cuba]], [[Eritrea]], [[Ethiopia]], [[Kenya]], [[Nepal]], [[Nigeria]], [[Pakistan]] and [[Somalia]], who are required to obtain a visa in advance.\n\n===By plane===\n[[Quito]]'s new airport is state of the art and has a modern on-site hotel. It is however, a long trek from Quito. The old airport in the City has been closed and is being transformed into a large park with lake.\n\nAnother port of entry is [[Guayaquil]], which has a modern airport that includes the typical amenities such as restaurants and duty-free shopping. The airport is located a few minutes north from downtown.\n\nQuito airport charges an international departure tax of $40.80. The tax is $26 from Guayaquil. This tax is already included in the cost of the flight.\n\nThe amazing [[Galapagos Islands]] are one of the Ecuadorian provinces and have two airports, one of which is on Baltra and the other is on San Cristobal. Avianca is the name of the airline which flies to Galapagos. All the flights are through the mainland Ecuador.\n\n===By train===\nThere are no international train services into Ecuador.   The national railroad from Quito to Guayaquil (Via Lactacunga and Riobamba) is being rebuilt, but in the meantime, several sections are running for tourists.   The most popular is the the Alausi to Nariz del Diablo section (this has resumed service in 2011 after a 4.6 million dollar renovation).\n\n===By car===\nDriving into Ecuador was a great experience, easy border crossing, from Ipiales Colombia to Tulcan Ecuador.  \nSOAT insurance for Ecuador is now required before entry, Only thing that costs is the insurance.\n\nAlthough it may for some be easier to enter the country by airplane or boat.\n\n===By bus===\n\n====To/from Colombia====\nThe major crossing between Ecuador and Colombia is at Rumichaca near [[Tulcan]] and [[Ipiales]].\nFrom [[Lago Agrio]] you can cross to [[Mocoa]], check the [[Mocoa]] page.\n\n====To/from Peru====\nThere are several places to cross the border with [[Peru]], though Huaquillas (near [[Machala]] gets the vast majority of the tourist crossings. [[Macara]] and La Balsa (near [[Zumba]]) are the other options (see the [[Peru]] get in section). \n\n===By boat===\nThere are a lot of cruises that arrive to some Ecuadorian ports at the Pacific Ocean, they start in Miami, Rio De Janeiro, Valparaiso, Lima or Panama and stops in [[Galapagos]], [[Manta]] and [[Guayaquil]]. Since Ecuador is situated at the coast and has some very large rivers, a boat ride is a lovely way to get around. Especially in the rainforest a boat ride can get you to places you usually wouldn't be able to go.\n\n==Get around==\nThe best way to discover the wonders of the four regions of Ecuador is through a Tour Operator.\n\n===By bus===\nIntercity buses travel to almost everywhere in Ecuador.   All the intercity bus routes and schedules are available online at [http://latinbus.com LatinBus.com] or [http://andestransit.com andestransit.com]. Many cities have a central bus terminal, known as the terminal terrestre, where it is possible to buy tickets from the various bus lines that serve the city. Long-distance buses typically cost from $1 to $2 per hour, depending on the distance and the type of service; groups may be able to negotiate discounts. Buses are frequent along major routes.\n\nReservations or advance purchases usually aren't needed except during peak periods such as holidays.  The bathroom on the bus, if any, is usually reserved for women.  However, it is permissible for men to request that the bus make a stop so that they might relieve themselves.  The bus rides themselves are often quite beautiful, through mountain views in the clouds.  These altitude changes cause many of the same ear pressure problems which are associated with an airplane ride.\n\nThe bus driver will stop along the way to board additional passengers. Many buses arrive at their destination with passengers standing in the aisle. There are a few first class buses, called \"Ejecutivo\", which cost a little more than the regular buses. They are generally more comfortable and safer.\n\nEcuador Hop is a new and refreshing hop on-hop off bus service that takes you to discover the real Ecuador. It now joins its sister companies, Peru Hop and Bolivia Hop, who have helped over 150,000 travellers discover South America. Find out more on how it works [https://www.ecuadorhop.com here].\n\n===By car===\nOver the last 5 years a massive investment has been made to re-build the road network. It has had amazing results. From some of the worst roads in the world, Ecuador's highways now rank with the best and their beauty is unsurpassed. Most international car rental agencies have a presence in all Ecuadorian cities and both international and national local airports. Driving though Ecuador is the only way to truly see it. \n\nHowever, Ecuadorians use a cavalier fashion of driving one finds in European countries. Buses and trucks frequently slow down highway traffic. For those who would like to avoid this, it is a simple matter to hire cars with drivers for reasonable prices everywhere, whether through your hotel or a tourist office. In cites, taxis are always plentiful and very cheap. \n\nBeware, people who have travelled to Ecuador prior to 2010 will not know any of these changes and will try to dissuade you.\n\n===By motorcycle===\nSome of the best motorcycling roads in South America are found in Ecuador.  A dual-sport motorcycle (for both paved and unpaved roads) is a great way to get places that you wouldn't want to take a car (especially a rental).  A ride through Ecuador will bring constantly changing temperatures and riding conditions.  You should be ready for hot sun, heavy rain, hail and even snow!  You'll want a riding jacket with a removable liner and be sure to dress in layers.  Add and remove the layers as you move up and down in altitude.  Be prepared with two pairs of gloves, one for hot weather and one for cold. A riding day can vary in temperature from 90 degrees to the low 30's as you cross the country and change altitude.\n\n===By taxi===\nTaxis are widely available. Taxis are generally yellow and have the taxi license number prominently displayed. Taxis in Quito have meters (fares under $1 are rounded up to the minimum fare of $1).  Agree upon a price before getting in or ask the driver to use the meter (often cheaper than a negotiated rate); short trips generally don't cost more than $1 or $2, and you generally shouldn't end up paying more than $10 per hour, if that, for longer trips. Evening rates are often double. As with any country in Latin America, (or the world for that matter), don't ride an unlicensed taxi. You can use Uber or Cabify in the big cities.\n\n===By plane===\nDomestic flights to major cities on the mainland costs from $50-100 one-way, and there are often round trip promotions for about the same price. You can find domestic flight schedules online at individual airlines' schedules on their sites.   Flights between the biggest cities are in jets, and some of the smaller cities are served by prop aircraft.   The domestic airlines in Ecuador are Avianca, LanEcuador and Tame, . Most of the airlines in Ecuador offer excellent service and relatively new planes.  You can buy domestic air tickets from agents or directly from the airlines - some sell tickets online and you can buy them at the airport or ticket offices for those who don't.\n\n===By hitchhiking===\nHitchhiking is possible in Ecuador. A lot of people drive pick-ups which you can easily throw your backpack into if they give you a lift. \n\nOn roads not frequently serviced by buses, cargo trucks may take on riders or hitchhikers, either to ride in back or in the cabin.  In some cases the driver charges the going bus fare, in others he may simply be taking on a rider for the company and refuse a fare.\n\n==Talk==\n[[Spanish phrasebook|Spanish]] is the official language. Amerindian languages (especially [[Quechua phrasebook|Quechua]]) are generally spoken in the more rural, mountainous villages. English is widely spoken in hotels, restaurants and other businesses that cater to high-end travelers. Ecuadorians are friendly and generally tolerant of foreigners who attempt to speak Spanish but make mistakes. It is suggested to approach younger people (specially college students) due to their knowledge of english.\n\n==Buy==\n\n===Money===\nEcuador adopted the ''United States dollar'' symbolised as $ (or USD in an international context) as its currency. Other currencies are not readily accepted. If you are from a country or territory with the US dollar as a official currency, you will not need to worry about understanding prices and currency transferring. Also if you are from [[Bermuda]], [[East Timor]], [[Panama]], or [[Bahamas]], the official currency(ies) of the mentioned countries and territories have fixed exchange rates to the US Dollar. Meaning what price is said in the U.S. will be understood with your country's/territory's official currency. Example; $150 US Dollars will equal $150 Bermudian dollars, but you will still have to exchange currencies.\n\nUS paper money is used for most transactions. Ecuador has its own coins, which are exactly the same size and weight as US coins up through 50-cent pieces; both them and US coins are used, although US coins are now used more frequently. US Sacagawea dollar coins are also widely used, more so than in the United States itself. Susan B. Anthony dollars, however, are not generally accepted.\n\nMany merchants examine large bills ($10 and above) carefully to make sure they aren't counterfeit. Frequently, businesses will not accept fifty dollar bills or hundred dollar bills at all. One must usually go to a bank in order to break hundred dollar bills. Outside of tourist areas and Quito, many merchants do not keep large amounts of money on hand, so getting change for bills large and small may be difficult.  This is especially true on cheaper buses. Take lots of one and five dollar bills with you; you will also want to bring the newest possible bills.  Worn bills are often regarded with suspicion, and it is not uncommon for a merchant to ask you to pay with another bill if the one you handed them appears old or worn.\n\nTravellers' cheques can be exchanged at some (but not all) banks for a reasonable fee (usually not more than 3 percent). They are also accepted at some hotels that cater to tourists, although it is difficult to use them elsewhere.  There is often a surcharge added to use Travellers' cheques.\n\nCredit and debit cards are accepted at many places that cater to tourists as well as at some upmarket shops. However, many places charge a commission for their use as reimbursement for what the banks charge them. You may be asked to show your passport when using a credit or debit card.\n\n'''Automated teller machines''' are widely available in major cities and tourist areas. Most claim to be tied in with major international networks, in theory making it possible to withdraw money from foreign accounts. Depending on the transaction fees charged by your bank at home, ATMs offer very good exchange rates. Be aware that you may have to try quite a few different machines before receiving money. TIP: Banco Austro is the only national bank chain that doesn't charge a withdrawal fee. The others have learned a cue from the States, and typically charge $1 or more per transaction. Avoid using ATMs on the street as their users are frequently targeted by street thieves.  Hotels or other places with a guard nearby are your best choices.\n\n===Costs===\nPrices vary widely in Ecuador. Costs at upmarket hotels and restaurants seem to be close, maybe 10 percent less, to what they would be in the United States. Outside of tourist areas, costs are much less. It is possible to get a meal at a clean restaurant for under $2 or to pay less than $10 for a clean but basic hotel room.\n\nIn Quito, a very famous tourist site is El Mercado Artesenal where many handmade local crafts can be found,however, after a thorough look around you will realize that there is a bit of redundancy in the items in the sense that people tend  to  sell similar things. Therefore, after buying a few main items it becomes difficult to find much more variety. Almost everything that can be bought has a price that can be bargained. If you are not a native, they will try and get higher prices out of you, which is why it is recommended to go with someone who is either fluent in Spanish or native to bargain more effectively.\n\n==Eat==\nThroughout Ecuador there is a lot of variety as to what is typically eaten, depending on the location. In the Sierra, potatoes almost always accompany lunch and dinner, and in the coast rice is popular. Soup is also a big part of lunch and dinner. Breakfasts often consist of toast, eggs, and juice or fruit. Batidos, or fruit shakes, are popular breakfast items or snacks.  Especially in the Coastline, Ecuadorians make a variety of breakfast meals based on green or sweet plantain and yuca, such as bolonoes, empanadas, patacones, corviches, muchines, pan de yuca, humitas and others.  They are cooked with either cheese, pork or fish.  They are very filling and inexpensive meals.\n\n[[Image:Locro de papa.jpg|thumb|upright=1.3|Locro de Papa]]\nRestaurants run the gamut in terms of menu, quality, hygiene, hours and price. Basic meals can be had for less than $2, or it is possible to pay close to US prices in the tourist areas, especially for food from the American chains. \n\nIf you're on a budget, your best bet for a good and local meal is to order an almuerzo (lunch) or a merienda (dinner).  These normally consist of a soup, a meat main course and a dessert for $2-4.  \n\nMore expensive restaurants (say, ones that charge $4 per meal or more) often add a 12% sales tax and a 10% service fee.\n\nCoffee or tea (including many herbal varieties) is typically served after the meal unless you ask for it sooner.\n\nExcept at places that cater to foreigners, it is the custom not to present the diner with the bill until it is requested.  While many servers are used to rude tourists, rubbing your fingers together isn't as accepted as in Europe although it's not considered downright rude as in the United States.  The best way to get the check is to tell your server \"La Cuenta, Por Favor.\"\n\nSmoking is allowed in most restaurants, but the law explicitly prohibits smoking in closed areas, so it's a good idea to ask for a smoking section, or ask if the restaurant allows smoking.\n\n[[Image:Cuy.jpg|thumb|upright=1.3|Cuy or Guinea Pig]]\n'''Locro de papa''' is a famous Ecuadorian soup with avocados, potatoes and cheese.  \n\n'''Ceviche''' is a common dish found on the coast.  It is a cold seafood cocktail that is usually served with \"chifles,\" thin fried plantains, and popcorn.\n\n'''Encebollado''' is a hearty fish soup with yuca, also found on the coast: A tomato-fish soup filled with chunks of yuca, marinated vegetables with \"chifles\" thrown in for added crunch.  \n\nIn the Highlands, Ecuadorians eat '''cuy, or guinea pig'''.  The entire animal is roasted or fried and often served skewered on a stick.\n\n'''Empanadas''' are also a common local food that are usually consumed as snacks in the afternoon.  The most common varieties of this filled pastry are \"empanada de morocho (a variety of maize)\" in the highlands and \"empanada de verde (a variety of banana)\" in the coast. There are also empanadas filled with cheese, chicken and meat. In Quito is popular \"la empanada de mejido\" with a fill made up with cheese, sugar and eggs.\n\n'''Hornado''' is the name for roasted pork. A typical dish of the highland region, served with llapingachos (fried mashed potatoes), mote (boiled corn kernels) and salad. You can not eat hornado with out a sauce called \"agrio\", a sour vinaigrette.\n\n'''Fritada''' is chopped pork cooked in water and orange juice, served with llapingachos, mote, avocado slices and salad.\n\n==Drink==\nBottled water is very common and is safe to drink; it comes ''con gas'' (carbonated) and ''sin gas'' (non-carbonated). Water from the tap is unsafe to drink. Even Ecuadorians generally only drink bottled (or boiled) water.\n\nCoffee is widely available in cafes and restaurants, and also sold in bean form. Tea is also common, usually with a good selection including herbal. \n\nFruit juice is plentiful and good, and you will often have many options: piña (pineapple), mora (blackberry), maracuyá (passion fruit), naranja (orange), sandía (watermelon), naranjilla (a jungle fruit), melon, taxo, guanabana, guava,  etc. If you'd like it made with milk, sort of like a less-frozen milkshake, ask for a ''batida''. Note that often juices are served lukewarm.\n\n''Guayusa'', a natural energy drink that have twice the antioxidants of green tea. Guayusa tea health benefits includes weight loss, better digestion, cleanses the urinary tract, prostate, and blood.\n\n''Aguardiente'', often made from fermented sugar cane, is the local firewater. If possible, have some ground freshly into your cup from the sugar cane.\n\n==Sleep==\nThere are many low-cost [[hostels]] that can be found throughout Ecuador. Often, the hostels in smaller towns are actually privately owned homes that welcome travellers. As with most things, natives can help you find an excellent hotel at a very low price ($6-14). Again, large groups will be able to bargain for lower prices. Air conditioning is an amenity which often comes at an extra cost of a dollar or two a night.\n\nEcuador is also home to an increasing number of [[Eco Lodges]], including many renovated, traditional Haciendas. See our article, ''[[Haciendas of Ecuador]]''.\n\n==Learn==\n\n===Spanish classes===\nQuito is a great place to learn Spanish, the accent in Quito is soft and clear and easy to understand. Quite a few private Spanish academies exist, they offer one on one and group courses with personalized programs that focus on grammar but also in helping to improve speaking and communicational skills in a short period of time. Quality varies greatly, so check reviews online and speak to current students before enrolling.  \n\nStudents who want to learn Spanish for longer periods and in big groups might consider the programs of two Ecuadorian universities which offer semester length Spanish as a Second Language classes for foreigners.  University study is ideal if you are serious about learning Spanish and have the time to complete the full program.  Successful completion of a university Spanish program may also allow to continue studying at that university or even to earn a degree. On the other hand, if you wish to learn Spanish while enjoying being on the beach, then Montañita is the best place to learn.\n\n===Formal university study===\nWhile all universities in Ecuador can theoretically admit foreign students, most have onerous entry requirements and will not admit students for just a semester or two.  Two universities -- Universidad San Francisco and Catholic University -- stand out for extending a welcome to foreign students, who can choose to study for a semester or even complete a full Bachelor's or Master's degree. ''Be sure to inquire about enrolment (''matricula'') costs which are usually above and beyond normal tuition. Obtain a student visa, if needed, '''before''' you enter Ecuador to study.''\n*[http://www.puce.edu.ec/ Catholic University of Ecuador]\n*[http://www.usfq.edu.ec/home.html Universidad San Francisco de Quito]\n\n==Work==\n\n===Volunteer===\nMany people who visit Ecuador choose to give back to the community by volunteering. The [http://www.peacecorps.gov/index.cfm?shell=learn.wherepc.southamerica&cntry=ecuador Peace Corps] alone has more than 200 volunteers in Ecuador at a time and there are much larger groups from other countries. From conservation projects to building houses to teaching English, there are many ways to help development in Ecuador. You can choose to volunteer through a third-party organization that arranges accommodations and connects you to a local organization to volunteer with. The other option is to volunteer directly through a local NGO. This will take more time and research but can also be significantly cheaper.\n\n*[https://www.abroaderview.org/volunteers/ecuador Volunteer Ecuador]\n*[https://www.abroaderview.org/volunteers/ecuador/quito Ecuador Quito]\n*[https://www.abroaderview.org/volunteers/ecuador/galapagos-islands Galapagos Island]\n*[https://www.volunteeringsolutions.com/volunteer-abroad/volunteer-in-ecuador-quito Volunteering Opportunities in quito, Ecuador]\n*[https://www.intvs.org/volunteer-abroad/volunteer-in-ecuador/ Volunteering Opportunities in Puerto Lopez, Ecuador]\n\nThe third option is to look for the right volunteer program on a comparison platform. On Volunteer World, for example, you can search and compare all options in Ecuador. <listing name=\"Volunteer World\" alt=\"\" directions=\"\" lat=\"\" long=\"\" address=\"Düsseldorf, Germany\" phone=\"\" tollfree=\"\" email=\"\" fax=\"\" url=\"https://www.volunteerworld.com/volunteer-in-ecuador/\" hours=\"\" price=\"\">is a social start up that helps grassroot projects all over Ecuador and interested volunteers worldwide to get in touch. Volunteers can compare and contact the social projects while local NGOs receive the necessary support to focus on their social cause.</listing>\n\n==Stay safe==\nTourists should use common sense to ensure their safety. Avoid problems by not flashing large amounts of money, not visiting areas near the [[Colombia|Colombian]] border, staying away from civil disturbances and not using side streets in big cities at night. Probably the biggest threat in most places is simple thievery: Belongings should not be left unguarded on the beach, for example, and pickpockets can be found in some of the more crowded areas, especially the Trolébus (Metro) in Quito, in bus terminals and on the buses themselves. Buses allow peddlers to board briefly and attempt to sell their wares; however, they are often thieves themselves, so keep a close eye out for them. Hotel personnel are generally good sources of information about places that should be avoided.\n\nYou can always ask tourist police officers, police officers or in Tourist information centre for the dangerous regions.\n\nEcuador offers great opportunities for hiking and climbing, unfortunately, some travellers have been attacked and robbed in remote sections of well known climbs - female hikers/climbers need to be '''extremely''' careful and never be alone. Travelers are urged to avoid solo hikes and to go in a '''large group''' for safety reasons.\n\nSee the section above on \"Crime\" for the Ecuador 2018 Crime & Safety Report: Quito, by U.S. Department of State Travel Advisory.\n\n==Stay healthy==\nEcuador is widely considered to be a developing country and health hazards are a significant issue. Of the most significant are food-borne illnesses, though they can easily be treated with digestive drugs such as antacids or antidiarrheals.\n\nBottled water is key in Ecuador if you don't want to get sick. This doesn't only apply to foreigners who don't have the stomach for Ecuadorian food but also Ecuadorians who know that if they don't boil their water or drink it from the bottle that they can get very sick.  As a result, it can be purchased almost everywhere (even in the most remote places) for well under $0.25-0.50. Water bottles are sometimes provided by hostels and hotels, which can be used for brushing teeth.\n\nIt is advisable to receive a typhoid vaccination, and possibly a yellow fever vaccination, depending on your specific area of travel.\n\nOutside the major cities and tourist areas, malaria and dengue can be a problem along the coast during the rainy season.\n\n==Respect==\nThe common greetings are \"Buenos días\", \"Buenas tardes\" or \"Buenas noches\", (Good morning, Good afternoon, and Good evening, respectively). It is usually complemented by a handshake, between men, and by a kiss on the cheek between women or between a man and a woman. \"Hola\" is the most common greeting between friends and acquaintances. Note that, as in most Latin American countries, it's considered normal and polite to stand quite close to the other person while talking.\n\nIf you speak Spanish with Ecuadorian commoners, take note of the difference between the two forms for the pronoun \"you\": the informal \"tú\" and the formal \"usted\". It's customary to address older people and people with whom you're not familiar with \"usted\". Ecuadorians are generally forgiving of non-native speakers, but use \"usted\" when in doubt. \n\nAmong many other cultural idiosyncrasies, in the Sierra regions it is considered impolite to use a downward-facing palm as a reference for the height of a person. Instead, the hand is held on its side, and the measurement taken from the lower edge to the floor. Gesturing with the palm down is appropriate for animals only.\n\nWhen motioning for someone to \"come here,\" it is impolite to motion your hand with the palm facing up.  Instead, use a downward swipe of the hand with the palm facing down.\n\nAcceptable clothing varies by region of the country.  In the mountainous Sierra region, including Quito, clothes are usually more warm because of the weather.  On the coast, meanwhile, more casual clothes predominate. Do not make the mistake of wearing shorts and flip flops in the highland cities.\n\n==Contact==\n\n===Internet===\nYou can find pretty good free Wifi connections in hotels and restaurants and even in some shopping malls in the big cities. Internet connections in Ecuador are generally of poor quality in small cities. You can buy a local SIM card or \"tourist chip\" for less than USD $30,00, that includes an Ecuadorian phone number, Internet data (3G or 4G, depending on the provider) and you can recharge it.\n\nThis said, there are free wifi networks here and there in cities, but some are unreliable. Internet cafes are on every corner, but expensive at $1 to $2 per hour.\n\n===Newspapers and magazines===\nSpanish-language newspapers and magazines can be purchased on the streets of cities but can be hard to find elsewhere. Some hotels catering to foreigners may have a small selection of English-language reading material.\n\n===Radio and television===\nRadio and/or television is available in Spanish except in some of the particularly remote areas. English-language movies usually are shown in the original language with Spanish subtitles. Many hotels have cable television that includes English-language stations and/or premium movie channels that feature subtitled movies in their original languages. The same variety of different cable service offerings and a multiplicity of channel and languages are now readily available in all cities.\n\nThe most popular private Ecuadorian tv channels are Teleamazonas, Ecuavisa, RTS, Canal Uno and TVC. Regarding public channels, Tc Televisión, Gamavision and EcuadorTv. This channels can be found on air tv (depending on the city) and in cable tv providers. You can watch [http://www.tvdeecuador.com Tv from Ecuador online here].\n\n===Telephone===\nFor most visitors, the easiest place to make phone calls is an Internet cafe, most of which provide VoIP service at reasonable rates. You can call the United States for about $0.10 per minute and Europe for a bit more. Avoid making a phone call through an operator; the cost for an international call can be $3 or more per minute.  For calls within Ecuador, it is possible to use a telephone cabin. This is an entire store front filled with telephones.  Generally, you are assigned a booth by the proprietor, you make your call, then you pay as you leave.  Calls within Ecuador are more expensive than domestic calls in most countries, but not unreasonable, except for calls to cell phones, which generate most of their revenue by charging the caller.  Also, call prices increase depending on the distance of your call within Ecuador, based on city, province, etc.  Visitors making an extended stay should consider purchasing a cell phone. Most are sold on a prepaid-call basis, and phone refill cards can be purchased in all but the smallest towns. It is also possible to get a modern GSM cellular phone \"unlocked\" so that it will function in Ecuador (you can take your own phone, if it compatible with GSM 850MHz), however, this should be reserved for emergencies as the cost of actually making such a call is usually exorbitant (about $0.45 per minute).\n\nClaro and Movistar are the two big operators. Claro has the bigger network but is known for poor quality, bad customer service and your credit (saldo) disappearing without you actually using it. Best to top up a dollar at a time, like the locals do.\n\n\n{{related|Galapagos_wildlife}}\n\n\n[[Category:Countries]]\n\n{{isPartOf|South_America}}\n{{outline}}\n{{countryguide}}\n\n[[ca:Equador]]\n[[de:Ecuador]]\n[[eo:Ekvadoro]]\n[[es:Ecuador]]\n[[fi:Ecuador]]\n[[fr:Équateur]]\n[[he:אקוודור]]\n[[hu:Ecuador]]\n[[it:Ecuador]]\n[[ja:エクアドル]]\n[[nl:Ecuador]]\n[[pl:Ekwador]]\n[[pt:Equador]]\n[[ro:Ecuador]]\n[[ru:Эквадор]]\n[[sv:Ecuador]]\n[[wts:Category:Ecuador]]\n\n[[WikiPedia:Ecuador]]\n[[Dmoz:South America/Ecuador/]]\n[[World66:southamerica/ecuador]]"
        }
    }
}