{
    "parse": {
        "title": "Estonia",
        "pageid": 358,
        "wikitext": {
            "*": "{{pagebanner|Estonia Banner.jpg}}\n\n{{quickbar\n| image=Tallinn-general-1.jpg\n| caption=Tallinn\n| location=Estonia in its region.svg\n| flag=Flag of Estonia.svg\n| capital=[[Tallinn]]\n| government=Parliamentary republic\n| currency=Euro\n| area=''total:'' 45,227km²\n| population=1,315,819 (1 January 2014)\n| language=[[Estonian phrasebook|Estonian]] (official) \n| religion=Evangelical Lutheran, Estonian Traditional/Native Belief, Russian Orthodox, Estonian Orthodox\n| electricity=230V/50Hz (European plug)\n| callingcode=+372\n| tld=.eeˇ\n| timezone=UTC+2\n}}\n\n[http://www.visitestonia.com '''Estonia'''] is a [[Baltic states|Baltic state]] in Northern [[Europe]] having land borders with both [[Latvia]] and [[Russia]]. Estonia's coastline lies on the Baltic sea and the Gulf of [[Finland]].\n\n==Understand== \n[[File:OldCity GuardTowerPark.JPG|thumb|upright=1.7|Medieval city wall in [[Tallinn]]]]\n\nEstonia is a Baltic gem offering visitors the chance to see a tiny dynamic land on the shores of the Baltic Sea. Glorious beaches pepper the extensive coastline, although the swimming season is short. After all, the Baltics are not renowned for warm weather - something that any visitor to Estonia must be aware of &mdash; the summer is short and the winter is severe. \n\n[[Tallinn]]'s medieval old town was built by German crusaders in the Late Middle Ages and is in magnificent condition, with the medieval city walls and towers almost completely intact and it rates as one of Europe's best preserved medieval old towns. Visitors can also experience an ex-Soviet occupied country that is now part of the European Union. Traces of the Soviet era are still there to be seen &mdash; e.g. [[Paldiski]], a deserted Soviet army base that was once off-limits to Estonians themselves, can easily be visited on a day trip from the capital, Tallinn. \n\n===History===\nAfter 7 centuries of [[Germany|German]], [[Denmark|Danish]], [[Sweden|Swedish]], [[Poland|Polish]] and [[Russia|Russian]] rule, Estonia attained independence in 1918. Forcefully annexed into the USSR in 1940, it re-gained independence in 1991 through its Singing Revolution [http://www.singingrevolution.com/cgi-local/content.cgi?pg=3&p=19], a non-violent revolution that overthrew an initially violent occupation. \n\nSince the last Russian troops left in 1994, Estonia moved to promote economic and political ties with Western Europe. It is now one of the more-prosperous former communist states, enjoying a high-tech environment, an open and liberal economy and a transparent government system. On the other hand, it is faced with a fairly low (but growing) GDP per capita (in a European Union context), as well as a very low birth rate, which is creating a slight population decline. Between 1991-2007, the country saw rapid economic expansion, leading it to be among one of the wealthiest and the most developed of the former Soviet Republics. However, its economy was badly damaged during the ongoing global recession, although more recently, it has been recovering quickly. In 2011, the Euro was adopted as the official currency.\n\nSince its accession to the EU, Estonia is becoming one of the most popular destinations in North-Eastern Europe with (EU highest) 30% growth in the number of visitors in 2004, according to Eurostat.\n\n===Geography===\n; '''Climate''' : maritime, wet, moderate winters, cool summers\n; '''Terrain''' : marshy, lowlands; flat in the north, hilly in the south\n; '''Elevation extremes''' : ''lowest point:'' Baltic Sea 0 m <br>''highest point:'' Suur Munamägi 318m (in the south east of Estonia, 20km north of the main highway that runs from Riga to Russia close to the borders of Estonia with both countries). \n; '''Geography - note''' : the mainland terrain is flat, boggy, and partly wooded; offshore lie more than 1,500 islands and islets\n;'''Nature''' : World War 2 and the subsequent occupation were devastating on humans, but the destruction and the closure of large areas for military use actually increased Estonia's forest coverage from about 25% before the war to more than 50% by 1991. Wolves, bears, lynx, elks, deer as well as some rare bird and plant species are abundant in Estonia. The wild animals from Estonia are exported to some EU countries for forest re-population programmes. Most animals can be hunted - according to yearly quotas..\n\n===Holidays===\nEstonia celebrates a national holiday:\n* '''Independence Day''' (''iseseisvuspäev''): 24 February; it is celebrated on the first date of independence in 1918, when Estonia declared independence from Soviet Russia. Estonia also declared independence from the Soviet Union on 20 August 1991, which is celebrated as a public holiday. There is always a military parade somewhere in the country on 24 February, although the weather can be too cold for some to come and watch.\n\nEstonia also celebrates several public holidays:\n* '''New Year's Day''' (''uusaasta''): 1 January; New Year's celebrations were promoted during the Soviet times, while Christmas was forbidden. After the restoration of independence, the significance of the New Year decreased, but it is still a celebrated as in the rest of the World.\n* '''Good Friday''' (''suur reede''): moves from 17 March to 20 April (always on Friday).\n* '''Easter Sunday''' (''ülestõusmispüha''): moves from 22 March to 26 April (first full moon Sunday after the spring equinox).\n* '''May Day''' (''kevadpüha''): 1 May; first a Soviet-imposed Labour Day, when students and public employees were forced to take part in political processions, the importance of the May Day has moved to the preceding night on 30 April. Many Estonians then celebrate the Germanic '''Walpurgis Night''' (''volbriöö'') and dress up as witches and roam the streets. In the university town of [[Tartu]], the mayor gives the power symbolically over to the students, who then gather to student organizations for the following night.\n* '''Pentecost''' (''nelipühad''): moving from 10 May to 14 June.\n* '''Victory Day''' (''võidupüha''): 23 June; celebration of the Estonian victory over the Baltic German ''Landeswehr'' in the [http://en.wikipedia.org/wiki/Battle_of_Paju| Battle of Paju] in 1919. There is usually a smaller military parade somewhere in the country on 23 June. \n* '''Midsummer Day''' or (''jaanipäev''): 24 June; the summer solstice, which is however celebrated on the previous night on 23 June, on St. John's Eve (''jaaniõhtu'' or ''jaaniöö''). It is recommended to attend the semi-public celebrations in any Estonian village. Most villages and many residents themselves organize large bonfires for the evening. There is also a tradition to jump over the bonfire. In the West Estonian islands, there are sometimes old fishing boats burnt within the bonfires. The sun only sets for a few hours on that night and it never really goes completely dark and many Estonians have the tradition to stay awake at least until sunrise.\n* '''Day of Restoration of Independence''' (''taasiseseisvumispäev''): 20 August; celebration of the restoration of independence from the Soviet Union in 1991.\n* '''Christmas''' (''jõulud''): from 24 to 26 December; Christmas in Estonia is a mix of Estonian and Western traditions. Celebrating Lutheran Christmas in December instead of Orthodox Christmas in January was forbidden during the Soviet Occupation and Christmas were celebrated in secret. Today it has remained a strictly family holiday.\n\nAll national and public holidays are a day off for workers in general, but most convenience stores remain open during regular hours.\n\n==Regions== \nEstonia itself is divided into 15 counties (or ''maakonnad'', singular - ''maakond''). However, to bring out the unique characteristics of Estonia, we use 4 distinctive regions in this guide. As the country is small, '''most destinations can be reached within a couple of hours from Tallinn'''.\n\n{{Regionlist|\nregionmap=Estonia regions map.png |\nregionmaptext=Regions of Estonia |\nregionmapsize=375px |\n\nregion1name=[[North Estonia]] |\nregion1color=#578e86 |\nregion1items=|\nregion1description=It's the most industrialized region with over 1/3 of the population of Estonia. [[Tallinn]], with its nightlife and UNESCO-protected medieval Old Town, is a well-known tourist attraction. Nonetheless, there are many small and beautiful beach villages on the coastline as well (such as [[Kaberneeme]], [[Laulasmaa]], [[Nõva]], [[Käsmu]] and [[Võsu]]). Furthermore [[Lahemaa National Park]] can be reached within an hour from Tallinn.  |\n\nregion2name=[[East Estonia]]  |\nregion2color=#71b37b |\nregion2items=|\nregion2description=East Estonia is as close as you can get to Russia. Seaside resorts, such as [[Toila]] and [[Narva-Jõesuu]], are considered to be among the best in Estonia. |\n\nregion3name=[[West Estonia and Islands]] |\nregion3color=#69999f |\nregion3items=|\nregion3description=West Estonia is well known for its resorts, [[Haapsalu]] and [[Pärnu]] (the summer capital of Estonia), and its islands ([[Saaremaa]] and [[Hiiumaa]] being the biggest). This region also has historical significance. [[Noarootsi]] and the islands of [[Ruhnu]] and [[Vormsi]] have been (and are) inhabited by coastal Swedes. Other unique places include the islands [[Kihnu]] and [[Muhu]] with their rich cultural heritage and the national parks {{-}} [[Vilsandi National Park]] and [[Matsalu National Park]]. |\n\nregion4name=[[South Estonia]]  |\nregion4color=#8a84a3 |\nregion4items= |\nregion4description=Centered around the lively university city of [[Tartu]]. Further south and south-east there are '''Setomaa''' and '''Mulgimaa''' with their unique cultural heritage that's still visible today. [[Karula National Park]] and [[Soomaa National Park]] are also part of the region, as are the ski resorts near [[Otepää]]. |}}\n\n==Cities==\n<!-- 9 cities, no more, discuss changes on Talk first -->\n* [[Tallinn]] {{-}} capital city with an enchanting medieval core\n* [[Tartu]] {{-}} Estonia's second-largest and oldest city, intellectual hub famous for its universities\n* [[Haapsalu]] {{-}} seaside resort town\n* [[Kuressaare]] {{-}} home of the Kuressaare castle\n* [[Narva]] {{-}} the easternmost point of the mainland European Union \n* [[Rakvere]] {{-}} known for its castle ruins and unique character\n* [[Pärnu]] {{-}} historical resort seaside city with a small harbour, Estonia's summer capital \n* [[Valga]] {{-}} border-town with Latvia\n* [[Viljandi]] {{-}} home of the annual Viljandi Folk Music Festival\n<!-- 9 cities, no more, discuss changes on Talk first -->\n\n==Other destinations==\nEstonians have a special love for nature, and many will tell you that they would rather sit under a tree in an empty forest or hike in a national park than almost anything else. Estonia's tranquil, laidback and unspoiled Baltic islands provide a splendid getaway to nature.\n\n* [[Hiiumaa]] {{-}} second largest island of Estonia\n* [[Karula National Park]] {{-}} the smallest national park, located in South Estonia\n* [[Lahemaa National Park]] {{-}} 50km east of Tallinn, with 1000km² of bays, peninsulas and forests\n* [[Matsalu National Park]] {{-}} one of the largest and most important autumn stopping grounds for migratory birds in Europe\n* [[Saaremaa]] {{-}} including the town of [[Kuressaare]] and one of few well-preserved medieval castles in the Baltics \n* [[Soomaa National Park]] {{-}} a peat bog formed from a glacier melt from around 11,000 years ago\n* [[Vilsandi National Park]] {{-}} covers 238km², including 163km² of sea and 75km² of land, plus 160 islands and islets\n\n==Get in==\n{{Schengen}}\n\nA growing number of foreign visitors have been travelling to Estonia in recent years. According to Statistics Estonia [http://www.stat.ee/?lang=eng&id=] the nation's statistics agency, 1.3 million foreigners visited the country in 2000, and that number climbed 38 percent to 1.8 million foreigners by 2005. \n\n===By plane=== \n[[Tallinn]] is Estonia's main international gateway. In addition to direct daily flights to/from all major Scandinavian ([[Stockholm]], [[Copenhagen]], and [[Oslo]]) and Baltic cities ([[Riga]] and [[Vilnius]]), there are direct flights from all major European hubs like [[London]], [[Paris]], [[Frankfurt]], [[Brussels]] and [[Amsterdam]] and regional hubs like [[Prague]] and [[Warsaw]]. Eastward connections are from [[Moscow]], [[St. Petersburg]] and [[Kiev]]. Local carrier Nordic Aviation Group [http://www.nagroup.ee] provides half of the services and the rest is provided by Finnair, SAS, Lufthansa, LOT, CSA, Air Baltic, Ryanair and others. Easyjet is one of a few low-cost carriers that provide service between Tallinn and major European cities.  Travelers can pay as little as EUR 120 (US$160) or £80 Sterling to fly roundtrip from London to Tallinn. \n\nFrom London's Stansted Airport, Easyjet provides nonstop service to Tallinn. From Frankfurt, choose from  Lufthansa and Estonian Air. From Brussels, select from KLM, Estonian Air, Finnair, SAS, RyanAir, Lufthansa and Czech Airlines. From Amsterdam, choose from KLM, Lufthansa, SAS, Czech Airlines, Finnair, LOT Polish and Estonian Air. From Rome's Fiumicino Airport, select from Alitalia, Czech Airlines, Estonia Air, KLM and Finnair. From Helsinki Vantaa airport select from Estonian Air, Finnair, FlyBE.\n\nClose proximity and excellent ferry services with [[Helsinki]] allow for combination of open-jaw air travel.  Additionally, even if you are only visiting Estonia, it is frequently still significantly cheaper (particularly on flights from North America) to fly into Helsinki and then take the ferry to Tallinn.\n\nDaily domestic flights are from Tallinn to the islands of Hiiumaa ([[Kärdla]]) and Saaremaa ([[Kuressaare]]). \n\n[[Tartu]] is one of Estonia's oldest towns and a key to South-Eastern regions of Estonia, ancient Russian [[Pskov]] or further to [[Latvia]]. Flights map of the local airport includes [[Helsinki]] by FlyBE airline and [[Tallinn]] by Estonian Air, which makes a roundtrip Helsinki-Tallinn-Tartu very easy in any combination.\n\n* '''Lennart Meri Tallinn Airport''' or '''Ülemiste Airport''' [http://www.tallinn-airport.ee/eng] ({{IATA|TLL}}) ({{ICAO|EETN}}), about 5 km from the city center, is increasingly becoming an airport hub of the Baltics. Estonian Air [http://www.estonian-air.ee?keel=eng] provides good quality services to a series of European cities. Other major airlines include Finnair, SAS and EasyJet. Bus line 2 runs from the airport to downtown Tallinn and taxis are also available.\n\n* '''Tartu Airport''' or '''Ülenurme Airport''' [http://www.tartu-airport.ee/eng] ({{IATA|TAY}}, {{ICAO|EETU}}) is located 10km from Tartu centre. The airport's bus stop is located in front of the terminal. Bus travels on the route Ülenurme - Tartu City Centre. The bus fare is about €1 and tickets can be bought from the bus driver. There is also the airport shuttle service at 3EUR from/to any location in the city.\n\n* '''Kuressaare Airport''' [http://www.eeke.ee] ({{IATA|URE}}, {{ICAO|EEKE}}) is situated 3 km from the town of Kuressaare on [[Saaremaa]] island and offers regular flights to [[Stockholm]] and domestic flights.\n\n===By train=== \nInternational train services are to/from Russia, Moscow. Domestic services [http://www.elron.ee] connect Tallinn with [[Narva]] in the east and [[Viljandi]] in the south, [[Pärnu]] in the south-west, [[Tartu]] and [[Valga]] in the south-east. Baltic Station railway terminal in Tallinn can be used to start your journey. The station can be accessed from town center and vice versa by tram number 2 - use the \"Balti jaam\" stop. The platform and trains are modern and the fares are reasonable. Free wifi is available on Elron trains.\n\n===By car=== \n[[Image:narva border.jpg|thumb|Centre|300px|The Narva-Ivangorod border bridge [Photo: Rolf Palmberg]]]\n\nGood road connections are to the south ([[Via Baltica]] routing Tallinn-[[Riga]]-[[Kaunas]]-[[Warsaw]]) and east (Tallinn-[[Saint Petersburg]]). The domestic road network is dense and covers all regions of the country.\n\n===By bus=== \nLots of good and cheap connections from Moscow, Saint Petersburg, Kiev, Kaliningrad, Warsaw, and all larger Baltic and German cities.\nThe most popular regular service provider is Luxexpress Group [http://www.luxexpress.eu], others include Ecolines [http://www.ecolines.net/] and Hansabuss [http://www.hansabuss.ee/].\n\nDomestic coach companies offer services nationwide. A schedule is available at [http://www.t-pilet.ee/ t-pilet.ee]. The most popular route is Tallinn-Tartu, where busses depart at least hourly.\n\n===By boat===\nFerry lines connect Tallinn with Sweden (Stockholm), Finland (Helsinki, [[Mariehamn]]) and also with Germany ([[Rostock]]) during the summer months. Tallinn-Helsinki is one of the busiest searoutes in Europe and has daily 20 ferry crossings and nearly 30 different fast-boat and hydrofoil crossings (the latter do not operate during winter). For details see Port of Tallinn passenger schedules [http://www.portoftallinn.com/passenger_ship_schedule.php].\n\nMinor international routes include recently re-established connection between [[Latvia]] port of [[Ventspils]] and the island of Saaremaa and [[Paldiski]] - [[Kapellskär]] (Sweden) with two different operators.\n\n==Get around==\nIn Estonia, the public transport system is well-developed and it is preferable to walk, cycle or use public transport.\n\n===By train===\nEstonia's train network is operated by [http://elron.ee/ Elron]. Tickets can be bought from Elron's website or from the ticket seller aboard the train. The ticket machines one can see on the train still do not work after almost a year since they were fitted (as of 2018-07).\n\nThey have several local commuter lines:\n* Tallinn-Keila-Paldiski\n* Tallinn-Riisipere\n* Tallinn-Aegviidu\n\nElron also operates long-distance lines to (larger destinations noted):\n* Tallinn -> Rakvere -> Narva\n* Tallinn -> Tapa -> Tartu -> Valga\n* Tallinn -> Lelle -> Türi -> Viljandi\n* Tallinn -> Lelle -> Pärnu (which will be shut down in 2019, the last stretch is in disrepair and that means very slow speeds of 60 km/h or 2 hours and 34 minutes in total)\n\nNote that:\n* the train to Viljandi is coupled with the train to Pärnu, which will be unhooked at Lelle. So be sure to get on the right one. Ask the ticket seller if in doubt or check out the screens.\n* some platforms in smaller settlements are short. So entry and exit will take place from the carriage marked with the letter 'C'. Which is where the toilet and bicycle holders are.\n* taking a bicycle on the train is free, but depending on the route, the day and the time, all 10 spots could be taken. To avoid standing guard over it, one can use another carriage and using the lock, attach it to a railing near the doors, so it does not fall when the train is braking. But keep in mind if the place you get off has a short platform or not.\n\nMobile internet sucks in middle of nowhere where the tracks go through, so stick with the (limited) train WiFi. 1st class has it's own, with the password known to the ticket seller on written on the ticket. Different trains can have it's WiFi network by the same name and password but are different networks.\n\n===By bus===\nEstonia has a comprehensive bus network all over the country. All bigger cities like Tartu, Pärnu, Viljandi and Narva are accessible by bus. Which work fine as long as you want to travel from or to Tallinn. Connections are more coincidental than planned.\n\nThere are several websites for bus information:\n\n[http://www.Tpilet.ee Tpilet.ee] - this shows probably all the departures between bigger towns, but it does not show all inter-county ones. One can buy a ticket there, the website accepts credit cards and payments through bank links of local banks. The FAQ section says which lines accept tickets shown off one's phone, by scanning it's QR code or otherwise.\n\n[http://www.peatus.ee peatus.ee] - fills in some blanks that Tpilet might not show, typically lines between smaller places.\n\nThere are also various bus companies that service lines heading outside Estonia as well, such as [http://www.eurolines.lt/ee/ Eurolines], [https://luxexpress.eu/en Lux Express], and surely several others.\n\nAs of 2018-07-01 Estonian government made some county lines free of charge, so don't be surprised if the bus driver does not want your money.\n\nPro-tip: If you want to travel between Pärnu and Haapsalu, then the journey planner on either of those sites does not show all the options. One could either look for departures to and from Lihula, which is between those two and might have a decent connection. Or go through Tallinn, but the journey planner will not tell you, nor will the website of Lux Express, that one can get off and on at Vana-Pääsküla stop, which saves 20 minutes each way. And possibly from having to wait for another trip.\n\n===By bicycle===\nQuality of cycling infrastructure is similar to other non-cycling countries. Outside towns light traffic paths often exist, separated from the road.\n\nAs for cycling in towns, do it in the manner that does not hurt you nor anyone else. If necessary ride on the pavement, if conditions allow then on the road, and if you find one - a bicycle path/lane.\n\n===By thumb===\n[[Hitchhiking]] in Estonia is generally good. The Baltic countries have a strong hitchhiking culture.\n\n===By car===\nThe road system is quite extensive although road quality varies. The speed limit in the countryside is 90 km/h and 50 km/h in the cities unless specified otherwise. Passengers are expected to wear seat belts. Lights must always be switched on. \n\nIn the central areas of bigger cities, a fee is levied on parking cars, but finding a provider of tickets is sometimes difficult as mobile parking is widespread. \n\nEstonia has lots of car rental companies and the level of English spoken by their representatives is generally very high. If you go to Level 0 of Tallinn international airport, there are several car rental agency counters. \n\nCar rental in Estonia is very cheap compared to Western Europe. You can get a decent car shared between two people for approximately €10/person/day e.g. a 2004 Fiat Punto. \n\nAn excellent day trip is to drive from Tallinn to Tartu. It takes about 2.5 hours each direction.\n\nAs of September 3, 2006, the drive from Tallinn to Tartu has been much improved. Outside of Tallinn, it is a two lane paved road with some construction ongoing to upgrade it. It takes two to two and a half hours. There are few sights of interest along the way. The terrain is flat and most of the road is bracketed by a birch tree and a few pines. Sam's Grill (about 1/2 way between Tallinn and Tartu)is recommended as a place to stop. There is a gas station next door.\n\nDriving in Estonia can be more dangerous than in much of Europe and the United States. Some drivers can be aggressive, recklessly overtaking vehicles and traveling at high speed, even in crowed urban areas. The best advice is to drive defensively: don’t assume your fellow drivers will do what you expect them to do, like avoiding overtaking in poor visibility or signal before they merge into your lane. \n\nEstonian laws against driving under the influence of alcohol are strict and follow a policy of zero tolerance. Unfortunately, accidents involving intoxicated drivers are distressingly frequent.\n\n==Talk==\nThe official language is [[Estonian phrasebook|Estonian]] which is linguistically very closely related to [[Finnish phrasebook|Finnish]]. \n\n[[Russian phrasebook|Russian]] is by far the most spoken minority language in the country. Russian is the native language of just under half the population of Tallinn, with 66% of Estonians in total having at least some knowledge of the Russian language.\n\nEnglish is also spoken by around 50% of the population, especially by the youth.\n\nThanks to heavy tourism and popular TV broadcasts from the other side of the gulf, [[Finnish phrasebook|Finnish]] is also spoken quite well by many people in Tallinn.\n\n[[German phrasebook|German]] is taught at school in Estonia, and around 10% of the population can speak it.\n\n==See==\n\n{{infobox|Estonia's top tourist attractions|\n# '''Tallinn's Medieval Old Town''', [[Tallinn]]\n# '''The Rotermann Quarter''', [[Tallinn]], Shopping district\n# '''Kadrioru Park''', [[Tallinn]], Park\n# '''KUMU''', [[Tallinn]], Art museum\n# '''Tartu Jaani (St. John's) Church''', [[Tartu]]\n# '''Pärnu Beach''', [[Pärnu]]\n# '''Narva Hermann Castle''', [[Narva]], Museum\n# '''The Kaali meteorite craters''', [[Saaremaa]]\n# '''Setumaa''' [http://www.visitestonia.com/en/holiday-destinations/cultural-treasures/setomaa], South-East Estonia\n# '''Rakvere Ordu Castle''', [[Rakvere]], Museum\n}}\n\n===Medieval History & Manors===\n\nThe main reason most people first come to Estonia is to see the best protected and intact medieval city in Europe - [[Tallinn]]. The unique value of '''Tallinn's Old Town''' lies first and foremost in the well-preserved (intact) nature of its medieval milieu and structure, which has been lost in most of the capitals of northern Europe. Since 1997, the Old Town of Tallinn has been on UNESCO's World Heritage list.\n\nLiving under the rule of Scandinavian kings, Russian empire and Teutonic Knights has left Estonia with unique and rich blend of historic landmarks. Over one thousand manors were built across Estonia from the 13th century onwards. Some of the manors have perished or fallen into ruins but a lot have been reconstructed and now are favourite attractions with tourists. Nowadays there are '''about 200 manor houses''' [http://www.visitestonia.com/en/articles/things-to-see-and-do/history-culture/manor-houses-and-castles] under state protection as architectural monuments and 100 in active use.\n\n===Islands & Coastline===\n\n[[Image:Viru-blog.jpg|thumb|350px|Bogs are clean in Estonia and provide a unique swimming experience]]\n\n[[Image:Jagala_at_minus20C.jpg|thumb|350px|Jägala falls to -20°C in winter]]\n\nEstonia has '''over 1,500 islands'''. The nature is essentially untouched and offers quite a different beach experience with their remoter rustic feel. Most of the public beaches are sandy and the average water temperature is 18°C in summer. Inland waters and some shallow bays' waters are even warmer.\n\nThe largest island is [[Saaremaa]] with an intact and well-restored medieval castle in its only city, Kuressaare. Stone fences, thatched roofs, working windmills and home made beer are all distinctive to Saaremaa. [[Hiiumaa]], on the other hand, is well known for its lighthouses, unspoilt nature, the Hill of Crosses and the sense of humour of its inhabitants. Both islands have an airport so they can be quickly reached from Tallinn.\n\nOther important islands include [[Kihnu]], [[Ruhnu]] (with its \"singing sand\" beach), [[Muhu]] and [[Vormsi]], each with its own unique characteristics. Most of the other tiny Estonian islands don't carry much cultural significance, but can be appealing for bird watching, canoeing, sailing, fishing etc.\n\nIn July and August, [[Pärnu]], Estonia's summer capital, is the main attraction. The coastline itself has loads of untouched beaches and a tour from [[Narva-Jõesuu]] (in the East) towards Tallinn is great for exploring the coastline. Some of the well known places include [[Toila]], [[Võsu]], [[Käsmu]] and [[Kaberneeme]].\n\n==Do==\n\n'''Tickets for events''' can be bought online via Piletilevi.ee [http://www.piletilevi.ee/eng] or the lately established Ticketpro.ee [http://www.ticketpro.ee/jnp/en/].\n\nThere's quite a good list of various events in Estonia at Visitestonia.com [http://www.visitestonia.com/en/things-to-see-do/events].\n\n\n*<do name=\"Real prison escape \" alt=\"\" address=\"Pärnu\" directions=\"Sillutise 1\" phone=\"+372 555 28376\" url=\"https://pogenemistoad.ee/\" hours=\"\" price=\"\" lat=\"\" long=\"\">Escape from a prison of Pärnu which was closed in 2007. The biggest escape room complex in Scandinavia</do>\n===Film Festivals===\n*<do name=\"Tallinn Black Nights Film Festival (PÖFF)\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"http://www.poff.ee/\" hours=\"November/December\" price=\"\" lat=\"\" long=\"\">The festival combines a feature film festival with the sub-festivals of animated films, student films and children/youth films.</do>\n\n===Music Festivals===\n\n[[Image:Estonian-song-celebration.jpg|thumb|250px|right|Estonian Song and Dance Celebration in 2009 ''Photo: Egon Tintse'']]\n*<do name=\"Eesti Laul\" alt=\"\" address=\"Tallinn\" directions=\"\" phone=\"\" url=\"http://etv.err.ee/l/meelelahutus/eesti_laul\" hours=\"February/March\" price=\"\" lat=\"\" long=\"\">The national selection process in Estonia for the Eurovision Song Contest, often called ''the alternative Melodifestivalen''. </do>\n\n*<do name=\"Tallinn Music Week\" alt=\"\" address=\"Tallinn\" directions=\"\" phone=\"\" url=\"http://www.tallinnmusicweek.ee\" hours=\"Spring\" price=\"\" lat=\"\" long=\"\">Showcase festival, aiming to stage the best and most outstanding Estonian talent on two nights in Tallinn's most vibrant live venues, as well as a networking event for the music industry professionals.</do>\n\n*<do name=\"Tallinn International Festival Jazzkaar\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"http://www.jazzkaar.ee/eng/\" hours=\"April\" price=\"\" lat=\"\" long=\"\">In addition to Tallinn jazz concerts also take place in Tartu and Pärnu.</do>\n\n*<do name=\"Tallinn Old Town Days\" alt=\"\" address=\"Tallinn\" directions=\"\" phone=\"\" url=\"http://www.vanalinnapaevad.ee\" hours=\"May/June\" price=\"\" lat=\"\" long=\"\"></do>\n\n*<do name=\"The Estonian Song Celebration (In Estonian: Laulupidu)\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"http://www.laulupidu.ee/eng\" hours=\"\" price=\"\" lat=\"\" long=\"\">First held in 1869, takes place every five years. In 2009, 35,000 choral singers gathered to perform for an audience of 90,000 people. It is recognised by UNESCO as a Masterpiece of the Oral and Intangible Heritage of Humanity.</do>\n\n*<do name=\"Rabarock\" url=\"http://www.rabarock.ee/?lang=en\" alt=\" address=\"Järvakandi\" \" long=\"\"> A 2 day Music festival in Mid-June since 2005.</do>\n\n*<do name=\"Õllesummer Festival\" alt=\"\" address=\"\" directions=\"Tallinn\" phone=\"\" url=\"http://www.ollesummer.ee/eng\" hours=\"July\" price=\"\" lat=\"\" long=\"\">Approx 70,000 people attend the festival each year over the course of 4 days.</do>\n\n*<do name=\"Viljandi Folk Music Festival\" alt=\"\" address=\"Viljandi\" directions=\"\" phone=\"\" url=\"http://www.folk.ee/festival/en\" hours=\"July\" price=\"\" lat=\"\" long=\"\">Annual folk music festival in a small but picturesque town of Viljandi. Each year the festival draws over 20,000 visitors.</do>\n\n*<do name=\"Saaremaa Opera Days\" alt=\"\" address=\"Saaremaa\" directions=\"\" phone=\"\" url=\"http://www.concert.ee/index.php?lang=eng\" hours=\"July\" price=\"\" lat=\"\" long=\"\"></do>\n\n*<do name=\"Leigo Lake Music Festival\" alt=\"\" address=\"near Otepää\" directions=\"\" phone=\"\" url=\"http://www.leigo.ee/en\" hours=\"August\" price=\"\" lat=\"\" long=\"\">Open-air concerts are held in completely natural venues on the hilly landscapes of the [[Otepää]] highland. The musicians' stage is on an island in the lake, surrounded by thousands of listeners on the sloping shore.</do>\n\n*<do name=\"Birgitta Festival\" alt=\"\" address=\"Tallinn\" directions=\"\" phone=\"\" url=\"\nhttp://www.birgitta.ee\" hours=\"August\" price=\"\" lat=\"\" long=\"\">Music and theatre festival, held at the ruins of the historical Pirita (St. Bridget's) convent.</do>\n\n===Sport Events===\n\n*<do name=\"Simpel Session\" alt=\"\" address=\"Tallinn\" directions=\"\" phone=\"\" url=\"http://www.session.ee/\" hours=\"Summer/Winter\" price=\"\" lat=\"\" long=\"\">International skateboarding and BMX event.</do>\n\n===Self Guided Tours===\n\nSelf guided tours are a good way to discover Estonia by yourself. For more information please visit the  [http://www.visitestonia.com/en/things-to-see-do/self-guided-tours self-guided tours] and [http://www.visitestonia.com/en/fullmap/view interactive maps] sections on the official tourism website.\n\n==Buy==\n===Currency===\n{{Euro}}\n\nThe Estonian kroon (EEK) ceased to be legal tender on January 15, 2011, but any kroons you have left over can be changed into euros at the Bank of Estonia [http://www.eestipank.ee] at a fixed rate of 15.6466 kroon to €1.\n\nATMs and currency exchange offices (''valuutavahetus'') are widely available. You will get the best rates by exchanging only after arrival in Estonia. Avoid changing money in the airport or port as the rates are lower.\n\n===Costs===\nEstonia is generally cheaper than Western Europe, but it is no longer the bargain basement it used to be in 1990s; and in touristy areas (say [[Tallinn]]'s Old Town), prices may be at Scandinavian levels.\n\nIn July 2012 bottle of local beer (0,5l) costs around 1€ in shops and 2,5-3,5€ in modest pub.\n\n==Eat==\nEstonian food draws heavily from German and Scandinavian cuisine.  The closest thing to a national dish is ''verivorst'', black pudding, served with ''mulgikapsad'', which is basically sauerkraut stew. \n\nMany types of food are close to Russian and have their equivalents almost exclusively in the former USSR, such as sour cream ''hapukoor'', smetana in Russian, a sour 20%-fat milk dressing for salads, especially \"kartulisalat\" or \"potato salad\", which isn't that rare anywhere else either, really.\n\nAs Estonia used to be a food mass-production powerhouse in the times of the USSR, some of its foods, unknown to Westerners, are still well-recognized in the lands of the CIS.\n\nAmong other everyday food, some game products are offered in food stores in Estonia, mostly wild boar, elk sausages and deer grill. Some restaurants also offer bear meat.\n\nFor those with a sweet tooth, the national chocolate manufacturer is \"Kalev\", with many specialist stores around the country as well as supermarkets retailing the product.\n\nThe more adventurous may want to try \"kohuke\", a flavoured milk-curd sweet covered with chocolate and available at every supermarket.\n\n==Drink==\nLike their neighbours the Finns and the Russians, the Estonians know their alcohol.  The two largest breweries are '''Saku''' [http://www.saku.ee] and '''A. Le Coq''' [http://www.alecoq.ee], which both offer a variety of different beers. Recent years have seen a surge in local micro-breweries, the products of which are becoming more and more available in larger shops. Baltic Porters ('''Põhjala öö''', '''Saku Porter''') are strong and heavy dark beers with a touch of caramel to be had in winter.\nThe best-known local vodka is '''Viru Valge''' (Vironian White) [http://www.viruvalge.ee/] and then there's the surprisingly smooth and tasty rum-like herbal liquor '''Vana Tallinn''' (Old Tallinn) [http://www.liviko.ee/products/liviko-products/liqueur/vana-tallinn/?verify_age=1], famous in the countries of former USSR.\n\nA local soft drink is \"Kali\" (the Estonian equivalent of \"kvass\"), made from fermented brown bread. It can be described as an acquired taste.\n\nMany locals also swear by \"keefir\", a fermented milk concoction.\n\n==Sleep==\n\nNumber of hotels has exploded from few to tens and hundreds after Estonia restored independence. In 2004, [[Tallinn]] achieved first place among the Baltic Sea cities in the number of overnight stays in hotels, though still behind Stockholm and Helsinki in the number of total overnight stays. \nA list of bigger hotels as well as some restaurants and nightclubs could be found at '''Estonian Hotel and Restaurant Association''' [http://www2.ehrl.ee/index.php?lang=2]. \n\nAs Soviet collective farms were disbanded, many farmers switched to running \"turismitalud,\" or tourism farms, which are inexpensive and indispensable places for spending holidays in nature, usually in a former farm house. A site on '''Estonian Rural Tourism''' [http://www.maaturism.ee/new/index.php?keel=eng] provides information on the tourism farms in Estonia. Hostels are a another popular option for budget-sensitive travellers; see the website of the '''Estonian Youth Hostel Association''': [http://www.hostels.ee]. You may find lot of beautiful manor houses in Estonia, where you may have a delicious meal in restaurant or stay in comfortable hotel. One hour drive from Tallinn you may find [http://www.palmse.ee Palmse Manor], [http://www.vihulamanor.com Vihula Manor], [http://www.sagadi.ee Sagadi Manor], [http://www.kau.ee Kau Manor]\n\nThe official tourism site Visitestonia.com [http://www.visitestonia.com/en/things-to-see-do/estonia-for-people-like-you/budget-travellers-backpackers] also has information and listings about B&B accommodation, youth hostels, camping and caravan sites etc.\n\n==Learn==\nEstonia has a fair amount of foreign students studying in its universities, especially from Nordic countries, as Estonian diplomas are recognized throughout the EU.  See the articles for university town [[Tartu]] and capital [[Tallinn]] for details.\n\n==Work==\n\nNo obstacles exist to citizens of EEA countries to come to invest and work in Estonia. Citizens of developed non-EU countries are exempt from short-term tourist visas. Swedes and Finns have by far the largest working community of post-Soviet foreigners in Estonia. Estonia may have had rocketlike growth in recent years, but only from a very low base as a former Soviet republic, and average local monthly salary (4th quarter 2007) is around 800 EUR.\n\n\nEducation is highly valued in Estonia because as a small nation with no exceptional natural resources, they believe that the only way to be competitive is to absorb knowledge. There are so many highly educated people in Estonia that it is a problem in the labour market - there aren't enough workers for jobs that require minimal education.\n\nConsiderable investments and some workers are constantly coming from CIS countries, though significant legal restrictions are imposed.\n\n'''Police and Border Guard Board''' [http://www.politsei.ee/en/] is the authority responsible for dealing with the paperwork.\n\n'''CV Online''' [http://www.cvonline.ee/] is one of the oldest Estonian recruitement and HR services operating in 9 countries (as of 2005).\n\n==Stay safe==\n\nThe published crime rate increased dramatically in 1991-1994 after democratic freedoms were introduced. In a large part, this is due to the fact that crime was a taboo subject before 1991, as Soviet propaganda needed to show how safe and otherwise good it was. The murder rate per 100,000 inhabitants, as of 2000, was some 4-5 times higher than in Sweden and Finland, although still significantly lower than in its biggest neighbour, Russia.\n\nToday, the official sources claim that the country has achieved a considerable reduction in crime in the recent years. According to Overseas Security Advisory Council crime rate in 2007 was quite comparable to the other European states including Scandinavia. Criminal activities are distributed unevenly across the territory with almost no crime in the island areas and a considerable rate of drug dealing in the predominantly Russian-speaking industrial area of North-East. In [[Tallinn]], petty crime is a problem and there are some incidents involving tourists, mainly [[Pickpockets|pickpocketing]] (especially in the markets). Tallinn Old City and other main tourist attractions are closely watched by local police and private security companies.\n\nMany Estonians drive carelessly, with about 60 to 80 people killed and 1000 people injured per year. Number of deaths in traffic related accidents per 100 000 people are similar to South-European countries like Portugal or Italy. Estonia has strict drink-driving laws with a policy of zero tolerance, but accidents involving intoxicated drivers are nevertheless a major problem. Estonian traffic laws requires headlight use at all times while driving and use of a seatbelts by all passengers is mandatory.\n\nRecently, Estonia enforced a new law requiring pedestrians to wear small reflectors, which people generally pin to their coats or handbags. Although this law is rarely enforced in cities, reflectors are very important in rural areas where it may be difficult for motorists to see pedestrians, especially in winter months. Violators of this law may be subject to a fine of around €30-50, or a higher fine up to around €400-500 if the pedestrian is under the influence of alcohol. Reflectors are inexpensive and you should be able to find them at many supermarkets, kiosks, and other shops.\n\nThe Estonian police are very effective and they are not corrupt as opposed to neighboring [[Russia]] or [[Latvia]].\n\nThe main advice to anyone worried about personal security is to stay reasonably sober despite tempting alcohol prices. When driving, make sure you have had absolutely no alcohol beforehand.\n\nFor emergencies call '''112'''.\n\nIt has been mentioned that ordinary Estonians are unlikely to approach a complete stranger or a tourist on their own. If somebody suddenly turns to you in the street (with questions or matters of small business) keeping a cautious eye on your belongings would be wise.\n\n'''Open homosexuality''' may be met with stares. The civil partnership act was adopted in 2016.\n\n==Stay healthy==\n\nFor an Estonian, it is considered \"mauvais ton\" not to criticize the Estonian healthcare system. Recent EU studies showed, however, that Estonia occupies a healthy 4th place in the block by the basic public health service indicators, on the same level as Sweden. In fact, around 1998-2000, the Estonian healthcare system was remodeled from the obsolete USSR model, directed to coping with disastrous consequences of large-scale war and made more up-to-date by the experts from Sweden. Estonia has harmonized its rules on travelers' health insurance with EU requirements.\n\nFor fast aid or rescue, dial 112.\n\nEstonia has Europe's highest rate of adult '''HIV/AIDS''' infections, currently over '''1.3%''' or '''1 in 77''' adults. Generally, the rate is much higher in Russian-speaking regions like Narva or Sillamäe. Don't make the situation worse by not protecting yourself and others.\n\nInformation about health care in Estonia is provided by the government agency [https://www.haigekassa.ee/en Eesti Haigekassa].\n\n==Respect==\n\n* It's easy to mistake Estonians somewhat rude, depressed and unwelcoming, due to the fact that they can be very direct and that small talk generally doesn't come easy. This is just a matter of culture. Don't expect them to deliver too many social niceties or small talk, Estonians only say what's seasonable. It's uncommon for people to chit-chat with strangers wherever they go, including on the bus. Once the ice is broken, you will find them open and candid. \n\n* Estonians respect physical distance. The most common greeting is a handshake. Hugs are exchanged between family members and close friends. \n\n* Estonians thrive themselves on a strong work ethic and do what they say. At the same time they expect others to keep their word. Friendships and acquaintances for this reason are highly valued, and just like in [[Latvia]] and [[Lithuania]], friendship is something that develops in the long term. \n\n* Due to a lack of immigration, modern Estonia is a very homogenous society. If you are a non-white traveller do not be surprised (or alarmed) if some people stare at you as they may have never seen someone of your complexion before.\n\n* Always deliver a simple apology even for being a few minutes late to an appointment. Punctuality is a norm and is much appreciated.\n\n* Do not raise your voice in a conversation. A decent silent conversation is the Estonian way of doing business. For similar reasons, don't be surprised if an Estonian responds back in a few moments; They prefer to listen more than they like to speak.\n\n* Avoid asking personal questions and don't be offended if nobody inquires about your family or personal life. Privacy is highly valued in Estonia, and engaging in probing behaviours like asking them about their salaries and so forth is a quick way to make Estonians lose their respect and appreciation for you. Avoid bragging about your accomplishments and desires; modesty is a virtue. \n\n* Do not haggle. Haggling shows disrespect to a vendor or seller and it is important to note that all prices at stores and markets are fixed and will not change. \n\n* Use compliments sparingly. Like in several European Nations, hurling too many compliments at someone is considered superficial behaviour and Estonians in general would get offended if you choose to shower them with compliments. Just deliver the simple niceties like \"Nice Sweater\" and so on, and move on.\n\n* If you are invited to an Estonian home, always remove your shoes. Bringing a small gift such as pastry, wine, or flowers to the host is appreciated. \n\n* Contemporary history may be a complicated subject. Estonia`s stance on their history with the USSR is emotional because the country suffered greatly due to the 50 years of Soviet occupation. However, Estonians are usually open to share the experience of the era if easily asked, this is by no means a no-go-zone in conversations. Just be aware of the tragic events of history that led the previously prosperous country into the 50 years of repression. \n\n* Around a quarter of Estonia's population is Russian-speaking with high concentration in the capital, Tallinn, and in the North-East of Estonia. Make sure that you understand whom you are addressing. A foreigner who initiates a conversation in Russian may get a frosty reception from some Estonians.\n\n* As a small nation, Estonia's souvenir shops are often filled with characteristic items from neighbouring countries, for example with Russian [https://en.wikipedia.org/wiki/Matryoshka_doll matryoshka dolls] or Baltic amber. While both of them are popular among tourists, it is worthwhile to understand that neither of them have any historical or cultural connection with Estonia.\n\n==Contact== \n\n===Internet===\n\n* Access to '''wireless, free internet''' [http://www.wifi.ee/?p=area&lang=eng] is widespread in Tallinn and Tartu.\n* On the open road you will often find petrol stations which offer wireless internet access too\n* If you do not have a laptop, public libraries offer free computers\n* The number of '''internet cafes''' is dropping but you will find several open almost all night in Tallinn and Tartu (expect to pay around 2-3 EUR per hour)\n* Most hotels also have a computer with internet access available\n* The departure lounge at Tallinn airport has several free internet access points for passengers\n\n===Landlines===\n\n* For local calls, dial the 7 or 8 digit number given.  There is no \"0\" dialed before local numbers\n* For international calls from Estonia, dial \"00\" then the country code and number\n* For international calls to Estonia, dial \"00\" from most countries or consult your operator, the country code \"372\" and the 7 or 8 digit number \n* For emergencies, dial \"112\".\n\n===Mobile phones===\n\n* \"Everyone\" has a mobile phone in Estonia\n* To ring Estonia from abroad, dial '''+372''' before the number\n* Mobile access is available everywhere, even on the smaller islands and at sea\n* '''Prepaid (pay-as-you-go) SIM cards''' and their top up cards can be bought from R-kiosks (ask for a \"kõnekaart\" - calling card in English). Popular brands are Smart, Simpel, Diil and Zen. Start-up packages are in a range of €1,55-€10.\n\n===Postal Service===\n\n* Within Estonia, the postage cost for a letter up to 50 grams is €0,45.\n* To other EU countries, Norway, Switzerland, Russia, Belarus and Ukraine the cost is €1,00 and to the rest of the world €1,10.\n* Be sure to mark all air mail pieces with \"Prioritaire/Par Avion\" stickers available at the post office, or clearly print it on the mail if needed.\n* Stamps are sold at post offices usually open during normal shopping hours, and also at newsstands.\n* Post offices open on Saturday but for shorter hours than during the week, and are closed on Sundays.\n\n[[ca:Estònia]]\n[[de:Estland]]\n[[eo:Estonio]]\n[[es:Estonia]]\n[[fi:Viro]]\n[[fr:Estonie]]\n[[hi:एस्टोनिया]]\n[[hu:Észtország]]\n[[it:Estonia]]\n[[ja:エストニア]]\n[[nl:Estland]]\n[[pl:Estonia]]\n[[pt:Estônia]]\n[[ro:Estonia]]\n[[ru:Эстония]]\n[[sv:Estland]]\n[[wts:Category:Estonia]]\n\n\n[[WikiPedia:Estonia]]\n[[Dmoz:Europe/Estonia/]]\n[[World66:europe/estonia]]\n\n{{isPartOf|Baltic states}}\n{{outline}}\n{{countryguide}}"
        }
    }
}