{
    "parse": {
        "title": "Guyana",
        "pageid": 450,
        "wikitext": {
            "*": "{{pagebanner|Guyana BAnner.jpg}}\n\n{{quickbar\n| image=Parliament Georgetown Guyana.JPG\n| caption=Parliament of Guyana, Georgetown\n| location=Guyana in its region.svg\n| flag=Flag of Guyana.svg\n| capital=[[Georgetown (Guyana)|Georgetown]]\n| government=Republic\n| currency=Guyanese dollar (GYD)\n| area=''total:'' 214,970 km<sup>2</sup><br />''water:'' 18,120 km<sup>2</sup><br />''land:'' 196,850 km<sup>2</sup>\n| population=767,000 (2006 est.)\n| language=English, Amerindian dialects, Creole, \n| religion=Christian 50%, Hindu 35%, Muslim 10%, other 5%\n| electricity=110-240V/60Hz (USA plug)\n| callingcode=+592\n| tld=.gy\n| timezone=UTC-3 to UTC-4\n}}\n'''Guyana''', [http://guyana-tourism.com/tourism/], is a country in north-eastern [[South America]]. It has an Atlantic Ocean coastline in the northeast, and lies between [[Suriname]] to the east and [[Venezuela]] to the west, with [[Brazil]] to the south.\n\nIt is now the third-smallest country in South America after [[Suriname]] and [[Uruguay]].\nThe name Guyana (from Arawak Wayana) means \"Land of many waters.\" \nIt is related to the name [[Uruguay]]: River of the colorful birds,\nanother country in South America.\n\n==Understand==\nSurrounded by the Atlantic Ocean to the north, and Venezuela, Brazil and Suriname on all other sides, Guyana is one of South America’s least discovered countries and a powerhouse of nature.  It boasts of miles of sun-bleached savannah, dense rainforests, hundreds of kilometers of coastline in the north, four large snaking rivers and waterfalls falling from rocky outcrops. With a small population of 746,955 spread over 214,970 sq metres of the country’s length and breadth, Guyana feels delightfully uncharted and is a popular destination for wildlife and adventure travellers. Most of the people live near the coastline, reserving most of the land for the forests and river systems, and their wild inhabitants. Guyana is part of the Guiana Shield that comprises of 18% of the world’s rainforests, giving ample reason for a variety of wildlife, birds, amphibians and biodiversity to flourish.  It is well connected to major cities in the United States, Europe and Caribbean, making it easy for serious wildlife enthusiasts to come in search of Giants of Guyana (jaguar, giant river otter, arapaima, harpy eagle, giant anteater, black caiman, victoria amazonica and capybara), amongst hundreds of other species of mammals, birds, trees and fish. Guyana aims to become one of the leading nations for sustainable tourism thanks to a clear vision and Green State agenda on sustainability and conservation.  It encourages low impact travel and has guidelines towards protection of its cultural heritage and natural ecosystems. \n\n==History== \nThe Indigenous Peoples (Amerindians) were the original settlers of Guyana, who still live in sync with nature in villages all across the country. One can trace their roots to 9000 BC, when they arrived in search of a fertile land for herding cattle. To date, the Indigenous Peoples have largely kept to their nomadic lifestyle. Many communities still sustain on controlled hunting and gathering, apart from farming. Cassava is of the main crop that is grown, which, in turn, is used as a chief ingredient to make cassava bread and farine. Several petroglyphs around the country shed light on the hunting themes and life in the ancient wild.\n\nModern history left Guyana with a mixed lineage and disruptive political backdrop until 1966 when the country was finally free of colonial presence. Before then, it went through centuries of rule by European nations until the British took rule. It started with Christopher Columbus anchoring on the shores, and then later Sir Walter Raleigh setting foot to find the fabled city of gold, El Dorado. The Dutch, who entered in the 1600s, had different plans. They rooted themselves in sugar plantations along the coast. The Anglo-Dutch War soon disrupted this in 1665 when the English, fueled by the rapid colonisation around the world, came to uproot the Dutch strongholds. Late 17th and early 18th centuries saw the ascent of the French rulers, attacking the Dutch colonies three times within twenty-five years. But the Dutch held sway for most part of the 18th century, until the British returned with more aggressive plans. For two decades, the French, Dutch and British swayed the control between each other, till finally, the British triumphed above all in 1803 – and remained at the helm till 1966. \n\nWhat started as trading practices between the Indigenous Peoples and the Dutch in the 16th century, soon unfolded into the latter making more firm settlements to cultivate their own sugarcane, coffee, cotton and tobacco. To sustain the workforce, they enlisted slaves from African nations. The first rebellion took place in 1763 in Berbice. A memorial in Guyana’s capital, Georgetown, testifies the bravery of Cuffy, a prominent slave hero. The dwindling military influence on the slaves was timed with the British taking the reins, bringing with them half-hearted slave-trade in 1806. It was in 1834 that the Emancipation Bill took effect that slavery was eventually a thing of the past, but not until four to six years of apprenticeship. Total freedom came about only in 1838.  When sustenance of plantations became an issue without the devoted workforce, East and South Indians were sent from across the world, till as late as the 20th century. To date, you can see people of mixed race in the country, which ironically also gives it a secular and interesting socio-cultural fabric. \n\nPolitics in Guyana is hinged on two major parties – the People’s Progressive Party (PPP) and People’s National Congress (PNC). Cheddi Jagan formed the PPP just after World War II. He was a dentist turned politician from an East Indian background. The PPP once had the support of Indian-descent and African-descent communities, as Linden Forbes Burnham, a lawyer of African descent, supported it. Elections in 1957 were monumental, as the Jagan faction of the PPP won political control of parliament. Burnham took his faction out of the PPP due to an ideological rift and formed the PNC. Early 1960s was a period of great social and economical turmoil for Guyana, but things have looked up for the last few decades. As a country facing significant economic ordeal, Guyana had a few things to highlight. For example, in 1997, Janet Jagan, became the first female Prime Minister of the country – a rarity around the world. With its tremendous natural resources like bauxite, rice, gold, sugar, fish and timber, Guyana is now able to wield its economic muscle and is on way to becoming a robust economy.\n\nGuyana today is a wonderful mélange of multicultural communities living in big cities like Georgetown and Lethem, and far-flung villages occupied by Indigenous Peoples.  It is culturally robust and has commercial success hinged on sectors like gold and diamond mining, tourism, and the newfound oil. The oil and gas and exploration activities have been going on in the country for the past decade, but 2015 marked the year of significant discoveries of the same.\n\n==Climate==\nAs a tropical country, Guyana is usually warm through the year. The temperature rarely goes above above 30 C/ 86 F. The cool trade winds blowing from the Atlantic Ocean make it easier to be outside and explore. In the interiors, the mountains and the forests help keep the temperatures low.  The two main seasons of Guyana are the green (wet) and  peak (dry).  May to September is the green season where the interiors are practically inundated, but gorgeous for nature lovers. For the birding enthusiasts, a trip during the this season means that the boats can get you close to the nesting sights. Both the savannahs and rainforest are best during the peak season (September to April) for outdoor activities like fishing, caiman tagging and birding. \n\n==='''Geography & Terrain'''===\nGiven its impenetrable rainforests, river systems, mountains and proximity to the ocean, Guyana is blessed with diverse landscapes. It lies 4.8604° N, 58.9302° W, sandwiched between the Atlantic, Suriname, Brazil and Venezuela. The coastal plains bordering the northern edge of the country, near the Atlantic, are made up of marsh and swamp. Massive mud flats spill kilometers into the sea. The interior highlands offer a more dramatic setting. Here craggy flat-topped mountains and plateaus, are fractured by Rupununi savannahs. The Pakaraima Mountains guard the western border along with the famous Mount Roraima as the tallest peak (2762 meters) of the country.  The Pakaraimas are where an annual 4x4 safari is organised over 8 days. The Kaieteur Plateau lies on the southern edge of the Pakaraimas, letting the namesake falls plunge 741 feet as one of the world’s most powerful single drop waterfalls. On the southern part of the country, the Kanaku Range and Akarai Mountains give adventurers plenty of reasons to visit. \n\nGuyana is home to four legendary rivers - Corentyne, Berbice, Demerara, and Essequibo. Scored of tributaries break the visual flow of the rainforest cover as the rivers form serpentine bends through the country before spilling into the Atlantic in the north. \n\n==Regions==\nGuyana is fragmented into 10 administrative regions that are awarded with natural attractions.  Hikes, nature trails, 4X4 adventures, fishing, bird watching, river tours, caiman watching, and community-oriented experiences headline the different regions. The locals are completely in tune with the natural surroundings and help travellers find their rhythm with local life and the tranquil forests. Booking with experienced operators allows ease of travel and booking, especially in the interiors, where connectivity is pleasantly elusive.\n\nRegion 1 - Barima Waini\nRegion 2 - Pomeroon-Supenaam\nRegion 3 - Essequibo Islands-West Demerara\nRegion 4 - Demerara- Mahaica\nRegion 5 Mahaica-Berbice\nRegion 6 - East Berbice - Corentyne\nRegion 7 - Cuyuni-Mazaruni\nRegion 8 - Potaro-Siparuni\nRegion 9 - Upper Takutu- Upper Essequibo\nRegion 10 - Upper Demerara-Upper Berbice\n\n==Regions==\n[[Image:Guyana Regions map.png|thumb|right|350px|Map of Guyana with regions colour-coded]]\n\n{{Regionlist\n\n| region1name=[[Guyanese Coastal Plain]]  \n| region1color=#e2ea89\n| region1items=[[Georgetown (Guyana)|Georgetown]], [[Bartica]], [[Mabaruma]]\n| region1description=\n\n| region2name=[[Guyanese Highlands]]\n| region2color=#71b37b\n| region2items=[[Lethem]], [[Paramakatoi]]\n| region2description=\n\n| region3name=[[Berbice-Corentyne]] \n| region3color=#e7ac5c\n| region3items=[[Linden (Guyana)|Linden]]\n| region3description= \n}}\n\nFor ease of understanding, it is easier to club the regions as below:\n\n'''Georgetown and around'''- The capital city of Georgetown is packed with cultural insights, historical monuments and stunning Government buildings. It offers a quick orientation to the country at large before one heads out to more remote parts.  The museums and monuments are an essential part of the sightseeing trail. Discover Guyana’s Indigenous culture at the Walter Roth Museum, National Museum, Museum of African Heritage and more contemporary collections like Roy Geddes Steel Pan Museum and National Art Gallery. The Lighthouse, the Dutch-built seawall, traditionally built meeting place called Umana Yana and the African Liberation Monument are other reminders of Guyana’s history. The sightseeing is headlined by the 19th century St. George’s Cathedral in the centre of the town. The parks and promenades of Georgetown offer a visual relief from the traffic. The Botanical Gardens and the Zoo are perfect to stroll through. Also visit the Stabroek and Bourda markets to witness the action in the form of hundreds of shops selling anything from clothes, electronics, books to vegetables, fruit and fish.\n\n'''Demerara and around'''- The 340km of Demerara River offers a stunning background to historical towns on its banks, resorts for weekend getaways, birding hotspots and a private museum. Garry Serrao’s private museum in Demerara has a collection of colonial and Guyanese memorabilia like utensils, stamps, glassware, books, and artifacts. Monuments and museums around Linden are also worth a stop. The Linden Museum of Socio-Cultural Heritage, Christianburg Waterwheel, St. Matthew’s Church, Watooka House and St. Aidan’s Anglican Church are some of the things to see here. St. Cuthbert’s Mission, located at the banks of the Mahaica River, is a 200-home village that is popular on the birdwatching circuit. One of the most prominent features on the Demerara is the Harbour Bridge that connects the East and West Banks.\n\n'''Essequibo and around'''- The Essequibo winds 1000 miles, making it the largest river of the country.  It has 365 islands, each with a historical or natural signature. The region around the Essequibo River is perfect to explore the historical monuments, which were once important buildings during the Dutch colonial rule.  Apart from history, birding and wildlife spotting are the other activities popular on the banks of the Essequibo. Some of the key monuments to see here are the museum housed in the 18th-century Court of Policy, the well-preserved Fort Zeelandia, a 36-foot-tall windmill built with clay bricks on Hogg Island, the 200-years-old St. Peter’s Anglican Church in Leguan Island and the Dutch Fort Kyk-Over-Al.  Sloth Island, Parrot Island and Gluck Island flanked by untouched forests are ideal for nature lovers.  There are a number of resorts that have come up on the banks for the river, and are ideal to visit for a short break from Georgetown.\n\n'''Berbice and around'''- Berbice is one of the low-key tourist areas but hordes vast history related to the sugarcane industry. New Amsterdam and Canje are the main towns that are known for colonial architecture. New Amsterdam Public Hospital, Town Hall, Mission Chapel Congregation Church are worth a visit. In Canje, see the Babu Jan (John) Cemetery, where Guyana’s former President, Cheddi Jagan and his wife, Janet, are laid to rest. \n\n'''North Rupununi and around'''- Wild grasslands and massive tracts of shaded forests, filled with wild inhabitants like leopards, caimans, tapirs, labbas, howler and saki monkeys, and other mammals, are the signature of North Rupununi. The region is also known for hundreds of species of birds, fish and amphibians.  Base yourself in one of the many eco-themed jungle lodges to get a peek into the thick forests of the country. You can take long treks or short walks, or you can take multi-day raft and boat trips with naturalists to see the diverse array of nature. Some of the popular lodges to experience the jungle are Karanambu, Atta Lodge, Surama Eco Lodge, Rewa Eco Lodge, Iwokrama River Lodge, Pakaraima Mountain Inn and Rockview Lodge.\n\n'''South and Central Rupununi''' - Traditionally a ranching region, South and Central Rupununi is covered in bleached grasslands and thick bush areas. You can still find a number of ranches with large cattle heads managed by authentic vaqueros (cowboys). Dadanawa Ranch was once the biggest in the world with thousands of cattle heads. Other popular ranches include Manari, Saddle Mountain and Waikin. Stay at one of these to experience the cowboy life. You might have to base yourself in Lethem to explore the region and its other highlights like Moco Moco Mountain, Kumu Falls, Shulainab and other villages close by. The annual Rupununi Rodeo during Easter is another reason to visit Lethem and Sand Creek. \n\n'''Protected Areas''' - Guyana is home to vast protected areas such as Kaieteur National Park, Iwokrama, Kanaku Mountains, Shell Beach and Konashen. These regions are rife with waterfalls, large rivers, wildlife and birds. Many travellers come here to see the Giants of Guyana, namely, the world’s largest lilies, Victoria Amazonica, jaguars, caimans, river otters, anteaters, arapaimas, capybaras, harpy eagle and the anacondas.  Other natural wonders of the country include the 741 feet Kaieteur Falls, the Pakaraima Mountain Range and Mt. Roraima.\n\n==Culture and People==\nGuyana is lucky to be blessed with a multi-cultural vibe of Indigenous Peoples, East Indians, Africans, Chinese, Portuguese and Europeans all contributing to a delightfully robust culture.  The colonial footprint on the country has left a lineage of different nations. People live in complete harmony, celebrating multiple festivals from different parts of the world. They even have palates tuned to diverse flavours. The ubiquitous curry-rice combo from India is just as popular as cassava bread or farine from Indigenous Peoples. \n\nNine indigenous groups of Arawaks, Arrecunas, Akawaios, Caribs,  Makushis Patamonas, Wapisianas, Warraus, and Wai-Wais make up the indigenous population and are spread all over the country. The population, just under 800,000 mostly lives around the coastal belt - almost a third of them in Georgetown. Other big cities add to this statistic, reserving the 90% of the land for 10% Amerindians. While Georgetown and Lethem in the south are like any other cosmopolitan cities, the far-flung villages of the hinterland are in step with nature and have a great rustic and earthy flavour to them.\n\nMusic is an important part of Guyanese life and takes after its Caribbean neighbours in the love for genres like soca, reggae and chutney. Retro Bollywood is also extremely popular in the country.\n\n===Language===\nEnglish Creolese is the commonly spoken language in Guyana, along with separate dialects of the Indigenous Peoples.  Locals in the South are well-versed in English as well as Portuguese, thanks to the proximity to Brazil. Other languages that are likely to cross the ears are Hindi and Chinese. An observation that is hard to miss is that the northern part of the country aligns to its Caribbean neighbours while the south is more embedded in its South American identity.\n\nGuyana’s backdrop is etched deeply in the culture of Guyana. English is the main language of communication and  the country is the only South American nation where English is the official language.\n\n==Flora and Fauna==\nThe local wildlife and nature experience is sublime. Given its green status, it seems that the land springs life, enriching and replenishing the world’s biodiversity at a rapid speed.  A prolific variety of animals, birds, reptiles and insects, along with exquisite flora, showcase nature’s hand in making this an essential for nature enthusiasts. The impenetrable forests and river systems make easy homes to iconic mammals like the elusive jaguar, the much celebrated-giant anteater and giant river otter, rare reptiles such as black caiman, and one-of-a-kind birds such as the harpy eagle and cock-of-the-rock. Flourishing statistics of 900 plus birds, 225 species of mammals, 880 species of reptiles and more than 6500 plants back the country’s reputation as a serious wildlife destination. \n\nThe Giants of Guyana are often on the list to see in the national park and protected forests. A host of snakes – bushmasters, anacondas, rattlesnakes, labarias and corals – are a big draw. For birders, the charm lies in endless display of colour, sounds and immodest glamour in every part of Guyana. Red siskin, Harpy eagle, Cock-of-the-rock and Hoatzin (national bird) feature high on the list of serious birding groups. The fish are allocated their own pedestal for those who care. About 400 species are identified and around 200 are yet to be mapped in the country. The Arapaima (world’s largest scaled freshwater fish), red-bellied piranha, electric eels and many catfish varieties bless the tanned rivers of Guyana.  These and other prized species of insects and frogs are best seen around the nature lodges and conservation centers, to have the support of naturalists and guides that know the land like the back of their hands. \n\nWorld famous naturalists and authors, David Attenborough and Gerald Durrell have given glowing reviews to the country, as a place that has had profound influence on their work. Amongst the most famous and cherished conservationists in the country, was Ms. Diane McTurk, who laid the groundwork for Guyana as an eco-tourism destination, with her relentless work in rehabilitating the endangered giant otters. Her legacy lives on in Karanambu Lodge, an essential on the rainforest circuit of Guyana.  \n\nThe local wildlife and nature experience is sublime. Given its green status, it seems that the land springs life, enriching and replenishing the world’s biodiversity at a rapid speed.  A prolific variety of animals, birds, reptiles and insects, along with exquisite flora, showcase nature’s hand in making this an essential for nature enthusiasts. The impenetrable forests and river systems make easy homes to iconic mammals like the elusive jaguar, the much celebrated-giant anteater and giant river otter, rare reptiles such as black caiman, and one-of-a-kind birds such as the harpy eagle and cock-of-the-rock. Flourishing statistics of 900 plus birds, 225 species of mammals, 880 species of reptiles and more than 6500 plants back the country’s reputation as a serious wildlife destination. \n\n==='''Giants of Guyana'''===\n\n'''Jaguar - King of the Jungle''' - The rare and elusive jaguar is probably the most famous animal in South America and is considered to be the largest cat and top terrestrial predator on the continent. King of both forests and savannas, jaguars are excellent swimmers and fishers.  They are one of the few cats that regularly go into the water and can easily swim the mighty Essequibo and other rivers.  According to Audubon Magazine, “the Iwokrama Forest may be the best place in the world to see a wild jaguar”.\n\n'''Giant Otter - Playful and Inquisitive''' - Of more than a dozen otter species in the world, the giant river otter is the largest and rarest.  It only lives in South America, and is only one of two otters species found in Guyana. Guyana's giant river otters were first documented at Karanambu Ranch in the North Rupununi in 1988. They can now be found throughout the North Rupununi. A stable population has been present in the area since then and has been chronicled through the giant river otter rehabilitation work of Diane McTurk.\n\n'''Harpy Eagle - Powerful and Majestic Raptor''' - The harpy eagle is the largest eagle in South America and one of the largest and most powerful birds of prey in the world. They are more often seen in the Kanuku and Iwokrama Mountains and in the communities of Surama and Warapoka, where they are estimated to spend 2-3 years in one nesting site. With huge talons similar to bear claws, the harpy can easily grip its prey, which it feeds on in the canopy treetops. Harpy populations are healthy in Guyana because of the vast expanses of untouched tropical forests that they use as hunting grounds. \n\n'''Black Caiman - Aquatic Hunters'''- The black caiman is a large crocodilia and the biggest existing member of the alligatoridae  family. This carnivorous reptile grows to 2.8 to 5 metres (9.2-16 feet) and lives along Guyana’s many slow moving rivers, lakes and in other freshwater habitats. It is the largest predator in the Amazon ecosystem, preying on a variety of fish, reptiles, birds and mammals. Yupukari, an indigenous community with support from the organisation, Rupununi Learners Institute, have made it their mission to protect the species. They establishment Caiman House where visitors can safely help to monitor this endangered species. \n\n'''Giant Anteater - Savannah Explorers'''  - With tiny eyes and ears that greatly contrast its large snout, body and tail, the world's largest anteater is truly an extraordinary animal to see.  Giant anteaters are found mostly in the Rupununi Savannahs of Guyana, and their food of choice, termites, found in giant mounds, can be seen from miles ahead. Although they may appear friendly, these animals may get aggressive if they feel threatened. \n\nAlthough these five are certainly worth checking off your bucket list, your tip to Guyana would not be complete without trying to spot the other giants this wild and pristine country has to offer. Venture out and see how many you can spot in their natural habitat. \n\n'''Arapaima''' - If you’re into fishing, many operators in Guyana can offer you the opportunity for catch and release the world’s largest scaled freshwater fish. Arapaima reach up to 440 pounds and 3 meters (10 feet) in length. Conservation efforts with organisations have significantly improved the population of Arapaima which are a protected species.\n\n'''Green Anaconda'''  - The world’s heaviest and longest snake, the green anaconda is not that difficult to spot when you are venturing across the country. It can be found in rivers, creeks, trenches or just about any riverrain area and feeds on other small reptiles. \n\n'''Capybara''' - Known as the largest rodent in South America, the capybara lives in the savannahs, dense forest or near water sources. \n\n'''Giant South American River Turtle'''- The world’s largest freshwater turtle, the giant South American river turtle, can be found in deep rivers, fresh water sources and flooded forests. \n\n'''Goliath Bird Eating Spider''' - The goliath bird eating spider is a very aggressive tarantula with large fangs and a moderately strong poisonous bite primarily found in the Rupununi rainforest. \n\n'''Victoria Amazonica''' - The victoria amazonica water lily is Guyana’s national flower and the world’s largest lily. It can be found in oxbow lakes, primarily in the Rupununi region. \n\n==='''Iwokrama'''===\nGuyana’s sustainability and conservation efforts are bound to make it one of the leading countries to preserve natural heritage. Amongst the many protected areas, Iwokrama is one of the more popular and well-feted regions. Iwokrama has a number of eco-lodges on the outskirts, making walking trails and boat safaris an exquisite affair. Wildlife and birds are found abundantly around these eco-lodges.  The Iwokrama International Centre was established in 1996 to manage the namesake forest that spreads over 371,000 hectares. It also has a riverside lodge that is open to visitors to stay and get up close with nature. \n\n==Get in==\n\n===Visas===\nA valid visa and a passport with 6 months validity is essential to enter Guyana. Over 60 countries are exempt from obtaining a visa beforehand and can opt for a visa on arrival. The main countries that feature on this list are those in the Caribbean Islands, USA, Canada, other South American nations and parts of Europe. Latest details can be found on www.minfor.gov.gy.\n\nCitizens of the following countries do not need a visa to visit Guyana:\nAntigua and Barbuda, Australia, Austria, Bahamas, Barbados, Belgium, Belize, Canada, Dominica, Denmark, Finland, France, Germany, Greece, Grenada, Ireland, Italy, Jamaica, Japan, North Korea, South Korea, Luxembourg, Montserrat, Netherlands, New Zealand, Norway, Portugal, Russia, Saint Kitts and Nevis, Saint Lucia, Saint Vincent and the Grenadines, Spain, Sweden, Switzerland, Suriname, Trinidad and Tobago, United Kingdom, United States [http://www.guyana.org/govt/visa_requirements.html].\n\nWhen applying for a visa, you will need the application form, a passport valid for at least 6 months, 3 passport size photographs, and proof that shows you have the funds to cover your entire trip to Guyana.\n\nIf your intent is to work or live in Guyana, you will need to obtain a '''letter of approval''' from the Ministry of Home Affairs, and include a copy of it in your submission.\n\nThe general way to submit your visa is through the mail. Submissions must be made to the Guyanese Embassy in Washington, D.C., or, if there is a Guyanese consulate in your country, you can submit it there, too. You can apply for the visa in the Guyanese Embassy in neighboring Suriname, the processing time is 1 day.  \n\nA tourist visa costs USD$30,  single entry business visa costs USD$40, a multiple entry 3 month business visa costs USD$50, and a multiple entry 1 year business visa costs USD$75.\n\nOnce in Guyana, if you want or need to extend your visa, you can do so at the Ministry of Home Affairs in Georgetown.\n\nThe [http://www.cjairport-gy.com/ Cheddi Jagan International Airport] (formerly Timehri Airport) is the main international junction that connects Georgetown, the capital of Guyana, to the rest of the world.  It lies 41 kilometers south of the capital, so it takes about an hour’s drive from here to reach the centre of town.  Leading destinations around the world are connected via multiple air carriers like Virgin Atlantic, Delta Air Lines, British Airways, Air India, Air Canada, Air France and Caribbean Airlines fly into the country. Direct flights are available from cities like New York, Miami, Kingston, Aruba, Port of Spain, Panama City and Toronto. Neighbouring countries like Venezuela, Brazil and Suriname can be accessed via road and sea.\n\nGeorgetown’s Eugene F. Correia International Airport (Ogle Airport) is the main air node to book small Cessna flights to different parts of the country. Popular air carriers that manage the internal routes are Air Services Limited and Trans Guyana Airways.  You have to be careful while booking, as the flight is dependant on minimum bookings and the weather. In the case of fewer bookings, one might have to buy an extra ticket. There are more than 30 airstrips in main and remote regions that connect travellers to the various attractions of the country. Though air travel is the most convenient way of getting around, road and river transportations are also available. One can cruise down the mighty rivers of Guyana with guided expeditions or take local vans or 4x4 to get around. Road travel is definitely slower as one gets to see the landscapes of rainforests, grasslands, mountains and riverbeds. \n\n===By plane===\n\n====Cheddi Jagan International Airport====\n({{IATA|GEO}},{{ICAO|SYCJ}}) Originally called Timehri International Airport in honor of the indigenous displaced peoples of Guyana (Timehri means \"Rock Painting\"), it was re-named Cheddi Jagan International Airport.  There are daily international flights into and out of Cheddi Jagan International Airport (airport code GEO) about 40km south of Georgetown. International flights include flights to the US, Canada, UK and The Caribbean with Caribbean Airlines(formerly BWIA). Caribbean Airlines is a state owned airline run by Trinidad & Tobago. Flights to the Caribbean with Caribbean Star and LIAT.  North American Xtra Airways, which are non- stop flights, on the New York and Guyana route. Primaris Airlines, non- stop flights, flies to Guyana from JFK- New York and FLL.-Florida\n\n====Ogle Aerodome====\n({{IATA|OGL}}, {{ICAO|SYGO}}) A small airfield located slightly closer to Georgetown (~6 mi) which is for a few private charter companies, primarily used for domestic/local flights. The following companies have a few daily flights from/to Zorg-en-Hoop Airfield in [[Paramaribo]]:\n* <listing name=\"Gum Air\" alt=\"\" directions=\"\" address=\"Doekhieweg 03, Zorg-en-Hoop Airport, Paramaribo, Suriname\" phone=\"+597 433830\" email=\"info@gumair.com\" fax=\"+597 491740\" url=\"http://gumair.com\" hours=\"M-Sa\" price=\"\"></listing>\n* <listing name=\"Trans Guyana Airways\" alt=\"TGA\" directions=\"\" address=\"Ogle Aerodome, Ogle, East Coast Demerara, Guyana\" phone=\"592-222-2525\" email=\"commercial@transguyana.net\" fax=\"\" url=\"http://www.transguyana.net\" hours=\"M-Sa\" price=\"\"></listing>\n\n===By train=== \nThere are no international railway services to Guyana nor are there any domestic services.  This is due to the fact that the entire system, the first in all of South America, was scrapped during the Burnham regime.\n\n===By car=== \nGuyana has road access to [[Suriname]] to the east and [[Brazil]] to the south. In Suriname, inquire in [[Paramaribo]] for mini-buses traveling to Guyana. Note that entering Guyana by water travel from Nieuw Nickerie in Suriname is illegal. (Even though there is nobody to stop you). The worst case scenario is that you could be sent back or made to pay for a visa.  When traveling from Nieuw-Nickerie to [[Paramaribo]] over land you will most likely run into a military police roadblock near Totness, but these guys are really after gun and drug smugglers, not tourists. Show your European or U.S. ID card or a valid drivers license and they won't even ask for your passport to check if you have the right visa stamps. It appears they don't mind you entering the country as long as you don't cause trouble and spend your money in their country.\n\nThere are no road links between [[Venezuela]] and Guyana. Travel to [[Venezuela]] may be done by air via [[Trinidad]] (Caribbean Airlines) or overland through [[Roraima]] state in [[Brazil]].\n\n===By bus===\nFrom [[Suriname]], there are minibuses from [[Paramaribo]] to South Drain in western Suriname, just across the river from Guyana. The trip takes at least 3 hrs and costs ~US$15. From there, you will go through customs on the Suriname side. Then take the 11am daily ferry across the river to South Drain. The actual ferry ride takes about 30 minutes, but you'll need more time for going through customs on the Guyanese side.\n\nThe bus ride from [[Lethem]], at the Brazilian border, to [[Georgetown]] takes about 16 hours through rainforest and southern savannah. The ride can be much longer in the rainy season. Sections of the roadway are known to become impassable in heavy rainy weather and extreme care must be taken.\n\nInquire about buses to Brazil at the Guybraz located on Sheriff in central west Georgetown. Buses usually leave very late at night and it is recommended that you take a taxi to the bus station as the area around there is unsafe at night. For buses from Brazil travel to Bonfim on the border and walk across the border. Find a minibus or taxi to take you to Lethem city center and inquire about buses traveling to Georgetown.\n\n==Get around==\nWhen people in Guyana refer to buses, they mean minibuses. Minibuses travel throughout Guyana and are the cheapest way to travel. Minibus fares range from G$60-G$10,000 (US$1 = G$200) depending on the length of the journey. Travel in this mode at night could be risky. It costs G$10,000 between Lethem (on the Brazil border) and Georgetown. Buses leave from Lethem in the late afternoon (various times) and stop just a couple of hours later at about 8:30 or 9pm either near Annai, or a little further along the road. Bring a hammock, or pay G$500 to rent one for the night. They resume the journey at approximately 3am the next morning, and take until 1 or 2pm that afternoon to reach Georgetown, a trip that includes a river ferry crossing, and several police (the nice kind) checkpoints. A lot of sandy, bumpy, divety road.\n\nMany parts of Guyana are separated by large rivers. These areas can be traversed by way of river taxi. Go to the port village and ask from where the speedboats launch. Ask other passengers what the fare is while traveling as boat operators tend to seek higher fees from tourists. Do not take \"specials\" without first negotiating the price. \n\nTaxis are a good way to get around in Georgetown. Fares should never be more than G$500 for travel within the city and most fares should be around G$400. All taxis license plates begin with 'H.' There are set prices for taxis for different destinations, e.g. from the airport to town costs GD$5,000, from the airport to Molson Creek is GD$24,000, etc.\n\nOne can also rent cars or 4x4s; check the local telephone listings for car rentals. Consult more than one rental agency as prices can vary. You might also be able to negotiate the prices charged to some extent. Deposits are usually required. If renting a vehicle, be sure to inquire whether your driver's license will be acceptable. Violations of traffic laws can result in much time wasted and possible trips to the local courts.\n\n\n=='''Major Cities and Towns'''==\nThere are not too many urban centers in Guyana, with most of the land attributed to wild swathes of nature. But there are a few that make for a good base city to explore the regions around. \n\n'''Major Cities'''\n\n'''Georgetown''' – Georgetown is the capital and the biggest city of Guyana with most of the population of the country settled or working here. It is also the main urban centre for commerce and governance. The city is located on the coast of the Atlantic Ocean and the east bank of Demerara River. Georgetown is the headquarters of CARICOM, a Caribbean community made of 15 nations that encourage economic integration and cooperation among its members. There are several monuments, museums and parks to interest the travellers. Some of them are the National Library, Umana Yana, St. George's Anglican Cathedral, Walter Roth Museum of Anthropology, Lighthouse, National Museum of Guyana, seawall and the monument of African Liberation.\n\n'''Linden''' – This is the second biggest urban center and the capital of the Upper Demerara-Berbice region in Guyana. The town is based on the banks of the Demerara River and is an integral Bauxite mining junction for over 100 years. Linden is best known for historical monuments and the Gluck Island, off the Essequibo River. It is one of the rare places where one can witness the blossoming of the Victoria Amazonica water lily. Over 200 species of birds can be found here along with black caimans and giant otters. The Linden Museum of Socio-Cultural Heritage, Christianburg Waterwheel, St. Matthew’s Church, Watooka House and St. Aidan’s Anglican Church are other notable buildings.\n\n'''New Amsterdam''' - Located in the East Berbice-Corentyne Region of Guyana, New Amsterdam is the third largest town of the country. The port town lies on the eastern bank of the Berbice River. New Amsterdam Public Hospital, Town Hall and Mission Chapel Congregation Church are reminders of Guyana’s colonial history.\n\n'''Bartica''' – Region 7’s Bartica is located on the confluence of the Cuyuni and Mazaruni Rivers and the Essequibo River in Guyana.  It is often hailed as the gateway of the mining regions, and has a diverse mix of people who live here, including mining workers from Brazil. The town is best known for the annual Easter Regatta, when thousands throng the small town and its beach to see motorboats and cultural shows. The street parade, Miss Bartica Regatta Pageant,  and sports are other highlights of the event.\n\n'''Parika'''- Essentially an important ferry point along the Demerara, Parika is a well-know base for travel activities. It allows access to islands like Leguan, Fort Kyk-Over-Al, Court of Policy and Fort Zeelandia. It is also known for a Sunday market.\n\n'''Lethem''' – Located in the Upper Takutu-Upper Essequibo Region of Guyana, Lethem is the gateway to South and Central Rupununi, and the home to the annual Rupununi Rodeo – one of the biggest festivals of the country. It is named after Sir Gordon James Lethem, the Governor of British Guiana from 1941 to 1947. Lethem is the perfect base to explore the ranches around, explore villages like Shulainab, hike to Moco Moco Mountain and Kumu Falls, and even visit neighbouring Brazil. The Takatu River forms the edge of the country, which one can cross and reach Brazil’s Bonfim town.\n\n'''Anna Regina -''' The town has the best of both waterfronts reserved for it – the Atlantic along its eastern edge and the Essequibo running along the north. The breezy town makes wandering an easy affair. Step out to explore the Anna Regina High Bridge built by the Dutch, a memorial to commemorate the arrivals of the East Indians and the 19th century St. Bartholomew Anglican Church. Two memorials – Damon’s Cross and Damon Monument- pay homage to another hero of the slaves’ uprising in 1834.\n\n\n==See==\nGuyana is mostly known for its natural treasures in deep rainforests, winding rivers and massive array of mammals, birds, amphibians and flora. Culturally rich with historical monuments from colonial occupation and Indigenous relics, the traveller has a vast opportunity to see and do much in the country. Most of the major sightseeing options lie in and around Georgetown.\n\n'''Major Sights'''\n\n'''Walter Roth Museum, Georgetown''' - Housed in a late 19th century building with typical Demerara shuttered windows and a timber column, the exterior of the Walter Roth Museum is just as impressive as the interior. Prepare to walk through the vibrant life of the nine Indigenous Peoples segregated by themes, in different sections. It documents a vast collection of objects of daily use, craft, food and cultural practices of the fascinating tribal life. The museum offers an insider’s view to the villages, which is an excellent orientation before you head out to the interiors to experience it first-hand.\n\n'''National Museum, Georgetown''' - An extensive assortment of beautifully preserved animals representing most of Guyana’s diverse fauna is the highlight of the National Museum. A stroll around these exhibits will quickly open your eyes to Guyana’s tremendous biodiversity and will provide a peek into what one might expect deep in the rainforest. \n\n'''National Art Gallery, Georgetown''' - Walk through a grand collection of Guyanese art in the National Art Gallery, which has a fascinating history of being the house of the country’s former Prime Minister, Forbes Burnham. Prior to becoming the residence of the Prime Minister, it had been the home to a Maltese architect, Cesar Castellani, christening the building, Castellani House. Today, the gallery promotes the work of local artists revealing the inspirations and talent pool of the Guyanese art scene.\n\n'''Museum of African Heritage, Georgetown''' -The museum is an expertly curated collection of African musical instruments, art, textiles, clothing and games. It was once the residence of historian, Dr. Herbert Nicholson, who donated the space and also contributed the first 200 art pieces. Though limited in size, it warrants a short stop to walk through the extremely informative exhibits. \n\n'''Roy Geddes Steel Pan Museum, Georgetown''' - This precious addition to museum trawling in Georgetown will leave you delighted. The museum is a haven for steel pan music lovers, where one can view photographs, drums raw materials and souvenirs that document Geddes’ life around this one-of-a-kind music. His own garden makes for a heartwarming background to the exhibits.\n\n'''Sugar Estate: Uitvlugt, Georgetown'''  - Visit the Dutch rooted Uitvlugt estate as homage to the flourishing sugarcane business that gave rise to the history of slavery in Guyana. The trip is poignant and at the same time captivates you, as you ride in a jeep to inspect lush fields as far as your eyes can see. The sugarcane-covered terrain has a maze of canals running in between, where heavy loading pontoons glide through the water to carry the canes right to the factory. Processing takes place over loud clanking machinery, so it’s best to listen to the guide before you step in. Wander inside the maze of machines to see the intriguing world of sugar and its byproducts.\n\n'''St. George's Cathedral, Georgetown''' - The most iconic address in Georgetown belongs to the St. George's Anglican Cathedral. Completed in late 19th century, it towers above the modern buildings and other historic sites in the heart of the city. This is reputedly the tallest freestanding wooden structure in the world. Ironically, the architect who made the drawings, Sir Arthur Bloomfield, never visited the location even once but his drawings resulted in the breeziest and most well lit place of worship in town. Step inside to walk on the wooden flooring made out of the local Greenheart tree, then look up at the high ceiling supported by Gothic-style arches, stained glass windows behind the altar and a dazzling chandelier, which was a gift from the Queen of England.\n\n'''Botanical Park and Zoological Park, Georgetown''' - Though Guyana is blessed with abundant wildlife, they can be hard to spot in the wild. The zoo in Georgetown gives you an option to get up close to a jaguar, boa constrictor, a sloth and even a harpy eagle. For uncaged avian friends, walk along the Botanical Gardens and you could get lucky, spotting about 50 species of birds. Other enthralling creatures in the park are the manatees that live below the Kissing Bridge on a lake, and the Seven Ponds Monument.\n\n'''Umana Yana & African Liberation Monument, Georgetown''' - A Wai Wai benab (hut) in the middle of Georgetown is a fascinating sight amongst the modern buildings. The current structure is a 55 feet tall, thatched roof hall made by the Wai Wai peoples in 2016, replacing the old benab which was burnt to the ground in 2014. Step inside to see the intricately built roof with local materials and supported by wooden rafters. Umana Yana translates to ‘meeting place’, which is exactly what the hall is now used for. Outside Umana Yana lies the African Liberation Monument. Five greenheart poles sprout from the ground to commemorate African freedom fighters.\n\n'''Lighthouse, Georgetown''' - The red and white striped Georgetown lighthouse was once the tallest building of the city, guiding Dutch ships the way to Demerara River from the Atlantic. It has stood here for more than 200 years as an integral part of the signaling systems for incoming ships. See the towering lighthouse from the ground or climb up its winding stairs (with prior permission) to enjoy a bird’s eye view of the city below. \n\n'''The Red House, Georgetown''' - There is no dearth of compelling architecture in Georgetown. Every street has remnants on 19th century styled buildings. The Red House (also known as Kamana Court) makes for a quick stop to see the red wallaba shingles and Demerara shutters on the windows. The building is home to the Cheddi Jagan Research Centre and served as the former Prime Minister’s home for a few years.\n\n'''Pandama Retreat & Winery, Demerara'''  - Craft wine is a whole new genre that is sure to excite wine connoisseurs.  At Pandama Winery, one can choose from the tropical flavours of Guyana and a host of other tonics, herbal wines and even natural vinegars. Think distinct flavours of Pineapple, Jamoon, Aunty Desmond, Noni, Cherry, Malacca Pear, Duka, Carambola and Sorrel. In short, a healthier alternative to regular alcohol. For those who want to ‘get away and get in touch with themselves’ the retreat is an excellent option to unwind in the midst of nature.\n\n'''Demerara Harbour Bridge''' - As the main thoroughfare between the East and West banks of the Demerara River, this pontoon bridge is a staple on the itinerary during a trip to Georgetown. The most exciting part of cruising over the mile and a half long bridge is to get on one side and see small and large vessels cross under it. Retractor spans in the centre of the bridge, open up and allow vessels to sail through. \n\n'''Fort Island, Essequibo''' - Located at the mouth of the Essequibo River, the island bears an imprint of the Dutch in the form of two important structures – the Court of Policy and Fort Zeelandia. Stroll through the manicured lawns of the 1752 built Court of Policy to step into its current avataar, a museum. This is the oldest non-military structure in Guyana has donned many hats as a store, a church, court, seat of government and now a well-curated museum. A short walk away from here is Fort Zeelandia, an 18th century brick fort, which was one of the very first buildings that was constructed in the country. Though a small fort, it was vital as a defensive fortification.\n\n'''Sloth Island, Essequibo'''  - Sloth Island on the Essequibo River doubles up as a perfect romantic as well as an adventure getaway. The days here can be filled with bird watching, nature walks, wildlife spotting, swimming in the creek, canoeing, fishing or just sinking in a hammock. Naturally, sloth bear watching is top priority for most visitors. If you’re staying here for a couple of days, add excursions to Amerindian villages around, Marshall Falls, Trutruba Falls, Kyk-Over-Al Island, Parrot Island and other sights on the Essequibo.\n\n'''Fort Kyk-Over-Al, Essequibo'''  - A brick arch on a grassy island on the Essequibo River is the only remaining part of the once the Dutch fort that kept other European enemies at bay. Kyk-Over-Al translates to ’see over all’ in Dutch, referencing the view to the entire riverfront from this spot.  Stand here and let your imagination take you back in time, when Dutch soldiers would have intensely guarded this slice of land. Now, only a handful of tourists scout it for photo-ops.\n\n'''Hogg/ Hog Island, Essequibo''' - The battle between ‘Hog’ and ‘Hogg’ is constant when you ask locals about the original name of the largest island on the Essequibo. Some attribute it to hundreds of wild hogs that once occupied it. A more rational explanation points to it being named after Quintin Hogg, an Englishman. Regardless, the island is a beautiful one with one main hook – the Hog Island windmill. The 36 feet Dutch structure was built with clay bricks on what used to be Plantation Luyksberg.\n\n\n==Do==\n\n'''Pakaraima and other 4x4 safaris''' - The annual 4X4 Safari is an 8-day self-drive through the Pakaraima mountain range, covering villages, waterfalls, streams, forest trails and steep hills. The safari leaves from Georgetown and ends in Lethem, just in time for the Rupununi Rodeo during Easter. It is essential to have a 4x4 to navigate the rough patches, but the thrill lies also in stopping at far-flung villages, sleeping under the stars and camping in the wilderness. Stunning waterfalls and forested trails with abundant wildlife are the other reasons to be on the safari. There are 3 other safaris organised in the year, of which, the South Rupununi Safari is extraordinary for its savannah-covered route. The remote terrain takes participants to remote Wapishana villages, the famous Shea Mountain and 6,000-year-old petroglyphs around Aishalton. You can opt for more adventure on wheels by hopping on motorbikes or ATVs in safaris organised by Super 7 Group Adventures.\n\n'''Abseiling''' – Another highlight for action-oriented travellers is abseiling down cliff-sides of rocky escarpments. This essentially includes rappelling down steep rocks with the instruction of trained instructors and high performing gear. Abseiling takes place in different parts of Guyana.\n[[Image:Kaieteur_Falls.JPG|thumb|Kaieteur Falls]]\n\n'''Wildlife spotting''' – Guyana’s reputation as one of the leading wildlife destinations of the world has been ratified by world famous naturalists and authors, David Attenborough and Gerald Durrell, amongst many others. Here you can find 900 plus species of birds, 225 species of mammals, 880 species of reptiles, over 200 of fish and more than 6500 plants. Guyana is specifically known for a few spectacular species, often known as the ‘Giants of Guyana’. These are the jaguar, giant river otter, arapaima, harpy eagle, giant anteater, black caiman, Victoria Amazonica and capybara. The large tracts of rainforests and savannah allow spotting in various parts of the country. The Rupununi is especially great for wildlife spotting due to diversity in the landscape.\n\n'''Birding''' – With over 900 plus species of birds in the country, this is truly a dream come true for a birder. Many enthusiasts have the Red siskin, Harpy eagle, Cock-of-the-rock and Hoatzin (national bird) on their lists, but Guyana has so much more to showcase. The low coastal plains are known for egrets, ibises, gulls, herons, hawks, tanagers, flycatchers, finches, blackbirds and orioles, while high forests are likely to have an impressive clutch of harpy eagles, toucans, parrots, macaws, cotingas, woodpeckers and trumpeters. Red-breasted blackbirds, the buff-necked ibises and the little blue herons amongst many others occupy the hilly sand and clay areas. If you’re travelling to the interiors, then keep a look out for hawks, falcons, caracaras, quail, flycatchers, harpy eagles, cock-of-the-rocks and red siskins.\n\n'''Jungle Survival''' – A one of a kind experience, jungle survival ups the game in outdoor adventures in Guyana. Instructors teach you how to survive in one of the most remote and wildest jungles on earth – it truly takes special skills and some guts. Jungle survival camps in the Iwokrama and Rupununi forests of Guyana are made for ultimate adventures. Get trained by the local survival expert and then spend days in the jungle with a machete as the only tool. The survival course teaches you how to make a shelter, fish and find other sources of food, along with protection from wild animals. The activity is extremely popular, making Guyana one of the few locations to shoot an international reality show.  \n\n'''Ranching'''-   The South and Central Rupununi region of Guyana is the veritable answer to America's wild west. It was once home to the world’s largest and oldest cattle ranches, Dadanawa and still boasts of scores of small and big ones. You can stay at one of the working ranches and saddle up to help the cowboys shepherd the cattle from a horseback and help in cleaning, feeding and milking the cows. The ranching tradition of the Rupununi has also resulted in an annual rodeo that takes place in the largest town of the region, Lethem.\n\n'''Hiking and Trekking''' – The forest clad mountains of Guyana offer great beginner to expert level trails for hiking enthusiasts. Apart from the challenge of conquering a mountain, this is a great opportunity to see wildlife and birds. The Kaieteur Overland trek, hikes around Iwokrama, Clarence Mountain Trail, Panorama Nature Trail, Awarmie Tour, Makarapan Tour, MocoMoco Mountain and hikes near Shulainab in the Rupununi are popular. Once you’ve walked through the dense forests, the sweeping views from the top of thousands of feet tall hills are mesmerizing. \n\n'''Sport Fishing''' – Guyana is often called the ‘Land of Many Rivers’ making anglers travel from all parts of the world in hope of seeing few of the 1800 species of fish, including the largest freshwater fish, the arapaima. Others popular fish include payara, arowana, himara and lukanani. The two main fishing seasons are February to April and September to November. The Essequibo River, Kurupukari River, Abary River, Mahaica Creek, Simoni Pond, Luri Creek, Rewa, Apoteri, Rupununi and Burro Burro River are the most popular locations.\n\n'''Canoeing, Rafting and River Trips''' - The Essequibo, Demerara, Berbice, Rupununi Rivers and their many tributaries offer the traveller a chance to explore the country by water. You can opt for instructed river expeditions, shorter canoeing trips and even rafting. The view of the wildlife packed banks from the rivers is otherworldly. \n\nEco-Tourism is a booming industry in Guyana.\n\n*<do name=\"Ayanganna\" alt=\"\" address=\"Region 7\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">Mount Ayanganna is the second highest mountain after Roraima, but is accessible to climbers of all abilities and also offers waterfalls and hiking with rare animal species looking on. Featuring a tepui limestone massif, this remote area is well worth getting too, primarily by flying in from Paramakatoi and trekking, or from Imbaimadai, both available from Air Services and Guyana Airways. This is off the beaten track travelling, and planning and preperation is needed. Walk with supplies and map.</do>\n*<do name=\"Splashmins water park\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">The cool black water park has two sides both  with lovely scenery and a huge man-made black water lake.</do>\n\n==Buy== \nThe best places to buy souvenirs are in Georgetown and a number of small villages that have a shop with curios made of local materials. Handicrafts made of local leaves and fibers, hammocks, clay products and jewellery are some of the things that one can buy. Balata figurines from Nappi village in the Rupununi, and homemade honey and peanut butter from Annai make for good giveaways. Robb Street in Georgetown is dotted with shops where one can buy Caribbean and Amerindian items. The Georgetown-brewed special rum, El Dorado, is also a popular souvenir. \n\n==Eat==  \nGuyana embodies gastronomical lineage from the Chinese, East Indians, Africans, Portuguese, Dutch, British and the Indigenous Peoples. While the big cities like Georgetown and Lethem have ample restaurants and bars for global and local cuisines, the authentic flavours of Guyana are best sampled in the inland areas.  Plan to sample indigenous foods such as cassava bread, farine with tuma pot (a meat dish that is cooked in cassava water with a variety of spices) and tasso (preserved salted beef strips). In the city restaurants, you can find flavours from Indian kitchens (rice-curry combos are staple), Chinese cuisines and International fare. Some of the popular restaurants include Backyard Café, The Bottle Bar and Restaurant at Cara Lodge, and the Caribe Boardwalk Pool Bar & Grill, Great Room and the Terra Mare Restaurant at the Marriott. \n\nGuyanaese food, like the entire country, is a creole fusion.\n\nIf there's a controlling cuisine, it is dishes influenced by the Indian subcontinent that have been localized. The most prominent of these are the curries, especially chicken, pork, beef, pumpkin and eggplant. Larger roti shops and those by the sea will have shrimp, crab and other seafoods. Curries are traditionally served with roti, an Indian bread, or rice. Other local dishes include pepperpot.\n\nChinese restaurants are also common, with noodle dishes such as chow mein and lo mein along with meat and rice dishes. The growing Brazilian population have led to several outdoor BBQ restaurants and churrascarias opening in the capital and near the border in [[Lethem]].\n\nGeorgetown has a greater variety of food options than elsewhere in the country, which include a couple of steakhouses, upscale colonial dining, European fare and proper Indian food. In smaller towns, there may only be restaurants serving a creole menu of a few dishes, which almost always includes a curry or two and a noodle dish.\n\nIn jungle lodges, the food can be limited to tinned goods and rice, along with whatever can be caught or grown locally.\n*<eat name=\"Omwattie Ritoe\" alt=\"\" address=\"Amaliadwaarstraat\" directions=\"Netherland\" phone=\"030-8777404\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\"></eat>\n\nThe most popular drink is dark rum. Some national favorites are XM 10 Year Old, \nEl Dorado and X-tra Mature. El Dorado offers a 15 year old variety which has won the \"Best Rum in the World\" award since 1999. All are quality enough to drink neat or by themselves with the 25 year-old comparing with high-quality scotch. \n\nBanks Beer is the national beer. It comes in a lager and a stout. Also available is the lighter Carib beer (Trinidadian), darker Mackeson's and Heineken\n\nGuinness is brewed locally under license and is a bit sweeter than its Irish counterpart, but just as good. \n\nPolar (Venezuelan) and Skol (Brazilian) can be found randomly throughout the country. You can also find Heineken and Corona at some bars in Georgetown.\n\nFor non-alcoholic drinks. Some of the local beverages can be found in the list below: \n\n*Mauby is a local drink commonly available around the country. It is a tree bark-based drink, some say it tastes similar to Root Beer. To many, it is an acquired taste due to it's bitter aftertaste. It's very refreshing and delicious.\n*Coconut water and cane juice are other common local drink\n*Sorrel, a sweet dark pink beverage made from the Roselle plant\n\n==Sleep==  \nGuyana offers a number of options for accommodations in cities as well as the interiors. While Georgetown has ample options from plush, to mid-budget and economy options in hotels, the interiors are dotted with community owned and led lodges. Riverside resorts are another popular option for guests who want to stay close to nature. Deep in the south and central Rupununi, one has the option of staying in working ranches to get a taste of ranch life. Depending on the activity that you want to indulge in, choose from a wide array of accommodations. For local immersion, staying at community-run accommodations like Rewa and [https://suramaecolodge.com/ Surama] is a good idea. Heritage and modern hotels of Georgetown include the [https://www.marriott.com/hotels/hotel-photos/geomc-guyana-marriott-hotel-georgetown/ Marriott], [https://caralodge.com/ Cara Lodge], [https://www.herdmanstonlodge.com/en-us Herdmanston Lodge] and Grand Coastal. If you have less time, then resorts like Arrowpoint and Aruwai offer a restful vacation and can be visited in a day. \n\n\nQuality of lodging in general is decent.\nGeorgetown, the capital, unsurprisingly has far and away the biggest range of options, but here there are a number of problems. None of the \"luxury\" options in the capital - primarily the Pegasus and the Princess, have anywhere near the polish or charm to justify the hundreds of dollars they charge. On the other end of the scale are a number of tiny guesthouses and pay-by-the-hour places with lower prices. There are some great options in Georgetown, especially at the three and four star level. Hopefully the rising Chinese and Brazilian populations in town will lead to better options here.\n\nIn the interior, there are some amazing jungle lodges and camps, including those at the ranches and the south and the community-supported ecolodges in the middle of the country. Other developing options are community supported huts in Amerindian towns on the Linden-Lethm road.\n\nThe adventurous could try to get by with a hammock and paying small fees to hang it up in a benab. This isn't an option in Georgetown and will involve some planning ahead, lots of bug spray and wiles to accomplish.\n\nSome small towns have basic guesthouses, which may or may not have fans, mosquito nets or other amenities.\n\n==Stay safe==\nThere are some recommended immunisations for visitors coming to Guyana. Though medical advice is recommended, one could get vaccinations for Hepatitis A, Hepatitis B, typhoid, rabies, yellow fever, malaria and other common diseases that can be caught through air and water. Do keep a personal health kit with specific medication that may not be available in Guyana. While travelling, try and eat cooked food and not raw vegetables. Wash them with purified water before consumption.\n\nTravelling in Guyana is relatively safe, but can be overwhelming for some. It’s best to pre-book a trip so your hotels, internal transportations and trips are booked in advance. While travelling in Georgetown at night, it’s best to book a credible call cab for traceability. One has to be on the guard in crowded or remote areas in the capital city and other coastal urban areas.\n\n==Health==\n\n'''''Do not drink the tap water''''', unless you want to spend a great part of your vacation on the toilet! Bottled water is readily available in a variety of brands.\n\nBefore traveling to Guyana, it is a good idea to receive '''anti-malarial medications''' from your health care provider, as malaria is widespread throughout most of the country.\n\n'''Yellow fever''' is endemic to this area; monkeys are a reservoir, but you can catch it even in cities. Be sure to get immunized before you leave, and take [[Mosquitoes|mosquito repellent]] with you. Also be careful of malaria and dengue fever in the interior.\n\nAlthough not required, it is recommended that traveler's receive vaccination against '''Typhoid fever''' within 2-4 weeks prior to arriving in Guyana.\n\nThe country's largest hospital is the Georgetown Public Hospital and is in the capital. Facilities here are basic, even though it is a ''tertiary'' referral center. Disposal of 'sharps' (needles, etc.) is improving but needs to get better, given the country's growing '''AIDS/HIV''' prevalence, currently at '''2.5%''' of adults or '''1 in 40'''. '''''Practice safe sex as well'''''.\n\nYou are better off using the private facilities at St. Joseph's Mercy Hospital near the US Embassy or the Medical Arts Centre on Thomas Street. While not first rate, these facilities are far superior to GPH and practices basic hygienic standards. Rooms are not overcrowded. There are also other private hospitals\n\nAvoid the sun between 1PM and 3PM. It tends to be at its hottest during those hours. Wear '''''sunscreen'''''.\n\nFor the latest in traveler's health information pertaining to Guyana, including advisories and recommendations, visit the '''Centers for Disease Control and Prevention''' destination Guyana website [http://wwwnc.cdc.gov/travel/destinations/guyana.aspx].\n\n==='''General Safety'''===\nGeorgetown is notorious for petty street crime. Do not walk alone at night, or even in the day, unless you know the area well. Areas such as the ''Tiger Bay'' area east of Main Street and the entire southeastern part of the city including Albouystown and Ruimveldt are traditional high crime areas but one can be relatively safe in groups and with native escorts. Police are unlikely to help you unless they see the crime in action. Be sensible about wearing jewellery. '''Exercise common sense.'''\n\nThe interior regions with the breath-taking waterfalls and the beautiful rainforests and mountains are perfectly safe. Many rural areas around the country are filled with a friendly atmosphere and are perfectly safe. Crime is rarely directed at tourists, so don't feel intimidated. Just be sensible about the company you keep, where you go and how you behave. \n\n'''Male homosexuality is illegal in Guyana''' and carries a sentence of '''life in prison'''. However, no one has been charged under the laws. Cross-dressing is also a criminal offence and has been prosecuted in court. \n\nOne organization SASOD [http://www.sasod.org.gy/] organizes some events to promote anti-homophobic work. There is no local gay \"scene\" as most homosexuals remain rather closeted. Private gatherings are known to occur to which one must be invited. Public displays of affection among gay people are frowned upon and can make you the target of overt discrimination, attacks and taunts. \n\nDiscussions of the current affairs of ethnic relations between the two major races, politics and the socio-economic issues in the country ought to be undertaken with much tact and much patience. Be aware that these types of discourses can sometimes lead to very heated and intense debate, and possibly something much worse. Guyanese are generally very open to discussing most issues, but as an outsider, you could be seen as a part of the problem, so guard your tongue.\n\n=='''Money'''==\nThe currency used in the country is Guyanese dollar, which is GYD 209 to USD 1. It is recommended to book your trip with the help of travel agents, so that a large chunk of the payment can be done in advance and one doesn’t have to carry a lot of cash on the way. Since many of the properties and trips are remote, the organizers or owners may not have access to Internet or online payment options. Your travel agent can connect with them on the ground and make payments on your behalf.  While Georgetown has several banks and ATMs, international travellers are allowed limited withdrawals. Do not depend on other cities and towns for withdrawing cash as you go along. Major hotels and restaurants in Georgetown also accept credit cards.\n\n=='''Travel Tips'''==\nThe visitor should keep in mind some handy tips before planning a trip to Guyana. The tropical country is lush and has plenty of insects. Carry full sleeves, and full-length pants that are light and breathable. Comfortable non-open walking shoes, insect repellants and your own medicines are essential to carry. The country also gets very hot during the peak season, so plenty of sunscreen, water and suitable hats should be part of the packing list. \nIn the case of equipment, rucksacks are suitable to carry if needed. Keep your photography equipment light and handy, with ample extra batteries, as there will be stunning visuals at every bend. When clicking locals, it’s best to ask with gestures and respect if they do not want to be photographed.\n\n==='''Travel Better in Guyana'''===\nGuyana is working hard to conserve its vibrant wildlife and ecosystems and protect its culture and heritage. We realize that it is often difficult to understand how you can support these aims and make a difference when you travel.  That's why we've set out to help you by creating [https://www.guyanatourism.com/travel-essentials/ Visitor Guidelines for Sustainable Travel]. All passionate globetrotters, curious culture seekers, and bold adventurers are encouraged to do all you can to leave a positive impact on the people and places you visit in Guyana.\n\n===Cost of Living===\nThe cost of living in Guyana is relatively very high, because most of the items used in daily life are imported with high transportation costs involved. Monopoly in some business sectors also causes higher profit booking and further raising of prices. For example (as of January, 2010) the approximate prices  of Gasoline (Petrol) is US$5 per imperial gallon, electricity price is US$0.33 per unit. A domestic gas bottle (gas cylinder) is over US$ 20. Rent for average family accommodation is US$500 per month in safer urban locations and personal income tax, which is 33.33% (one third) of total taxable income makes the cost of living further higher.\n\n==Learn==\nThe official language of Guyana is English, so there won't be a language barrier problem with native speakers. That said, most people also speak Creole, which is difficult for native English speakers to understand sometimes, particularly the dialect spoken in the interior.\n\nThere is a limited number of education/learning opportunities in the country, mainly on the coast.\n\nHigher education is very expensive for locals, limiting aspirations. Getting a legal education for 5 years is equivalent to 25,000 pounds per year, when the average wage is 1500 pounds per year, or 2500 dollars US. There is only one university, The University of Guyana, with two campuses at Tain and Turkeyen. 89% of all university graduates emigrate because of the cost of living and the low wages, leaving a generally badly educated population.\n\nLevels of literacy have gone down by 10% since 1990, reflecting the crisis in education, both higher and lower.\n\nThere are opportunities for volunteer and paid teachers throughout the country. Pay, if there is any, will be low.\n\n==Work==\nGuyana has a fair number of expatriates (Most of them are from developing or poor countries) working in different sectors across the country. Persons who are not Guyanese, have to get a work permit after employment is confirmed. Caribbean citizens might have some exemptions under the CSME scheme. There are a number of volunteer organizations like Project Trust, Peace Corps, VSO and CESO working in Guyana. Some people have come on short stints to volunteer with churches, and other non-governmental organizations. It is the responsibility of the host organizations (or employer) to arrange necessary travel/work permits from the concerned Ministry for prospective employee.\n\nSalary in Guyana is normally paid in Guyanese Dollor (GYD), which is the local currency. The present exchange rate is 206 GYD for 1 USD (United States dollar). Income Tax (which is one third of total taxable income,minus $50,000.00 dollars GY per month) is usually deducted by employer. The overall [[#Buy|cost of living]] is relatively very high, making an expatriate employee's life very difficult in Guyana.\n\n\n==Contact==\n\n* Police 592.226.2487 emergency - 911 \n* Fire 592.226.2411   emergency - 912 \n* Ambulance Service   emergency - 913 \n* Cheddi Jagan International Airport 592.261.2245 \n* Ministry of Foreign Affairs 592.226.1606 \n* Ministry of Tourism Industry & Commerce 592.226.2392 \n* Guyana Telephone & Telegraph 592.225.1315 \n* Licence Revenue Office 592.223.5501 \n\n==Get Out==\n[[Brazil]] - Access to Brazil is via Lethem. There are Interserv buses - get the schedule at the Interserv Bus Office located on Charlotte Street in downtown [[Georgetown]]. The buses typically leave late at night. Another option are minibuses that ply the Georgetown-Lethem road, although the lack of paved road beyond Linden means that the trip will probably need to be broken up overnight.\n\n[[Suriname]] is reachable via minibuses & a ferry, or by a short flights from Cheddi Jagan Temeri International airport or Ogle airport.\n\n[[Trinidad]] and the rest of the [[Lesser Antilles]] is a short flight away via Caribbean Airlines or LIAT.\n\n[[Venezuela]] There is a walkable track from Venezuela from Kamarang if you walk with enough food, and there are boats that go up the Cuyuni past Ankoko Island and Ekiteringbang if you ask the petrol dealers in Bartica.\n\n[[ca:Guyana]]\n[[de:Guyana]]\n[[eo:Gujano]]\n[[es:Guyana]]\n[[fi:Guyana]]\n[[fr:Guyana]]\n[[hu:Guyana]]\n[[it:Guyana]]\n[[ja:ガイアナ]]\n[[nl:Guyana]]\n[[pl:Gujana]]\n[[pt:Guiana]]\n[[ru:Гайана]]\n[[sv:Guyana]]\n[[wts:Category:Guyana]]\n\n[[WikiPedia:Guyana]]\n[[Dmoz:South America/Guyana/]]\n\n{{isPartOf|South_America}}\n{{outline}}\n{{countryguide}}"
        }
    }
}