{
    "parse": {
        "title": "Italy",
        "pageid": 499,
        "wikitext": {
            "*": "{{pagebanner|Italy banner.jpg}}\n\n__TOC__\n[http://www.italia.it/en/home.html '''Italy'''] ([[Italian phrasebook|Italian]]: ''Italia'') is a country in Southern Europe. Together with [[Greece]], it is acknowledged as the birthplace of Western culture. Not surprisingly, it is also home to the greatest number of [[UNESCO World Heritage List|UNESCO World Heritage Sites]] in the world. High art and monuments are to be found everywhere around the country. \n\nIt is also famous worldwide for its delicious cuisine, its trendy fashion industry, luxury sports cars and motorcycles, diverse regional cultures and dialects, as well as for its beautiful coast, alpine lakes and mountain ranges (the Alps and Apennines). No wonder it is often nicknamed the ''Bel Paese'' (the Beautiful Country).\n\n{{quickbar\n| image=Rome at night.jpg\n| caption=Rome\n| location=Italy in its region.svg\n| flag=Flag of Italy.svg\n| capital=[[Rome]]\n| government=Parliamentary Republic \n| currency=Euro (€)\n| area=total: 301,340km²<br />''water:'' 7,200km²<br />''land:'' 294,140km²\n| population=59,433,744 (2011 census)\n| language=[[Italian]] (official); minor [[German]], [[French]] and [[Slovenian phrasebook|Slovene]]-speaking communities\n| religion=predominately Roman Catholic with mature Protestant and Jewish communities and a growing Muslim immigrant community\n| callingcode=+39\n| tld=.it\n| timezone=UTC+1\n| electricity=230V, 50Hz (European or Italian plug)\n| emergencies=dial '''112'''\n}}\n\nTwo independent mini-states are surrounded entirely by Italy: [[San Marino]] and [[Rome/Vatican|Vatican City]]. While technically not part of the European Union, both of these states are also part of the Schengen Area and the European Monetary Union (EMU). Apart from different police uniforms, there is no evident transition from these states and Italy's territory, and the currency is the same. Italian is also the official language in both countries.\n\n==Understand==\nItaly is, for the most part, a peninsula situated on the Mediterranean Sea, bordering [[France]], [[Switzerland]], [[Austria]], and [[Slovenia]] in the north. Italy, which is boot-shaped, is surrounded by the Ligurian and the Tyrrhenian Seas to the west, the Mediterranean and Ionian Seas to the South, and the Adriatic Sea to the East.  \n\nItalian is the official language spoken by the majority of the population, but as you travel throughout the country you will find that there are several distinct Italian dialects depending on the region you're in. French is spoken in the northwest and German in the northeast. Italy has a very diverse landscape, but can be primarily described as mountainous, including the Alps and the Apennines mountain ranges that run through the vast majority of it. Two major islands are part of this country: [[Sardinia]], which is an island off the west coast of Italy, and [[Sicily]], at the southern tip (the \"toe\") of the boot. \n\nWhile abroad somewhat preserving the reputation as a fiercely catholic society, the Italian religious reality is actually rather diverse. If churches are a ubiquitous sight in large cities as in tiny small towns, the actual practice and mass attendance among believers is in line with that of other European countries: older generations being more observant while younger ones more on the ''indifferent'' side.\nAll possible Christian denominations - and a sizeable Jewish community - have made Italy their home for centuries. Moreover, in recent decades Islam and Buddhism have also become increasingly visible, partly as a consequence of mass immigration from North Africa and Asia, but also due to sporadic conversions among Italians. Agnosticism or downright atheism have also become common, according to the latest census, accounting for nearly 20% of the population.\n\n===History===\n[[File:Rom Pantheon mit Obelisk.jpg|thumb|250px|The Pantheon, a huge Roman temple, which is a symbol of the Roman civilization in Italy.]]\nCertainly, humans inhabited the Italian peninsula for at least 200,000 years; Neolithic civilisations flourished in prehistoric Italy but were either wiped out, or assimilated, around 2000&nbsp;BC by a group of Indo-European tribes, which are collectively known as the Italic peoples. \nThese were more or less closely related to each other and comprised tribes such as the Latins, Etruscans, Umbrians, Samnites, Sicels, Ligures, Oscans, just to name a few. The Etruscan civilisation was among the first to rise in the 6th century BC and lasted until the late Republican period; it flourished in what are now northern [[Lazio]], [[Umbria]] and [[Tuscany]].\nIn the 8th and 7th centuries BC, Greek colonies were established in Sicily and the southern part of Italy: the Etruscan culture rapidly became influenced by that of Greece. This is well illustrated at some excellent Etruscan museums; Etruscan burial sites are also well worth visiting. [[Rome]] itself was dominated by Etruscan kings until 509&nbsp;BC, when the last of them - Tarquinius Superbus - was ousted from power and the Roman Republic was founded. After a series of wars, the Romans sacked the nearby Etruscan city of Veii in 396&nbsp;BC; this triggered the collapse of the Etruscan confederation and the Etruscan people themselves began to be assimilated.\n\nThe Celts settled in what is now Northern Italy, where their civilisation flourished, in the 1st millennium BC and began expanding further south; they made the mistake of sacking Rome in 390&nbsp;BC and the Romans, hell-bent on revenge, waged wars against them until they were conquered and their people assimilated.\n\nAncient Rome was at first a small village founded around the 8th century BC. In time, its primitive kingdom grew into a republic - which would later evolve into an empire - covering the whole Mediterranean and expanding as far north as Scotland and as far east as Mesopotamia and Arabia. Its steady decline began in the 2nd century AD, and the empire finally broke into two parts in 285 AD: the Western Roman Empire and the Byzantine Empire in the East. The western part came under attack from various Germanic tribes; Visigoths sacked Rome in 410AD and their Vandal fellows would follow in 455AD. The Western Roman Empire finally collapsed in 476&nbsp;AD, and the barbarian chiefs divided the Italian peninsula among themselves; after this, Italy plunged into the so-called ''Dark Ages.''\n\nFollowing a lengthy, and bloody, reconquest by the Byzantines (the so-called \"Gothic Wars\"), much of Italy was controlled by the Eastern Roman Empire. Needless to say, this wouldn't last long - as a Germanic tribe, the Lombards, invaded Italy once more in 572; hence the present-day northern region of [[Lombardy]]. Like their predecessors, they divided the land among themselves; however, due to their numerical inferiority, they were eventually assimilated by the native populace. Only parts of southern Italy - which were under Byzantine control - and what would later become the Papal States (that is, Rome and the surrounding region, which were under the authority of the Pope) survived as relatively independent entities: indeed, the Church was so independent that it saw fit to call other barbarians, the Franks, in order to get rid of their (now almost-completely romanised) violent, unstable, nosy Lombard neighbours. These were defeated in 774 by the aforementioned Franks and subsequently lost their kingdom. \n\nMeanwhile, the [[Veneto]] was being devastated by the barbarians: a part of its inhabitants thought they'd been safe on the islands in the Venetian lagoon and thus founded a city there: [[Venice]] was born. The first evidence of what would become the Italian language dates back to this century and more precisely to 960.\n\nSicily remained in Byzantine hands until the late 8th century, when it was conquered by the Arabs whose reign, however, was short-lived: in 1092 the Normans - after having kicked out the Byzantines from the rest of Southern Italy - proceeded to invade Sicily. They created the Kingdoms of Sicily and Naples (which would later become the ''Kingdom of the Two Sicilies'', as a result of the unification of these two realms in 1442, and had its capital in Naples).\n\nIn the north, Italy was a collection of small, independent city-states and kingdoms which were under the authority of the Holy Roman Emperor. However, they revolted against the then-Emperor - Frederick Barbarossa - in 1176 and beat the Imperial army at Legnano, thus gaining their independence. The so-called ''repubbliche marinare'' (maritime republics) of [[Genoa]], [[Venice]], [[Pisa]] and [[Amalfi]] remained relativey authonomous and competed against each other for the control of the seas and for that of the lucrative trade routes with the Far East.\nThis was also the era of the ''comuni'', independent city-states which were governed by what must have been a close approximation of democracy (that is, they were what we'd call today a \"oligarchies\" in which the most powerful, or prestigious, families in town were called to cooperate - at least nominally - for the \"public good\"). Meanwhile, the Hohenstaufens ruled the south and, under Frederick II - who was a patron of the art - gave birth to a rich culture. \n\nFrom the 13th century onwards, Florence became the main cultural hotspot of the peninsula: not only it was home to poets such as Dante Alighieri and Petrarch but hosted also writers of the calibre of Boccaccio. Indeed, their works formed the basis of a standard form of the Italian language (which is itself a mixture of Florentine grammar and Roman pronunciation). People looked to strong men who could bring order to the cities and this is how dynasties such as the Medici in [[Florence]] developed. In turn, these families became patrons of the arts, allowing Italy to become the birthplace of the Renaissance, with the emergence of men of genius such as Leonardo da Vinci, Bramante, Tiziano, Raffaello, Michelangelo and many others. After the heir of Frederick II was killed in battle in 1268, the French ruled the south; they were however expelled from Sicily in 1282 after a popular uprising, the ''vespri siciliani'', during which thousands of Frenchmen were slain (opera buffs will certainly recognise one of their favourite operas!).\n\nIn the late 14th and 15th centuries, Italy was home to some of the richest states in Europe; however, they were often at war with each other and only the diplomatic skills of Lorenzo il Magnifico prevented the many petty kingdoms from warring each other. Predictably, when Lorenzo died in 1492, the Italian states plunged into chaos; the King of France took advantage of the situation, crossed the Alps and reclaimed the Kingdom of Naples for himself. He succeeded, but was forced to return to France. Only then did the Italian majors realise the danger, but it was too late: after a futile victory at the battle of Fornovo, in 1495, the peninsula came to the attention of its European neighbours and suffered a series of invasions from the French and the Spanish. The north eventually became dominated by the Austrians.\n\nThe discovery of the New World damaged the already declining Italian economies and most of Italy's states came under foreign domination: and despite the artistic, architectonic and literary developments, life in post-Reinassance Italy became pretty miserable. The Counter-Reformation, while it did succeed in restraining most of the clergy's \"earthly\" excesses, further plunged the peninsula into a not-so-happy era. This situation, further aggravated by the Italian Wars of 1494-59 (during which Rome itself was sacked by the German mercenaries of Emperor Charles V) became even worse in the 17th centuries, when the foreign powers fought each other in a series of mostly useless wars over the dynastic rights on the Italian states. The 18th century, while (relatively) more peaceful than the one that preceded it, was, culturally speaking, not-so-grand; on top of that, the Austrians ruled the North with an iron fist and the once-prosperous South had the misfortune of being governed by a particularly backward and obscurantist ruling class.\n\n====The birth of modern Italy====\nEventually, the French revolution was \"exported\" to Italy and revolutionary movements popped up almost everywhere. These ideals had a lasting impact on the future of the peninsula (the Italian flag dates from 1797); a Partenopean (Neapolitan) Republic was proclaimed in 1799 but was crushed by the royalists supported by the British fleet commanded by Horatio Nelson. The advent of Napoleon Bonaparte and the adoption of the Napoleonic Code set the basis for the ''Risorgimento'', or \"Resurgence\", of Italy: after the Restoration - particularly after the Revolutions of 1848 - the notion of an Italian nation-state became popular; in 1849, the people of Rome, Milan and Venice rebelled against their oppressors but were soon crushed (the current Italian national anthem was composed in this period).\n\nIn that same year (1849), the Kingdom of Sardinia-Piedmont - ruled by the House of Savoy - became the fulcrum of the movement that advocated the unification of Italy. A disastrous war against the Austrians did not stop the cunning Piedmontese Prime Minister, '''Camillo Benso, conte di Cavour''', and King '''Victor Emmanuel II''' from becoming the people behind the unification process. With the help France, and after the first two Wars of Italian Independence (which ended in 1859), Austria was finally defeated: Lombardy was ceded to Piedmont-Sardinia. At roughly the same time (1860), '''Giuseppe Garibaldi''' led an expedition in order to annex the Kingdom of the Two Sicilies (the so-called ''Spedizione dei Mille'' or \"Expedition of the Thousand\"); his volunteer army, the Redshirts, landed in Sicily, defeated the enemy troops despite being outnumbered 20:1, conquered the island and set forth to invade the rest of the Kingdom. Once this process was complete, the  people of the Grand-Duchy of Tuscany - which was ruled by a cadet branch of the Hapsburg dynasty -, Umbria and the Pontifical Legations (provinces) of Emilia and Romagna - which belonged to the Pope - revolted and requested the annexation to Piedmont-Sardinia, a request that was duly granted.\n\nThe Parliament of Piedmont-Sardinia was then called to a meeting by Victor Emanuel II and the '''Kingdom of Italy''' was finally proclaimed on '''17 March 1861'''. Turin was chosen as the capital of the newly formed state, but was moved to Florence in 1865. Why not Rome? The city was still home to the Papal States, which were under the protection of that same French emperor - Napoleon III - who helped establish the Kingdom of Italy. In 1866, Victor Emmanuel II managed to annex Venice after the Third War of Independence. On '''20 September 1870''', shortly after France abandoned it due to the Franco-Prussian War, '''Rome''' was stormed by the Italian troops and became the capital of Italy.\n\nCavour died in 1861, when the newly-formed country was in a rather delicate phase due to the ''brigantaggio'', that is, a particularly violent recrudescence of brigandage which was raging in the South; Victor Emmanuel II was thus forced send the army in order to suppress the brigands. He died in 1878 and was the first King of Italy to be buried in the Pantheon. He was succeeded by his son, '''Umberto I''' whose Queen consort, Margherita di Savoia, was homaged by a Neapolitan pizza chef who named the ''pizza margherita'' after her in 1889. That same year, the death penalty was abolished in Italy.\n\nFrancesco Crispi, then Prime Minister, sought a defensive alliance with the Austrian-Hungarian and German empires - despite the fierce opposition from the Italian public opinion (Austria was seen as the country's traditional enemy) - and made the nation join the Triple Alliance in 1882. In 1890, Italy - a late-comer to the \"Scramble for Africa\" - conquered Eritrea and Somalia, which became colonies; despite these successes, the economy had significantly worsened and millions of Italians, mainly from the rural South, were forced to emigrate. In 1896 Francesco Crispi, Prime Minister for the second time, gave order to invade Ethiopia: the badly-led expedition however was massacred at the battle of Adwa. Crispi was forced to resign due to a public uproar; two years later, a protest took place in Milan because of the high prices of food but was cruelly crushed (Fiorenzo Bava Beccaris, the general who ordered to fire the cannons at the crowd, was publicly congratulated by the King himself and was even offered a seat in the Royal Senate). \n\nUnsurprisingly, King Umberto became quickly unpopular and was fatally '''shot''' on '''29 July 1900''' by an anarchist, Gaetano Bresci. His son, '''Vittorio Emanuele III''', succeeded him.\n\nIn 1911, war broke out between Italy and the Ottoman Empire, which was quickly defeated and had to cede Libya and the Dodecanese islands as war reparations (this conflict is notable because aircraft were employed for the first time in reconnaissance/bombing roles). The Italian state, however, was only in control of Libya's main towns and coastal areas as a strong resistance movement prevented it from completely occupying the country: this situation would last until the mid '20s, when the Fascist régime brutally repressed the rebels.\n\n====World War One====\nItaly, in virtue of the defensive pact of 1882, did not join the war immediately. Many Italians wished however to regain the so-called ''terre irredente'' (these were provinces inhabited by an autochtonous, Italian-speaking majority and were once part of past Italian states; by 1915, these had been Austrian possession for little more than a century).\n\nMost intellectuals - among them was the famed poet, writer and war hero Gabriele d'Annunzio - were pushing to join the war on the Entente's side. The interventionist faction eventually got the upper hand, and a secret pact - the Treaty of London - was signed between Italy, France and Great Britain: by virtue of said treaty, Italy would have gained the ethnically-Italian provinces of Trentino, Istria and Dalmazia if it joined the war against the Central Powers.\n\nHostilities began on May 24, 1915 and ended on November 4, 1918. After three years of bloody fighting all over the Alpine arch, more than a million Italian soldiers lost their lives but Italy managed nevertheless to win the war; the Entente, however, disregarded some of the treaty's provisions and Italy was awarded just part of the territories it claimed.\n\n====The rise of Fascism and World War Two====\nIn October 1922, a small National Fascist Party led by Benito Mussolini attempted a coup with its \"March on Rome\", which resulted in the King forming an alliance with Mussolini. A pact with Germany was concluded by Mussolini in 1936, and a second in 1938. During the Second World War, Italy was invaded by the Allies in June 1943, leading to the collapse of the fascist regime and the arrest, flight, eventual re-capture and death of Mussolini. In September 1943, Italy surrendered. However, fighting continued on its territory for the rest of the war, with the allies fighting those Italian fascists who did not surrender, as well as German forces. \n\n====The Republic and the post-war years====\nIn 1946, King Umberto II was forced to abdicate and Italy became a republic. In the 1950s, Italy became a member of NATO and allied itself with the United States. The Marshall Plan helped revive the Italian economy which, until the 1960s, enjoyed a period of sustained economic growth. In 1957, Italy became a founding member of the European Economic Community. In the 1950s and early-1960s, Italy experienced a period of rapid economic growth and industrial production, called \"il boom\", which saw the country's rise from a poor and weak nation, to a powerful one. During this period, also, cities such as Rome returned to being popular tourist destinations, expressed in both American and Italian films such as ''Roman Holiday'' and ''La Dolce Vita''.\n\n[[Image:Trevi Fountain at Night.jpg|thumb|The Trevi Fountain, symbol of 18th century Baroque Italy.]]\nHowever, despite a productive and successful period which lasted until the mid-early 1960s, from the late 60s till the late 1980s, the country experienced an economic crisis. There was a constant fear, both inside and outside Italy (particularly in the USA), that the Communist Party, which regularly polled over 20% of the vote, would one day form a government and all sorts of dirty tricks were concocted to prevent this. From 1992 to the present day, Italy has faced massive government debt and extensive corruption. Scandals have involved all major parties, but especially the Christian Democrats and the Socialists, which were both dissolved. The 1994 elections put media magnate Silvio Berlusconi into the Prime Minister's seat; he has twice been defeated, but he emerged triumphant again in the 2008 election.\n[[Image:Pirelli Building, Milan, Italy.jpg|thumb|right|The modern 1960s Pirelli Tower in Milan is often considered a symbol of the new Italy, and of post-war economic growth and reconstruction.]]\nDespite Unification having lasted for over 150 years, there remain significant divisions in Italy. The northern part of the country is richer and more industrialized than the south and many northerners object to being effectively asked to subsidise southerners. The ''Northern League'' political party pushes for greater autonomy for the north and for reduced fund transfers to the south. On one thing the people of the north and the south can agree: none of them likes paying for the enormous bureaucracy that is based in Rome.\n\n===Climate===\nThe climate of Italy is highly diverse, and could be far from the stereotypical Mediterranean climate.  Most of Italy has hot, dry summers, with July being the hottest month of the year. Autumns are generally rainy. Winters are cold and damp (hence often foggy) in the North, and milder in the South. Conditions on peninsular coastal areas can be very different from the interior's higher ground and valleys, particularly during the winter months when the higher altitudes tend to be cold, wet, and often snowy. The Alps have a mountain climate, with cool summers and very cold winters.\n\n===Literature===\nNon-Guidebooks about Italy or by Italian writers. \n\n* ''Italian Journey'' (in the German original: Italienische Reise) by Johann Wolfgang von Goethe; a report on his travels to Italy via [[Innsbruck]] and the [[Brenner Pass]]. He visited [[Lake Garda]], [[Verona]], [[Vicenza]], [[Venice]], [[Bologna]], [[Assisi]], [[Rome]] and [[Alban Hills]], [[Naples]] and [[Sicily]] from 1786–7, published in 1816–7\n\n* ''The Agony and the Ecstasy'' by Irving Stone &mdash; a biography of Michelangelo that also paints a lovely portrait of Tuscany and Rome\n\n* ''Brunelleschi's Dome: How a Renaissance Genius Reinvented Architecture'' by Ross King &mdash; a compelling story of one of the greatest structural engineering achievements of the Renaissance. The story of the building of the immense dome on top of the basilica in Florence, Italy.\n\n* ''Under the Tuscan Sun'' by Frances Mayes &mdash; an account of a woman who buys and restores a holiday home in Cortona, Italy. Full of local flavor and a true taste of Tuscany.\n\n* ''The Sea and Sardinia'' by D.H. Lawrence &mdash; describes a brief excursion undertaken by Lawrence and Frieda, his wife aka Queen Bee, from Taormina in Sicily to the interior of Sardinia. They visited Cagliari, Mandas, Sorgono, and Nuoro. Despite the brevity of his visit, Lawrence distills an essence of the island and its people that is still recognisable today. Also by D.H. Lawrence is ''Etruscan Places'', recording his impressions of [[Cerveteri]], [[Tarquinia]], [[Vulci]] and [[Volterra]].\n\n* ''Italian neighbours'' and ''A season with Verona'' by Tim Parks. Two portraits of nowdays life in Italy as seen by an English writer who decided to live just outside Verona.\n\n* ''Living in Italy: the Real Deal'' by Stef Smulders. Hilarious expat adventure of a Dutch couple moving to Italy to start their bed and breakfast.\n\n* ''Winter Stars'' by Beatrice Lao &mdash; poems born between the Alps and the Tyrrhenian by the oriental poetess, 988979991X\n\n* ''The Travels of Marco Polo'' by Marco Polo &mdash; stories about China by the Venetian traveller\n\n* ''A Tivoli Companion'' by Tim Cawkwell &mdash; illustrated essay about history and gardens of Tivoli, Lazio\n\n==Regions==\n{{Regionlist|\nregionmap=Italy regions.png |\nregionmapsize=300px |\nregionmaptext=Regions of Italy |\n\nregion1name=[[Northwest Italy]] |\nregion1color=#71b37b |\nregion1items=[[Piedmont]], [[Liguria]], [[Lombardy]] and [[Aosta Valley]]|\nregion1description=Home of the Italian Riviera, including [[Portofino]] and the [[Cinque Terre]]. The [[Alps]], world class cities like the industrial capital of Italy ([[Turin]]), its largest port ([[Genoa]]), the main business hub of the country ([[Milan]]), share the region's visitors with beautiful landscapes like the [[Lake Como]] and [[Lake Maggiore]] area, and little known Renaissance treasures like [[Mantova]].\n|\n\nregion2name=[[Northeast Italy]] |\nregion2color=#8a84a3  |\nregion2items=[[Emilia-Romagna]], [[Friuli-Venezia Giulia]], [[Trentino-Alto Adige]] and [[Veneto]] |\nregion2description=From the canals of [[Venice]] to the gastronomic capital [[Bologna]], from impressive mountains such as the [[Dolomites]] and first-class ski resorts like [[Cortina d'Ampezzo]] to the delightful roofscapes of [[Parma]] and [[Verona]] these regions offer much to see and do. [[South Tyrol]] and the cosmopolitan city of [[Trieste]] offer a uniquely Central European flair.\n|\n\nregion3name=[[Central Italy]] |\nregion3color=#d5dc76  |\nregion3items=[[Lazio]], [[Marche]], [[Tuscany]], [[Abruzzo]] and [[Umbria]] |\nregion3description=Breathes history and art. [[Rome]] boasts the remaining wonders of the Roman Empire and some of the world's best known landmarks, combined with a vibrant, big-city feel. [[Florence]], cradle of the Renaissance, is [[Tuscany]]'s top attraction, whereas the magnificent countryside and nearby cities like [[Siena]], [[Pisa]] and [[Lucca]] have much to offer to those looking for the country's rich history and heritage. Umbria is dotted with many picturesque cities such as [[Perugia]], [[Orvieto]], [[Gubbio]] and [[Assisi]]|\n\nregion4name=[[Southern Italy]]  |\nregion4color=#d09440  |\nregion4items=[[Apulia]], [[Basilicata]], [[Calabria]], [[Campania]] and [[Molise]] |\nregion4description=Bustling [[Naples]], the dramatic ruins of [[Pompeii]], the romantic [[Amalfi Coast]] and [[Capri]], laidback [[Apulia]] and stunning unspoilt beaches of [[Calabria]], as well as up-and-coming agritourism help making Italy's less visited region a great place to explore. |\n\nregion5name=[[Sicily]]  |\nregion5color=#d56d76  |\nregion5items= |\nregion5description=The beautiful island famous for archaeology, seascape and some of the best cuisine the Italian kitchen has to offer.  |\n\nregion6name=[[Sardinia]]  |\nregion6color=#b383b3  |\nregion6items= |\nregion6description=Large island some 250 km west of the Italian coastline. Beautiful scenery, megalithic monuments, lovely seas and beaches: a major holiday destination for high budget tourists.|\n}}\n<br clear=\"all\" />\n\n==Cities==\n[[Image:Neptune fountain.jpg|thumb|Rome (fountain of Neptune, Piazza Navona)]]\n[[Image:Florence bridges.jpg|thumb|Florence (River Arno, with Ponte Vecchio in the foreground)]]\nThere are hundreds of Italian cities. Here are '''nine''' of its most famous:\n<!-- '''nine''' Please do not change this list without first discussing your proposed change on the talk page. Cities lists are limited by Wikitravel policy to NINE.-->\n* [[Rome]] (Roma) — the capital, both of Italy and, in the past, of the Roman Empire until 285 AD\n* [[Bologna]] — one of the world's great university cities that is filled with history, culture, technology and food\n* [[Florence]] (Firenze) — the Renaissance city known for its architecture and art that had a major impact throughout the world\n* [[Genoa]] (Genova) — an important medieval maritime republic; its port brings in tourism and trade, along with art and architecture\n* [[Milan]] (Milano) — one of the main fashion cities of the world, but also Italy's most important centre of trade and business\n* [[Naples]] (Napoli) — one of the oldest cities of the Western world, with a historic city centre that is a UNESCO World Heritage Site. This is also the birth-place of pizza.\n* [[Pisa]] — one of the medieval maritime republics, it is home to the unmistakable image of the Leaning Tower of Pisa\n* [[Turin]] (Torino) — a well-known industrial and historical city, first capital of Italy and home of FIAT. The city's also renowned for its large amount of baroque buildings.\n* [[Venice]] (Venezia) — one of the most beautiful cities in Italy, known for its history, art, and of course its world famous canals\n\n==Other destinations==\n[[Image:beachpraiaarcomagno.jpg|thumb|[[Praia a Mare]]'s stunning beach, facing Dino island]]\n[[File:Lago-Maggiore 1491a.jpg|thumb|Isola Bella, Borromean Islands, Lake Maggiore (Italy)]]\n* [[Alps|Italian Alps]] — some of the most beautiful mountains in Europe, including Mont Blanc and Mount Rosa\n* [[Amalfi Coast]] — stunningly beautiful rocky coastline, so popular that private cars are banned in the summer months\n* [[Capri]] — the famed island in the Bay of Naples, formerly a favoured resort of the Roman emperors\n* [[Cinque Terre]] — five tiny, scenic, towns strung along the steep vineyard-laced coast of Liguria\n* [[Lake Como]] — its atmosphere has been appreciated for its beauty and uniqueness since Roman times\n* [[Lake Garda]] — a beautiful lake in Northern Italy surrounded with many small villages \n* [[Matera]] — in the Basilicata region, Matera boasts the \"sassi\", well-preserved rock-cut settlements that are a World Heritage site and one of Southern Italy's many important attractions\n* [[Pompeii]] and [[Herculaneum]] — two neighbouring cities covered by an eruption of Mt. Vesuvius in AD 79, now excavated to reveal life as it was in Roman times\n* [[Vesuvius]] — the famous dormant volcano with a stunning view of the Bay of Naples\n\n==Get in==\n{{infobox|Minimum validity of travel documents|* EU, EEA and Swiss citizens, as well as non-EU citizens who are visa-exempt (e.g. U.S. Citizens and Australians), need only produce a passport which is valid for the entirety of their stay in Italy.\n--CAUTION--\nIn practice, if entering from another Schengen area country (such as a change of planes in France), you may need to satisfy somewhat different requirements for visa-exempt entry. For example, you may need a passport valid for 6 months from entry.\n* Other nationals who are required to have a visa (eg: South Africans), however, must have a passport which has '''at least 3 months' validity''' beyond their period of stay in Italy.\n* For more information, visit [http://www.esteri.it/MAE/EN/Ministero/Servizi/Stranieri/IngressoeSoggiornoInItalia.htm this webpage of the Ministry of Foreign Affairs of Italy].}}\n[[Image:Pisa 03.JPG|thumb|Pisa, the Piazza dei Miracoli, with the cathedral and the leaning tower]]\n\n[[Image:Bay of Naples and Mount Vesuvius, Italy.jpg|thumb|Naples, a view over the city, showing the Vesuvius]]\n\n[[Image:Italy Venice Canal Grande.jpg|thumb|Venice, the Grand Canal]]\n\n[[Image:IMG 0282.JPG|thumb|Bologna, the red terracotta roofs and brick towers of the city's skyline]]\n\n[[Image:Duomo 99.JPG|thumb|Milan, the Piazza del Duomo, with the stunning city medieval cathedral]]\n{{Schengen}}\n\nForeign military entering Italy under a Status of Forces Agreement do not require a passport and need only show their valid military identification card and travel orders. Their dependants, however, are not exempt from visa requirements.\n\nAll '''non'''-EU, EEA or Swiss citizens staying in Italy for 90 days or less have to declare their presence in Italy within 8 days of arrival. If your passport was stamped on arrival ''in Italy'', the stamp counts as such a declaration.  Generally, a copy of your hotel registration will suffice if you are staying at a hotel (i.e. a copy of your passport ID page will be retained by hotel staff and they will complete the paperwork for you). Otherwise, however, you will have to go to a police office to complete the form ('''dichiarazione di presenza''') yourself. Failing to do so may result in expulsion. Travellers staying longer than 90 days do not need to complete this declaration, but must instead have an appropriate visa and must obtain a residence permit ('''permesso di soggiorno''').\n\n===By plane=== \nItaly has a national airline, [http://www.alitalia.com Alitalia] based in [[Rome]] as well as a new competitor in [[Milan]] called [http://www.airitaly.com Air Italy].\n\nItaly is one of the main battle grounds for European [[Discount airlines in Europe|low cost airlines]] several routes to/from and within Italy are offered. The larger airports are, of course, served by the major European airlines.\n\nIntercontinental airlines mainly arrive in Rome and Milan, with Rome being the main international gateway into the country. \n\nMost of mid-range international flights arrive to the following Italian cities:\n\n* [[Rome]] - with two airports: Fiumicino (FCO - Leonardo Da Vinci) and Ciampino (CIA) for budget airlines\n\n* [[Milan]] - with two airports: Malpensa (MXP) and Linate (LIN); in addition, Bergamo (BGY - Orio al Serio) is sometimes referred to as \"Milan Bergamo\"\n\n* [[Bologna]] (BLQ – Guglielmo Marconi)\n\n* [[Naples]] (NAP - Capodichino)\n\n* [[Pisa]] (PSA - Galileo Galilei)\n\n* [[Venice]] (VCE – Marco Polo); in addition, Treviso (TSF - Antonio Canova) is sometimes referred to as \"Venice Treviso\"\n\n* [[Turin]] (TRN – Sandro Pertini)\n\n* [[Palermo]] (PMO - Punta Raisi)\n\n* [[Catania]] (CTA - Vincenzo Bellini)\n\n* [[Bari]] (BRI - Palese)\n\n* [[Genoa]] (GOA - Cristoforo Colombo)\n\n===By train===\n*From [[Austria]] via [[Vienna]], [[Innsbruck]] and [[Villach]]\n*From [[France]] via [[Nice]], [[Lyon]], and [[Paris]]\n*From [[Germany]] via [[Munich]]\n*From [[Spain]] via [[Barcelona]]\n*From [[Switzerland]] via [[Basel]], [[Geneva]] and [[Zurich]]\n\nDirect connection by train with eastern Europe ([[Croatia]], [[Hungary]], [[Romania]], [[Serbia]] and [[Slovenia]]) no longer exists. The only way to reach Italy by train from these countries is via [[Vienna]] or [[Villach]]; it's also possible reach by train Nova Gorica (in [[Slovenia]], then cross the border by foot and take a train in Italy in the railway station of [[Gorizia]].\n\n===By car===\nItaly borders on [[France]], [[Austria]], [[Switzerland]] and [[Slovenia]]. All borders are open (without passport/customs checks),except for the Swiss one, with customs checks and random passport checks.In the other borders cars can be stopped behind the border for random checks. \n\n===By bus===\n[http://www.eurolines.it/index.php?option=com_frontpage&Itemid=1&lang=en Eurolines] has are regular buses between Ljubljana, Slovenian coastal towns and Istria (Croatia) and Trieste (Italy).  These services are cheap and from Trieste onward connections with the rest of Italy are plentiful. There's also a bus that goes from [[Malmö]], Sweden via Denmark, Germany and Switzerland to Italy.\n\n===By boat===\n'' See also [[Ferries in the Mediterranean]]''\nThere are several ferries departing from [[Greece]], [[Albania]], [[Montenegro]] and [[Croatia]]. Most of them arrive at [[Venice]], [[Ancona]], [[Bari]] and [[Brindisi]].\n\nSome regular ferry services connect the island of [[Corsica]] in [[France]] to [[Genoa]], [[Livorno]], [[Civitavecchia]], [[Naples]] and North of [[Sardinia]]. [[Barcelona]] is connected to [[Civitavecchia]] and to [[Genoa]].\n\nSome regular ferry services connect [[Sicily]] and [[Naples]] to some [[North Africa|North African]] harbours.\n\nThere is a hydrofoil service running from [[Pozzallo]] on the south-eastern coast of [[Sicily]] to [[Malta]].\n\nThere is a year-round service between [[Trieste]] and Albania and summer services between Trieste and [[Piran|Pirano]] (Slovenia) and [[Porec|Parenzo]] and [[Rovinj|Rovigno]] in Croatian Istria.  The service between Trieste and Rovigno takes less than 2 hours which is quicker than the bus service.\n\n==Get around==\n\n===By train===\n\nTrains in Italy are generally good value, frequent but of mixed reliability. There are different train types: '''high-speed trains''' (Frecciarossa, Frecciargento, Frecciabianca, Eurostar Italia), '''Intercity''', '''regional trains''' (Regionali, Regionali Veloci) and '''international trains''' (Eurocity, Euronight). \n\nHigh-speed trains are efficient and very comfortable, travelling up to 300 km/h and stopping only at major stations. They connect Rome with Turin, Milan, Venice, Bologna, Florence, Naples and other cities. They also are the most expensive train type by far. To travel on these trains you are required to pay a supplement to the standard ticket, which includes the booking fee.\nRegional trains are the slowest, cheapest and less reliable, stopping at all stations. \nIntercity trains are somewhere in between high-speed and local trains. They are generally reliable, but if you need to catch a flight, for example, it might be better to pay extra for the high-speed trains. \n\nOn long distance trains there are 1st and 2nd classes. A 2nd class ticket costs about 80% the price of a 1st class ticket. On high-speed trains you can also choose between basic, standard and flexible tickets. Basic tickets are of course the cheapest.\nOn high-speed trains seating reservation is compulsory. This means your seat is theoretically guaranteed, but it also means you will need to purchase tickets in advance. Actually, many passengers with tickets for other trains that take a wrong one will have to pay the cheap fine for not having a seat reservation. As a result, on major routes or peak hours, expect to find your seat taken, in this case just showing the ticket is enough to get your seat. \nDuring commuter hours, on major north-south routes during the holidays, or before and after large political demonstrations, trains on the lower train types can become extremely full, to the point where it gets very uncomfortable, in which case you could find yourself sitting on a tiny fold out flap in the hallway, where you'll have to move for everyone passing by. \n\nWhile between Milan and Naples (including Bologna, Florence and Rome) high-speed trains cut travel times in half, on other routes, such as between Rome and Genoa, Naples and Reggio Calabria, Venice and Trieste, high-speed trains travel on the traditional line rather than on a dedicated high-speed line, with only marginally shorter travel times compared to Intercity trains, thus taking them might be a waste of money. Just check the Trenitalia website [http://www.trenitalia.com/tcom-en] or the printed schedule, usually located near the entrance to each platform, to see how long the trip will take. \n\nOn long routes, such as [[Milan]] - [[Rome]] or [[Milan]] - [[Reggio Calabria]], Trenitalia operates special night trains '''Treni Notte'''. They depart around 22.00 and arrive in the morning. Depending on the train, you may be able to choose between normal seats, couchette and sleeper cabins of different categories. Seats are cheapest, but even sleeper cabins are not prohibitively expensive and are a very relaxing way to travel long distances. Also keep in mind some trains do not provide air conditioning so bring your own water bottle during the hot summer months.\n\nOn the train schedules displayed at each station, every train is listed in different colours (i.e. blue, red, green).  The arrival times are listed in parentheses next to the names of each destination.  One thing to watch out for is that certain trains only operate seasonally, or for certain time periods (for example, during holidays). \n\nThe queues to buy tickets can be very long, and slow, so get to the station early.  There are touch-screen ticket machines which are very useful, efficient, and multilingual, but there are never that many, and the queues for those can be very long too. \n\nYou can also buy tickets online on the Trenitalia [http://trenitalia.com/] website; you will receive a code (codice di prenotatione (PNR)) that is used to pick up the ticket from a ticket machine in the station (\"Self Service\"). For some (but not all) trains you can also choose a ''ticketless'' option, where you print out the ticket yourself. See also below at [[Italy#Trenitalia Ticketless|Trenitalia Ticketless]]. You can also choose an option to have a \"proper\" receipt printed on the train, should you need one. By default the site will only show the \"best\" (usually more expensive) connections - you may select to \"show all connections\" to see if there are slower but cheaper connections available.\n\nHigh-speed trains can fill up, so if you're on a tight schedule you should buy those tickets in advance. In general, you should buy the tickets ''before'' boarding the train. The Italian Rail recently (end of 2007) started a campaign against fare evasion, and introduced heftier fines (starting at €50). If you're really running late and you have no ticket, it's probably best to directly talk with the conductor (''il controllore'' or ''il capotreno'') outside the train when boarding. \n\nRemember that you '''must''' validate the ticket before boarding most trains, by stamping it in one of the yellow boxes (marked ''Convalida''). Travelling with an unstamped ticket is technically the same as travelling without ticket. It is quite important not to forget to validate your ticket as the conductors are generally not tolerant in this particular matter. The exception are tickets which specify the day and time of travel; since those are only valid for one specific train they generally do not need to be validated.\n\nThe cheapest and best way to travel in a region is to buy  a '''zone ticket card'''. A chart displayed near the validating machine tells you how many zones you must ''pay'' between stations. To buy a zone card for the next region you would have to get off the train at the last station and because the stops are so short you would have to board the next train (usually in about 1 hour).\n\nAs of January 10, 2005 a '''smoking ban''' in public places went into effect in Italy. You will be subject to fines for smoking on any Italian train.\n\nThere are special deals offered too, some of them are reserved to foreign tourist and others are available to locals. Some deals are passes that allow travel during a chosen period, while other special offers are normal tickets sold at decent prices with some restrictions. Before you choose to buy a pass, check first if it is cheaper than buying a normal ticket (or better, a discounted normal ticket, if available).\n\nIf you are traveling a lot, and you're not Italian and a resident of another EU nation,  you can get a TRENITALIA PASS: you buy a number of days of travel to be used within 2 months, however you still have to pay a supplement on the compulsory reservation services, i.e. TBiz, Eurostar Italia, Intercity Plus and Intercity which will between EUR 5.00 and EUR 25.00 depending on the train type. You should be aware that reserved seats available for pass holders is quite limited. Additionally, there are substantial discounts for advanced reservations which can often be lower than the reservation fee for using the pass. This is particularly true of the high speed trains. Also note that there is a second network of private high speed trains called Italo[http://www.italotreno.it/?sc_lang=en] which do not recognize the pass; prices are similar and similarly discounted for advance booking. Pass details are on the Trenitalia website [http://www.trenitalia.com/tcom-en], and also on RailChoice website at [http://www.railchoice.co.uk/trenitalia/information.asp?aid=&prodid=7].\n\n===Trenitalia Ticketless===\nTrenitalia's Ticketless option is only available when booked online or at an approved travel agency, and only for high-speed and intercity trains. The Ticketless solution allows you to buy a ticket online, get a PNR code via mail and board the train directly. You can choose whether to obtain a receipt by email or pick it up on board the train. On board you must tell the conductor your PNR code to allow him/her to issue the receipt, or confirm your presence on board if you have already obtained the payment receipt by email.\n\n===By car===\nIn Northern and Central Italy there's a well-developed system of motorways (''autostrade''), while in the South it is a bit worse for quality and extent. Every motorway is identified by an A followed by a number on a green backdrop. Most motorways are toll roads. Some have toll stations giving you access to a whole section (particularly the ''tangenziali'' of Naples, Rome, and Milan, for example), but generally, most have entrance and exit toll stations; on those motorways, you need to collect a ticket upon entrance and your toll amount will be calculated upon exit depending on the distance covered. Tolls depend on the motorways and stretches; as a rough estimate, you should expect a toll between €0.06 and €0.12 for each kilometre. Don't lose your entrance ticket, for if you do, it will be assumed you have entered the motorway at the farthest station from your exit, thus you will be charged the maximum toll possible. All the '''blue lanes''' (marked '''\"Viacard\"''') of toll stations are automatic machines accepting major credit cards as well as pre-paid cards (called ''Viacard'') that are for sale at service stations along the motorway or for instance at several tobacconists' in cities. If you have problems with the machine (eg, your credit card can't be read), press the ''assistenza'' button and wait for an operator to help you - be prepared to have to pay your toll in cash if problems persist. '''Do not back up''' to move into another lane, even if you might see other locals doing it, unless the personnel or the police clearly instruct you to do so; backing up in toll stations is considered equivalent to backing up on the motorway and ''very heavily'' fined if you get caught.\n\nMany Italians use an electronic pay-toll device, and there are reserved lanes marked in '''yellow''' with the sign '''\"Telepass\"''' or a simply '''\"T\"'''. Driving through those lanes (controlled by camera system) without the device will result in a fine and a payment of the toll for the longest distance. Due to agreement with other countries, if you're foreigner, you'll pay also extra cost for locating you in your country.\n\nSpeeding on the ''autostrade'' is nowadays far less common than in the past because of sensibly strengthened control in the last years. There are a number of automatic and almost invisible systems to punish speeding and hazardous driving, also Italian Highway Patrol (''Polizia Stradale'') operates several unmarked cars equipped with very advanced speed radars and camera systems. Since 2006, several sections of the Italian Highways are equipped with an automatic system called ''Tutor'' with automatic license plate recognition, which checks the average speed of all vehicles over a road stretch. The coverage of this system is being extended to more and more motorways. At times, road signs will remind you of the presence of this system.\n\nIf virtually all vehicles around you seem to behave, scrupulously driving at the speed limit or even a bit below, this is a good hint that some kind of enforcement system is in operation on that road. As a foreigner, it will be better to stay on the safe side and respect limits and rules at all times, even when locals driving like crazy might lead you to think a certain speed limit or \"no passing\" sign was a mere suggestion: every now and then, those locals do encounter the police on their way.\n\nWhen Italian drivers flash their lights it may be meant either as a demand to get out of the way or as an invitation to go first, depending on the situation. A vehicle coming in the opposite direction flashing repeatedly might warn you about a danger or a police car/checkpoint further on the road (even though this warning is forbidden).\n\nUnless different limits are posted, general speed limits are:\n*130km/h on motorways (''autostrade'') (110 km/h in case of rain, 50 km/h in case of fog);\n*110km/h on divided, grade-separated highways marked with blue motorway signs at the entrances, called ''superstrade'';\n*90km/h general speed limit on highways and roads outside urban areas;\n*50km/h in urban areas - an urban area beginning with a white sign with the town/city name written in black, and ending with a similar sign barred in red.\n\nItalian laws allow a 5% (minimum 5km/h) tolerance on speed limits.\nFines are generally very expensive. If you are caught doing more than 40km/h over the speed limit, you will be fined in excess of €500 and will receive an immediate driving ban from 1 to 3 months, leaving you on foot that very moment (you may reach the destination of your current journey). Non-resident drivers of vehicles with foreign registration are required either to pay their fines on the spot if they accept it, or to pay a deposit on the spot if they intend to appeal afterwards; either way, you must pay something immediately and the police won't hesitate to escort you to the nearest ATM to withdraw the cash you need. While the chances of getting caught are admittedly not terribly high, you really don't want all of this to happen to you.\n\nAs of 2003, all vehicles must use headlights at all times outside urban areas, including motorways. Motorbikes must drive with headlights on at all times everywhere.\n\nThe issue of drunk driving has received a great deal of attention in the last years after a series of lethal accidents. The tolerated limit is '''0.50g/L''' in blood; being above this limit is a crime punishable by heavy fines, license revocation, jail time and even immediate confiscation of one's own vehicle in the most serious cases. The limit for drivers under 21 years of age or less than 3 years of driving experience or professional drivers is '''zero'''. Unfortunately, enforcement, although stronger than before, is still insufficient and drunk driving is still somewhat an issue.\n\nAll passengers are required to wear their seat belts and children under 10 must use the back seats. Children under 12 years of age must use either an approved car seat or a booster seat, depending on the age.  \n\nAt unmarked intersections, you are supposed to yield to any vehicle coming from your right. Be on the look-out because many Italians seem to ignore this rule and will insist on an non existent right of way just because they are going straight on or they are travelling on what they think is the main road, even if the intersection is actually completely unmarked. This especially occurs in large cities at night time, when traffic lights at some intersections are switched off. Most times, the minor roads at those intersections will have a \"give way\" sign, but sometimes they don't, which is both confusing, because you never know if the crossing road has a sign or is unmarked, and dangerous because you might expect the vehicle coming from your left to let you pass while it will assume you have a \"give way\" sign and will carry on travelling like a bullet.\n\nBe advised that many Italians don't take road markings too seriously (a few of them don't even seem to notice there are any road markings...), which can be odd if you come from north of the Alps. On multi-lane roads, you should always be wary of vehicles on other lanes invading your lane in curves. Lane markings in multi-lane roundabouts are systematically ignored and virtually all motorists will \"cut off\" while negotiating the roundabout and again when exiting, of course without signalling. There is a fair amount of confusion in Italy about the correct behaviour in large roundabouts; you should exercise caution there, expect vehicles entering, turning and exiting at any time without signalling and never travel side by side with other vehicles in a roundabout assuming the other will respect the lane markings.\n\nSignposts used in Italy are patterned according to EU recommendations and use mostly pictographs (not text). Motorway (''autostrade'') directions are written on a green background while general highway signs (including those on the divided-carriageway, grade-separated ''superstrade'') are on a blue background, and urban or local road signs are on a white one.\n\nWhen on a timetable, use the ''autostrade'' - marked in green - where available and avoid using the general highways - marked in blue - for long distances (unless they are the divided-carriageway, grade-separated ''superstrade''). While the toll on the ''autostrade'' can be rather expensive, they significantly decrease your travel time, whereas general roads can be annoyingly slow since they are heavily used by local traffic, can be clogged with trucks, can feature lots of roundabouts or traffic lights and will often run through towns and villages without bypasses. On the other side, general roads often offer breath-taking sceneries and should be your first choice if you are not in a rush and want to explore the real nature of the country.\n\nFuel prices are a bit more expensive than in western Europe and considerably more expensive than in North America and Japan. As of 2016, prices wander about €1.35 per litre for gasoline and €1.15 per litre for diesel. At most stations, only one sort of 95-octane gasoline and one sort of diesel is available; some others additionally have premium gasoline and/or premium diesel sorts. At many service stations, there is a considerable price difference between self-service filling (''self-service'') and having an attendant do it (''servito''). The respective pumps are marked accordingly when you enter the gas station, and you are supposed to pull up to the pump(s) according to the type of service you'd like. If you stop at an attendant-served pump, just wait and an attendant will pop out within seconds.\n\nTraffic in large Italian cities is really heavy and finding a parking spot can vary from a challenging to an impossible enterprise at times, so driving in Italian large cities is not advisable unless you really need to. Basically in any large city, you'll be better off parking your vehicle at a park-and-ride facility or somewhere in the outskirts and using public transport, which is reasonably reliable and quite cheap.\nBe very careful with ''Zone a Traffico Limitato'' or [http://www.slowtrav.com/italy/driving/traffic_cameras_speeding.htm '''ZTL'''s (Limited Traffic Zones)]. They are restricted areas in many medium-sized and large Italian cities, mostly but not only in the historical centres, where only authorized vehicles are permitted. The entrance to a ZTL is marked by signs and cameras, which go easily unnoticed by tourists driving a car. Many tourists every year report being fined (about €100) for entering a ZTL unknowingly. Tourists renting a car '''will''' end up receiving one or more tickets months later at their homes, including additional fees for the paperwork needed to send the papers abroad. Also, the renting companies may charge €15-50  to give the driver details to the police. So entering those zones without authorization might easily add up to a fine of more than €200. If you booked accommodation in a city centre and plan to reach it by car, you should check in advance if it lies within such a limited zone and if you are entitled to an authorization. If you plan to rent a car, the following car rental brokers and companies are a good choice: AutoEurope.com, Avis, Hertz, Europcar.\n\n===By bus===\nBuy town bus tickets from corner shops, bus company offices or automated machines before boarding (on ''some'' systems, tickets ''might'' be bought on-board from an automated machine). Buying tickets from the bus driver is generally not possible.\nThe payment system for most mass transit in Italy (urban trains, city buses, subway) is based on voluntary payment combined with variable enforcement. Tickets are bought before boarding and validated on an on-board machine; inspectors may board the vehicle to check the passengers' tickets and issue fines to those who do not have a validated ticket. Bus company inspectors are generally recognizable by some item displaying the company's logo. When issuing a fine inspectors are allowed to ask to see your documents, and they have to give some sort of receipt with date, time and location. They are never allowed to directly collect the fine (which generally can be payed at a post office). Assaulting an inspector during his work is a serious offense.\n\nDaily, weekly, monthly and year-round tickets are generally available, in addition to multi-use tickets. These may or may not need to be validated. In almost every city there's a different pricing scheme, so check in advance ticket formulas and availability.\nFor tourists it may be very convenient to buy daily (or multi-day) tickets that allow you to travel as much as you want in a single (or more) day.\nEvery major city also has some type of '''City Card''', a fixed-fee card allowing you to travel on local public transportation and visit a number of museums and giving you discounts in shops, hotels and restaurants.\n\nCheck for both these possibilities at local Tourist Offices or on the city's website (which is often of the form www.comune.''cityname''.it as for example www.comune.roma.it).\n\n===By thumb===\nHitchhiking in Italy is related with the 1960's hippies and \"on the road\" kind of culture. Therefore, it is considered out-dated and useless. You will almost never find Italians hitchhiking unless there's a serious problem with the bus or other means of transportation. Also, it is nowadays common to spot prostitutes by the side of the road pretending to hitchkike to attact clientele so it's advisable to avoid being mistaken for one.\nHitchhiking in the summer in touristy areas works okay because you'll get rides from Northern European tourists, and it works okay in very rural areas as long as there is consistent traffic (because you're still playing the odds), but hitchhiking near large cities or along busy routes is '''extremely frustrating'''. Hitchhiking along expressways and highways is forbidden by law. Off the Autostrada things are also a bit difficult: Italians are generally friendly people, but they're less likely to pick up hitchhikers than anyone else in the world.  It is easier to hitchhike out of the Bronx than it is to hitchhike in Italy.\n\n===By boat===\nApproaching Italy by sea can be a great experience and is a good alternative to traditional onshore “tours”.\n\nA yacht charter to Italy is a fulfilling way to experience the country. Although the yacht charter industry is smaller than one would expect for this incredibly popular tourist destination, there are many reasons to choose a yacht over a more conventional onshore approach. The Italian coast, like the French coast, attracts luxury yacht charters of the highest standards. “Touring” Italy from a private yacht is surprisingly convenient and comfortable. Italy’s dramatic coastline is best appreciated from the sea and the Italians know it! You may take a swim whenever you like, and many of the most famous sights are within easy reach of the seashore. Cruising on a private yacht also offers you a certain relief from the crowds and traffic that are traditionally unavoidable in Italy’s most popular destinations.\nThere are many companies offering luxury yacht charters in Italy.\n\nThere are major distinct nautical regions in Italy: [[Tuscany]], Amalfi Coast, [[Sardinia]] and [[Sicily]]. Each has its own flavour and focus. Be sure to plan your itinerary carefully as each region is rewarding in its own particular way.\n\n==Talk==\nNot surprisingly, '''[[Italian phrasebook|Italian]]''' is the language spoken natively by most Italians.\n\nEvery region in Italy has a distinct native Romance dialect (which is, sometimes, a language) in addition to Italian that may or may not be the native language of the locals depending on the area: in areas like Rome or Milan the spoken language is nowadays mostly Italian with slight local influence, whereas in rural areas the local language is more common; though people are usually bilingual.\n\nA good phrasebook will be very useful if you're going anywhere remote, while in most big cities you will find many people understanding English, Spanish or French. But even in those areas Italians will be happy to hear you trying to speak Italian or the local language, and will try to understand you even if you are making many mistakes. If you want your errors to be corrected to help you better learn the language, don't forget to ask before starting a conversation. Italians will rarely correct you otherwise as they consider it very impolite to do so. They also appreciate your efforts to speak their language, even if you do it badly, and won't make too much fuss about your mistakes. \n\n'''English''' is widely spoken at varied levels of proficiency in the well-traveled touristic areas where it may be used by shopkeepers and tourist operators. Outside of that, you will find that most Italians are not conversant in English, a relatively new subject in schools (first introduced in the 1970s instead of French). While most younger Italians have studied English, due to a lack of practice and exposure proficiency tends to be poor. Nevertheless, the most basic words and phrases usually stick, and there is often at least one person in a group of younger people who knows enough English to help you out. Senior citizens rarely know English, but they'll try to help you anyway with gestures or similar words and they will most surely assume you understand Italian. If you are going to speak in English, it is polite begin the conversation in Italian and ask if the person understands English before proceeding. Speaking in a foreign language while assuming it will be understood might be considered very arrogant and impolite by many Italians.\n\nIn [[South Tyrol]] the majority of people also speaks Austro-Bavarian dialects of German as their native tongue (except in the region's capital Bolzano where it is spoken by only about a fourth of the population), and German is an official language of the autonomous province in addition to Italian. That is because those regions used to be part of the Austro-Hungarian Empire until the end of World War I.\n\n'''Spanish''', '''French''' and '''Portuguese''' are not as widely spoken but as they are similar enough to Italian that people might be able recognise some words, thus making yourself understood; note however that trying to address people in Spanish - or confusing Italian with that language - is considered rather annoying by the locals. In the northwesternmost [[Valle d'Aosta]] region there is a Franco-Provençal speaking minority.\n\nIn the northern part of Italy, there are small pockets of other Romance languages like Ladin, a Rhaeto-Romance language related to [[Switzerland]]'s Romansh. Friulano, another Rhaeto-Romance language, is still spoken by a small minority in the border province near Slovenia. There are several small pockets of [[Greek]]-speaking communities in the southern regions of [[Calabria]] and [[Puglia]] and there are an estimated 100,000 [[Albanian]] speakers in Puglia, Calabria and Sicily&mdash;some of which have migrated in Middle Ages and thus speak rather medieval [[Arberesh phrasebook|Arberesh]] language. Italian is the only official language of Italy but some regions have other languages which are also co-official: German in South Tyrol, Slovene in Friuli-Venezia Giulia and French in Val d'Aosta.\n\nSlovene is a native language in parts of Friuli-Venezia Giulia alongside Italian and is widely spoken in villages near the Slovenian border and [[Trieste]]. In all cases Slovene speakers will also speak Italian.\n\n==See==\nThere is so much to see in Italy that it is difficult to know where to begin. Virtually every small village has an interesting location or two, plus a couple of other things to see.\n\n* '''Medieval villages''' and towns are dotted across rural Italy, and make for pleasant day trips or scenic places for a more relaxed holiday. Two notable examples (and UNESCO World Heritage sites) are [[San Gimignano]], known for it's profusion of thin towers, and [[Assisi]], known for Saint Francis of Assisi and the Basilica di San Francesco dedicated to the saint and filled with breathtaking frescos.\n* '''Etruscan Italy.''' If you have limited time and no potential to travel outside the main cities, then don't miss the amazing collection at the Etruscan Museum at Villa Giulia in Rome. Hiring a car gives access to the painted tombs and museum of [[Tarquinia]] or the enormous burial complex at [[Cerveteri]] and those are just the sites within easy reach of Rome.\n[[Image:Bikini.jpg|thumb|Roman bikinis. Mosaic from the Villa Romana at [[Piazza Armerina]], Sicily.]]\n* '''The Greek Influence.''' Well-preserved Greek temples at [[Agrigento]] in the southwest of Sicily and at [[Paestum]], just south of Naples, give a good understanding of the extent of Greek influence on Italy.\n* '''Roman ruins.''' From the south, in Sicily, to the north of the country Italy is full of reminders of the Roman empire. In [[Taormina]], Sicily check out the Roman theatre, with excellent views of Mt. Etna on a clear day. Also in Sicily, don't miss the well-preserved mosaics at [[Piazza Armerina]]. Moving north to just south of Naples, you find [[Pompeii]] and [[Herculaneum]], covered in lava by Mt. Vesuvius and, as a result, amazingly well preserved. To [[Rome]] and every street in the center seems to have a few pieces of inscribed Roman stone built into more recent buildings. Don't miss the Colosseum, the Roman Forum, the Aqueducts, the Appian Way, and a dozen or so museums devoted to Roman ruins. Further north, the Roman amphitheatre at [[Verona]] is definitely not to be missed.\n[[Image:Florence italy duomo.jpg|thumb|Florence's cathedral; bell tower by Giotto to the left and the tower of the Palazzo Vecchio in front]]\n* '''Christian Italy.''' The [[Rome/Vatican|Vatican]] is the seat of the Roman Catholic Church. Although inside Rome it has the status of a separate state. Don't miss St Peter's and the Vatican Museum. Rome, itself, has over 900 churches; a large number of these are worth a quick visit. Throughout Italy there is some truly amazing Christian architecture covering the Romanesque (700-1200); Gothic (1100-1450); Renaissance (1400-1600); and ornate Baroque (1600-1830) styles. Although theft of artwork has been a problem, major city churches and cathedrals retain an enormous number of paintings and sculptures and others have been moved to city and Church museums. Frescoes and mosaics are everywhere, and quite stunning. Don't just look for churches: in rural areas there are some fascinating monasteries to be discovered. When planning to visit churches, note that all but the largest are usually closed between 12.30 and 15.30.\n* '''The Byzantine Cities.''' The Byzantines controlled northern Italy until kicked out by the Lombards in 751. [[Venice]] is of course world famous and nearby Chioggia, also in the Lagoon, is a smaller version.  [[Ravenna|Ravenna's churches]] have some incredible mosaics. Visiting Ravenna requires a bit of a detour, but it is well worth it.\n\n* '''The Renaissance. '''Start with a visit to Piazza Michelangelo in [[Florence]] to admire the famous view. Then set about exploring the many museums, both inside and outside Florence, that house Renaissance masterpieces. The Renaissance, or Rebirth, (''Rinascimento'' in Italian) lasted between 14th and 16th centuries and is generally believed to have begun in Florence. The list of famous names is endless: in architecture  Ghiberti (the cathedral's bronze doors), Brunelleschi (the dome), and Giotto (the bell tower). In literature: Dante, Petrarch and Machiavelli. In painting and sculpture: Leonardo da Vinci, Michelangelo, Donatello, Masaccio and Boticelli.\n* '''The Streets and squares.''' You could visit Italy's cities, never go in a church, museum or Roman ruin, and still have a great time. Just wander around, keeping your eyes open. Apart from in the northern Po and Adige valleys most of Italy (including the cities) is hilly or mountainous, giving some great views. Look up when walking around to see amazing roof gardens and classical bell towers. In cities such as Rome, note the continued juxtaposition of expensive stores with small workplaces for artisans. Search for interesting food shops and places to get a good ice cream (''gelato''). Above all, just enjoy the atmosphere.\n* '''Operas.''' If you are interested in the famous italian Operas, they are on play in various cities: Milan, Verona, Parma, Rome, Venice, Spoleto, Florence, Palermo.\n* '''Western Alps. '''Visiting Western Alps you will have the chance to wander amongst lots of green valleys, as Val Pellice, Val Chisone, Val Po, and many others, in the shade of the highest european peaks. All valleys are full of wandering paths, of any difficulty level, whether you want to softly walk around a mountain lake or try something harder, in the higher valley, inside scenarios of colossal pine woods and space-like high mountain landscapes. People in mountain villages are often quite friendly, as long as you show respect to them and to the place they live in, obviously. The towns you might start your trip from are Cuneo, for the southern valleys; [[File:Monte Granero.JPG|thumb|Lago Lungo and Monte Granero (3171 mt - 10404 ft), Val Pellice]] Pinerolo, for the central ones, Susa and Lanzo for the northern, all easily reachable from Turin.\n\n*<see name=\"Eastern Alps\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">Eastern Alps include a little known but surprisingly beautiful region, [[Trentino-Alto Adige]] as well as the regions of [[Veneto]] and [[Friuli-Venezia Giulia]]. The two provinces comprised in the Trentino-Alto Adige region are actually quite different, both culturally and geographically. While Alto Adige is mostly German-speaking, Trentino belongs to the Italian cultural area. Trentino is one of the most popular Italian regions. It holds an extraordinary variety of landscapes such as woods, wide valleys, streams, waterfalls and lakes. Its mountains, most importantly the chain of the [[Dolomites]], represent a natural monument recognized by UNESCO as a World Heritage Site. But Trentino is also a territory rich in art and culture with its castles which offer a fairy-tale atmosphere and its modern and sophisticated museums such as \"The Museum of Contemporary Art - Mart\" in Rovereto and the Science Museum \"Muse\" in Trento. Both in summer and in winter the region offers the opportunity to spend a holiday enjoying nature, practicing sports or simply enjoying the local culture.</see>\n===Monuments===\n* [[UNESCO World Heritage List#Italy|UNESCO World Heritage]]\n\n===Islands===\n* [[Sicily]], \n* [[Sardinia]], \n* [[Capri]], \n* [[Ischia]], \n* [[Elba]], \n* [[Procida]], \n* [[Aeolian Islands]],\n* [[Tremiti]],\n* [[Ustica]],\n* [[Pantelleria]],\n* [[Aegadi Islands]],\n* [[Pelagie Islands]]\n* [[Dino Island]]\n\n===Museums===\n[[Image:Galleria degli Uffizi Florence.jpg|thumb|The Uffizi gallery in Florence, regarded as being one of the most prestigious art museums in the world.]]\nEvery major city has a number of local museums, but some of them have national and international relevance.\n\nThese are some of the most important permanent collections.\n\n* '''Uffizi Museum''' [http://www.polomuseale.firenze.it/] in Florence, is one of the greatest museums in the world and a must see. Given the great number of visitors, advance ticket reservation is a good idea, to avoid hour-long queues.\n* '''Brera art gallery''' [http://www.brera.beniculturali.it/] in Milan is a prestigious museum held in a fine 17th-century palace, which boasts several paintings, including notable ones from the Renaissance era. \n* '''The Etruscan Academy Museum of the City of Cortona''' [http://www.cortonamaec.org/] in Cortona, Tuscany.\n* '''Egyptian Museum''' [http://www.museoegizio.org/] in Turin, holds the second-largest Egyptian collection in the world, after Egypt's Cairo Museum collection.\n* '''The Aquarium''' [http://www.acquario.ge.it/] in Genoa, one of the largest and most beautiful in the world, is in the '''Porto Antico''' (ancient port) in an area completely renewed by architect Renzo Piano in 1992. \n* '''Science and Technology Museum''' [http://www.museoscienza.org/] in Milan, one of the largest in Europe, holds collections about boats, airplanes, trains, cars, motorcycles, radio and energy. Recently has also acquired the Toti submarine, which is open to visitors.\n* '''Roman Civilization Museum''' [http://www2.comune.roma.it/museociviltaromana/] in Rome, hold the world's largest collection about ancient Rome and a marvellous reproduction (scale 1:250) of the entire Rome area in 325 A.D., the age of Constantine the Great.\n* '''National Cinema Museum''' [http://www.museonazionaledelcinema.org/] in Turin, located inside the wonderful '''Mole Antonelliana''', historical building and symbol of the city.\n* '''Automobile Museum''' [http://www.museoauto.it/] in Turin, one of the largest in the world, with a 170 car collection covering the entire  history of automobiles.\n* '''The [[Rome/Vatican|Vatican]] Museum'''. Not, strictly speaking, in Italy as the Vatican is a separate territory. Visit the museum to see the Sistine Chapel, the rooms painted by Raphael, some amazing early maps and much, much more.\n* '''The Etruscan Museum at Villa Giulia, Rome'''. Amazing collection of Etruscan art.\n\n\n'''Discriminatory pricing Museum''' [http://www.rome-museum.com/tickets.htm]\n\nSome of the State Museums such as the Uffizi, Palazzo Pitti, Accademia and the Medici chapels offer free tickets to European citizens under the age of 18 or over 65. EU citizens between the age of 18 and 25 are eligible for reduced price tickets.BUT remember to bring your passport as a valid form of identity.\n\n==Do==\n\n===Visit the beach===\n\nIn theory beach access is free to all in Italy but as with a lot of things in this country the practice may be somewhat different to the law. Many stretches of beach, particularly those close to urban areas, are let out to private concessions. In the season they cover almost all the beach with rows and rows of sunbeds (lettini) and umbrellas (ombrelloni). You have the right to pass through these establishments without being charged to get to the sea, and should be able to walk along the sea in front of them. More affordable are the beaches in [[Calabria]], most are free, you will only need to pay for the eventual equipment you want to rent.\n\nSouth of Rome there are 20km of free beach at the Circeo National Park. This is thank to '''Dr. Mario Valeriani''' [http://www.valeriani.com/Mario-Valeriani.html], who was in charge of that area after WWII and never gave permissions to build anything, in spite of the very generous bribes offered by a multitude of would be investors and private millionaires, as he thought this was a natural marvel that was to remain as it was intended. So today we can all enjoy this stretch of nature. You can bring your own chair and sun cover and you will only be charged a parking fee on the main road. \n\nWhile renting lettini for the day is not particularly expensive at establishments, they can fill up very quickly. There are some free beaches everywhere: they are easily identifiable by the absence of regimented rows of lettini.  They can get very crowded: on a Saturday or Sunday in the summer you won’t find an empty stretch of beach anywhere. Most establishments offer full services including entertainment, bar and restaurant, gym classes, kindergarten and much more. Close to urban areas you will never be far from a fish restaurant on the beach or, at the very least, a bar. On the beach, topless women are more or less accepted everywhere but complete nudity is absolutely not accepted anywhere in Italy and it carries a hefty fine and/or arrest.[http://www.quitalia.com/WhatToSee]\n\n===Visit the vineyards===\n\nItaly is famous for its wine. And its vineyards tend to be in the middle of some beautiful scenery. Taking an organized tour is probably your best bet. Day trips can usually be organized through your hotel if you are staying in a major wine area such as [[Chianti]] or through the local tourism office. There are several companies offering longer tours that include meals and accommodation. A simple web search for “Italian vineyard tours” or “wine tour Italy” will find them. Note that these longer tours tend to emphasise good food, great wine and a high standard of accommodation and are thus expensive. \nIf you rent a car and want to organize your own trips, a helpful website is that of the  Movimento Turismo del Vino. [http://www.movimentoturismovino.it/?lang=en] The Italian page has a link to ''itinerari'' which is not available in English. Even if you don’t read Italian you can still find addresses and opening hours of some interesting wine producers. Note that “su prenotazione” means By Appointment Only.\n\n===Cycling tours===\nItaly has a passion for cycling and there is no better way to explore off the tourist path, than by bicycle.  The main hub for the bicycle manufacturing industry has always been in Northern Italy.  Each region is varied in the style of riding you will encounter and unique and cultural specialities.  There are several companies that offer cycling tours throughout Italy.  You can either cycle on your own as a self guided tour or a supported tour that provides a guide to help you during your program.  You can do destination tours changing cities each day or ride two or three days in one location before moving on, also there are various skill levels. A good way to find out more information is to visit a web site like [http://www.italiaoutdoors.com/outdoors-italy/biking-italy] or you can google 'Bike Touring Italy' and find several companies offer services.  Be sure to research well so that you find the right tour that suits your riding experience and fitness level..\n\n===Sailing===\nSailing is one of the best ways to see the Italian islands such as Sardinia and Sicily. Most charter companies offer many options from bareboat to crewed and cabin charter, with all types of the boats.\n\nCharter a yacht to discover Italy's numerous islands or to visit hidden coves and beaches that are not accessible otherwise. \n\nLocal yacht charter companies to consider:\n\n* [https://www.silverstaryachting.com/ Silver Star Yachting] is a yacht charter company based in Ischia, Naples.\n* [http://europe-yachts.com/ Luxury Yacht Charter Italy] offers a wide range of Luxury Mega Yachts, sailing Yachts, Catamarans for charter in Italy.\n* [http://http://catamarancharteritaly.com/ Catamaran Charter Italy] offers Catamarans for charter on the all Italian coast.\n* [http://www.globeyachtcharter.com/ Globe Yacht Charter Italy] have variety of sailing yachts and catamarans for charter in Italy.\n\n===Take a Cooking Class===\nItaly is very famous for good food. A must-do in Italy: cooking classes and food touring.  Most cooking classes companies offer many options from fresh pasta making classes to risotto classes or Italian sauces classes or pizza classes. A simple web search for “The Art of Making Pasta Classes” or “Risotto classes” or \"Pizza Making Classes\" will find them. A helpful and comprehensive website offers a wide range of Cooking Classes and Culinary Experience. [http://isacookinpadua.altervista.org]\n\n===Learn Glass Bead Making===\n\n*<do name=\"Courses: Glass Bead Making (Lampwork) / Jewelry Design / Mixed Media\" alt=\"\" address=\"Camaiore\" directions=\"\" phone=\"39 0584-194-4650\" url=\"https://BijouArte.com/\" hours=\"\" price=\"\" lat=\"\" long=\"\">Visit the Bijou Arte Creative Studio/Bead Shop in the pedestrian-only main street of Camaiore, in coastal Tuscany! Beginner & intermediate glass bead making classes introduce students to both basic and advanced lampworking techniques and help pave the way towards finding your own artistic voice. Plus beading and jewelry design classes, mixed media workshops, unique European beading supplies, astrology readings and more. Join us!</do>\n\n==Buy==\n{{Euro}}\nBe careful as to where to exchange money.  Big-branded foreign exchange stalls that you find in train stations and airports, whilst legitimate, may charge a huge commission of approximately 20% on top of the published rates '''plus''' a fixed amount of euro.  '''Read the small print first''' before turning over any foreign currency to the agent. Your USD100 may easily turn into just €50 if you are impulsive. The smaller stalls found in more touristy areas usually offer friendlier rates: you should get something closer to €70 for every USD100 you exchange.        \n\nItaly can be quite an expensive country. As everywhere, major cities and central locations have a higher cost of life than suburban and rural places. It is a general rule of thumb that Southern Italy is less expensive than Northern Italy, especially for food; this will, of course, vary by location.\n\nMeals can be had from as cheap as €3 (if you are happy with a sandwich, panini or falafel from a street vendor); restaurant bills are rarely less than €10 (a burger with fries\\salad and a soft drink from a pub) and generally go to about €20 (a starter, main course and water from a regular restaurant). Also, for dinner, wine may be served even without ordering, and you will almost certainly be charged.\n\nService is always included, either in the display price or a ''coperto'' line on the bill; tipping is thus not necessary, but neither is it frowned upon. Tipping taxi drivers is not necessary, but a hotel porter may expect a little something. And unless otherwise stated, prices are inclusive of IVA sales tax (same as '''VAT'''), which is 21% for most goods, and 10% in restaurants and hotels. On some products, such as books, IVA is 4%. In practice, you can forget about it since it is universally included in the display price.  If you're a non-EU resident, you are entitled to at least a partial VAT refund on purchases of goods that will be exported out of the [[European Union]].  Shops offering this scheme have a '''Tax Free''' sticker outside.  Be sure to ask for your tax-free voucher and have your passport and address (back home) details ready before leaving the store.  You need to purchase at least €155 worth of goods (inclusive of IVA) from a particular merchant during the course of one business day (although you can pool together multiple purchases from the same merchant on that day).  These goods have to be unused when you pass the customs checkpoint upon leaving the EU.  \n\nIf you plan to travel through countryside or rural regions you probably should not rely on your '''credit cards''', as in many small towns they're accepted only by a small number of shops and restaurants.\n\nRemember that in Italy (even during the winter months) it remains very common for shops, offices and banks to close for up to 3 hours during the afternoon (often between 12.30 and 15.30).  Banks, especially, have short hours with most only being open to the public for about 4 hours in the morning and barely 1 hour in the afternoon.\n\n===What to buy===\nItaly is a great place for all forms of shopping. Most cities, villages and towns, are crammed to the brim with many different forms of shops, from glitzy boutiques and huge shopping malls, to tiny art galleries, small food stores, antique dealers and general newsagents. \n\n* '''Food''' is definitely one of the best souvenir you can get in Italy. There are thousands of different shapes of pasta (not only spaghetti or maccaroni). Then, every Italian region has its typical food like cheese, wine, ham, salami, oil, winegare, etc. Don't forget to buy Nutella.\n\n* Italian '''fashion''' is renowned worldwide. Many of the world's most famous international brands have their headquarters or were founded in Italy. \n\n:Milan is Italy's fashion and design capital. In the city one can find virtually every major brand in the world, not only Italian, but also French, English, American, Swedish and Spanish. Your main place for the ''crème de la crème'' shopping is the Via Montenapoleone, but the Via della Spiga, Via Manzoni, Via Sant' Andrea and the Corso Vittorio Emanuele are equally luxurious, if not slightly less prominent, high-class shopping streets. The Corso Buenos Aires is the place to go for mass-scale or outlet shopping. And, the beautiful Galleria Vittorio Emanuele in the centre and Via Dante boast some designer boutiques, too. Virtually every street in central Milan does boast at least some clothing stores of some kind.\n\n:However, Rome and Florence, are too, serious fashion centres, and boast being the birthplace of some of the oldest fashion and jewelry houses in Italy. When in Rome, the chic and beautiful Via dei Condotti, leading to the Spanish Steps, will be your primary point of shopping reference, with boutiques but subsidary streets such as Via dei Babuino, Via Borgognona, Via Frattina, Via del Corso and the Piazza di Spagna. In Florence, Via de' Tornabuoni is the main high-fashion shopping street, and there you'll find loads of designer brands. However, in both cities, you'll be able to find a plethora of chic boutiques, designer or not, scattered around the centre. \n\n* '''Jewellery and accessory''' shops can be found in abundance in Italy. There are loads of jewellery and accessory stores which hail from Italy. Vicenza and Valenza are considered the country's jewellery capitals, which are also famous for their silverware and goldware shops. All over Italy, notably Vicenza, Milan, Valenza, Rome, Naples, Florence and Venice, but also several other cities, you can find hundreds of different jewellery or silverware boutiques. Apart from the famous ones, there are some great quirky and funky jewellery stores scattered around the country. \n\n* '''Design and furniture''' is something Italy is proudly and justifiably famous for. Excellent quality furniture stores can be found all over, but the real place to buy the best deals is Milan. Milan contains amongst the top design rooms and emporia in the world. For the newest design inventions, attend the Fiera di Milano in Rho, where the latest appliances are exhibited. Many Italian cities have great antique furniture stores. So, you can choose between cutting-edge, avant-garde furniture, or old world antiques to buy in this country, which are, by average, of good quality.\n\n* '''Glassware''' is something which Venice makes uniquely but which is spread around the whole of the country. In Venice is famously the capital of Murano (not the island), or glassware made in different colours. Here, you can get stunning goblets, crystal chandeliers, candlesticks and decorations made in stunning, multi-coloured blown glass, which can be designed in modern, funky arrangements, or the classical old style.\n\n* '''Books''' can be found in bookshops in every small, medium sized or big city. The main book and publishing companies/stores in Italy include Feltrinelli, Giunti, Mondadori, Hoepli or Rizzoli. Most big book stores are found in Milan, Turin and nearby Monza, which are the capitals of Italy's publishing trade (Turin was made World Book Capital in 2006) however cities such as Rome and more boast loads of book shops. 99% of the books sold are in Italian.\n\n* '''Art''' shops can be found all over in Italy, notably the most artistic cities of Florence, Rome and Venice. In Florence, the best place to go for buying art is the Oltrarno, where there are numerous ateliers selling replicas of famous paintings or similar things. Usually, depending in what city you're in, you get replicas of notable works of art found there, but also, you can find rare art shops, sculpture shops, or funky, modern/old stores in several cities.\n\n===How to buy===\nIn a small or medium sized shop, it's standard to greet the staff as you enter, not when you approach the counter to pay. A friendly 'Buongiorno' or 'Buonasera' warms the atmosphere. When paying, the staff usually expect you to put coins down on the surface or dish provided, rather than placing money directly into their hands (old money-handling etiquette to avoid messy coin droppings), and they will do the same when giving you your change ('il resto'). This is normal practice and is not intended to be rude.\n\nHaggling is very rare and only ever takes place when dealing with hawkers. They will generally ask for an initial price that is much higher than what they are willing to sell for, and going for the asking price is a sure way to get ripped off. Be advised that often times hawkers sell counterfeit merchandise (in some cases, very believable counterfeits), and that hoping to buy a Gucci purse for €30 off the street might not be in your best interest.\n\nIn all other situations, haggling will get you nowhere.\n\n===Internet===\nDon't forget about the internet. There are various solutions available on the market. The best are eSim based connectivity hubs, such as Nommi. It provides internet in over150 countries at a nearly local price and gives free access to over 4 million Wi-Fi networks around the world which are available via Nommi App as a Wi-Fi map. Additionally, the device functions as a power bank, able to charge a smartphone a few times. Nommi also has a built-in VPN that works in China.\n\n==Eat==\n[[Image:RedMeatWine.jpg|thumb|A traditional Italian meal, with beef with sauce and dark red wine.]]\n[[File:Tiramisu at Garibaldi Italian Cuisine, Bangsar.jpg|thumb|200px|Tiramisu]]\n[[File:Italian gelato.png|thumb|250px|Italian gelato]]\n\n===Cuisine===\nItalian food inside of Italy is different to what is called \"Italian food\" in America. Italy's cuisine is truly one of the most diverse in the world and, in any region, or even city and village you go, there are different specialities. For instance, it could be only misleading to say that Northern Italian cuisine is based on hearty, potato and rice-rich meals, Central Italian cuisine mainly on pastas, roasts and meat, and Southern Italian cuisine on vegetables, pizza, pasta and seafood: there are so many cross-influences that you'd only get confused trying to categorize. And in any case, Italian cuisine, contrary to popular belief, is not just based on pasta and tomato sauce - that's only a tiny snippet of the nation's food, as in some parts of Northern Italy, pasta isn't even used at all, and rice, potatoes, lentils, soups and similar meals are very common in some parts of the country. Italian food is based upon so many ingredients and Italians often have very discriminating tastes that may seem strange to Americans and other visitors.\n\nFor instance, a '''sandwich''' stand might sell 4 different types of ham sandwiches that in each case contain ham, mayonnaise, and cheese. The only thing that may be different between the sandwiches is the type of ham or cheese used in them. Rustichella and panzerotti are two examples of sandwiches well-liked by Italians and tourists alike. Also, Italian sandwiches are quite different from the traditional Italian-American “hero”, “submarine”, or “hoagie” sandwich (which by the way mean nothing to any Italian). Rather than large sandwiches with a piling of meat, vegetables, and cheese, sandwiches in Italy are often quite small, very flat (made even more so when they are quickly heated and pressed on a panini grill), and contain a few simple ingredients with rarely, if ever, lettuce or mayonnaise.\nThe term '''panini''' may be somewhat confusing to travellers from Northern Europe where it has erroneously come to mean a flat, heated sandwich on a grill. In Italy the term is equivalent to \"bread rolls\" (plural) which can be simple rolls or sometimes with basic filling. However instead of a sandwich why not try '''piadinas''' which are a flat folded bread with filling, which are served warm and are typical of the coast of Emilia-Romagna.\n\nAmericans will notice that Italian pasta is usually available with a myriad of sauces rather than simply tomato and [http://www.alfredos.com/roma.html Alfredo]. Also, Italian pasta is often served with much less sauce than in America. This is, in part, because pasta in a restaurant is usually regarded as the first course of a three- or four-course meal, not a meal in itself.\n\n'''Structure of a traditional meal:''' despite the stereotype, your average Italian's meals consist of a small breakfast, a one-dish lunch and a two-dish dinner. Coffee is welcomed at nearly every hour, especially around 10:00 and at the end of a meal (unless that meal is pizza). At the weekends and in restaurants (for other occasions), a meal typically consists of: ''antipasto'' (appetizers: marinated vegetables, mixed coldcuts, seafood, etc), ''primo'' (pasta or rice dish), ''secondo'' (meat or fish course) often with a side-dish known as ''contorno'', and ''dolce'' (dessert).\n\nLike the language and culture, food in Italy '''differs region by region'''. Generally speaking pasta and olive oil are the staples of Southern Italian food, the Central Italian cuisines rely on pasta, meat and olive oil/butter while northern food focuses on rice and butter (but today there are many, many exceptions). Local ingredients are also very important. In warm Naples, citrus and other fresh fruit play a prominent role in both food and liquor, while in Venice fish is obviously an important traditional ingredient. As a guideline, in the south cuisine is focused on pasta and dessert, while at north meat is king, but this rule can be very different depending on where you are.\n\nA note about '''breakfast''' in Italy: this is a ''very'' light meal, often just a cappuccino or coffee with a pastry (''cappuccino e cornetto'') or a piece of bread and fruit jam. You should not expect a large breakfast. In Italy, it is not customary to eat eggs and bacon for breakfast - the very thought of it is revolting to most Italians. Indeed, no salty foods are consumed for breakfast. Additionally, cappuccino is considered something you'd have for breakfast; ordering one after lunch or dinner is considered an oddity and a typical \"tourist thing\". An ordinary coffee is considered much more appropriate.\n\nAnother enjoyable Italian breakfast item is '''cornetto''' (plural: ''cornetti''): a croissant or light pastry often filled with jam, cream or chocolate.\n\n'''Lunch''' is seen as the most important part of the day. In the past, many shops used to close down and resume after the two hour break period and to compensate for this, businesses used to stay open later than in most other European towns, often until 20:00.  However, this is no longer the case and now the business hours of a typical Italian day are comparable to those in the rest of Western Europe but still a lot shorter than in North America or Asia. Good luck trying to find a place open during the so-called \"pausa pranzo\" (lunch break), when visiting a small town, but this is not the case in the biggest cities or shopping centres.\n\n'''Dinner''' (i.e. the evening meal) is generally taken late, usually around 20:00. In summer, if you are in a restaurant before 20:00 you are likely to be eating on your own, and it is quite normal to see families with young children still dining after 22:00. \n\nCuisine is considered an art. Great chefs like Gualtiero Marchesi or Gianfranco Vissani are seen as half-way between TV stars and magicians. Italians are extremely proud of their culinary tradition and generally love food and talking about it - however, they are ''definitely'' not so fond of common preconceptions, such as that Italian food is only pizza and spaghetti. They also have a distaste for \"bastardized\" versions of their dishes that are popular elsewhere, and many Italians have a hard time believing that the average foreigner can't get even a basic dish \"right\". \n\nA note about service: do not expect the kind of dedicated, focused service you will find in American restaurants. In Italy this is considered somewhat annoying and people generally prefer to be left alone when consuming their meal. You should expect the waiter to come and check on you after your first course, maybe to order something as second course. \n\nYou should consider that Italy's most famous dishes like pizza or spaghetti are quite lame for Italians, and eating in different areas can be an interesting opportunity to taste some less well known local speciality. Even for something as simple as pizza there are significant regional variations. The pizza of Naples has a thick, soft crust while that of Rome is considerably thinner and crustier.\n\nWhen dining out with Italians read the menu and remember that almost every restaurant has a typical dish and some towns have centuries-old traditions that you are invited to learn. People will be most happy when you ask for local specialities and will gladly advise you. \n\nIn Northern Italy at around 17:00 most bars will prepare for an '''aperitivo''' especially in cosmopolitan Milan, with a series of plates of nibbles, cheese, olives, meat, bruschetta and much more... This is NOT considered a meal and should you indulge yourself in eating as if it was dinner, you would most likely not be very much appreciated. All this food is typically free to anyone who purchases a drink but it is intended to be just a snack before the main meal.\n\nAn interesting piece of trivia mostly lost on tourists and locals alike, is that the tomato did not make its way into Italian cuisine until well into the 17th century. The tomato plant is native to South America and as such, was not \"discovered\" by Europeans until its introduction in the late 1600s and early 1700s. No, Da Vinci didn't eat pizza with tomato sauce and Michelangelo didn't dine on it either.\n\n===Specialities===\nAlmost every city and region has its own specialities, a brief list of which may include:\n\n*'''Risotto''' - Arborio rice that has been sautéed and cooked in a shallow pan with stock. The result is a very creamy and hearty dish. Meat, poultry, seafood, vegetables, and cheeses are almost always added depending on the recipe and the locale. Many restaurants, families, towns, and regions will have a signature risotto or at least style of risotto, in addition or in place of a signature pasta dish (risotto alla Milanese is a famous Italian classic). Risotto is a typical dish in Lombardy and Piedmont.\n*'''Arancino''' - A deep fried ball of rice with tomato sauce, eggs, and cheese. It's a southern Italian speciality, though are now quite common all over. It is NOT to be confused with '''supplì''', which are a strictly Roman speciality and are pretty much unheard of in the rest of the peninsula.\n*'''Polenta''' - Yellow corn meal (yellow grits) that has been cooked with stock. It is normally served either creamy, or allowed to set up and then cut into shapes and fried or roasted. It is a very common dish in northern mountains restaurants, usually eaten with deer or boar meat.\n*'''Gelato''' This is the Italian word for ice cream. The non-fruit flavours are usually made only with milk. Gelato made with water and without dairy ingredients is also known as sorbetto. It's fresh as a sorbet, but tastier. There are many flavours, including coffee, chocolate, fruit, and tiramisù. When buying at a gelateria, you have the choice of having it served in a wafer cone or a tub; in northen Italy you'll pay for every single flavour \"ball\", and the panna (the milk cream) counts as a flavour; in Rome you can buy a small wafer cone (around €1.80) a medium one (€2.50) or a large one (€3.00) without limit of flavours, and the panna is free. \n*'''Tiramisù''' Italian cake made with coffee, mascarpone, and ladyfingers (sometimes rum) with cocoa powder on the top. The name means \"pick-me-up\".\n\n====Pizza====\n[[Image:Pizza_margherita.jpeg|thumb|250px|The real pizza margherita]]\nPizza is a quick and convenient meal.  In most cities there are pizza shops that sell by the gram.  Look for a sign '''Pizza al taglio'''. When ordering, simply point to the display or tell the attendant the type of pizza you would like (e.g. pizza margherita, pizza con patate (roasted or french fries), pizza al prosciutto (ham), etc.) and how much (\"Vorrei (due fette - two slices) or (due etti - two-tenths of a kilogram) or simply say \"di più\" - more, or \"di meno\" - less, \"per favore\").  They will slice it, warm it in the oven, fold it in half, and wrap it in paper. Other food shops also sell pizza by the slice. Remember, getting your meal on the run can save money but some touristy sandwich shops charge an additional fee if you want to sit to eat your meal. Also, in many parts of the country pizzas have a thinner base of bread and less cheese than those found outside Italy. The most authentic, original pizzas is found in Naples - often containing few ingredients (tomato and oregano, or tomato and mozzarella). The Neapolitan one is the only traditional Italian pizza. You can eat it in Naples, of course, but you can also find some few pizzerias in other big cities which make a pizza quite similar to the real Neapolitan pizza. \n\nThe traditional, round pizza is found in many restaurants and specialized pizza restaurants (''pizzerie''). The \"Ristorante-Pizzeria\" is very common in Italy: it is basically a restaurant that serves also handmade pizza. Until a few years ago, it was rare to find a restaurant that serves pizza at lunchtime, nowadays it is not so and pizza at lunchtime is quite common (sometimes it is better to ask to a waiter if they do that before ordering).\n\n====Cheese and sausages====\nIn Italy you can find nearly 800 kinds of cheese, including the famous Parmigiano Reggiano, and over 400 types of sausages.\n\nIf you want a real kick, then try to find one of the huge open markets, which are always open on Saturdays and usually during other days, except Sunday, as well. You will find all types of cheese and meat on display.\n\n===Restaurants and bars===\n[[Image:Via Veneto restaurant.jpg|thumb|There are numerous restaurants in Italian cities (like this one, in the exclusive Via Veneto, Rome)]]\nItalian bars in the centre of major cities charge more (typically double whatever the final bill is) if you drink or eat seated at a table outside rather than standing at the bar or taking your order to go. This is because bars are charged a very high tax to place tables and chair outside, so since most people do not use tables anyway, they had decided long ago to only charge those who do. The further away you are from the center streets, the less this rule is applied. When calling into a bar for a coffee or other drink you first go to the cash register and pay for what you want. You then give the receipt to the barman, who will serve you.\n\nRestaurants - with the notable exception of Rome and the surrounding Lazio region, where such a charge is forbidden by law - charge a small ''coperto'' (cover charge). Some years ago attempts were made to outlaw the practice, with limited success. You can be charged for bread, but if you don't want to pay for it just send it away.\n\nSome restaurants now levy a service charge, but this is far from common. In Italian restaurants a large tip is never expected. The customary 15% of the United States may cause an Italian waiter to drop dead with a heart attack. Just leave a euro or two and they will be more than happy. \n\nThe traditional meal can include (in order) ''antipasto'' (starter of cold seafood, gratinated vegetables or ham and salami), ''primo'' (first dish - pasta or rice dishes), ''secondo'' (second dish - meat or fish dishes), served together with ''contorno'' (mostly vegetables), cheeses/fruit, ''dessert'', coffee, and spirits. Upmarket restaurants usually refuse to make changes to proposed dishes (exceptions warmly granted for babies or people on special diets). Mid-range restaurants are usually more accommodating. For example, a simple pasta with tomato sauce may not be on the menu but a restaurant will nearly always be willing to cook one for kids who turn their noses up at everything else on the menu.\n\nIf you are in a large group (say four or more) then it is appreciated if you don't all order a totally different pasta. While the sauces are pre-cooked the pasta is cooked fresh and it is difficult for the restaurant if one person wants '''spaghetti''', another '''fettuccine''', a third '''rigatoni''', a fourth '''penne''' and a fifth '''farfalle''' (butterfly shaped pasta). If you attempt such an order you will invariably be told that you will have a long wait!\n\nWhen pizza is ordered, it is served as a ''primo'' (even if formally it is not considered as such), together with other ''primi''. If you order a pasta or pizza and your friend has a steak you will get your pasta dish, and probably when you've finished eating the steak will arrive. If you want ''primo'' and ''secondo'' dishes to be brought at the same time you have to ask. \n\nRestaurants which propose '''diet food''', very few, usually write it clearly in menus and even outside; others usually don't have any dietetic resources. People with coeliac disease may be surprised that many restaurants and shops offer '''gluten-free''' (''senza glutine'') food and the disease is generally well known.\n\n===Gastronomia===\nA Gastronomia is a kind of self-service restaurant (normally you tell the staff what you want rather than serving yourself) that also offers take-aways. This can give a good opportunity to sample traditional Italian dishes at fairly low cost. Note that these are not buffet restaurants. You pay according to what you order.\n\n===The 'Cesarine' of \"Home Food\"===\nThe '''Cesarine''' of '''Home Food''', present in many Italian places, spread and enhance the traditional recipes, the peculiarities of the territory of the local products and welcome guests within their houses, preparing for them courses from a menu in which intertwine skills, gastronomic tradition and unforgettable flavours.\n\n[http://www.homefood.it/en/ The Home Food project], with the patronage of the Ministry of Agriculture and the University of Bologna, stands for the protection and preservation of traditional food culture and typical products of Italy. Through the creation of a virtuous circle and non-profit, Home Food, allows its members to be Guests at the table of Italian families and enjoy the food prepared by the lady of the houses, which are friendly called with the epithet of \"Cesarine\", and are the depositories of the ancient culinary know-how.\n\n==Drink==\nBars, like restaurants, are non-smoking.\n\nItalians enjoy going out during the evenings, so it's common to have a drink in a bar before dinner. It is called '''aperitivo'''.\nWithin the last couple years, started by Milan, a lot of bars have started offering fixed-price cocktails at aperitivo hours (18 - 21) with a free, and often a very good, buffet meal. It's now widely considered stylish to have this kind of aperitivo (called '''Happy Hour''') instead of a structured meal before going out to dance or whatever.\n\nWhile safe to drink, the tap water in some parts of Italy (e.g. Sardinia, or parts of the South) can be cloudy with a slight off taste. Some Italians prefer bottled water, which is served in restaurants; make sure you let the waiter/waitress know you want regular water (acqua naturale or acqua liscia) or else you could get water with either natural gas (acqua effervescente) or with added carbonation (acqua frizzante or acqua gassata); usually the waiter will ask which one you want with phrases like \"Liscia/naturale o gassata/frizzante?\" (Still or sparkling water?). \nRome, in particular, has exceptional pride in the quality of its water. This goes right back to the building of aqueducts channeling pure mountain water to every citizen during Roman times. Don't waste plastic bottles! You can refill your drinking containers and bottles at any of the constant running taps and fountains dotted around the city, safe in the knowledge that you are getting excellent quality cool spring water - try it!\n\n===Wine===\n\nItalian wine is exported all over the world, and names like Barolo, Brunello and Chianti are well-known. In Italy wine is a substantial topic, a sort of test which can ensure either respect or lack of attention from an entire restaurant staff. Doing your homework ensures that you will get better service, better wine and in the end may even pay less.\n\n{{infobox|DOC, DOCG, IGT?|The ''Denominazione di origine controllata'' certificate restricts above all the grape blend allowed for the wine, and in itself it is not yet a guarantee of quality. The same applies to the stricter ''Denominazione di origine controllata e garantita''. These two denominations are indications of a traditional wine typical of the region, such as [[Chianti]], and often a good partner for local food. But some of the best Italian wines are labeled with the less strict ''Indicazione geografica tipica'' designation, often a sign of a more modern, \"international\" wine.}}\n\nSo before reaching Italy, try to learn a little about the most important wines of the region you are planning to visit. This will greatly increase you enjoyment. Italian cuisine varies greatly from region to region (sometimes also from town to town), and wine reflects this variety.  Italians have a long tradition of matching wines with dishes and often every dish has an appropriate wine. The popular \"color rule\" (red wines with meat dishes, white wines with fish) can be happily broken when proposed by a ''sommelier'' or when you really know what you are doing: Italy has many strong white wines to serve with meat (a Sicilian or Tuscan ''chardonnay''), as well as delicate red wines for fish (perhaps an Alto Adige ''pinot noir'').\n\nUnlike in the UK, for example, the price mark-ups charged by restaurants for wines on their wine list are not usually excessive, giving you a chance to experiment. In the big cities, there are also many wine bars, where you can taste different wines by the glass, at the same time as eating some delicious snacks. Unlike in many other countries it is unusual for restaurants to serve wine by the glass.\n\nThe ''vino della casa'' (house wine) can be an excellent drinking opportunity in small villages far from towns (especially in Tuscany), where it could be what the patron would really personally drink or could even be the restaurant's own product. It tends to be a safe choice in decent restaurants in cities as well. Vino della casa may come bottled but in lower-priced restaurants it is still just as likely to be available in a carafe of one quarter, one half or one litre. As a general rule, if the restaurant seems honest and not too geared for tourists, the house wine is usually not too bad. That said, some house wines can be dreadful and give you a nasty headache the next morning. If it doesn't taste too good it probably won't do you much good, so send it back and order from the wine list.\n\nItalians are justly proud of their wines and foreign wines are rarely served, but many foreign grapes like ''cabernet sauvignon'' and ''chardonnay'' are increasingly being used.\n\n===Beer===\nAlthough wine is a traditional product, beer is very common as well. Beer did not quite belong to the Italian tradition in the way that wine does, but in the last 30-odd years there has been an explosion of Irish-style pubs in every big town, with usually a huge selection of any kind of beer, ale, stout and cider, from every country in the world.\nMajor Italian beers include Peroni and Moretti and these are usually the ones offered by cafés. If you are serious about beer drinking, there are many bars that specialise in serving a wide range of bottled beers (see city articles for more details), as well as Irish pubs and similar establishments. There is an increasing number of micro-breweries around the country. They often are run by local beer enthusiasts turned brewers, running small breweries with a pub attached. Their association is called Unionbirrai  [http://www.unionbirrai.com/].\n\nIn the Trieste region it is far more common to drink Slovenian beers and the most popular brands are 'Union' and 'Zlatorag'.\n\n===Other drinks===\n[[Image:Limoncello.jpg|thumb|A cold limoncello on a warm night]]\n* '''Limoncello'''.  A liquor made of alcohol, lemon peels, and sugar. Limoncello can be considered a \"moonshine\" type of product (although usually made with legally obtained alcohol) as every Italian family, especially in the middle-south (near Napoli) and southern part of the country, has its own recipe for limoncello. Because lemon trees adapt so well to the Mediterreanean climate, and they produce a large amount of fruit continually throughout their long fruit-bearing season, it is not unusual to find many villa's yards filled with lemon trees bending under the weight of their crop. You can make a lot of lemonade, or better yet, brew your own limoncello. It is mainly considered a dessert liquor, served after a heavy meal (similar to amaretto), and used for different celebrations. The taste can be compared to a very strong and slightly thick lemonade flavor with an alcohol tinge to it. Best served chilled in the freezer in small glasses that have been in the freezer. It is better sipped than treated as a shooter.\n\n*'''Grappa''' is made by distilling grape skins after the juice has been squeezed from them for winemaking, so you could imagine how it might taste.  If you're going to drink it, then make sure you get a bottle having been distilled multiple times.\n\n*'''Amaro''': there is a wide variety of ''amari'', a word that encompasses a wide variety of herbal liquors, also referred to as ''digestivo''. Some can be drunk alone, some are put into the traditional espresso coffee (''caffè corretto''). There are a few commercial ones, but look out for traditional regional ones.\n\nLimoncello, grappa, and amari, are usually served after a meal as an aid to digestion. If you are a good customer restaurants will offer a drink to you free of charge, and may even leave the bottle on your table for you to help yourself. Beware that these are very strong drinks.\n\n===Coffee===\nBars in Italy offer an enormous number of possible permutations for a way of having a cup of coffee. What you won’t get, however, is 100 different types of bean; nor will you find “gourmet” coffees. If you like that kind of stuff, better take your own. A bar will make coffee from a commercial blend of beans supplied by just one roaster. There are many companies who supply roast beans and the brand used is usually prominently displayed both inside and outside of the bar.\n\nThere are various kinds of coffee, the most popular of which are:\n\n* ''Caffè'' (known to foreign tourists as \"espresso\"). This is the basic kind of coffee, which is normally consumed at breakfast or after a meal.\n* ''Caffè ristretto''. This uses the same amount of coffee powder, but less water, thus making it lighter because less caffeine is extracted. \n* ''Caffè lungo''. Like ordinary coffee, but additional water is allowed to go through the coffee beans in the machine.\n* ''Caffè americano''. This has much more water and is served in a cappuccino cup. It is more like an American breakfast coffee but the quantity is still far less than you would get in the States. \n\nSo far so good. But here the permutations begin. For the same price as a normal coffee, you can ask for a dash of milk to be added to any of the above. This is called ''macchiato''. Hence, ''caffè lungo macchiato'' or ''caffè americano macchiato''. But that dash of milk can be either hot (caldo) or cold (freddo). So you can ask, without the barman batting an eye, for a ''caffè lungo macchiato freddo'' or a ''caffè americano macchiato caldo''. Any one of these options can also be had decaffeinated. Ask for ''caffè decaffeinato''; The most popular brand is HAG and it is quite usual to ask for ''caffè HAG'' even if the bar does not use that particular brand.\n\nIf you are really in need of a pick-me-up you can ask for a double dose of coffee, or a ''doppio''. You have to specify this when you pay at the cash register and it costs twice as much as a normal coffee. All the above permutations still apply, although a ''caffè doppio ristretto'' may be a bit strange. \n\nAdditionally, if you need a shot of alcohol, you can ask for a ''caffè corretto''. This usually involves adding grappa, brandy or sambuca; \"corrected\" being the Italian expression corresponding to \"spiked\". Normally it is only a plain coffee that is corrected but there is no reason why you should not correct any of the above combinations.\n\nThen there are coffee drinks with milk, as follows:\n\n* ''Cappuccino''. Needs no introduction. If you don’t like the froth you can ask for ''cappuccino senza schiuma''.\n* ''Caffè latte''. Often served in a glass, this is a small amount of coffee with the cup/glass filled up with hot milk.\n* ''Latte macchiato''. This is a glass of milk with a dash of coffee in the top. The milk can be hot or cold.\n\n'''Note''': ''latte'' is the Italian word for milk. If you ask for one, what you'll be getting is a glass of milk... and a perplexed look.\n\nFinally, in the summer you can have ''caffè freddo'', which is basically plain coffee with ice, \"caffè freddo shakerato\" (shaked ice coffee) or ''cappuccino freddo'', which is a cold milky coffee without the froth. This list is by no means exhaustive. With a vivid imagination and a desire to experiment you should be able to find many more permutations. Enjoy!\n\n==Sleep==\n\nIn major cities and touristic areas you can find a good variety of accommodations, from world-class brand hotels to family-managed bed & breakfasts and room rentals, but [[hostels]] are really few.\nCamping is a good way to save money and camping sites are usually well managed, but especially during summer, managers tend not to accept last-minute groups of young people (given the high chance of problems that such groups of Italian guys tend to cause), so you'd better book in advance. Farmstays are an increasingly popular way to experience Italy, particularly in rural areas of [[Tuscany]], [[Piedmont]], [[Umbria]], [[Abruzzo]], [[Sardinia]] and [[Apulia]]. They provide a great combination of good and healthy food, wonderful sights and not-so-expensive prices. If you prefer self-catering accommodations, it's quite simple to find them on the wonderful [[Amalfi Coast]] or the less commercial and more genuine [[Calabria]] coast.\n\nHotel star ratings can only be taken as a broad indication of what you will get for your money. There are many marvellous 2-star hotels that you will want to return to every year and many 5-star hotels that you will never want to set foot in again. The star rating, as in all countries, is based on a bureaucratic assessment of the facilities provided and does not necessarily relate to comfort. Often the only difference between a 3-star and 4-star hotel is that the latter offers all meals while the former only offers breakfast.\n\n==Cope==\n\n* '''Electricity'''. Italy uses 220V, 50Hz. Italy has its own electrical [[Electrical_systems|plug]] design. The standard \"European\" two-prong plugs will fit, but grounded (three-prong) plugs from other countries will not. German-type \"Schuko\" sockets can also be found quite often, especially in the north, and you'll find adapters for that system in virtually all supermarkets. Adapters for other systems (including US plugs) are not that ubiquitous but can be found at airports or in specialised shops.\n\nIf you're using American appliances that were designed for standard US household 110V, 60Hz current, make sure you get a ''voltage'' converter, not just a ''plug'' adaptor.  The higher voltage will damage or destroy your appliance, and could injure or kill you as well.\n\nNote that if you have a USB plug/charger, it is likely rated for 100V-220V (usually written on the device), so may only need a plug adapter to charge your phone and/or camera. If not, they are cheap, so you may want to pick one up in country rather than lugging around a converter.\n\nPower surges and power failures are virtually unknown in Italy, even less so than in the States; the energy, water and gas systems are state-run and very well equipped and maintained since even before WW2; the electrical system is fully updated to the latest tech specs and every household is required to comply when renovating. That includes the remote villages in the South, too.\n\n==Learn==\n\nFor English-speakers looking to study in Italy, there are several options.  In Rome, Duquesne University, John Cabot,  Loyola University Chicago and Temple University maintain campuses. Right outside of Rome the University of Dallas maintains its own campus in Marino.  St. John's University has a graduate program in Rome for International Relations and MBA. New York University has a study-abroad program in Florence available even to freshmen and maintains its own campus at Villa La Pietra. \n\nIt depends on how you want to learn.  Are you interested in studying in a huge touristy city like Florence or Rome?  Or, are you interested in learning from a small town on the Italian Riviera.  The smaller cities have better opportunity to learn Italian because there's not a lot of English going around.  No matter where you decide, Italy is one of the best spots geographically to travel while you're not studying. However, keep in mind that in many places of Italy people still speak their local dialects. This is particularly true in the South.\n\nThink about learning what the Italians are best at: food, wine, Italian language, architecture, motors (cars and bikes) and interior design.\n\n==Work==\nWork in Italy is not easy to find. Many young adults are without a job. Starting salaries in shops, offices, etc range from €450 to €800 a month. There's a huge underground black market though, where you'll find many people working. This doesn't mean working in some kind of obscure crime syndicate: it simply means not being book-regulated. Most \"black\" workers can be found in small business such as cafés, pubs and small shops, or as construction workers. Although this kind of job is illegal (but legal consequences fall mostly on the employer's shoulders) they're probably the easier thing to find if you're looking for a temporary job.\n\nIf you're thinking about establishing a small business be sure to get in contact with local Chamber of Commerce and an accountant and they will help you to sort out the Italian laws.\n\nItaly is the main destination for Romanians working abroad. Unofficial statistics reveal that there are approximately one million Romanians in Italy. However these numbers have been dwarfed in recent years by immigration from [[Africa]].\n\n==Stay safe==\nFor emergencies, call '''112'''. This phone number works for every type of emergency, as you'll speak with an operator that will contact the appropriate authority (police, fire department, ...)\n\nIn case of emergency or inconvenience, the Italian Ministry for Tourism has implemented a multilingual contact centre providing information and assistance to tourists. '''Easy Italia''' operates seven days a week, 09.00-22:00, and its telephone number (+39 39 039 039) can be dialled from anywhere in the world from either a landline or a mobile. If you're currently in Italy, you can also contact them by dialling the toll-free number 800 000 039 from landlines and payphones. The service is also available on Skype (easyitalia) and you can also ask information for free by filling in [http://www.easy-italia.com/ a web form]\n\nItaly is a safe country to travel in like most developed countries. There are few incidents of terrorism/serious violence and these episodes have been almost exclusively motivated by internal politics. Examples include the 1993 bombing of the Uffizi Gallery in Florence by the Mafia. Almost every major incident is attributed to organized crime or anarchist movements and rarely, if ever, directed at travelers or foreigners. \n\n===Crime===\nViolent crime rates in Italy are low even compared to most European countries. If you're reasonably careful and use common sense you won't encounter personal safety risks even in the less affluent neighborhoods of large cities. However, petty crime can be a problem for unwary travelers. Travelers should note that pickpockets often work in pairs or teams, occasionally in conjunction with street vendors; the usual precautions against pickpockets. Instances of rape and robbery are increasing slightly. \n\nYou should exercise the usual caution when going out at night alone, although it remains reasonably safe even for single women to walk alone at night. Italians will often offer to accompany female friends back home for safety, even though crime statistics show that sexual violence against women is rare compared to most other Western countries.\n\nProstitution is rife in the night streets around mid and large towns. Prostitution in Italy is legal though authorities are taking a firmer stance against it than before. Brothels are illegal and pimping is a serious offense, considered by the law similar to slavery. In Italy, it is an offence even to stop your car in front of a prostitute. Due to the ambivalent situation regarding prostitution, a lot of prostitutes fall victim to human trafficking. In general, being the client of a prostitute falls in an area of questionable legality and is inadvisable. Being the client of a prostitute under 18 is a criminal offence, '''even if you claim to be unaware of the prostitute's age'''.\n\nThere are four types of police forces a tourist might encounter in Italy. The Polizia di Stato (State Police) is the national police force; they wear blue shirts and grey pants and drive light-blue-painted cars with \"POLIZIA\" written on the side. The Carabinieri are the national gendarmerie; they wear very dark blue uniforms with fiery red vertical stripes on their pants and drive similarly colored cars. The Guardia di Finanza is a police force charged with border controls and fiscal matters; they dress fully in light grey and drive blue or gray cars with yellow markings. Finally, municipalities have local police, with names such as \"Polizia municipale\" or \"Vigili Urbani\". Their style of dressing varies among the cities, but they will always wear some type of uniform and drive marked cars, which should be easy to spot. \n\nAfter leaving a restaurant or other commercial facility, it is possible, though unlikely, that you are asked to show your bill and your documents by Guardia di Finanza agents. This is perfectly legitimate (they are checking to see if the facility has printed a proper receipt and will thus pay taxes on what was sold).\n\nFor all practical matters, including reporting a crime or asking for information, you may ask any of the aforementioned kinds of police. Recently, the military has been directly tasked with protecting key locations, including some city highlights you may want to visit; in case of emergency you can, by all means, ask them for help, but understand that these are not policemen and will very likely have to call actual police for you to report a crime and so on.\n\nPolicemen in Italy are not authorized to collect fines of any kind and have no authority to ask you for money for any reason (unless you are pulled over in your foreign vehicle and fined, see Get around|By car above).\n\nPossession of drugs is always illegal, but it is a criminal offence only above a certain amount.\n\nThe main emergency number, handled by the State Police, is 113. The medical emergency number is 118, but personnel of the 113 call centre are trained to handle mistakes and will immediately hook you up with actual medical emergency services.\n\nThere are many bars in Italy that cater to tourists and foreigners with \"home country\" themes, calling themselves such things as \"American bars\" or \"Irish pubs\". In addition to travelers, these bars attract a large number of Italians who, among other reasons, go there specifically to meet travelers and other foreigners.\n\nWhile the motivation for the vast majority of these Italians is simply to have a good time with new friends, there can be one or two petty criminals who loiter in and out of these establishments hoping to take advantage of travelers who are disoriented or drunk. Traveling to these places in groups is a simple solution to this problem. Alternatively, if you are alone, avoid getting drunk!\n\nWhen entering with a car into a city, avoid restricted, pedestrian-only areas (ZTL [http://www.slowtrav.com/italy/driving/traffic_cameras_speeding.htm]) or you could be fined about €100.\n\nAs in other countries, there are gangs known for tampering with ATMs by placing \"skimmers\" in front of the card slot and get a clone of your card. Check carefully the machine and, if unsure, use a different one.\n\nTravellers in search of employment in agriculture,either permanent or seasonal,should be aware that abuse in this industry has increased exponentially especially in Southern Italy and Sicily. There are numerous reports of people who had their passsports taken away,forced into slave labour with long hours without pay and even sexual abuse with little or no reaction from the local authorities.\n\n===Tourist Scams===\n\nRead up on the legends concerning tourist scams. Most of them occur regularly in bigger cities such as Rome, Milan, or Naples.\n\nA particular scam is when some plainclothes police will approach you, asking to look for \"drug money,\" or ask to see your passport. This is a scam to take your money. You can scare them by asking for their ID. Guardia di Finanza (the grey uniformed ones) do customs work.\n\nA recent scam involves men approaching you, asking where you are from, and begin to tie bracelets around your wrists. When they are done they will try to charge you upwards of €20 for each bracelet. If anyone makes any attempt to reach for your hand, retract quickly. If you get trapped, you can refuse to pay, but this may not be wise if there are not many people around. Carry small bills or just change, in your wallet, so if you find yourself in cornered to pay for the bracelet, you can convince them that €1 or €2 is all you have.\n\nWhen taking a taxi, be sure to remember license number written on the card door. In seconds, people have had a taxi bill risen by €10 or even more. When giving money to taxi driver, be careful.\n\nAround popular tourist sites, there are groups mostly of men trying to sell cheap souvenirs. They may also carry roses and say they are giving you a gift because they like you but the minute you take their 'gift' they demand money. They are often very insistent and often the only way to get rid of them is to be plain rude. Do the best you can to not take their \"gifts\" as they will follow you around asking for money. Simply saying \"no\" or \"vai via\" (\"go away\") will get them off your back until the next vendor comes up to you.\n\nYet another scam involves being approached by a man, asking you to help break a large bill - usually €20 or €50. Do not give him your money. The bill he is giving you is fake, but at first glance it might seem real.  \n\nOn train platforms, you may be approached by people who act like train conductors or station personnel, offering to help you find your carriage and seat. The moment you hand over your ticket they will tell you that you are running late, and rush you to your carriage. They usher you to your seat and then help you put your baggage onto the racks; then they ask for an extortionate fee (something like 5 euros per person). There is no way to get rid of them without being extremely rude and causing a scene. Make sure to ignore everyone on the train platforms unless he/she is wearing a station uniform!\n\nThe best advice to avoid scams is to get way from anyone that you have never seen before who starts talking to you.\n\n===Racism===\nUnfortunately racism is still present in Italy; the country only started having a significant non-white presence in the last 20 years and, while racially-motivated violence is rare (it does make the news a few times a year), it is generally perpetrated at the expense of immigrants. Some Italians may assume a person with prominent 'foreign' features to be an immigrant and, regrettably, treat them with some measure of contempt or condescension. This especially happens towards persons who may look like gypsies or Maghreb Arabs. Tourists can generally expect not to be insulted to their face but, unfortunately, casual racism and bigotry is not absent from conversation (especially bar talk and especially if matches featuring non-white players are on TV).\n\nOn the other hand, antisemitism is mostly absent in Italian society and Italy itself never really had a history of it (save for part of the Fascist era).\n\n==Stay healthy==\nItalian hospitals are public and offer completely free high-standard treatments for EU travellers, although, as anywhere else, you may have a long wait to be served. Emergency assistance is granted even to non-EU travelers. For non-emergency assistance, non-EU citizens are required to pay out-of-pocket, there is no convention with US health insurances (although some insurance companies might later reimburse these expenses).  Nonetheless, a requirement for a Schengen visa is that you have valid travel insurance which includes emergency expenses covering your entire trip anyway.  \n\nWater in southern Italy might come from desalination and sometimes may have a strange taste, due to extended droughts. If in doubt use bottled water. Elsewhere tap water is perfectly drinkable and very well maintained. Or else, a \"NON POTABILE\" warning is posted.\n\n==Respect==\nItaly has a reputation for being a welcoming country and Italians are friendly and courteous, as well as ''very'' used to interacting with foreigners. The Italian society is however slightly more formal than the Northern European or English-speaking ones, and it can be more sensitive to issues of respect or lack thereof, so it is wrong to assume everyone will be gregarious and laid-back. \n\n=== Social Etiquette ===\n* '''Communication across Italy varies from region to region'''. In the North, communication is seen as more direct and straightforward, whereas in the South, people take a more casual approach to life and are more friendly and easy-going. This said though, Italians tend to be very open about their emotions and speak clearly about what their feelings are. They also expect the same from visitors as well. \n\n* '''Communication tends to be very expressive and emotive'''. Italians tend to communicate in loud voices to make themselves heard over one another. A raised voice is not necessarily a sign of anger, but can be an expression of excitement or conviction. Hand gestures and the like are commonly used as well. \n\n* '''Italians tend to be very inquisitive'''. You may be asked several personal questions about your life story, background, and in some cases you can expect others to be eager to give you advice on whatever it is you're doing. Don't be offended by this as Italians don't intend to put you down or patronise in any way. Policing one another is considered a civic duty.   \n\n* '''Playful banter is a cornerstone of Italian culture'''. Italians often joke in a conversation, but they are humorous in a way that can be quite cynical. They can also be quite self-deprecating, ironic and sarcastic. Expect them to mock one another and slip sarcasm or double meanings into any topic of conversation.\n\n* '''Italians greet family and close friends with two light kisses on the cheek'''. Males do, too. To avoid ending up kissing on the lips note that you first move to the right (kiss the other person on their left cheek) and then to the left. In general, when joining or leaving a group, you will shake hands individually with (or kiss, depending on the level of familiarity) each member of the group. If it is a business related meeting you just shake hands.\n\n* '''To make friends, it's a good idea to pay some compliments'''. Most Italians still live in their town of origin and feel far more strongly about their local area than they do about Italy in general. Tell them how beautiful their town/lake/village/church is and possibly add how much you prefer it to Rome/Milan/other Italian towns. Residents can be fonts of knowledge regarding their local monuments and history, and a few questions will often produce interesting stories.\n\n* '''Make an effort to use some Italian phrases and/or words'''. Italians are very proud of their language, and you'll find that people are going to be noticeably aloof if you immediately converse in English. You are not expected to be fluent in the language, but a few words go a long way. \n\n* '''Always ask if someone speaks in English before conversing with them in it'''. A visitor who immediately converses in English immediately can be met with a frosty reception, even if it is not your intention.\n\n=== Home Etiquette ===\n* '''Don't be afraid of asking your hosts to give you a tour of their home'''. It's not considered rude manners unlike in many parts of Europe, and Italians will be more than delighted to guide you around.\n\n* '''When invited to an Italian home, always consider bringing a gift'''. High quality liquor, gifts with company logos, desk accessories, music and books are appreciated.\n\n* '''Do not gift knives, scissors or sharp objects'''. They are associated with bad luck.\n\n* '''Avoid gifting Chrysantheums'''. They are associated with death.\n\n=== Dress Codes ===\n\nWhole essays can be written about the Italians' relationships with clothes. Three of the most important observations:\n# Some Italians (especially young ones from the upper and upper-middle social classes) can be very appearance-conscious.\n# It's important, however, not to judge people by their choice of clothing. Styles do not necessarily carry the same connotations in Italy that they would in Britain or some other countries. Some youths lounge about in skin-tight tee-shirts and casually-knotted knitwear (and are very perplexed by the response they get when they take their sense of style and grooming to a less 'sophisticated' climate).\n# Sometimes, clothing rules are written. To visit a church or religious site you will need to cover yourself up; no bare backs, chests, shoulders and sometimes no knees. Sometimes museums and other attractions can also be strict; no bathing costumes, for example. If you want to visit a church or religious site it's a good idea to take something to cover yourself up with; for example a jumper or large scarf. Some churches supply cover-ups, such as sarongs are loaned to men with shorts so that they can modestly conceal their legs. Even where there are no written rules, it's worth noting that bare chests and large expanses of sunburnt skin are unacceptable away from beaches or sunbathing areas, whatever the temperature is. It's considered impolite for a man to wear a hat inside of any Catholic church.\n\n=== Things to Avoid ===\n\n==== Sports: ====\n* '''Steer clear from criticising the national football/soccer team, as well as any clubs'''. The sport of football/soccer is taken very seriously in Italy, and most Italians are fiercely supportive of the sport. For this reason, many friendships and relationships falter and '''this is not an exaggeration'''. Wearing a rival jersey in a particular area can lead to violence and/or a public confrontation. It's best to only wear a national team jersey should you choose to.\n\n==== Politics: ====\n* '''Steer clear from discussing internal politics'''. Although many Italians often express frustration and dismay with their politicians and political situation, a visitor discussing Italian politics, corruption, and the Mafia can come across as uninformed unless they ardently follow Italian news and politics. Don't hesitate to ask any questions you may have, but it is important to understand that being a visitor puts you in a delicate position.\n\n==== Culture: ====\n* '''Do not insult or speak badly of the country or its people'''. Although Italians are generally tolerant of criticism and differing opinions, they would view any criticisms of their country from visitors with varying degrees of hostility. To avoid getting into the bad raps of the locals, it's advisable to praise the country and not say anything negative about it. If in doubt, always ask about something rather than directly criticising it. \n\n* '''Do not speak badly of Italian cuisine'''. Italians are very proud of their cuisine, and they would view any criticisms and/or suggestions for improvement with degrees of hostility. \n\n==== Symbols====\n* '''Do not desecrate or inappropriately use the Italian flag'''. Not only will Italians be very offended, but you risk a hefty prison sentence and a fine as it is considered a crime.\n\n==== Sensitive Issues====\n* '''Avoid criticising or joking about the Catholic Church'''. Although the vast majority of Italians are catholic, many of them often criticise the church's role in Italian society. In the company of elderly Italians, criticisms or jokes about the church can be met with serious offence. \n\n* '''Avoid discussing the Mafia'''. Although the vast majority of visitors are often exposed to various stereotypes and depictions of Italian organised crime and the Mafia in film, video games, and so on, it is an incredibly uncomfortable subject amongst many Italians and it is best left avoided.  \n\n* '''Be very respectful when talking about Fascist Italy and World War II in general'''.  Italian society maintains a very emotional stance on those issues and any jokes or judgemental remarks about them will be met with offence.\n\n* '''Be very respectful when talking about independence movements'''.  In several areas around Italy, particularly in [[Lombardy]] and [[Venice]], independence movements exist, and some would be offended if you question a region's ability to function as an independent country. \n\n* '''Do not compare the North and South'''. The \"Southern Issue\" is considered a very sensitive topic which is bound to upset many Italians in the South. On the contrary, Northerners won't be as offended, although it can quickly turn into a heated, lengthy conversation.\n\n* '''Avoid criticising Italian history'''. Although Italians are modest about their country's role in the world, some parts of their history are regarded with dismay and shame. It's good form to not directly criticise Italian history as it could cause offence, and/or some fierce debates.\n\n==Contact==\n===Internet access===\n\n====Wi-Fi====\nThere are plenty of public Wi-Fi hotspots in Italy that are free of charge to use. \n  \nBy law, all public-access internet points must keep records of web sites viewed by customers, and even the customer's ID: expect to be refused access if you don't provide identification. Hotels providing Internet access are not required to record IDs if the connection is provided in the guest's room, although if the connection is offered in the main public hall then IDs are required.\n\nPublicly available '''wireless access''' without user identification is illegal, so open Wi-Fi hotspots (like the ones you might expect to find in a mall or café) all have some form of (generally one-time) registration.\n\nCertain internet activities are illegal. Beside the obvious (child pornography, trading in illegal products like drugs and weapons), copyright infringement is technically illegal even if no profit is made. However enforcement of copyright laws against P2P users is lax and \"cease & desist\" letters from providers are unheard of, ''unless'' using a University's Wi-Fi. Certain websites (mostly related to online gambling and copyrighted material) have been blocked in Italy following court rulings.\n\nYou can rent a mobile Wi-Fi hotspot (4G/LTE) for short term period at a reasonable price. Some companies such as  My Webspot provide unlimited internet for the duration you need in Italy (from 5€ per day). It is delivered to your hotel or at the airport. A good solution to stay connected, and place international calls with your favorite Apps, for cheap.\n\n====Mobile====\nMobile (3G or HSDPA) internet connectivity is available from all major Italian carriers. Beware though that internet plans are generally much more expensive than in other European countries. \n\nAlso, contracts often contain little-publicized usage limitations, eg, a plan that is advertised as 3 GB per month but actually has a daily limit of 100MB. \n\nRetailers will often fail to mention these limitations and quite often are themselves ignorant that they exist, so it is advisable to double check on the carrier's website.\n\nAlso keep in mind that, generally speaking, internet plans only include connectivity when under a specific carrier's coverage. When roaming, internet costs can be very high. Coverage of major carriers is widespread, but it would be wise to check whether your carrier covers your area.\n\n===Telephone===\nBoth the fixed and mobile phone systems are available throughout Italy.\nTelephone numbers of the fixed system used to have separate prefixes (area codes) and a local number. In the 1990s the numbers were unified and nowadays, when calling Italian phones you should '''always dial the full number'''. For example you start numbers for Rome ''with 06 even if you are calling from Rome''. All land line numbers start with 0. Mobile numbers start with 3. Numbers starting with 89 are high-fee services. If you don't know somebody's phone number you can dial a variety of recently-established phone services, the most used being 1240, 892424, 892892, but most of them have high fees.\n\nTo call abroad from Italy you have to dial <code>'''00''' + ''country code'' + ''local part''</code> where the syntax of the ''local part'' depends on the country called.\n\nTo call Italy from abroad you have to dial <code>''international prefix'' + '''39''' + ''local part''</code>.\nNote that, unlike calls to most countries, you should ''not'' skip the starting zero of the local part if you are calling an Italian land line.\n\nPayphones are widely available, especially in stations and airports. However, the number of payphones has consistently been reduced after the introduction of mobile phones. Some payphones work with coins only, some with phone cards only and some with both coins and phone cards. Only a limited number of phones (just a few in main airports) directly accept credit cards. \n\nItalians use mobile phones extensively, some might say excessively. The main networks are TIM (Telecom Italia Mobile, part of Telecom Italia, formerly state controlled), Vodafone, Wind, and 3 (only UMTS cellphones). Note that cellphones from North America will not work in Italy unless they are Tri-band. Nearly all of the country has GSM, GPRS and UMTS/HDSPA coverage. If you arrive from abroad and intend making a lot of calls, buy a pay-as-you-go SIM card (termed ''prepagato'' for \"prepaid\" and ''ricaricabile'' for \"rechargeable\") and put it in your current mobile (if compatible and if your mobile set is not locked). You need to provide a valid form of identification, such as a passport or other official identity, to be able to purchase the SIM card. Unless you already have one, you will also be required to obtain a ''Codice Fiscale'' (a tax number) - the vendor may generate one for you from your form of identification. Subscription-based mobile telephony accounts are subject to a government tax, to which ''prepaid'' SIM cards are not subject. Sometimes hotels have mobile phones for customer to borrow or rent.\n\nCall costs vary greatly depending on when, where, from and where to. Each provider offers an array of complex tariffs  and it is near impossible to make reliable cost estimates. The cost of calls differs considerably if you call a fixed-line phone or a mobile phone. Usually there is a difference in cost even for incoming calls from abroad. If you can choose, calling the other party's land line could be even 40% cheaper than mobile. \nMany companies are shifting their customer service numbers to fixed-rate number (prefix 199). These numbers are at the local rate, no matter where are you calling from.\n\nAccording to national regulations, hotels cannot apply a surcharge on calls made from the hotel (as the switchboard service should be already included as a service paid in the room cost), but to be sure check it before you use. \n\nCalls between landlines are charged at either the local rate or the national rate depending on the originating and destination area codes; if both are the same then the call will be local rate. Note that local calls are not free.\n\n====Emergency numbers====\n\n&nbsp;\n\n<big>'''112'''</big> is  the ''pan-European emergency number'' and is always free to call. \n\n&nbsp;\n\n'''Note''': in both Lombardy and the (former) province of Rome '''112''' - much like 911 or 999 - has \nreplaced the previous emergency numbers which are, however, still in use throughout the rest of the Peninsula!\n\nThey are:\n\n&nbsp;\n\n* ☎ '''112''' - ''Carabinieri''. This is a general-purpose emergency number: the ''Carabinieri'' this special force are for out of town emergency.\n* ☎ '''113''' - ''Police''. Another general-purpose emergency number; by dialling 113 you'll be put in contact with the Police.\n* ☎ '''115''' - ''Firemen''.\n* ☎ '''117''' - ''Guardia di Finanza''. The restaurateur tried to pad your bill? You've just been scammed? Shady deals going on? Then call the GdF.\n* ☎ '''118''' - Medical emergency; should you ever need an ambulance, this is the number to call. \n* ☎ '''1515''' - ''Corpo Forestale dello Stato''. The Italian equivalent of park rangers - call them if you see a forest fire, poachers, and whatnot.\n* ☎ '''1530''' - ''Guardia Costiera''. An emergency number specific to the Italian Coast Guard. Is the ship you're in or do you see one sinking? Then you'd better call them.\n* ☎ '''803-116''' - ''Automobile Club d'Italia''. Your car has broken down and there's no one in sight? Call this number and assistance will be given. '''**'''\n'''**''' This service is provided for free to subscribers by A.C.I. or other automobile clubs associated with ARC Europe; if you're not associated to any of these automobile clubs you'll be asked to pay a fee (approx. €80).\n\nAll calls to numbers listed above are free and can be made from payphones without the need to insert coins; these emergency numbers can also be dialled from any mobile phone (even if you have no credit or if you're in an area covered only by a different network). Always carry with you a note about the address and phone number of your embassy.\n\n===Post===\nIf at all possible wait until you leave Italy before posting postcards, greetings cards and other items to friends and family back home. The Italian post was notorious for being slow, expensive and unreliable, but things have improved in the past years. In border towns and cities near the borders with France, Austria and Switzerland it may be best to cross the border to post - postcards from Slovenia to Britain can take just 2 days compared with over a week when posted across the border in Trieste, Italy; it costs less than €1 to post from France to anywhere outside Europe, whereas it costs roughly twice as much to do the same from Italy.  Moreover, unlike most other European countries, only cash is accepted to buy postage, hence the little Euro coins/banknotes you have may be drained as they are expensive.  \n\nPostboxes are red and can be found very easily.\n\nAvoid using the globepostalservice (GPS) stamps. These are stamps sold by a private owned company through the tobacco shops using black mailboxes (the public ones are red) which charges more than normal and there have been lots of complains of delayed delivery and sometimes failure of delivery. Ask instead for the normal stamps.\n\nPost Offices can be found in every town and most villages - look for the ''PT'' symbol.  When entering the post office you will usually have to take a ticket and wait for your number to appear on the screen when it's your turn. There will be different tickets for different services but for posting a parcel look for the yellow symbol with the icon of an envelope.  Most post offices close about 13:00 or 14:00 and only a central post office in most towns will re-open in the late afternoon.\n\n\n\n{{related|Ferries in the Mediterranean}}\n\n{{isPartOf|Europe}}\n{{outline}}\n{{countryguide}}\n\n[[ca:Itàlia]]\n[[de:Italien]]\n[[eo:Italio]]\n[[es:Italia]]\n[[fi:Italia]]\n[[fr:Italie]]\n[[hu:Olaszország]]\n[[it:Italia]]\n[[ja:イタリア]]\n[[nl:Italië]]\n[[pl:Włochy]]\n[[pt:Itália]]\n[[ro:Italia]]\n[[ru:Италия]]\n[[sv:Italien]]\n[[zh:意大利]]\n[[wts:Category:Italy]]\n\n[[WikiPedia:Italy]]\n[[Dmoz:Europe/Italy/]]"
        }
    }
}