{
    "parse": {
        "title": "Kazakhstan",
        "pageid": 551,
        "wikitext": {
            "*": "{{pagebanner|Kazakhstan banner.jpg}}\n\n{{quickbar\n| location=Kazakhstan in its region.svg\n| flag=Flag of Kazakhstan.svg\n| capital=[[Nursultan]]\n| government=Republic\n| currency=tenge (KZT)\n| area=2,724,902km²<br />''water: 47,500km²<br />land: 2,669,800km²''\n| population=16,402,861 (July 2009 estimate)\n| language=[[Kazakh phrasebook|Kazakh]] (official, state language) 64.4%, [[Russian]] (official) 95% (2001 estimate)\n| religion=Muslim 67%, Russian Orthodox 24%, Protestant 2%, other 7%\n| electricity=220V, 50Hz, European plug\n| callingcode=+7\n| tld=\n| timezone=UTC+5 to UTC+6\n}}\n[http://visitkazakhstan.kz/en/ '''Kazakhstan'''] is by far the largest of the [[Central Asia|Central Asian]] states within the proposed [[South-Central Asia]]n Union. It has borders with [[Russia]], [[China]], and the Central Asian countries of [[Kyrgyzstan]], [[Uzbekistan]], and [[Turkmenistan]]. \n\nKazakhstan is the world's ninth biggest country by size, and it is more than twice the size of the other Central Asian states combined. Its lack of significant historical sites and endless featureless steppe have put many off Kazakhstan, while many still are captivated by the emptiness and mystery of this Goliath state. It will be many travellers' first port of call on their Central Asian adventure, and there is much for the intrepid traveller to enjoy. Kazakhstan is the richest country in [[Central Asia]], due to its large oil and natural gas reserves. The country is also the largest landlocked country.\n\n==Understand==\n\nNative Kazakhs, a mix of Turkic and Mongol nomadic tribes who migrated into the region in the 13th century, were united as a single nation in the middle of 15th century. Kazakhstan became a member of the Soviet Republic in 1936. The area was conquered by Russia in the second half of 19th century and now is a standalone country.\n\nDuring the launching of the 1950s and 1960s agricultural \"Virgin Lands\" program, Soviet citizens were encouraged to help cultivate Kazakhstan's northern pastures. This influx of immigrants (mostly Russians, but also some other deported nationalities, including the Volga Germans) skewed the ethnic mixture and enabled non-Kazakhs to outnumber natives. Independence has caused many of these newcomers to emigrate.\n\nModern Kazakhstan is a neo-patrimonial state characterized by considerable nepotism and dominance over political and economic affairs by President Nursultan Nazarbayev and his allies. However, it is not as severely authoritarian in government as compared to bordering Turkmenistan, Uzbekistan, and China.\n\nSince independence from the Soviet Union in 1991, the Kazakh government has allowed foreign investment to flow into the country. The development of significant oil and gas reserves, particularly in the north and west, have subsequently brought a large amount of wealth to the country, though the money falls into the hands of just a few people. Nevertheless, Kazakhstan is now labeled a middle-income country and is already classified with a high human development index. Corruption in Kazakhstan is even more ubiquitous than neighboring China, but it is not as widespread compared to other countries in the region.\n\nCurrent issues include: developing a cohesive national identity; expanding the development of the country's vast energy resources and exporting them to world markets (an oil pipeline to China has been built; the gas pipeline is under construction); achieving a sustainable economic growth outside the oil, gas, and mining sectors, and strengthening relations with surrounding states and other foreign powers.\n\n==Regions==\n{{Regionlist\n| regionmap=Kazakhstan regions map.png\n| regionmaptext=\n| regionmapsize=upright=2.5\n\n| region1name=[[Almaty Province]]\n| region1color=#a7c8ad\n| region1items=\n| region1description=the former capital, treks into Tian Shan, historic towns, ancient petroglyphs\n\n| region2name=[[Kazakhstani North]]\n| region2color=#d6b9e4\n| region2items=\n| region2description=cold steppes home to the national capital, the country's Russian minority, and industrial cities\n\n| region3name=[[Kazakh Desert]]\n| region3color=#e7c9a8\n| region3items=\n| region3description=ancient desert cities dotting the [[Silk Road]]\n\n| region4name=[[Altai (Kazakhstan)|Altai]]\n| region4color=#a5bad4\n| region4items=\n| region4description=remote and beautiful alpine scenery\n\n| region5name=[[Caspian Basin]]\n| region5color=#dbaeb3\n| region5items=\n| region5description=Caspian beaches and oil industry, and where local tribal affiliations still run strong\n\n| region6name=[[Central Highlands (Kazakhstan)|Central Highlands]]\n| region6color=#e1e4b7\n| region6items=\n| region6description=endless and sparsely populated steppes}}\n\n==Cities== \n<!-- Nine representative cities only to be listed here. Do not make any changes without first discussing on the talk page-->\n* [[Nursultan]] (Aqmola) &mdash; second largest city, and capital since December 1998. Worth visiting but you only need a few days to get to the most recommended sightseeings. The city is brand new and being built very rapidly. If you want to see what Akmola (Astana previous name) looks like, you need to do it now as the old city is disappearing quite rapidly.\n* [[Atyrau]] &mdash; oil capital of Kazakhstan, where large onshore [[Tengiz]] and offshore [[Kashagan]] oilfields are located.\n* [[Almaty]] &mdash; largest city, and capital prior to December 1998. Definitely a must-see. Beside the Soviet-style city, you may want to go to the Medeu and other places in the nearby mountains.\n* [[Aktobe]] &mdash; an industrial city located in the eastern part of Europe.\n* [[Karaganda]] &mdash; industrial city between Astana and Almaty; worth visiting if you like mining history.\n* [[Pavlodar]] &mdash; Kazakh city in very north of the country, founded in 1720, closed until 1992 for its military significance in tank production, and home to one very impressive mosque, as well as other interesting Orthodox churches and various memorials \n* [[Shymkent]] &mdash; Kazakhstan's third largest city, very crowded with Uzbek people, it is an old market town located near [[Tashkent]] and some beautiful mountains; now booming with oil exploration,\n* [[Turkestan]] &mdash; another ancient city, long a border town between the Persian culture to the south and the Turkic nomadic culture to the north, now majority Uzbek and home to several important cultural-historical monuments \n* [[Ust-Kamenogorsk]] &mdash; Majority Russian mining city in the Altai mountains\n<!-- Nine representative cities only to be listed here. Do not make any changes without first discussing on the talk page-->\n\n==Other destinations==\n[[Image:SharynCanyonKazakhstan.jpg|thumb|250px|Sharyn Canyon]] \n* [[Aksu-Zhabagly]]\n* [[Altai Mountains]]\n* [[Aral]]\n* [[Baikonur]]\n* [[Karkaraly National Park]]\n* [[Kyzylarai wildlife reserve]]\n* [[Talgar]]\n* [[Zailiysky Alatau]]\n* [[Turgen Valley]]\n* [[Kolsai Lakes]]\n\n==Get in== \n{{infobox|If you need to post your passport overseas for visa processing|(For example, Australian and NZ citizens need to post their applications to Singapore), book your return courier '''before''' you send off your application. If complications arise with your visa application, you can always change the pick up time. Couriers (DHL, TNT etc) require a shipment label to be printed on the return envelope, and it is easier if you don't rely on the embassy to print and stick on your shipment label, although confirmation that the embassy will do this if you ring up and ask.\n\nFor residents in Australia and New Zealand, it is cheaper to book online directly with Singapore courier companies such as DHL Singapore or TNT Singapore. DHL Australia charges AUD125 and DHL Singapore only charged SGD66. You can still print off a DHL Singapore shipment label and attach it to your envelope before you send it off.}}\n\n===Visa-free===\n\nCitizens of [[Armenia]], [[Belarus]], [[Georgia (country)|Georgia]], [[Kyrgyzstan]], [[Moldova]], [[Mongolia]], [[Russia]], and [[Ukraine]] may enter Kazakhstan visa-free for up to 90 days (90 days within a 180-day period for Ukraine). Citizens of Russia may enter Kazakhstan with an internal passport in lieu of a regular passport, and citizens of Kyrgyzstan may enter using a national ID card.\n\nCitizens of all [[European Union]] countries, plus [[Argentina]], [[Australia]], [[Azerbaijan]], [[Brazil]], [[Canada]], [[Chile]], [[Ecuador]], [[Iceland]], [[Israel]], [[Japan]], [[Malaysia]], [[Mexico]], [[Monaco]], [[New Zealand]], [[Serbia]], [[Singapore]], [[South Korea]], [[Switzerland]], [[Tajikistan]], [[Turkey]], the [[United Arab Emirates]], the [[United States]] and [[Uzbekistan]] may enter Kazakhstan visa-free for up to 30 days. South Korean citizens may enter for a maximum total stay of 60 days within a 180-day period, Ecuadorian citizens may enter for up to 30 days within 180 day period, and Argentine and Brazilian citizens may enter for up to 30 days within a one year period.\n\nCitizens of the following countries who hold a valid tourist visa for [[Kyrgyzstan]] are permitted to visit the border districts of Almaty and Jambul regions of Kazakhstan within the validity of such visa: Australia, Austria, Belgium, Canada, Croatia, Denmark, Finland, France, Germany, Greece, Hungary, Iceland, Ireland, Israel, Italy, Japan, Liechtenstein, Luxembourg, Malaysia, Monaco, Netherlands, New Zealand, Norway, Portugal, Poland, Saudi Arabia, Singapore, Slovakia, South Korea, Spain, Sweden, Switzerland, United Arab Emirates, United Kingdom and the United States.\n\nAustralasia: Australia, New Zealand, Japan, South Korea, Philippines, Malaysia & Singapore; citizens of Hong Kong only for 14 days.\n\nCitizens of [[China]] (PRC) and [[India]] do not require a visa for a 72-hour stay, provided that they enter through Astana or Almaty International Airports, travel on a Kazakh airline and hold valid onward tickets.\n\nResidents of the Balkan Region of [[Turkmenistan]] have visa free access to Atyrau Province and Mangystau Province for up to 5 days.\n\n===Visas===\n\nVisas on arrival with a validity of up to one month are available for nationals arriving from a country without a Kazakh diplomatic mission. The fee is approximately US$80, and travellers must hold an invitation letter and obtain an approval from the Kazakh Ministry of Foreign Affairs. Additionally, travellers must enter Kazakhstan through Aktau, Almaty, Astana, Atyrau or Oral Ak Zhol airports.\n\nAnyone not falling into the above categories must obtain a visa in advance.\n\nFor more information you should contact a Kazakhstan diplomatic mission in your area or Kazakhstan MFA's website  [http://www.mfa.kz Ministry of Foreign Affairs of Kazakhstan]. Note that as of June 2012 the Consulate General of Kazakhstan in New York says it only accepts money orders, but they actually accept cashier's checks as well.\n\nNote:  Although the Kazakh government has set certain policies regarding which countries do not require LOI's, this does not always reach the embassies.  Be prepared for the worst and coming up against an official who might flat out refuse to give you a visa without a LOI.  This is an issue at the Kazakhstan Embassy in Moscow (Australian Passports).\n\n===By plane=== \nAir Kazakhstan stopped flying at the end of March 2004. The flag carrier is now [http://www.airastana.com/ Air Astana] which flies to [[Almaty]], [[Astana]], [[Aktau]], [[Aktobe]], [[Atyrau]], [[Abu Dhabi]], [[Uralsk]], [[Kyzylorda]], [[Moscow]], [[Delhi]], [[Beijing]], [[Istanbul]], [[Bangkok]], [[Hannover]], [[London]], [[Amsterdam]], [[Baku]], [[Kuala Lumpur]], [[Frankfurt]], [[Seoul]], [[Ho Chi Minh City]], and [[Hong Kong]].\n\nIn 2011, Air Astana stopped flying to and from Dubai, but now flies to and from Abu Dhabi. [http://www.etihad.com/en-us/ Etihad Airways] also services the Almaty and Astana to and from Abu Dhabi routes.\nupdate 01/12/2018 - Air Astana fly from Dubai to Almaty\nHowever, Air Astana has a near monopoly on the international routes by limiting the access of foreign airlines to Kazakhstan.\n\nLufthansa has also flights to Almaty, from where you can go anywhere via local carrier [http://en.wikipedia.org/wiki/SCAT_(airline) SCAT], which flies to most cities in Kazakhstan, although it must be mentioned that SCAT is on the list of airlines banned from European airspace. British Airways (Almaty-Heathrow route taken over by bmi from Sept 2007) and KLM now fly several times a week to Heathrow and Schiphol. There is also non-stop connection twice a week from Prague, operated by Czech airlines. \nTurkish Airlines is good passenger carrier, with flights to Istanbul (ask a travel agent about the student fares, which can be a great deal).\n\nThere are twice a week flights from Seoul to Almaty; one is Asiana Airlines, and the other is Astana.\nAirbaltic also flies to Almaty (no direct flight); if you reserve tickets in advance, you can go there for €130 (from [[Riga]]).\n\nWizzair flies to Astana from [[Budapest]] weekly. As a low-cost airline it regularly offers one-way tickets for as low as 30€.\n\n===By train=== \nTrains in Kazakhstan are slow but comfortable and clean. Popular routes include Almaty to/from Moscow (77 hours), [[Novosibirsk]] (35 hours) and [[Ürümqi]], [[China]] (34 hours). Count on a 3–4 hours stay at Russian border or 6–8 hours at Chinese border. Trains in Kazakhstan can also be booked online.\n\n===By car===\nYou can enter Kazakhstan by car through many of the border checkpoints on main roads into the country. However, be prepared to wait up to 36 hours in the queues, with rather poor facilities.\n\n===By bus===\nIt is fairly easy to travel from [[Ürümqi]] to Almaty via sleeper bus, especially if you aren't in a hurry and don't mind living on a bus for a good 24 to 36 hours. The border crossing itself is a bit of a hike, and you may be made to carry all of your belongings with you for quite a ways in some seriously warm weather. The bus trip and \"baggage fees\" are around USD45. You can pick up your Kazakhstan visa at the consulate in Urumqi as well, but be prepared to chill for at least a week waiting, and be sure to get a copy of your passport before handing it over.\n\n===By boat===\nFreighters travel regularly between [[Baku]] and [[Aktau]], and it is possible to hitch a ride. Note, though, that it is common for ships to get held up, even for weeks, before entering port, so you had better stock up on food and water before boarding. See [[freighter travel]] to better understand how this works.\n\n===Registration===\nYou must register your visa within five days of entering Kazakhstan if your border entry card  has only one stamp. After your first registration you must register in each destination if you stay more than 72 hours (see each destination for further details). If you stay in Kazakhstan less than five days then you may not need to register but this needs to be confirmed (July 2008).\n\nAlthough border entry card is having provision to mention just the name of your organisation, you must specify full address next to the name of organisation (although no one tells this at the time of entry). In one off case people are caught by immigration police for not having full address in the border entry card, resulting into seizing the passports causing inconvenience to the visitors. The passports needs to be collected at the immigration police office later next day after due formality.\n\n==Get around==\nYou can travel within Kazakhstan using taxis, buses, trains and planes, it depends on your budget and demands. Renting a car is rather costly compared to other means of transport.\n\nIn Semipalatinsk (Semey) a minivan costs KZT35, and a large bus costs KZT35-40 (in Astana it ranges about KZT60-65), common taxi fare is minimally KZT300 (at the time, March of 2009, USD1 was approximately KZT150 ).\n\n===By public buses=== \nPublic transportation in big cities is rather popular. You can use buses, trolleys, trams and minibuses. One big minus of all of them is that they never come on schedule and are very crowded at peak time. Moreover, there is absolutely no plan with bus stops and schedule whatsoever. If you don't speak Russian, taking the bus will be quite tricky but not impossible.\n\n===By taxi===\nUse taxis as they are very cheap (€2 to €6 within city). You don't have to use official taxis in most cities, basically you can stop almost any car on the street by raising your hand. It works good in Almaty and Astana, but in Karagandy the best way is to order a taxi by phone. It is somewhat cheaper and even faster than hitch-hike waiting. \n\nA note of warning, getting to the Almaty airport can be expensive. Taxis to the airport vary greatly in price. Any foreigner will be quoted a very high rate but usually cabs will come down once they see they aren't going to be able to get that much. USD50 is outlandish. Do not accept the first price as it will result in your being overcharged. It should be less than USD10, although it can ''never'' be guaranteed that a foreigner will get that price. A better option are the minibuses and buses that go to the airport. The word \"airport\" is very similar in Russian and English.\n\nA common way to get around is by unofficial taxis. Any time of the day, just wave your hand and someone will stop.  Locals do this all the time. Negotiate the price and destination before you agree to go. About USD2-4 is fair for a ride within the centre of Almaty. If your Russian is poor or non-existent, you will be charged a lot more than locals; to avoid this, try to use public buses as much as you can and don't hesitate to tell the driver how much you are ready to pay (do this before he tells you how much he wants!). To be safe though, do not get in a car if more than one person is driving.  Also, do not take these kind of taxis for long distances or anywhere that goes through remote areas, as there are frequent robberies, especially of foreigners.\n\nAlways try to have exact amount of money in cash (the price which you negotiated with a taxi driver), since usually they will not give you change. So if the price should be KZT350, give the driver KZT350, not more (otherwise he/she might not find change for you).\n\n===By train===\nTrain is the most popular way of covering the huge distances between Kazakhstan's main cities. Main train stations are located in Astana, Karaganda and Almaty, but they can be found almost in every big city. \n\nThe rolling stock, train classes, ticket and reservation system was inherited from former Soviet Railways, so they are very similar to the Russian system, see [[Russia#By_train_2|Russian train travel article]]. \n\nTicket prices are slightly lower than in Russia. Kazakh Railways have an e-shop [https://epay.railways.kz] (only in Kazakh and Russian), but it doesn't accept many of non-CIS credit cards, so you probably use it only for price check.\n\nKazakhstan is a large country. For instance, it will take you almost 24 hours to get from Almaty to Astana. However, going by train is most fun way of travelling, since the trains are a great way to meet people. A lot has been written about the pitfalls of being included in a vodka drinking party on a train, but for the most part fellow travellers are friendly, and keen to find out about you (\"why aren't you married?\" and, if you are, \"why don't you have children?\", and if you do, \"why don't they have children?\"!). Most travellers take food for the journey, as restaurant car provision is sporadic (and they expect you to share yours too!). If you don't have enough to last the distance, the trains generally stop for 15-20 minutes at each station and there are always people on the platform selling food and drink, at any time of day or night.\n\nThere is also a train called Talgo, which is able to cover distance between Almaty and Astana in 9 hours. The cost of the ticket is about KZT9000.\n\n===By long distance buses===\nThey are a popular alternatives to trains and are faster but less comfortable than them. As for trains, you will need to buy your ticket in advance and will be given a seat number. Be careful when the bus makes a bathroom stop, the driver don't check if all passengers are on board before resuming driving! \n\nFares are relatively low, for instance a single from Almaty to Karaganda (14 hours) will cost you KZT2500, much cheaper than an flight ticket.\n\n===By plane===\nAir Astana provides offices in a few major hotels in big cities, or you can book on their website; it's the fastest way of travelling within the country for those who can afford it. Planes are brand new and match European standards in quality.\n\n===Other===\nA fun and cheap way to get around is by taking a \"marshrutka\".  These are the dilapidated vans that cruise around town.  They usually have a sign (in Russian) listing the destination, and the driver will usually call out where they are going. But you will not find them in Almaty.\n\n==Talk==\n\nThe [[Kazakh phrasebook|Kazakh]] and Russian languages are spoken in Kazakhstan. More than 90% of Kazakh citizens speak Russian, while less than 50% speak Kazakh, and roughly half of those who speak Kazakh speak it as their native language. Although the Russian language is much more useful, ethnic Kazakhs will react extremely well to you if you speak even a little Kazakh, and even if they themselves speak none, because the Kazakh language is a great source of national pride for the Kazakh people. Most ethnic Kazakhs are not proud to speak the Russian language.\n\nMany people under age 20 will know some English as well as many customs officials and airport people know English.\n\nIt is difficult to get around the country without some Russian or Kazakh language skills; though, within the more modernized cities, it is easier. Have your place of residence written on a card and get a cab if you get lost (you might be somewhat overcharged by the cab, but it is better than being lost).\n\n==See==\nBaikonur is the famous cosmodrome site for the launch of the first manned orbital flight by Yuri Gagarin. The modern town of Baikonur was built near the existing village of Tyuratam.\n\nAs the cosmodrome area (6000km²) is rented by Russia, no Kazakh visa is needed if you fly in directly from Moscow.\n\n==Do==\n*<do name=\"Sauna complexes\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">Due to its cold and windy weather conditions, visiting saunas with friends is very popular in Kazakhstan. Saunas (Russian banyas or Finnish steam rooms) are an excellent place to discuss business issues or just socialize with friends. Having parties (birthdays, New Year, etc) in saunas is a normal practice. In fact many modern sauna complexes in Almaty and Astana are usually fully equipped with karaoke, billiards, swimming pools, relax rooms, massage rooms, etc.. </do>\n\n==Buy==\nThe national currency is the ''tenge'' (Kazakh: теңге, ''teñge'', sometimes also written as ₸) coded as '''KZT'''. Tenge is free-floating currency \nAt 22 July 2018 the rate is:\n* 1 USD = 344.18 KZT\n* 1 EUR = 403.71 KZT\n* 1 RUB = 5.42 KZT\n* 1 CNY = 50.84 KZT\n* 1 INR. = 5.14 KZT (03/09/2018)\n\n\nExchange rates are controlled by the state bank. Prices are increasing, especially on imported goods, but also on basics like bus fares. As of March 2014, it's difficult to buy dollars, at least in Karaganda. \n\n===Shopping===\nEven for people who are not big shoppers, the beautifully crafted felt items will appeal. They are also easy to carry and inexpensive to post.\n\n==Eat== \nMeat, potatoes, rice and pasta. And lots of it. If you're vegetarian be wary, because if it doesn't have meat in it, it was almost certainly cooked on meat stock.\n\nSome recommended dishes:\n* Beshbarmak - a horse meat and pasta dish with potato and onion. The national traditional dish of Kazakhstan most often served for special occasions. Can also be made with beef or lamb. Most restaurants that serve it will present a portion enough for two or three people\n* Kazy - handmade horse meat sausage, could be cooked and served with Beshbarmak, but not at the restaurants, unless you ask to do so when preorder menu. If you did not, it would be served as cold meat appetizer with other types of cold meat appetizers(Zhaya, Basturma, Shyzhyk). And separate price would be charged. Kazakh dish. \n* Laghman - a thick noodle dish with meat, carrot and onion, usually served as a soup.Some other veggies could be added too.\n* Manty - large steamed dumplings full of meat and onions. Sometimes made with onions or pumpkin. Traditional Uighur dish.\n* Plov - wonderful dish of fried rice, meat, carrots, and sometimes other bits such as raisins or tomatoes. Traditional Uzbek dish.\n* Shashlyk or Shish Kebab - skewered, roasted chunks of marinated meat, served with some sort of flatbread (usually lavash) and onions. Various marinates can be used, and different ways to cook it, open fire or other.\n* Baursaky - bread best served piping hot. A little like an unsweetened doughnut. Kazakh.\n* Pelmeni - boiled dumplings made from different kinds of meat or potato. Russian.\n\nIf you're a vegetarian, you're probably thinking there's nothing for you in Kazakstan. And you're right - so long as you eat out. But if you're cooking your own food, you'll be more than satisfied. Kazakstan has some excellent products available at little markets everywhere. You will be amazed with the taste and availability of fresh organic veggies at low price! For a treat in Almaty, try Govinda's, a delicious vegetarian Hare Krishna restaurant. Malls have food courts with some vegetarian options too.  Even some small Kazakh eateries will prepare vegetarian meals for you if you make it very clear to them (e.g. \"byez myasa\" (without meat), \"ya vegeterianetz\" (I [male] am a vegetarian), \"ya vegetarianka\" (I [female] am a vegetarian) in Russian).  At some places (e.g. smak) you can even find vegetarian manty made with pumpkin.\n\nThe legacy of Korean resettlement in Kazakhstan means that Korean dishes, particularly salads, are very common.  At the country's many bazaars (independent food and goods markets), look for the Korean ladies selling these.  They will wrap you up any number of delicious, often spicy and garlicky salads to take away in plastic bags.  If you are vegetarian, this may be the only decent thing you get to eat while you're in the country.\n\nOn the other hand, in Kazakhstan you can find any dishes you want, but Chinese and Japanese dishes are very expensive.\nThe most delicious is caviar, which is very cheap, you can buy 1 kilo of caviar for less than USD300 in Almaty Zyeloniy Bazaar, but you can't export or take it with you home, you will be stopped at airport and pay high fines.\n\nEating out is relatively cheap; you basically order the meat dish and then add rice, potatoes, etc. Each element is priced individually, so you can order for instance only meat or only rice. Prices are relatively cheap, count 500T for chicken, 1000T for beef, and up to 1500T for horse, a local delicacy.  Of course, the fancier the restaurant, the higher the price. If you don't speak Russian, things are relatively hard as the majority of restaurants don't have English menus (with the exception of some hyped places in Almaty).\n\nWhile Kazakhs are not very religious, most do not eat pork. Be aware of this if you are dining out with Kazakhs or planning a dinner at home. Also many dishes that are made elsewhere with pork (such as dumplings or sausage) are made with beef or mutton here.\n\n==Drink==\nThe legal drinking/purchasing age of alcoholic beverages is '''21'''.\n\nYou can find any sort of drink you want, some of the traditional beverages include:\n\n* Kumiss - fermented mare's milk, up to 6% alcohol content - imagine tart lemonade, mixed with semi-sour milk\n* Kumyran (Shubat)- fermented camel's milk\n* Kvas - described as similar to root beer it can be bought in a bottle in a store, or by the cup from people with giant yellowish tanks of it on the street\n\nCheap alcoholic drinks can be found at every little corner shop (called the astanovka).  These places are open 24/7, just knock on their door if the shopkeeper is asleep.  Kazakhstan's specialty is cognac, though stores still sell vodka cheaper than bottled water at times. However, some of these astanovka sometimes sell alcohol of dubious origin; for the sake of your stomach you may want to buy your beverage in a supermarket, although the price will definitely be higher.\n\nSeveral brands of beer, of good quality and flavor, are made in Karaganda.\n\nJuices, in cartons, are common and delicious, especially peach juice.\n\n==Sleep==\nThere are numerous hotels, from very cheap ones for €10 per night, to the luxurious ones. You wouldn't find the cheapest ones on the web; the only way to book them is to call directly, but in that case you'll have to speak Russian at the least.\n\nThere are almost no camping sites except in Burabay/Borovoe in Kazakhstan. You can, however, camp almost anywhere due to the huge uninhabited spots. The scenery is beautiful but because of the very hot weather: don't forget to take plenty of water with you as you can very easily spend many of days without seeing anybody. If you camp near a nomadic tribe, ask for the permission to stay near; it will not be refused.\n\nThere are also many apartments rent by the night, some by agencies, or from women often near the train station whom shake large key rings on the main roads, and are cheaper.\n\n==Work==\nUnlike certain European countries still recovering from recession, Kazakhstan abounds in employment or business opportunities.  Skilled professionals may be able to find a job, more likely, in the energy or educational sector.  Salaries tend to decrease as the country is working in the direction of ensuring equal pay for locals vs. expat staff.   Expatriate candidates must obtain a work permit.  In recent years, it is becoming harder to get a work permit, comparing with prior years.\n\n==Stay safe==\nKazakhstan is a country where the population has a long history of balanced, harmonious, multi-ethnic social interaction, where both guests and locals are treated with respect during everyday life, with certain exceptions (described below in more detail). Visitors will experience hospitality and warmth in this lovely country.  However, your personal safety may vary from very safe to relatively unsafe depending on the location, time of the day, circumstances, and your personal behaviour.  Unlike other former Soviet Union countries, black, South Asian and Middle Eastern people should feel comfortable.  \n\nGenerally, Kazakh cities are safe during the day, but certain parts of major cities should be avoided at night to reduce risk (e.g. (i) all parts of Almaty below Tashkentskaya street and all microdistrict areas within these zones, certain other remote microdistricts, and areas with high concentration of shabby private houses (such as Shanyrak); (ii) in smaller towns, e.g. Taraz, Balkhash, Shymkent, Taldykorgan, Uralsk, Semey and Ust-Kamenogorsk, going out at night should not present a significant risk, though infrequent muggings do occur; and (iii) all smaller towns such as Shar, Stepnogorsk, and Temirtau may present a higher risk of mugging and violent crime). \n\n=== Scams === \nScams are common in Kazakhstan, such as the \"lost wallet ploy\", where someone will often claim to have found a wallet and then try to split the money with you. Their partner may saunter up and says it's their wallet and will force you to give them money. The twist on this scam is that the individual who will come looking for a lost wallet will demand that you show your purse or pocket to prove you haven't stolen it. The individual may end up grabbing all your belongings and darts away.\n\nLocals might pose as cops and then demand you for money about something. As a general rule, the real police officer will show their badges or produce them upon request.\n\n=== Corruption ===\nCorruption is an immense problem in Kazakhstan, despite numerous efforts initiated by the government to fight the issue. Troublingly, the police are generally not to be trusted. Due to their low salaries, cops can be easily bribed and they may often engage in aggressive behavior such as robbing visitors by pretending to arrest them for being publicly drunk. Stay alert and ensure that this will not happen to you.  Other public officials might also engage in similar antics with travelers.\n\n=== Authorities ===\nIt's very common for the authorities to put visitors under surveillance in their hotel rooms, such as tapping telephones to going through your belongings.\n\nThe police may also conduct random checks on the street that require you to show your passport. This is because the Kazakh government takes a very harsh stance against illegal immigration and they intend to make sure that people are who they say they are. As a general rule of thumb, always carry your ID with you.\n\nTo avoid any problems with the authorities, '''avoid taking photographs of government buildings''' as that can be interpreted as espionage which can land you in prison.\n\n=== Prostitution ===\nAlthough illegal, '''prostitution''' has become widespread in many big cities lately. Usually prostitutes work in hotels, night clubs or saunas. Also, local classified newspapers typically have a whole section dedicated to escort services. Many sex workers in Kazakhstan are in fact from neighbouring, less economically developed states such as Uzbekistan, Kyrgyzstan and Tajikistan.\n\n=== Crime Issues ===\nA foreign man soliciting a local woman on the streets or in a nightclub may draw unwanted attention from locals, or might result in arguments.  Normal western attention and respect for women and children, including a smile or kind greeting, can be taken by a local husband or father as threatening or offensive.\n\nCarrying expensive phones, watches, and jewelry; or otherwise demonstrating wealth in public may result in closer attention from '''pickpockets''' and potential criminals. Outside Almaty and Astana, this should be avoided. \n\nThere is zero tolerance for any drugs, and trace amounts may result in criminal investigation, prosecution, and jail time.  Prisons are known to be dangerous and often inhumane.\n\nKeep your passport (or a certified copy of your passport and visa) with you at all times. While the situation has improved lately, police might still try to extort money from foreigners, especially on trains and long-distance buses. Unless the officers involved are drunk, it is possible to avoid paying them by pretending not to understand, or by claiming poverty.\n\nThe risk of '''violent crime''' is comparable with rougher parts of major USA cities.  An ordinary tourist should not experience any violent crime and is unlikely to be a target of minor crimes, if their behavior stays within generally accepted norms in public places. \n\nExcessive consumption of '''alcohol''' and visiting a nightclub will always present a higher risk, especially if a person goes out alone. It is advisable to go out as a group, or even better, with locals.  Late at night, people speaking foreign languages may receive extra attention from local police, who have been known to falsely accuse a person with petty crimes, make an arrest, and attempt to obtain a KZT1,000-5,000 cash payment \"fine\".  Cell phones work most places and should be used to call a local-language speaking friend.\n\n=== Driving ===\nCareless and '''drunk driving''' is a problem.  It is always advisable to obey traffic rules and wear seat belts.  In most cities, using local taxis may present a higher risk than official public transportation due to many taxis operating unlicensed with incompetent drivers.  Situations of unlicensed taxi drivers demanding additional fees before releasing luggage from their trunk, or driving off and stealing luggage are more common than would be expected in western cities with a well-regulated taxi industry.  It's advisable to keep your valuables and passport in your pockets and your most valuable bag on your lap.  Public transportation and taxis are much less expensive than in western cities.\n\n== Respect ==\nKazakh people have more pride than most westerners would expect.  Therefore, insulting or negative comments about Kazakhstan or local Kazakhstani people will often result in severe arguments and possible threats of physical violence.  It is not recommended to get into an argument with locals, as Kazakhstan is a nation where physical power is part of the local culture, and occasionally can lead to a fatal last argument. Do not under any circumstances associate the country of Kazakhstan with the character Borat. There have been cases of violence against foreign workers in West Kazakhstan.  A housing camp of Turkish workers was destroyed, with many workers assaulted, due to anger about foreigners taking local jobs and an alleged rape involving a local woman.\n\nMany locals treat foreigners with a visible degree of skepticism, largely due to years of isolation from the rest of the world. With the work of the Peace Corps and many other international groups and companies, this view is starting to fade.  Nevertheless, the locals will often stare at foreigners with a mix of intense curiosity or skepticism.  \n\n=== Gestures ===\nKazakhs, like Russians, often don't smile at people in public except to those they know. Although this is widely changing, smiling at an individual you do not know can be interpreted as rude and inconsiderate. \n\nWhistling inside a house is unacceptable in almost all Kazakh homes. It is a very common superstition in Kazakhstan that whistling inside will make the owner of the house poor.\n\n==Contact== \n\n===Embassies===\nKazakhstan has some foreign consulates and official representatives. \n\n* [[Image:in-flag.png|20px]] <listing name=\"India\" alt=\"\" address=\"Kaskad Business Center, 5th floor, 6/1, Kabanbai Batyr Avenue, Astana \" directions=\"\" phone=\"+ 7 7172 - 925 700/701/702/703\" url=\"http://www.indembastana.gov.in\" hours=\"\" price=\"\" lat=\"\" long=\"\"></listing> \n\n* [[Image:ch-flag.png|20px]] <listing name=\"China\" alt=\"\" address=\"37 Kabanbay Batyr, Astana \" directions=\"\" phone=\"+7 7172 79-35-61, 79-35-94, 79-35-64\" url=\"http://kz.china-embassy.org/rus/\" hours=\"\" price=\"\" lat=\"\" long=\"\"></listing> \n\n* [[Image:fi-flag.png|20px]] <listing name=\"Finland\" alt=\"\" address=\"12 Samal Microdistrict, Astana Tower, 17 floor, Astana\" directions=\"\" phone=\"+7 7172 44-21-21\" url=\"www.finland.org.kz \" hours=\"\" price=\"\" lat=\"\" long=\"\" >sanomat.AST@formin.fi</listing> \n\n* [[Image:gr-flag.png|20px]] <listing name=\"Greece\" alt=\"\" address=\"109 microdistrict KARAOTKEL 2010000, Astana\n\" directions=\"\" phone=\"  +77172 563714, Emergencies: +7701 188 7406\" \n url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"gremb.ast[at]mfa.gr\n\" fax=\"+77172 563826\"></listing>\n\n*[[File:Flag of Lithuania.svg|20px]] [http://kz.mfa.lt/ '''Lithuania'''], 6/1 Kabanbay batyr g., BC Kaskad, 10 a., 103 room, ☎ +7 7172 925850, Fax: +7 7172 925 853  \n\n*[[File:Flag of Romania.svg|20px]] [http://astana.mae.ro/ '''Romania'''], 28 Saraishyk Street, ☎ +7 717 2286201, astana [at] mae.ro\n\n* [[Image:uk-flag.png|20px]] <listing name=\"United Kingdom\" alt=\"\" address=\"British Embassy, Astana 62, Kosmonavtov Street\" directions=\"\" phone=\"+7 7172 556200\" url=\"http://ukinkz.fco.gov.uk/en/\" hours=\"\" price=\"\" lat=\"\" long=\"\" fax=\"+852 2901 3066\"></listing> \n\n* [[Image:us-flag.png|20px]] <listing name=\"United States of America\" alt=\"\" address=\"Ak Bulak 4, Str. 23-22, building #3, Astana 010010\" directions=\"\" phone=\"+7 (7172) 70-21-00\" url=\"http://kazakhstan.usembassy.gov/\" hours=\"\" price=\"\" lat=\"\" long=\"\" fax=\"+7 (7172) 54-09-14\" email=\"info@usembassy.kz\"></listing>\n\n* [[File:Flag_of_the_Netherlands.svg|20px]] <listing name=\"The Netherlands\" alt=\"\" address=\"Kosmonavtov street 62, Renco building 3rd floor, Microdistrict Chubary, 010000 Astana\" directions=\"\" phone=\"+7 7172 555450\" url=\"http://kazakhstan.nlembassy.org/\" hours=\"\" price=\"\" lat=\"\" long=\"\" fax=\"+7 7172 555474\" email=\"ast@minbuza.nl\"></listing>\n\n* <listing name=\"Poland\" alt=\"\" address=\"Saryarka street 15, Business Center \"Isker\", 010000 Astana\" directions=\"\" phone=\"+7 7172 944400\" url=\"http://www.astana.msz.gov.pl/\" hours=\"\" price=\"\" lat=\"\" long=\"\" fax=\"+7 7172 944411\"></listing>\n\n\n{{isPartOf|Central_Asia}}\n{{outline}}\n{{countryguide}}\n\n\n\n[[de:Kasachstan]]\n[[eo:Kazaĥio]]\n[[es:Kazajstán]]\n[[fi:Kazakstan]]\n[[fr:Kazakhstan]]\n[[hi:कज़ाख़स्तान]]\n[[hu:Kazahsztán]]\n[[it:Kazakhstan]]\n[[ja:カザフスタン]]\n[[nl:Kazachstan]]\n[[pl:Kazachstan]]\n[[pt:Cazaquistão]]\n[[ru:Казахстан]]\n[[sv:Kazakstan]]\n[[zh:哈薩克]]\n[[wts:Category:Kazakhstan]]\n\n\n[[WikiPedia:Kazakhstan]]\n[[World66:asia/centralasia/kazakhstan]]\n{{hasDocent|Caravanistan}}"
        }
    }
}