{
    "parse": {
        "title": "Latvia",
        "pageid": 2615,
        "wikitext": {
            "*": "{{pagebanner|Latvia Banner.jpg}}\n\n{{quickbar\n|image=Riga_Dom.jpg\n|caption=Riga Cathedral, Riga\n|location=Latvia in its region.svg\n|flag=Flag of Latvia.svg\n|capital=[[Riga]]\n|government=parliamentary democracy\n|currency=euro (EUR)\n|area=64,589 sq km\n|population=2,223,000 (October 2009 est.)\n|language=[[Latvian]] (official), [[Russian]] (widely spoken, especially in Riga and Daugavpils), English (widely spoken in Riga), others\n|religion=Lutheran, Catholic, Muslim, Russian Orthodox, Jewish\n|electricity=220V/50Hz (European plug)\n|tld=.lv\n|callingcode=+371\n|timezone=UTC+2\n}}\n[http://www.latviatourism.lv '''Latvia'''] (''Latvija'') is a [[Baltic states|Baltic state]] in Northern [[Europe]]. Latvia is bordered by [[Estonia]] to the north, [[Lithuania]] to the south, [[Russia]] to the east, [[Belarus]] on the south east, and the Baltic Sea on the west. The most famous travel spot is the capital [[Riga]], a World Heritage Site.  There are also many other great places to see, both urban and rural, such as [[Liepaja]] with its unique former secret military town of Karosta and a magnificent beach. [[Kuldiga]] with Europe`s widest waterfall and [[Cesis]] with its medieval castle ruins are also interesting. Tourists can also enjoy the wild beauty of Latvia's unspoilt sea coast, which is 500 km long and consists mainly of white, soft sandy beaches. Forests, which cover approximately a half of Latvia's territory, offer many nature trails and nature parks.\n\n==Understand==\nLatvia is a famous ancient trading point. The famous route from the Vikings to the Greeks’ mentioned in ancient chronicles stretched from [[Scandinavia]] through Latvian territory along the river Daugava to the Kievan Rus and Byzantine Empire.  Across the European continent, Latvia’s coast was known as a place for obtaining amber. In the Middle Ages amber was more valuable than gold in many places. Latvian amber was known in places as far away as Ancient [[Greece]] and the Roman Empire.  In the 12th century, German traders arrived, bringing with them missionaries who attempted to convert the pagan Finno-Ugric and Baltic tribes to the Christian faith. The Germans founded Rīga in 1201, establishing it as the largest and most powerful city on the eastern coast of the Baltic Sea. After independence in 1918, Latvia achieved considerable results in social development, economy, industry and agriculture.  On June 16, 1940, Vyacheslav Molotov presented the Latvian representative in Moscow with an ultimatum accusing Latvia of violations of that pact, and on June 17 Soviet forces occupied the country. Elections for a \"People's Saeima\" were held, and a puppet government headed by Augusts Kirhenšteins led Latvia into the USSR. The annexation was formalized on August 5, 1940. During the time of the Iron Curtain, Latvia was a province of the Soviet Union, but the concentration of heavy industry was enormous. Contacts with the West were regulated. The Baltic region had the reputation of being the most urbanized and having the highest literacy rate in the Soviet Union. Latvia gained independence on September 6, 1991. Between 1991 and 2007 the country saw unprecedented economic growth. However, the global recession and the banking crisis hit Latvia brutally, and severe economic contraction and destructively high unemployment returned. The economy has recovered during the last few years, even reaching fastest growth in EU for some periods. \n\nBecause of a tribal past and divisions between occupying nations, there are regional differences between parts of Latvia which are interesting to explore. \n\n===Climate===\n\n\n'''The best time to travel''' to Latvia is from June to mid September, when it is warm and plenty of local food is available. January and February are the coldest months. October and November have autumn rains and daylight is short.\n\n===Geography===\n\nHalf of Latvia is covered with forests which are '''rich with wildlife'''. There are many lakes, especially if you go to Latgale region. There are deep river valleys with some sections having sand cliffs on their banks. Heavy industry halted a long time ago, so most places are ecologically clean. \n\nThe highest point in Latvia is '''Gaizinkalns''' [http://www.gaizinkalns.lv], at 312m (1,023ft) above sea level, just west of the town of Madona.\n\n==Regions==\nThere are some cultural and social differences between regions, for example, traditional dress is different from region to region. The Latgale region has its own unique culture and language - Latgalian.\n\n\n{{Regionlist|\n\nregionmap=Latvia regions map.png |\nregionmaptext=Regions of Latvia |\nregionmapsize=400px |\n\nregion1name=[[Kurzeme]] |\nregion1color=#e18792 |\nregion1items= |\nregion1description= |\n\nregion2name=[[Latgale]] |\nregion2color=#c9bd9f |\nregion2items= |\nregion2description= |\n\nregion3name=[[Riga region]]  |\nregion3color=#9ce187 |\nregion3items=  |\nregion3description= |\n\nregion4name=[[Vidzeme]]   |\nregion4color=#c2a7e1  |\nregion4items=  |\nregion4description=  |\n\nregion5name=[[Zemgale]]  |\nregion5color=#87bce1 |\nregion5items=  |\nregion5description=  |\n\n}}\n\n\n\n==Cities==\n\n[[Image:Vidzeme-beach.jpg|thumb|230px|Stony beach in Vidzeme]]\n[[Image:Riga-Rolands.jpg|thumb|220px|Statue of Rolands, Riga Old Town]]\n\n* [[Riga]] - the capital city with more than 800 years of history, with the popular holiday suburb of [[Jūrmala]] right by\n* [[Daugavpils]] - second biggest city in Latvia. Features many factories and other industries.\n* [[Jurmala]] \n* [[Kuldīga]] - Kuldīga is the pearl of Kurzeme, Latvia's western region.\n* [[Liepaja]] - city of music on the Baltic sea coast, which is always windy. Latvians believe that the wind starts in the city; and well-known Latvian musicians come from there. There is a very interesting former secret military town called [[Karosta]], between a lake and the sea. One of the world's largest pipe organs. Famous summer event Baltic Beach Party in July. Fantastic unspoilt, white, soft sandy beach.\n* [[Madona]] - a small scenic town in eastern Vidzeme, surrounded by hills, forests and lakes, capital of winter sports.\n* [[Sigulda]] - popular town with many interesting castles and historic places. Most popular attraction outside Riga for foreign tourists.\n* [[Valka]]\n* [[Ventspils]] - hosts one of busiest ports in Europe. It is possible to observe incoming ships.\n\n==Other destinations==\n\n* [[Riga|Latvijas Etnografiskais Brivdabas Muzejs]] — open air museum of the traditional culture of Latvian tribes, near Riga\n* [[Jurmala|Livu Akvaparks]] — the biggest water attraction in Northern Europe\n* [[Liepaja|Karostas cietums]] — true Soviet prison experience with live prison show as well as night in prison. Based in the Karosta suburb of Liepaja\n* [[Pedvale|Open Air Art Museum]] — modern art and installations in nature park, near Sabile in Kurzeme region\n* <do name=\"Around Latvia tours\" alt=\"Local tour operator in Latvia. Tours all around Latvia from Riga\" address=\"Terbatas 85, Riga, LV-1001\" directions=\"\" phone=\"+371 28808598\" email=\"info@aroundlatvia.com\" fax=\"+371 67286681\" url=\"http://www.aroundlatvia.com\" hours=\"9:00 - 19:00\" price=\"\"></do>\n\n* <do name=\"Latvian Tour Guides\" alt=\"One day tours to Jurmala, Sigulda, Rundale palace, Ligatne, Valmiermuiza and Liepaja\" address=\"\" directions=\"\" phone=\"+371 29787307\" email=\"info@latviantourguides.com\" fax=\"\" url=\"http://www.latviantourguides.com/index.html\" hours=\"\" price=\"\"></do>\n\n==Get in==\n===Visas===\n{{Schengen}}\n\n===By plane===\n\n[[Image:Riga-airport.jpg|thumb|230px|Riga airport: RIX]]\n\n'''[http://www.riga-airport.com/ Riga International Airport]''' is the only airport in Latvia that services commercial flights. For more information on flying to/from Riga, see [[Riga#Get_in]].\n\nAlternatively, you can fly to [[Kaunas]] in [[Lithuania]] and take the [http://www.flybus.lv/ Flybus] to Riga.\n\n===By train===\n'''SJSC Latvian Railways''' [http://www.ldz.lv/] operates trains to Riga from [[Moscow]] or [[Saint Petersburg]], [[Russia]] with stops at [[Rezekne]] and Jekabpils, as well as trains to/from [[Tallinn]], [[Estonia]] via change in [[Valga]]. In addition, trains to [[Daugavpils]] and [[Rezekne]] are available from [[Saint Petersburg]], [[Russia]] and [[Vilnius]], [[Lithuania]].\n\nIf you travel by train via [[Daugavpils]] to connect to/from [[Riga]] you might need to stay in Daugavpils overnight for the connection. Therefore, for travel between Riga and Vilnius, it is better to take a bus or plane.\n\n===By bus===\nThere are international bus connections to anywhere in Europe, including frequent service to [[Tallinn]] and [[Tartu]] in [[Estonia]], and [[Vilnius]] and [[Kaunas]] in [[Lithuania]].\n\n* '''[http://www.ecolines.net/ Ecolines]'''\n* '''[http://www.simpleexpress.eu/en Eurolines Simple Express]''' \n* '''[http://www.luxexpress.eu/en Eurolines Lux Express]''' - More legroom than Simple Express service & free coffee.\n* '''[http://www.flybus.lv/ Flybus]''' - Service between Riga and [[Kaunas]] and [[Vilnius]]\n\n===By boat===\n*'''Tallink''' [http://www.tallink.se] operates ferries between [[Stockholm]], [[Sweden]] and [[Riga]].\n\n===By car===\nThe road known as [[Via Baltica]] links [[Warsaw]], [[Poland]] to [[Tallinn]], [[Estonia]] via [[Kaunas]], [[Lithuania]], and [[Riga]]. \n\n===Using carpooling===\n'''[http://www.blablacar.com/ Blablacar]''' has become quite popular in Eastern Europe. There are several rides per day to neighbour countries, Russia, Germany, Poland and even as far away as Spain.\n\n====Driver's License====\nIf you have a '''driver's licence''' issued by another country of the European Union, you can use it continuosly. Residents of other countries have to obtain a Latvian licence after 6 months; however, it involves only a theoretical exam, which can be taken in English, German, French, or Russian.\n\n==Get around==\n\n===By plane===\nThere are several small airports available across Latvia, two in Riga - Spilves airport and Rumbulas airport and in biggest cities of Latvia. Due to the short distances and wide availability of cheaper transport modes, domestic air travel in Latvia remains an irregular and unpopular travel option. However, as of Spring 2017, domestic air travel between [[Riga]] and [[Liepaja]] has been reopened, and there are flights thrice a week.\n\n===By car===\n\nInternational car rentals are represented in Latvia. There are many offices in Riga, including some at Riga Airport. Cheaper car rental offices are also available.\n\nDrive with the headlights on all year round. Winter or all-season tyres are required for the winter period (December 1 to March 1). Many gas stations are self-service and operate 24/7. Gasoline with octane ratings of 95 and 98 is available, as well as diesel fuel.\n\nYou can browse the car rental companies list at the Riga International Airport website [http://www.riga-airport.com/?id=308/ page ID 308].\n\n===By train===\n\n[[Image:route.gif|thumb|200px|Train connections route map]]\n\nIt is advisable to go by train instead of bus from [[Riga]] to the following towns: [[Jurmala]], [[Tukums]], [[Jelgava]], [[Salaspils]], [[Jekabpils]], [[Daugavpils]], [[Rezekne]], [[Sigulda]], [[Cesis]] and [[Saulkrasti]]. Check the official Latvian Railroad Passenger trains (Pasažieru vilciens) at [http://pv.lv/ pv.lv] or at the directory site [http://www.1188.lv/ www.1188.lv].  If you are going to other cities, there is most likely only a couple trains per day or there are no trains going at all.\n\nTrains are usually cheaper and you don't need to worry about having no seat. Trains are usually crowded on peak days of summer.\n\nRemember that sometimes the name of station differs from the name of town. For example, you might need to go to  Krustpils station, if traveling to [[Jekabpils]], and going to Majori (city center) or Ķemeri (going to the national park), if going to [[Jurmala]].\n\nBuying a train ticket before you board the train will avoid an extra fee and language hassles of buying a ticket on the train. Ticket offices at smaller stations can open late and close early, and also close for periods during the date.  The schedule is posted at the ticket office.  Don't buy a return ticket unless you have confirmed there is a return train at the time you need.  Tickets can be purchased in advance online or from any station.  If you buy them online you still need to collect them from a station.\n \nThere is the [http://www.banitis.lv/ Banitis] narrow gauge railway [[Gulbene]]-[[Aluksne]] in the North-East of Latvia. There are several tourist-oriented places along the route.\n\n===By bus===\n\nThere is a vast network of bus connections around Latvia. Buy a bus ticket at the bus station or on bus when boarding. If you have luggage, ask the bus driver to put it in the trunk. It depends on the bus company, if they will charge extra. There are express bus connections to major towns, which can save time considerably. \n\nOn Fridays and Saturdays buses could be crowded in the outbound direction from Riga. Bus time tables are available at the website of Rigas  [http://www.autoosta.lv/ Autoosta], and at the directory site [http://www.1188.lv/ www.1188.lv]. If going by bus on Friday from Riga or coming back to Riga on Sunday it is highly recommended to book ticket in advance (available only of booking for route from starting station of bus) at the cash desk of bus station or online at [https://www.bezrindas.lv/index_bus.php?lang=en bezrindas.lv]. You can buy ticket up to 10 days before departure.\n\n===By boat===\n\nIf you are going from [[Riga]] to [[Jurmala]] during summer, a very romantic way is to travel by river cruise boats: dominantly two-deck motor boats with capacity for around 60-100 people. They usually depart from Riga center in the morning and go back in the afternoon. There probably still is also a river cruise service from Riga center to Riga Zoo. Ask in the tourism information center for more details and prices.\n\n===By bike===\n\nIt is advised to cycle around Riga in the early morning when there is less traffic, although one should be careful when choosing this time due to reduced drivers attention. Expect heavy traffic from 5 PM to 8 PM. No left turn allowed from middle line. However, it is highly advised to choose by-ways and less densely populated roads due to hazardous traffic.\nIt is vitally important to wear reflectors; reflective belts, bands and bright coloured clothing are advised, as well as having the bike equipped with strong front and rear lights.\nGenerally, cycling is still not very safe in the country, especially during the dark hours. The only \"real\" bicycle path is existing from the old town of Riga to the Sea resort of Jurmala. But the country is fast developing '''local cycling routes'''. The international bicycle project [http://www.balticcycle.eu BaltiCCycle] may provide you with a lot of information and help.\n\n===By thumb===\n[[Hitchhiking]] in Latvia is generally good. The roads around [[Riga]] present the largest obstacle, unless the city is your destination - there is no clean \"by-pass\" road, and a considerable amount of local traffic makes hitching very difficult. The easiest way to get around Riga is to find a \"cross-country\" lift at the border with [[Estonia]] or [[Lithuania]]. License plate numbers/countries of origin are your friends. \n\n===Carpooling===\nCarpooling in Latvia is done in Facebook groups so if you want to get a ride from Riga to other city, try searching Facebook for Riga - (name of the city) - Riga. A group might show up. Largest cities, for example Liepaja, have several thousand members and you might catch a great, cheap and fast ride with friendly locals.\n\n==Talk==\n\n[[Latvian]]' (''Latviešu valoda'')  is the only official language and belongs to the Baltic language group of Indo-European languages and its closest relative is Lithuanian, but it is very different anyway, so most likely Latvian will sound completely foreign for you and it is hard to guess what written words mean, even if Latvian uses Latin alphabet, just like English. However, some words are borrowed from other languages and it is not hard to understand that ''Restorans'' means Restaurant, but what about ''Veikals''? It means Shop. The language has complicated grammar, the most complex being usage of verb prefixes and suffixes, which can change the meaning completely, as well as many kinds of participles majority of which do not have equivalent in English. \n\nThe pronunciation is more or less easy; however there are some complicated rules for some letters like ''e'' and ''o'', and any foreigners trying to speak Latvian have an accent, because it is really hard to speak perfect Latvian. In Latvian, there are three pitch tones and sometimes the meaning of the word changes if you change the tone, e.g. ''loks'' can mean leek or bow, depending on the pronunciation tone. ''Zale'' can mean a hall or grass, again depends on the tone you use. The easiest part is the stress, which is almost always on the first syllable. Latvian is spoken natively by only 1.5 million people in the whole world, most of them of course in Latvia, but also in Ireland, UK, USA, Russia, Brazil, and Australia.\n\nBesides Latvian, [[Russian]] is spoken fluently by most people (67% of people are able to converse in Russian according to the Eurobarometer poll of 2012), since Latvia was part of the [[Soviet Union]], and in fact some places like Daugavpils have Russian as the majority language. It is also possible to get by with English, especially in Riga. According to the 2012 Eurobarometer poll, 46% of Latvians are able to have a conversation in English.\n\n==See==\n[[Image:Venta.jpg|thumb|240px|Bridge over Venta in Kuldiga]]\n\nWhen thinking of [[Europe]], the small nation of Latvia is probably not one of the first countries to spring to your mind. Buried under the big no-go blanket of the Soviet Union, it has yet to be properly discovered by the large tourist crowds. If you manage to make it there, however, you might just find yourself most positively surprised by the charms of this Baltic country.\n\nLatvia's dynamic capital, the historic city of '''[[Riga]]''', is a great place to spend some time. It boasts a truly lovely '''old quarter''', full of magnificent Jugendstil architecture, winding cobblestoned lanes and many steeples. Yet, it is a modern, metropolitan city with a vibrant nightlife and a strong economic impulse, to the extent that the rise of modernist buildings is threatening the old town's World Heritage listing. Riga's vibe gets under many travellers' skins, perhaps for the strong contrasts between old and new or maybe because of the seemingly painless blend of Latvian and Russian cultures, as almost half of the city's inhabitants are of Russian origin. To get a sense of the city, wander through its large, manicured parks, stroll through the historic quarter and then kick back in one of the many cafés or outdoor terraces. Among Riga's best sights are the impressive '''Riga Cathedral''', '''St. Peter's Church''' and the bustling '''Central Market'''.\n\n[[Image:Cognitive path in Kemeri NP, Latvia.jpeg|thumb|240px|Cognitive path in [http://www.daba.gov.lv/public/lat/iadt/nacionalie_parki/kemeru_nacionalais_parks/ Ķemeri National Park]: view from the observation tower]]\n\nAlthough Riga is by far the country's main tourist destination, there are a bunch of other places well worth a visit. At just 40 km from the capital is [[Sigulda]], with the nicely reconstructed '''Turaida Castle''', an interesting castle museum as well as the deep '''Gutmanis Cave'''. The town is beautifully located in the '''Gauja valley''' and has been called the \"Switzerland of Latvia\" for its steep cliffs and banks. It's known for its winter sports opportunities and makes a great base for explorations of the fine nature around it. The coastal city of '''[[Liepāja]]''' is known to Latvians as \"the city where the wind is born\", for the sea breeze it constantly enjoys. It has a nice '''beach''' and a charming town centre with a colourful mixture or architectural styles, from wooden houses and spacious parks to Art Nouveau and concrete, Soviet-era apartment buildings. Liepāja's neighbourhood of '''Karosta''' was built in the late 19th century as a naval base for Tsar Alexander III and was later used by the Soviet Baltic Fleet. Its splendid sea side panoramas, former military prison and fortress remains now make it a popular tourist sight. \n\n'''[[Cesis]]''' is one of the country's oldest towns and has a charming centre with cobblestoned lanes, historic wooden building and a few impressive castles. '''[[Kuldīga]]''' boasts Europe's widest, though at two meters high unspectacular, water fall. It's part of the '''Venta Rapid''', one of Latvia's natural monuments. Despite its limited hight it's still a nice sight and the town itself is worth exploring too. The colossal white '''Cathedral of Aglona''' is a worthwhile day trip from '''[[Daugavpils]]''', the second largest city in the country. '''[[Jelgava]]''' has two fine sight in its baroque style '''Rundāle and Jelgava palaces'''.\n\nThere are many interesting and '''old castles''' around Latvia. The [http://www.pilis.lv/tulk/aktual_list.php/ Association of Latvian Castles, Palaces and Manors] has links and photos on their website. Note that sometimes castles are reserved for private occasions.\n\n==Do==\n===Sports and outdoor activities===\nDue to low population density, large parts of Latvia are covered by forests and wetlands and there are many national parks and nature preserves. The largest one is the densely forested [http://www.gnp.lv/en Gauja National Park] in the River Gauja valley. [http://slitere.lv/?lang=en Slitere National Park] has the stunning beach of [http://www.kolka.info/en/get-to-kow-/cape-kolka/ Cape Kolka], where the Gulf of Riga meets the Baltic Sea. Latvia is popular for '''bird watching'''. There are also many trekking opportunities at all difficulty levels, from short walks in old parks up to several day camping and boating trips. It is popular to go for a stroll in the autumn to watch the different shades of colour, when the trees turn red and yellow. Popular places for such activities are [[Sigulda]] and Vidzemes Augstiene.\n\nThere are a lot of possibilities for winter sports - snowboarding, cross country skiing, downhill skiing etc. Major ski facilities include [http://www.ramkalni.lv/en.php Ramkalni], [http://www.baili.lv/ Baili], and [http://www.zviedrucepure.lv/winter_en.php Zviedru Cepure]. Some of the slopes are open late at night. They are not accessible via public transport.\n\nAs rivers get more water from melting snow, kayaking down rivers is among the favorite pastimes for young people. It usually gets warmer after Easter.\n\n===Beach activities===\nLatvia has one of the longest '''sand beaches''' in Europe. In July and August the water is warm enough to swim comfortably. The sea has a very slow slope.  As a best natural beach is listed the coast southwards from Liepaja because it is a coast of open sea (not a gulf) with cleaner water, brighter sand, and not too many people, because it's not close to massive population.  With stable air temperature 30°C, water temperature is about 20°C, which is very refreshing when you take an intensive sunbath. You practically don't need to wash after swimming, because the salt level is pleasantly low.\n\n===Spas===\nLatvia's many '''spas''' are an excellent way to relax. Although widely available, the popular holiday resort town of '''[[Jūrmala]]''' has some of the best options, as well as a fine beach.\n\n===Festivals===\n{{infobox|Latvian Song and Dance Festival|One of the key cultural events in Latvia, which started back in 1873 as a singing festival. Now the festival involves live performances of various choirs, folk dance groups, brass bands etc. Competitions, exibitions, concerts, parades and joint concerts are some of the cultural events. Riga is full with people wearing traditional costumes and cheerful people from all Latvia. It is held once in five years. The last Latvian Song and Dance Festival [http://www.dziesmusvetki2008.lv/] took place from '''6th to 12th July, 2008 in Riga'''. }}\n* '''New Year eve''': most locals celebrate with their family, but there's a chance to see something on streets as well. Traditional food includes stewed peas that symbolize tears: eating peas you leave all tears in a year behind.\n* '''International Ice Sculpture Festival''' in Jelgava, February\n* '''International Festival of Cartoons - Bimini''' in Riga, March\n* '''Easter''' - usually something is going on in town centers. Experience traditional Easter celebrations with swings and egg fight.  Perfect time of the year to \"indulge\" in traditional balzams - a high alcohol content liqueur, and for cultural pursuits such as seeing the amazing Riga Opera.\n* '''International Baltic Balet Festival''' [http://www.ballet-festival.lv/] in April/May.\n* '''Days of Art''' in Cesis, April\n* '''European Undertaking “Museum Night”''' all over Latvia, in May.\n* '''Jani''' - on the June 24th, Latvians celebrate the summer solstice with the midsummer festival called Jani. Before that Jani flea markets are held in major towns.\n* '''Country music festival''' [http://www.cma.lv/] - held annually in Bauska, around middle July for 2 days. European and US country musicans. Camping on the site possible. \n* '''Saulkrasti Jazz''' [http://www.saulkrastijazz.lv/] - yearly jazz festival, which is held at the end of July. Latvian and massive number of foreign musicians are performing live by the sea. Weekly gigs culminate in one final concert. Saulkrasti can be easily reached from the Riga main train terminal by train.\n* '''International Music Festival “Riga Rythms”''' [http://www.rigasritmi.lv/] usually held at the beginning of July in Riga. \n* '''Sigulda Opera Festival''' at the beginning of August, held in open air in Sigulda town.\n* '''Cesis Music and Art Festival. Medieval Festivity''' at the beginning of August. All things Medieval there - food, costumes, customs, ''etc''. \n* '''[https://www.positivusfestival.com/ Positivus Festival]''' is Latvia's largest music festival and features many international acts in a fun environment. Mid July.\n* '''Liepajas Dzintars''' [http://www.liepajasdzintars.lv/] - the end of August is the time for famous [[Liepaja]] music festival.\n\n==Buy==\n{{Euro}}\n\nLatvian lats could be exchanged for free at any bank until 30 June 2014. As the banks were not obligated to support this service after this grace period, most shut it down, though some banks or currency exchange services may have elected to continue it for a fee, even if not widely advertised. However, the Bank of Latvia is to continue LVL/EUR currency exchange at a fixed rate (1 EUR = 0.702804 LVL) indefinitely.\n\nATMs are widely available throughout Latvia (including Riga International Airport), even in many small towns. '''[http://www.taxfree.lv/ Tax free]''' stores have their signs clearly displayed.\n\nBanks will accept '''traveller's cheques''' with a fee, usually equal to the greater of 1% of the amount exchanged or €10. \n\n===Shopping===\n*'''Amber''', which is sold in most souvenir shops. If you are lucky, some can sometimes be found on the Baltic Sea shore after a storm. Be careful looking for amber on beaches in western Latvia - the sea near Liepāja is poluted with phosphorus, which looks exactly the same, but catches on fire after drying out.\n*'''Smoked (black) ceramics''' from Latgale.\n*'''Silver jewellery'''\n*'''Mittens''' with ornaments. Hand-made and representing traditional culture. \n*'''Black (rye) bread''' gives more energy than the common white (wheat) bread. If bought fresh and kept in a plastic bag, it might last well up to 10 days or more. \n*[http://www.balzams.lv/html/eng/index.php/ '''Riga Black Balsam (Melnais Balzams)'''], a traditional Latvian herbal liqueur made using many natural ingredients. \n*[http://www.laima.lv/ '''Laima Chocolates''']: various sweets and chocolates with all kinds of fillings. \n\nSpeciality shops are open mostly 08:00-18:00 on weekdays, until 16:00 on Saturdays and closed on Sundays. Groceries are open every day until 20:00 or longer, though the working hours may be slightly shorter on weekends, especially Sundays. Most supermarkets are open until 22:00 or 23:00 every day. Some convenience stores may be open 24/7.\n\n==Eat==\nThe country offers plenty of varieties of bread, milk products, ice cream, sweets (loose sweets, made by Laima) etc. In the open air markets of Riga, Liepaja and other cities and towns, the local fruits, vegetables and mushrooms are a great option, such as freshly picked wild strawberries or blueberries from the forests, or some big strawberries, apples, rhubarb pie and a crunch made of fresh stalks straight from the garden. This is, of course, available mainly in summer and autumn season.\n \nLatvian cuisine comes from its peasant culture, and is based on crops that grow in Latvia's maritime, temperate climate. Rye, wheat, oat, peas, beets, and potatoes are the staples; smoked bacon, sausage, and other pork products are favourites, smoked and raw fish is common. Many types of food are flavoured with caraway seeds, especially cheese and bread. A cheese similar to smoked gouda, but softer, is the cheapest and, arguably, tastiest variety. Latvian rye bread is heavy and flavourful, and goes well with hearty Latvian meals like pea soup, potatoes, and schnitzels. Restaurants in larger cities often offer stews in clay pots.\n\nLatvian cuisine is typical of northern countries, especially close to Finland; it's high on butter, fat, and grains, low on spice except for caraway and black pepper. If you are from the Mediterranean, you might find it bland, but if you come from England or the Midwestern US, you're not likely to have trouble getting used to it.  \n\n[[Image:Koknese2.jpg|thumb|240px|Koknese castle ruins]]\n\nA more exotic Latvian dish is a sweet soup made from rye bread (maizes zupa).\n\n'''Black bread''' is extremely important part of Latvian food. There are many types of black breads and they are believed to be much healthier and better than white bread. Try Lacu or Liepkalni for autentic taste\n\nLatvia is much richer in milk products than an average Western country. Try '''Biezpiena sieriņš''' - a curd snack with sweet taste. Many types are available, the most popular being '''Karums''' and '''Baltais'''. Try the dessert '''Maizes zupa''' (bread soup, made of black bread and fruits). Taste the '''Biešu zupa''' (red beetroot soup). \n\nAny Latvian would tell you that chocolate of '''Laima''', the local sweets factory, is much better than Belgian chocolate. Laima offers not just chocolate, but also ''konfektes'' - candies of different types, sold by grams and kilos and the price is about €8 per kilo. The best candies are Rudzupuķe, Lācītis Ķepainītis, Serenāde, Vētras putns, Rīts, Soho, Sarkanā magone, Vāverīte etc. An assortment in a nice box can also be a nice gift to friends who stayed home. Try Zefirs - a soft marshmallow-type sweet. Gotiņa (cow in the diminutive ) is a famous milk candy. The '''[http://www.emilsgustavs.com/ Emihls Gustavs]''' chocolate factory in Riga is more exclusive and they make little sculptures of different shapes of chocolate, but it is a bit pricy.\n\nIt is important to know that in Latvia the whole concept and meaning of words '''Cafeteria''' (''Kafejnīca''), '''Canteen''' (''Ēdnīca'') and '''Restaurant''' (''Restorāns'') are different than in many other countries. A Cafeteria or Kafejnīca is not just a coffee shop. Usually you can have all meals that you would probably expect in a restaurant. The difference is that in Kafejnīca you sometimes bring your food to your table yourself. However, some Kafejnīcas have waiters, but these are then something in between of Kafejnīca and Restorāns. Restorāns is usually a more or less top class place (however, some fast food establishments, in keeping with foreign naming conventions, refer to themselves as such). Ēdnīca is a name for canteens of schools, universities, factories etc. They tend to serve traditional Latvian/Soviet era foods and are often perceived by locals to have a high quality/price ratio, but sometimes limit access to outside customers.\n\nSome specific food in this area:\n* '''Biezpiena sierins''' [http://www.piens.lv/produkti_karums.html] - curd actually, but with sweet taste\n* '''Kefirs''' - specific dairy product (vegetarian)\n* '''Kiselis''' - thickened stewed fruit (usually cherry or rhubarb) served for dessert (vegetarian)\n* '''Griki''' - buckwheat, eaten as main course\n* '''Skabeti kaposti''' - sauerkraut\n* '''Piragi''' - bacon, sauerkraut and onion wrapped in a thin-ish yeast dough.  A real classic of Latvian cuisine.\n\nOther mentionable food and dishes:\n* '''Smoked cheese''' - goes very well with wine\n* '''Eclair''' - cake with sweet cream inside\n* '''Eel''' \n* '''Frikadelu zupa''' - meatball soup \n* '''Biesu zupa''' - red colored beetroot soup (vegetarian and non-vegetarian)\n* '''Rosols''' - salad with sour cream (Salad Olivier), usually non-vegetarian\n* '''Kotletes''' - meatballs served with potatoes\n* '''Gailenu merce''' - chanterelles sauce in sour cream, usually served with potatoes (vegetarian)\n* '''Siļķe ar biezpienu''' - herring served with cottage cheese\n* '''Commorgan-wieders'''(old name)- once braised chuck, ground with celery, onions and wrapped in a crepe and resauteed.\n* '''Kuka grozins''' - white soft creme cake\n\n==Drink==\n[[Image:Skybar.jpg|thumb|260px|A view from Skyline bar]]\n\n'''Beer''', the most popular alcoholic beverage in Latvia, is excellent. Beers, such as Aldaris, Līvu, and Senču can be bought almost anywhere but local people are very proud about local small breweries, try ''Bauskas, Tervetes, Piebalgas'' and some other beer. A special 'live beer' like Užavas can be found in selected pubs and restaurants. Don't forget to try the locally distilled '''Black Balsam''' (Rīgas Melnais Balzams). It's a strong (45%) infusion of various herbs, roots, and spices. It will cure your flu in no time. Add a few drops to flavor your tea, or a few spoons to lace your coffee, or in various cocktails. By itself it can be a very strong beverage! '''Wine''' is also grown in Latvia in small quantities. It is one of the most Northern places in the world where the wine can be successfully grown. Vineyards can be seen in Sabile [http://www.sabile.lv/] (in Latvian).\n\nSome possible places to have a sip:\n*'''Krodziņš \"Riva\"''' in Jurkalne, could be seen from Liepaja - Ventspils highway, a small pub near a waterfall and a wooden bridge.\n*'''Raganas Ķēķis''', [http://www.raganaskekis.lv]. The name means \"witches kitchen\". Located in Ragana village (which obviously means the \"witch\" in Latvian), in the Vidzeme region. You will see it if you travel to Valmiera or Limbazi by road.\n\nIt is common to tip 10% of the bill depending on the service you encountered.  Make sure you check the receipt, as some establishments automatically include a 10% tip in the bill.\n\n==Sleep==\n[[Image:Laukucel.jpg|thumb|260px|Country house]]\n\nAlthough you might not find plenty of 5 star hotels all around Latvia, you will find comfortable places to stay for a reasonable price.  There are many '''hotels''' to choose from. Prices start from 20 LVL outside of Riga and from 40 LVL in Riga. \n\nNetwork of '''youth hostels''' [http://www.hostellinglatvia.com/hostels.htm] is also developing. Dormitory rooms come around 10 lats, single, double rooms start from 20 lats and above. \n\n'''Camping''' in parks is usually not allowed.\nAs regards the stealth camping- most of rural land is private, but camping there is always possible; common sense is to ask for a permission of the owner, which in most cases will be gladly granted. However, if there's no such chance, but you decide to camp there nevertheless and are later asked to move, you have to. Paying a small amount of money (1-2 lats) helps in most such cases. Overall, camping outdoors on privately owned land is widely understood, common and accepted; however, staying in one place for more than two days, or really close to a home is not considered good manners. Follow the common sense of stealth camping.\n\nIndicated free camp sites can be found in Latvia, especially in national parks, you can easily camp there.\nCommercial campgrounds as small businesses are becoming more and more widespread.\n\nSo called '''guest houses''' and '''country houses''' (some on farms) are arguably the best places to stay at in the countryside, and usually for much less money than hotels and better quality than hostels, due to very limited numbers of guests and more personal oriented and specialized service (usually run by families). These come with full amenities and some follow the hotel star ratings. These also provide many recreational activities- from the Latvian popular ancient '''\"pirts\"''' sauna to horse rides etc. This is not only a good way to spend the night, but also an option to spend your holiday. However, usually, guest houses should be called up earlier than the day you plan to arrive, but this can vary depending on the place. Guest houses can be found fairly frequent throughout the country and are usually listed on tourist booklets.\n[[Image:Cesis.jpg|thumb|230px|Cesis castle in Vidzeme region]]\n\n==Learn==\n\n==Work==\nFinding work is possible, especially if you are a citizen of an EU country; however, salaries are low when compared to the Western countries. Due to fairly strict language competency requirements for workers and a comparatively large presence of people who speak little or no Latvian (locals, tourists, foreign trading partners etc.) most job advertisements, in addition to Latvian, include Russian and English proficiency as a requirement. Job advertisements are posted in Latvian newspapers such as [http://www.diena.lv/ Diena] in its Tuesday or Saturday edition, as well as various classified advertising websites, the most popular of such websites being [http://www.ss.com/ SS.com]. Some ads are in English, German, Russian, or French.\n\nFor information on obtaining a residence permit, see [http://www.pmlp.gov.lv/en/home/services/residence-permits/#1 Office of Citizenship & Migration Affairs]\n\n==Stay safe==\nIt is generally safe to travel around on your own, although some petty crime exists. A thing to watch out for is bicycle theft, and it is advisable not to leave valuable things in your car. Mind the forest roads, collisions with wildlife animals can easily occur.\n\nMuch like [[Estonia]] and [[Lithuania]], roads are congested with traffic and accident rates in Latvia are high. Take care while crossing the road as most drivers can be reckless.\n\nWhen visiting bars and restaurants in [[Riga]], make sure you know the price before you order and follow your spending, so no cheating is possible.  Beware of [[Common scams|scammers]] who strike up conversations out of the blue and invite you to visit their favorite club or bar; this is often a favorite way for the mafia to rob foreigners, and the police are unlikely to help if you get scammed.  The Police of Latvia [http://www.vp.gov.lv/?sadala=312] has a website with advice for travelers. \n\nLocal informational web-sites for tourists claim that, in terms of safety, there is almost no difference between big cities and country areas [http://www.celosana.lv/galamerki/latvija/]. Although it is true that anywhere in Latvia one is never too far from a town or a city, seeking help in case of emergency may be somewhat more difficult in the countryside (for foreign tourists). This is because English is mainly spoken in cities, but outside them one may find almost no people who would understand you (young people are an exception, but they are also drawn from rural areas to bigger cities). This is somewhat balanced by the fact that even then locals are quite friendly and ready to help. \n\n'''Emergency phone number''': Single European Emergency Phone Number '''112'''.\n\nIf '''bitten''' by a dog, wild animal or a snake, seek medical attention immediately. Snakes are not venomous in Latvia, except for the European Adder which is a possible death threat if no treatment is received within the next few hours after the bite. A dog or cat bite can carry the risk of rabies. Mosquitoes carry no disease and are only an annoyance in the summer months. \n\n'''Forest ticks''' can be abundant from May-September, depending on previous year's weather, especially in brushwood/scrub areas, but also occasionally in town parks. Their bite carries the risk of tick-born encephalitis[http://en.wikipedia.org/wiki/Tick-borne_encephalitis] (infected ticks can be quite common, vaccination possible before season) and Lyme disease[http://en.wikipedia.org/wiki/Lyme_disease] -- less common; delayed or inadequate treatment can lead to disabilities.\n\n==Stay healthy==\nThere is no problem turning to any doctor or hospital to seek medical help, just by paying an outside patient fee. However, it can prove difficult to obtain medical assistance in many rural areas, as the service can be slow and unresponsive; therefore, it may be a good idea to bring your own first aid kit. There are virtually no air ambulance helicopters in the country, except for the army, so when exploring sparsely-inhabited, remote areas on your own, it's important to be well-prepared for emergency situations. If you get to a doctor, he/she will probably only speak Latvian and Russian. \n\nFew drugs are available without a prescription; bring your own medicine if you require it.\n\nIf you need to seek medical attention of a doctor, be prepared to ''pay a fee under the table''; in Latvia, it is estimated that 1 in 4 doctors take \"private donations\" to see patients. \n\nTap water is safe to drink; however, most locals prefer to boil it before drinking. Purchasing bottled water is an alternative.\n\n==Respect==\n\nOne should be cautious when mentioning Latvia in the context of the USSR to ethnic Latvians. Latvia became a USSR province after World War II, and praise of the Soviet (or Russian) regimes is unlikely to be understood or appreciated by Latvians, especially young ones. In the same manner, mentioning any ethnic, lingustic or citizenship issues involving Latvians and Russians should be avoided, as this remains one of the most controversial subjects of local politics.\n\nIt is very common to give up your seat for elderly passengers or pregnant women on the public transport in Latvia, particularly if the vehicle has no assigned seats. It is also considered polite to let women board a train or bus first. \n\nThere are many bins and trash cans on the sidewalks and near most shops. Littering is considered a very bad manner and may be fined.\n\nAlso, you do not need to specially greet, smile, or offer help to people. Latvian citizens are not so easy-going in relationships. Friendship is seen as a very serious affair that develops in the long term.\n\n==Contact==\n====Post====\nThe postal service, '''Latvijas Pasts''' [http://www.pasts.lv/en/] is reliable and a fast way to send letters and parcels up to 10kg. \n\n====Telephone & Internet====\nAny GSM phone that works in Europe will work in Latvia. For local communication, it is much cheaper to buy a local prepaid SIM card, which can include data as well as voice and text. These cards and separate renewal vouchers can be easily bought in gas stations, kiosks, or supermarkets. All brands are more or less equal in price and service, and a prepaid SIM card can be bought for under €2. No identity card or other document is required to make the purchase. Popular brands include LMT [http://www.lmt.lv/], Tele2 [http://www.tele2.lv/], Bite [http://www.bite.lv/]. All prepaid SIM cards come with a manual in English, Russian, and Latvian.\n\nUntil early 2014, public payphones were available in many cities and towns; however, they were dismantled due to low demand and relatively high maintenance costs (related to e.g. vandalism, electricity and cleaning expenses). Even though local media outlets have voiced an argument that payphones may still be useful in an emergency, as of 2017, no phone operator is legally required to provide such a service and no plans have been announced to reintroduce them in Latvia.\n\nFree wifi is available in many cafes, libraries, and the Riga Airport, as well as other public places. Most hotels will provide free wireless access spots for laptops.\n\n====Telegram====\nUnlike many European countries, it is still possible to send and receive telegrams in Latvia using the services of Latvijas Pasts [http://www.pasts.lv/en/]. No recent statistics regarding telegram service exist (in 2011, it was reported that a few hundred telegrams were sent and received each month [http://apollo.tvnet.lv/zinas/latvijas-iedzivotaji-21-gadsimta-joprojam-suta-telegrammas/486089]), however, the demand for this service is considered to be very low, so it is not guaranteed that the post office staff will be particularly familiar with the process!\n\n{{isPartOf|Baltic states}}\n{{outline}}\n{{countryguide}}\n\n[[ca:Letònia]]\n[[de:Lettland]]\n[[eo:Latvio]]\n[[es:Letonia]]\n[[fi:Latvia]]\n[[fr:Lettonie]]\n[[hu:Lettország]]\n[[it:Lettonia]]\n[[ja:ラトビア]]\n[[nl:Letland]]\n[[pl:Łotwa]]\n[[pt:Letônia]]\n[[ro:Letonia]]\n[[ru:Латвия]]\n[[sv:Lettland]]\n[[wts:Category:Latvia]]\n\n\n[[WikiPedia:Latvia]]\n[[Dmoz:Europe/Latvia/]]\n[[World66:europe/latvia]]"
        }
    }
}