{
    "parse": {
        "title": "Liechtenstein",
        "pageid": 574,
        "wikitext": {
            "*": "{{pagebanner|Liechtenstein Banner.jpg}}\n\n{{quickbar\n| image=Field Liechtenstein Mountains Alps landscape.jpg\n| caption=a wheat field in Lichtenstein \n| location=Liechtenstein in its region.svg\n| flag=Flag of Liechtenstein.svg\n| capital=[[Vaduz]]\n| government=Hereditary constitutional monarchy on a democratic and parliamentary basis\n| currency=Swiss franc (CHF)\n| area=''total:'' 160 km<sup>2</sup>\n| population=33,987 (July 2006 est.)\n| language=[[German]] (official), Alemannic dialect\n| religion=Roman Catholic 76.2%, Protestant 7%, unknown 10.6%, other 6.2% (June 2002)\n| electricity=230V/50Hz (European plug)\n| callingcode=+423\n| tld=.li\n| timezone=UTC +1\n}}\nThe [http://www.tourismus.li/en/ '''Principality of Liechtenstein'''] (German: ''Fürstentum Liechtenstein'') is a small, alpine German-speaking country doubly landlocked by [[Switzerland]] and [[Austria]]. It is the last remnant of the Holy Roman Empire and an independent nation with very close ties to Switzerland. It enjoys a very high standard of living and is home to some incredibly beautiful mountain scenery. The principality's capital, [[Vaduz]], is mainly a modern city and a major centre of commerce and international banking.\n\n==Understand==\n\n===History===\nThe Principality of Liechtenstein was established within the Holy Roman Empire in 1719. Liechtenstein was occupied by both French and Russian troops during the Napoleonic Wars and became a sovereign state in 1806. Until the end of World War I, it was closely tied to [[Austria]], but the economic devastation caused by that conflict forced [[Liechtenstein]] to conclude a customs and monetary union with Switzerland. Since World War II (in which Liechtenstein remained neutral, although it supposedly helped the Nazis), the country has seen outstanding economic growth.\n\nShortcomings in banking regulatory oversight have resulted in concerns about the use of the financial institutions for money laundering and tax evasion. However, the days of bringing suitcases of money into banks for deposit without questions asked is over. Liechtensteiners are also very proud of the fact that their nation has never been physically involved in a battle or military confrontation with an \"enemy state\" and see their flag as a banner of peace.\n\n===Economy===\nDespite its small size and limited natural resources, Liechtenstein has developed into a prosperous, highly industrialized, free-enterprise economy with a vital financial service sector and living standards on a par with the urban areas of its large European neighbors. The Liechtenstein economy is widely diversified with a large number of small businesses. Low business taxes--the maximum tax rate is 20%--and easy incorporation rules have induced a large number of holding or so-called letter box companies to establish nominal offices in Liechtenstein, providing 30% of state revenues.\n\nThe country participates in a customs union with Switzerland and uses the Swiss franc as its national currency. It imports more than 90% of its energy requirements. Liechtenstein has been, since May 1995, a member of the European Economic Area, an organization serving as a bridge between the EFTA and the EU. The government is working to harmonize its economic policies with those of an integrated Europe. Liechtenstein has one of the highest personal income rates (GDP Per Capita) in the world, with the base rate of income tax currently standing at just 1.2%.\n\nLiechtenstein was the home of the Curta calculator.\n\n===Geography===\nLiechtenstein is very mountainous and one of the world's two doubly-landlocked countries (Meaning that the countries that border it are themselves landlocked too) along with [[Uzbekistan]].  Most of Liechtenstein's population lives in the long and wide Rhine Valley in the western third.  Roads are mainly laid out in a north-south pattern following the valley as well. To the north the main roads lead to the border with Austria, to the south they enter Switzerland, and to the west across the river the bridges also cross into Switzerland. Most of the eastern border with Austria is not passable and is only accessible by foot as it is very mountainous, though the north of the country is well connected by road to [[Feldkirch]] in [[Austria]]. The country's highest point is the '''Grauspitz''', which stretches to 2,599m. Liechtenstein is 2.5 times bigger than [[San Marino]] and it is 81 times bigger than [[Monaco]].\n\n===Climate===\nLiechtenstein has a continental climate featuring cold, cloudy winters with frequent snow or rain, making the country a moderately popular ski destination.  Summers are cool to moderately warm, also often cloudy and humid.\n\n==Cities==\n[[Image:Liechteinstein-map.png|thumb|300px|Map of Liechtenstein]]\n\n* [[Vaduz]] {{-}} capital city of Liechtenstein and the seat of government\n* [[Balzers]] {{-}} this town is home to a very beautiful church and castle\n* [[Malbun]] {{-}} an area for skiing and snowboarding\n* [[Schaan]] {{-}} the largest populated area in the country\n* [[Triesen]] {{-}} a small town south of Vaduz known for its historical buildings\n* [[Triesenberg]] {{-}} an alpine town high in Liechtenstein's mountains\n* [[Ruggell]] {{-}} a town in northern Liechtenstein where there is a nature reserve of rare plants and animals\n* [[Bendern]] {{-}} where Liechtenstein was born in 1699\n* [[Nendeln]] {{-}} where there are a ceramics works and Roman ruins\n* [[Schellenberg]] {{-}} a town with a museum of rural homes\n\n==Get in==\n\n===Entry requirements===\n{{Schengen}}\n\nDespite the country being a member of the Schengen Agreement and the [[EEA]], Liechtenstein is '''not''' a member of the [[EU]]. Therefore, travellers entering Liechtenstein from Austria (and vice versa) are subject to non-systematic customs controls, despite the fact that there are no immigration controls.\n\nLiechtenstein, however, maintains a complete customs union with [[Switzerland]] and is represented by Switzerland in embassies around the globe. Since 1923 there have been no border formalities needed for crossing between the two countries. In essence there is nothing more than a sign announcing your arrival in Switzerland or Liechtenstein (when you cross the Rhine or the land border), similar to the situation at smaller border crossings in many EU nations (Austria/Germany/France/Italy etc.).\n\nStamp hunters can, however, get an authentic Liechtenstein entry stamp in their passport at [[Vaduz]]'s tourist office for 3.00 Swiss franc (CHF) or €3.00.  The stamp is not available at the Liechtensteinisches Landesmuseum; the tourist office is the only place that you can purchase the stamp. Be aware that such memorial stamps may render your passport 'falsified' in the eyes of Finland's consular and border control officials.\n\n===By plane===\nLiechtenstein has no airports due to the size of the country. You can take a flight to [[Zürich]] Airport (115km). Although the airport was the only major airport near Liechtenstein, there were some limited services from Vienna to [[St. Gallen]]-Altenrhein Airport (53km) by [http://www.aua.com Austrian Arrows]. There was also a private airport in Bad Ragaz, very near the country. Another popular point of entry is through [[Friedrichshafen]] in [[Germany]], which is served by low-cost airlines and Turkish Airlines.\n\nThere is a heliport in Balzers owned and operated by Swiss Helicopter. From there, one can take scenic flights around the country or book shuttle flights, e.g. from or to Zurich airport. The latter being private charter flights, not scheduled ones, cost around 4000 CHF for up to five passengers.\n\n===By train or bus===\nThe easiest way of getting to Liechtenstein by train is to travel to [[Sargans]] or [[Buchs]] in Switzerland, or [[Feldkirch]] in Austria, and then take a connecting bus to Liechtenstein. \n\nLiechtenstein buses are a distinctive light green colour. Timetables and route map is available on their Web site [http://www.liemobil.li].\n\n====From Sargans, Switzerland====\n\nFrom [[Sargans]] train station,  Liechtenstein bus route 11 runs about every 30 minutes during the day. It travels through Vaduz and Schann on its way to Feldkirch (Austria). It takes about 30 minutes to reach Vaduz.\n\nBus route 12E is also available, but it only goes as far as Vaduz.\n\nCatch the busses from stop C, which is at the far side of the bus stop island just outside the train station.\n\nSargans can be reached by fast trains from [[Zurich]] as well as many international train services. Consult the SBB timetable [http://sbb.ch/en/index.htm] to find out what'll be quickest when you're travelling. There are lockers at Sargans station so you can leave your luggage there as well as other facilities [https://www.sbb.ch/en/station-services/railway-stations/further-stations/station.9411.html].\n\n====From Buchs, Switzerland====\n\nFrom [[Buchs]] railway station, Liechtenstein bus route 12 runs every 15 minutes to Schaan, from where connecting buses run to [[Vaduz]]. It only takes about 10 minutes to Schaan and another 5 to Vaduz.\n\nAnother option is to take a train operated by the Austrian federal railway company, ÖBB. From the ''Buchs SG'' station they go via the ''Schaan-Vaduz'' station (near Schaan) to [[Feldkirch]] (Austria).  But these are very limited trains services,. Trains only run during weekday peak hours, which makes buses far more convenient.\n\n====From Feldkirch, Austria====\n\nFrom [[Feldkirch]] railway station, Liechtenstein bus route 14 travels to Schaan.\n\nBus 11 is also available. It travels through Schann and Vaduz on its way to Sargans (Switzerland). But for Schaan, bus 14 is more direct.\n\n====Cost====\n\nTickets for the bus can be purchased from the driver.  Swiss Travel Passes can also be used. Consider buying a whole network one-day pass (12 CHF) or one-week pass (24 CHF) if you are making multiple journeys. For example, a single fare from Sargans to Vaduz is 5.80 CHF and 3.40 CHF from Buchs to Sichuan or Vaduz.\n\n===By car===\nThe Swiss Autobahn A13/E34 runs along the Swiss side of the Rhine River, the border between Switzerland and Liechtenstein.  There are several access points that cross the Rhine into Liechtenstein, the two that are most commonly used are the bridge crossing into the southern town of Balzers and the crossing into Vaduz. Parking in Vaduz is easy, with a large parking garage located below the Kunstmuseum. Driving in Liechtenstein is relatively safe, but extra care should be taken on narrow and winding mountain roads. Speed traps are everywhere and fines are high!\n\n===Hitchhiking===\nVery easy indeed from Feldkirch in Austria. Rush hour sees lots of commuters head into the capital. A simple sign as you stand by the main road in Feldkirch should get you a lift within minutes.\n\n===On foot===\nYou can take the commuter train from [[Sargans]] or [[St. Margrethen]], in Switzerland, to [[Buchs]] SG or [[Sevelen]] stations, and then '''walk''' into Liechtenstein. Either option gives you the interesting experience of crossing the international border on foot. [[Buchs]] is the closest station to the Schaan-Vaduz Youth Hostel, while Sevelen is the closest to downtown Vaduz.\n\n==Get around==\nPublic transport in Liechtenstein is amazingly efficient and commonly used.  The country's sole bus operator is LBA [http://www.lba.li/]. LBA fares are reasonable, a 7-day unlimited use card costs CHF 24. Another cheap way to travel, weather permitting, is by bike. The roads in Liechtenstein are in excellent condition and many (in the Balzers-Schaan corridor) even offer bike lanes. Biking through the whole country (entering from Austria going all the way south through to Switzerland) takes only a few hours, but is worth every minute of the wonderful alpine scenery!\n\n==Talk==\n\nThe national language is German, but the main language in everyday use is Alemannic German dialect, which Liechtenstein shares with German-speaking Eastern Switzerland, Baden-Württemberg (south of Stuttgart, Germany), and Vorarlberg, Austria. Almost everyone can speak standard German when necessary, and English is also prevalent. French and Latin are also widely taught in the secondary public school system.\n\n==See==\nLiechtenstein boasts a number of attractions that are of interest to visitors.\n\n[[Image:Balzers Castle, Liechtenstein.jpg|thumb|250.px|Balzers Castle]]\n\n'''Vaduz''' - The capital is the main shopping area in the country, with many souvenir stores and assorted restaurants. The city is also home to a modest ''cathedral'' and the decade-old ''Liechtenstein Kunstmuseum'' that holds modern and contemporary art. Vaduz also has the Postage Stamp Museum and the Liechtenstein National Archives. A ski museum is north of the town centre. It is entirely possible to encounter the royal family at the Kunstmuseum, coming in and out of Schloss Vaduz or skiing during winter time.  This is one benefit of such a small country. They are recognizable in their cars, which use their birth year for their licence plate number.\n\n'''Schloss Vaduz''' - This imposing and historic castle, home to the royal family, overlooks the city of Vaduz and can be seen closer by following the Castle Trail starting in Vaduz. The castle is not open to the public, but it is possible to view it from quite close up.\n\n'''Malbun''' - Home to a ski resort and falconry center\n\n'''Balzers''' - Home to a beautiful church and a spectacular Gothic castle.\n\n'''Triesenberg''' - Go here if you want to have one of the best views to the swiss alps. Certainly a unique experience.\n\n==Do==\nLiechtenstein offers great hiking, road biking, and mountain biking terrain. Skiing and snowboarding are also offered at a reasonable price at the country's small resort, [[Malbun]], in comparison to the expensive lift prices in neighboring Switzerland or Austria. \n\nGet up early one morning and drive up the mountains on the east side of the river. From here you have an incredible view over Vaduz & Switzerland that you can stand and admire.\n\n==Buy==\nLiechtenstein uses the '''Swiss franc''' (CHF) as its currency.  Many shops will also accept the Euro, but the exchange rate may not be very advantageous.  \n\n===Costs===\nCosts in Liechtenstein are roughly equivalent to those in [[Switzerland]] and are therefore somewhat more expensive than other European countries.\n\n==Eat==\nYou will find a few restaurants in the larger cities of Liechtenstein.  There is also a McDonald's restaurant (opened in 1996; serves beer), which is very popular and is widely publicised by road signs throughout the country.\n\nThe many small bakeries are a great place to get a hot, fresh roll or pastry.\n\nOne recommended restaurant is the Old Castle Inn, Aeulestrasse 22, +423 232 1065, in the centre of Vaduz. It is impossible to miss and offers authentic food at a reasonable price and with a pleasant atmosphere.\n\n==Contact==\nInternet access is available with one station at Telecom Liechtenstein immediate south of Vaduz's centre on the main road, but this is only open during business hours. Most hotels and some bars/restaurants will have net access such as in [[Schaan]].  The last real Internet cafe disappeared, because every one in the country has net access in their homes, so the local market completely disappeared and only visitors need access.\n\n==Drink==\nThe legal drinking/purchasing age is '''16''' for wine, beer, and cider. While the legal drinking/purchasing age is '''18''' for spirits and spirit-based beverages. \nThere is a small amount of wine that is produced in Liechtenstein that is available in supermarkets and tourist shops throughout the country.  Expect to pay around 25 Swiss Francs for an average bottle.  The Prince even owns his own vineyard in Vaduz, off the main road. Beer is also available for purchase that is made with malt from Liechtenstein, although most of the beer itself is brewed in Switzerland.  A variety of other European wines, beers, and soft drinks are also available. There is now a brewery in Liechtenstein that produces a variety of beers; lagers including Helles (blonde) and Hefe Weizen (unfiltered wheat) styles are brewed.\n\nThere is also a one-man distillery in Triesen who makes liquors and schnapps from fruits.  Tours on Saturdays.\n\n==Sleep==\nThere are a few hotels in Liechtenstein, but they tend to run on the expensive side.  There is one [http://www.hihostels.com/dba/hostel055067.en.htm youth hostel] located in Schaan, but it closes for the winter.  You will probably be able to find cheaper accommodation in neighbouring [[Feldkirch]], Austria.\n\nCamping Mittagspitz is the only full-service campsite in the Principality.  It offers excellent facilities, a friendly reception and a fabulous reasonably priced restaurant. There are three other camp grounds in Liechtenstein. One in Bendern, one in Vaduz, and one in Triesen.  All are pretty much full year round.\n\n*<sleep name=\"Gasthaus Krone\" alt=\"\" address=\"Dorf 36, 9488 Schellenberg\" directions=\"next to post office and bus-station\" phone=\"+423 373 1168\" url=\"http://www.hotelkrone.li/\" checkin=\"\" checkout=\"\" price=\"60 CHF (double)\" lat=\"\" long=\"\">Very inexpensive rooms. Familly run hotel and restaurant. 15 km away from Vaduz, regular (hourly) bus service to all parts of Liechtenstein.</sleep>\n\n==Learn==\nLiechtenstein's university offers courses only in technical sciences. Without either Liechtenstein/Swiss or EU citizenship, a large bank balance and a fluency in German, it is unlikely to interest visitors.\n\n==Work==\nFinding work in Liechtenstein is difficult. A majority of non-nationals working in the Principality are Swiss, with a smaller number of Austrians and \nGermans. Liechtenstein is not a member of the European Union, so the government has no obligation to let nationals of EU member states work and live in the country.\n\n==Stay safe==\nLiechtenstein is easily one of the safest countries in the world, though it is not without its problems. The most common crime in Liechtenstein is of a non-violent nature, though the Principality maintains a well-equipped police force which maintains a presence on the streets. In the late 1990s, the ''Liechtenstein Landespolizei'' launched a crackdown on prostitution in Vaduz. Considering the largest cities nearby are Innsbruck and Zürich, outside of Schaan and Vaduz, the whole place can seem very rural. Drunk drivers and winter road conditions may be your only \"realistic\" concern. Speed limits are strictly enforced by speed cameras which will be very pricey. Don't speed, enjoy the scenery instead!\n\nThe country's beautiful scenery is also very dangerous. Cases of hikers finding themselves in difficulty are very common, and extreme care should be taken when leaving the well-marked trails. Follow local advice, read local weather forecasts (newspapers in the Principality print individual forecasts for the different cities in Liechtenstein, which is beneficial because the difference in altitude often cause different weather conditions), and ensure that you have the correct equipment before setting out.\n\n==Stay healthy==\nThere are excellent medical facilities in Liechtenstein, but it is more likely that you would be transferred to a hospital in [[Switzerland]] should you require medical attention. If you are Austrian, you may want to seek medical attention in neighbouring Feldkirch, Austria. For EU citizens carrying a EHIC pass, medical treatment in Liechtenstein and Switzerland is covered.\n\n==Respect==\nThe Principality of Liechtenstein has existed for centuries as an independent state and this should be remembered. Liechtenstein is not part of Switzerland or Austria, and its citizens will not hesitate to remind you.\n\nRemember that this is a traditional Catholic country. On Sundays, the streets are almost dead except for the tourists and the tourist shops.\n\nLiechtensteiners are very proud of their national identity and would take offence at being wrongly labelled \"German\", \"Austrian\" or \"Swiss\". Those who may feel inclined to denounce the monarchy as a system of government should be advised: the prince is well loved and very popular, and he is certainly held in high esteem when discussing national politics.\n\n==Get out==\n[[Feldkirch]], Gamsgrat, Augstenberg, Steg Parkplatz bim Gänglisee, Austria and Lake Constance make for wonderful destinations.\n\n\n\n\n{{isPartOf|Central_Europe}}\n\n{{Countryguide}}\n\n[[ca:Liechtenstein]]\n[[de:Liechtenstein]]\n[[eo:Liĥtenŝtejno]]\n[[es:Liechtenstein]]\n[[fi:Liechtenstein]]\n[[fr:Liechtenstein]]\n[[hu:Liechtenstein]]\n[[it:Liechtenstein]]\n[[ja:リヒテンシュタイン]]\n[[nl:Liechtenstein]]\n[[pl:Liechtenstein]]\n[[pt:Liechtenstein]]\n[[ro:Liechtenstein]]\n[[ru:Лихтенштейн]]\n[[sv:Liechtenstein]]\n[[wts:Category:Liechtenstein]]\n\n\n[[WikiPedia:Liechtenstein]]\n[[Dmoz:Europe/Liechtenstein/]]\n[[World66:europe/liechtenstein]]\n\n{{outline}}"
        }
    }
}