{
    "parse": {
        "title": "Luxembourg",
        "pageid": 580,
        "wikitext": {
            "*": "{{pagebanner|Luxembourg banner.jpg}}\n\n{{otheruses}}\n{{quickbar\n|image=Luxembourg_City_Center.JPG\n|caption=Ville Haute, Luxembourg\n|location=Luxembourg in its region.svg\n|flag=Flag of Luxembourg.svg\n|capital=[[Luxembourg (city)|Luxembourg]]\n|government=constitutional monarchy\n|currency=euro (EUR)\n|area=2,586km²\n|population=474,413 (July 2006 estimate)\n|language=Luxembourgish (national language), [[German]] and [[French]] (administrative languages)\n|religion=87% Roman Catholic, remainder Protestants, Jews, and Muslims\n|electricity=230V, 50Hz (European plug)\n|tld=.lu\n|callingcode=+352\n|timezone=UTC+1\n}}\nThe [http://www.mdt.public.lu/en/ '''Grand Duchy of Luxembourg'''] (Luxembourgish: ''Groussherzogtum Lëtzebuerg'', French:''Grand-Duché de Luxembourg'', German: ''Großherzogtum Luxemburg''), is a landlocked country in the [[Benelux]] bordered by [[Belgium]], [[France]] and [[Germany]] which lies at the crossroads of Germanic and Latin cultures. It is the only Grand Duchy in the world and is the second-smallest of the [[European Union]] member states.\n\nWith a successful steel, finance and high technology industry, a strategic location at the heart of Western Europe, more natural beauty than you might expect given its size, and as one of the three richest countries in the world, Luxembourg enjoys a very high standard of living - and has prices to match!\n\n==Understand==\n\n===History===\nThe city of Luxembourg proper was founded in 963, and its strategic position soon promised it a great fate. Luxembourg was at the crossroads of Western Europe and became heavily fortified, and you can still see the extensive city walls and towers which are the most distinctive aspect of the cityscape. Due to its key position, Luxembourg was raised up to a Duchy that included a much larger territory that stretched into present-day Belgium, Netherlands, Germany and France. The powerful Habsburg family kept its hands on it until late Renaissance times.\n\nAfter the Napoleonic wars, the Duchy of Luxembourg was granted to the Netherlands. It had a special status as a member of the German confederacy, and the citadel was armed with a Prussian garrison: Luxembourg was still a strategic lock that everybody aimed at controlling. It was granted the title \"Grand Duchy\" in 1815, but lost some territories that are today parts of France and Germany.\n\nDuring the course of the 19th century, developments in warfare and the appearance of artillery made Luxembourg obsolete as a stronghold, and it became little more than a rural territory of no strategic interest. The Germans relinquished their rights over it and moved their garrison out, its western half was granted to Belgium in 1839, and the Netherlands granted it complete independence in 1867. Since then, Luxembourg has arisen from a poor country of fields and farms to a modern economy relying on financial services and high-tech industries.\n\nOverrun by Germany in both world wars, Luxembourg was one of the major battlefields of the '''Battle of the Bulge''' in the winter of 1944-1945, a story well documented in the museum at [[Diekirch]].  The state ended its neutrality in 1948 when it entered into the [[Benelux]] Customs Union, and it joined NATO the following year. In 1957, Luxembourg became one of the six founding countries of the European Economic Community (later the European Union), and it joined the euro currency area in 1999.\n\n===Climate===\nModified continental with mild winters, although January and February can get very cold and temperatures can fall to as low as -15°C. The summer can be very hot in Luxembourg, with temperatures in July and August reaching around 30+°C.\n\n===Terrain===\nMostly gently rolling uplands with broad, shallow valleys; uplands to slightly mountainous in the north; steep slope down to Moselle flood plain in the south.\n\n===Holidays===\n*'''National holiday''' : National Day falls on the 23rd June. (Birthday of Grand Duchess Charlotte moved by 6 months to coincide with the warmer weather)\n\n==Cities==\n[[Image:Luxembourg.png|thumb|upright=1.7|Map of Luxembourg]]\n\n*[[Luxembourg (city)|Luxembourg]] - Capital\n*[[Esch-sur-Alzette]]\n*[[Ettelbruck]]\n*[[Clervaux]]\n*[[Esch-sur-Sure]]\n*[[Diekirch]] &mdash; home to a World War II museum commemorating the Battle of the Bulge\n*[[Mertert]]\n*[[Echternach]]\n*[[Grevenmacher]]\n\n==Other destinations==\n*[[Vianden]] - Quaint small town presided over by a rather splendid château\n*[[Remich]] - For promenades along the Moselle\n*[[Mondorf-les-Bains]] - Spa town with gambling \"Casino\" located on Luxembourg-France border\n\n==Get in== \n{{infobox|Minimum validity of travel documents|* EU, EEA and Swiss citizens need only produce a passport which is valid for the entirety of their stay in Luxembourg.\n* Non-EU citizens who are visa-exempt (e.g. New Zealanders and Australians) must present a passport which is valid for at least 3 months on the day they enter Luxembourg.\n* Non-EU nationals who are required to have a visa (e.g. South Africans) must have a passport which has '''at least 3 months' validity''' beyond their period of stay in Luxembourg in order for a Schengen visa to be granted.\n* For more information, visit [http://www.guichet.public.lu/fr/citoyens/citoyennete/immigration-visa/sejour-moins-3-mois/sejour/index.html this Luxembourg Government webpage (in French)].}}\n{{Schengen}}\n\nCitizens of the above countries/territories - '''except''' for [[Antigua and Barbuda]], the [[Bahamas]], [[Barbados]], [[Mauritius]], [[Saint Kitts and Nevis]] and [[Seychelles]] - '''are''' permitted to work in Luxembourg without having to obtain any authorization during the period of the 90 day visa-free stay. However, this visa exemption does not necessarily extend to other Schengen countries.\n\nFor a non-EEA or non-Swiss national to stay in Luxembourg for more than 90 days, a temporary stay authorization (''autorisation de séjour temporaire'') must be obtained '''before''' arriving in Luxembourg. This is done by sending an application to the Immigration Directorate in Luxembourg or, in some cases, to the Luxembourg Embassy responsible for your place of residence; the application is free of charge. If the stay authorization is granted, no visa is required for citizens of visa-exempt countries, but they must enter Luxembourg and register with the local authorities within 90 days of the date on the letter; citizens of non-visa-exempt countries must obtain a visa within the 90 days. Once in Luxembourg, a residence permit (''titre de séjour'') must then be applied for within three months of arrival. [http://www.guichet.public.lu/citoyens/fr/immigration/en/plus-3-mois/index.html]\n\nAll foreigners must register with the local authorities within three business days of arrival in Luxembourg; EU nationals normally have eight days to do so. If staying in a hotel, this is normally done by the hotel.\n\n===By plane===\n[http://www.luxairport.lu/en/ '''Luxembourg-Findel International Airport'''] ({{IATA|LUX}}) is 6km outside Luxembourg-City. Easily accessible from the city centre via the cheap (€2 single or €4 for a day ticket valid on almost all buses and trains in the country - buy either from the driver or from the multilingual automat by the bus stop) and frequent bus services numbers 29 and 16. It is served by Luxair [http://www.luxair.lu], the national airline, which flies to many EU countries (including [[Milan]] and [[London]] Heathrow and City), Ryanair ([[Barcelona]], [[Lisbon]]), EasyJet ([[London]] Gatwick, [[Porto]]), Air France ([[Paris]]; actually a Luxair codeshare), KLM ([[Amsterdam]]), Swiss ([[Zurich]]), Lufthansa ([[Frankfurt]]; actually a Luxair codeshare), SAS ([[Copenhagen]]), British Airways ([[London]] Heathrow) and Turkish Airlines ([[Istanbul]]). Another airline to consider is CityJet (owned by Air France), often a cheaper option than Luxair. A completely new terminal opened in May 2008, the airport site [http://www.lux-airport.lu/] has information about all flights.\n\nAlternative airports, especially for low-cost carriers, include Ryanair hub [[Hahn]] (aka \"Frankfurt-Hahn\"), about two hours away by direct [http://www.flibco.com Flibco bus], Saarbrucken Airport (accessible by bus from Luxembourg train station) and [[Brussels]]-South Charleroi, served by Flibco bus.\n\n===By train===\nLuxembourg train station can be reached directly from [[Paris]] (2 hours), [[Metz]] (1 hour), [[Brussels]] (3 hours) and [[Trier]] (43min). Both international and national timetables can be found on the website of the national railways company CFL [http://www.cfl.lu/CFLInternet/Espaces/01EspaceVoyageurs].\n\n===By car===\nMotorways from [[Metz]] (A3), [[Brussels]] (A6) and [[Trier]] (A1) connect to the ring-road around Luxembourg City, from which most other parts of the country can be reached. \n\nIf you want to enjoy a nice view to the city, \"Grund\" and Kasematten, leave the motorway coming from the East ([[Germany]]) at exit \"Cents\". Enter Cents and drive down the hill. Don't let yourself be stopped by signs that the route is blocked via \"Grund\".\n\n===By bus===\nAside from the airport buses listed above, sometimes there are commuter buses to [[Trier]] and [[Bitburg]]. The train is a far more preferable option for entering the country from nearby. From [[Saarbrücken]] there are direct bus connections [http://www.cfl.lu/cflinternet/espaces/02espaceevasion/0_general/news/luxemburgsaarbrckenexpress2012.htm]. This bus is rather expensive (€16) but it cheaper if bought in combination with a German or French rail ticket.\n\n===By boat===\nLuxembourg being a landlocked country, it's extremely hard to get in by boat. But if you really want to, there are boat links from the German side of the Moselle river to the Luxembourg side, but it is easier walking over the bridges.\n\n==Get around==\n[[Image:Train CFL.JPG|thumb|CFL regional train]]\n\nLuxembourg is a compact country and it's possible to reach almost any place in the country from the capital in under an hour.  The central railway station has a handy '''Mobilitéit''' [http://www.mobiliteit.lu/] office that will help to plan your trip with bus and train.\n\n===By train===\nThe '''Chemins de Fer Luxembourgeois''' ('''CFL''') [http://www.cfl.lu/] train network is either comprehensive or spartan, depending whether you want to go south or north. While the south is reasonably well covered, the north is limited to one main line (Ligne 10) which runs from Luxembourg City via Mersch, Ettelbrück, Wilwerwiltz, Clervaux and Troisvierges. The line continues north into [[Belgium]] towards Liège. [[Diekirch]] has a branch line from Ettelbrück, and Wiltz has a branch line from Kautenbach. To the south you can reach Bettembourg and Esch-sur-Alzette. There is also a line to the east which crosses into [[Germany]] over the Moselle River at Wasserbillig.\n\nThe same tickets are valid on trains as buses, and the same rates apply: €2 for two hours (unlimited transfers) or €4 for one day. A  €50 (July 2013)  one-month ticket can be purchased at the CFL office in Hamilius next to the Post Office, at some newsagencies or at the station. Trains in Luxembourg generally run very much on time and are modern and comfortable. As the fares are so cheap this is a good mode of transport to use when possible. Buying any train tickets on board a train is subject to a mandatory €1 surcharge.\n\nFrom an aesthetic view, perhaps the best way to approach Luxembourg City is by train from the north via Ligne 10 as this is a beautifully scenic route past some of the most well-known Luxembourgish sights.\n\n===By bus===\nWithin the city, the comprehensive bus service is more than adequate for the average tourist. Buses numbered 1-31 serve the Ville de Luxembourg, with the most useful being the 16 (Town to the Airport via Kirchberg) and the 1 (Town to Kirchberg and Auchan). Almost all buses pass the central point \"Hamilius\" (convenient for the centre of town) and the Gare Centrale (Station) on their routes at some point. Any bus pointing stationwards from Hamilius will probably take you there (the 3 being a notable exception). Bus tickets (which are also valid on trains) are available from the driver. A standard ticket costs €2.00 and will be valid on any bus up to 2 hours after its purchase. A ticket valid all day on all forms of transport in the Grand Duchy costs €4.00.\n\nThe bus service out of town is also extensive and reliable. Every village has a convenient bus service which runs at least once every hour. Buses numbered 100 upwards will take you out of the city. Useful routes to the north of the country include the 100 (Diekirch via Junglinster, every hour), the 120 (Junglinster, every 30 minutes) and the 290 (Mersch, frequent). However, Mersch and the south are more easily reached by train (see below). The 118 goes East to Wasserbillig and Trier from Hamilius and Bvd JFK in Kirchberg.\n\nA monthly network (réseau) pass for the whole Luxembourg network costs a very reasonable €50 but crossing the border to Belgium, France or Germany will add substantially to this. A monthly pass for the city costs just €25.\n\nTown buses experienced a reduced service on Saturdays (including those used mainly by shoppers), and many routes are barely existent (if at all) on a Sunday. This doesn't matter, though, since most shops and attractions are closed on a Sunday.\n\nAlmost all national buses run the same on Saturdays (which count as working days in this instance) as during the week, but the Sunday service is usually reduced or non-existent.\n\n===By car===\nLuxembourg's road infrastructure is well-developed if not always very well thought-out. Anywhere that happens to lie along the major motorways is easily accessible via these (including Grevenmacher in the east, Mamer to the west and Bettembourg to the south). Esch-Alzette, the country's second city (more like a small town by international standards) has its own motorway link, the A4. In addition, a new motorway, the A7, was recently completed which goes to Ettelbrück in the center of Luxembourg. \n\nCurrent national speed limits are 50km/h in towns and villages, 90km/h on open country roads (110 in some places on N7 and N11), and 130km/h on the motorway (110 in the rain). 70km/h also exists in some places. Speed limits are enforced by random police checks and cameras on certain segments of motorway and near the ends to motorways. Be aware that if you have a right-hand-drive car then you are very likely to be singled out for a customs check on the way in. Police are also very keen on stopping drivers for having the 'wrong' lights on in town, i.e. side lights instead of dipped headlights.\n\nDriving in Luxembourg is nowhere as testing as in other European countries. The locals are polite, even when entering roundabouts. When entering the highways from side roads into the slower traffic lane, the other drivers will allow you to join the traffic line, but traffic indicators are essential. As with other highways in Europe always keep in the slow traffic lane, keeping the fast lane for overtaking. Some drivers travel at high speeds and will flash their headlights to indicate that they are in a hurry, even if you are sitting on the speed limit. Most of the time trucks keep in the slow lane at their regulated speed for large vehicles. They can be a little annoying when overtaking other trucks. The truck drivers seem to keep a watch out for other vehicles. Cars towing caravans can be a bit of a menace at times but staying alert will ensure there are no problems. The closing speeds of vehicles needs to be watched if overtaking, as some drivers travel well in excess of the speed limits. \n\nNormal day to day driving in Luxembourg is a delight but traffic does slow down in peak times.  \n\nFinding parking in Luxembourg city centre on weekends can be difficult. Most spaces are quickly taken and some parking garages close early. The best option is to find somewhere near the station and then walk around the city centre. Traffic wardens are also numerous and vigilant.\n\n===By bike===\nThe streets and landscape in Luxembourg make for good biking territory; Look for national biking paths (\"PC\" mark standing for \"Piste Cyclable\"). For bicycle repairs, neighboring Trier (with a considerable University student population) is usually a safer bet.\n\n==Talk==\n\nLuxembourg is a multilingual nation. However, unlike most nations, language use is usually regulated by social situation rather than by local geography.\n\n'''Luxembourgish''' (\"Lëtzebuergesch\") - a Germanic language that incorporates many French loan-words - is the national language. It is spoken natively by just over half of the native population, and is the main language of television and radio broadcasts.\n\n'''[[German phrasebook|German]]''' (\"Hochdeutsch\") enjoys official status in Luxembourg. It is taught in schools, is the language of the press, court system and church, and is almost universally understood by the local population.\n\nThat being said, everything from road signs to menus to information in stores, will appear in '''[[French phrasebook|French]]''' - which is the main language of the government. French therefore is clearly one of the most useful of the three official languages to know, particularly in the capital. This is also because many of the workers in the shops, bars and restaurants in Luxembourg come from across the border in France and Belgium, driven by high rates of unemployment and the relatively high cost of living in Luxembourg itself. This essentially makes the capital, and the area to the south of the capital a predominately Francophone area for the visitor - this is less so northwards of the city, and in the areas close to the German border such as Diekirch or Echternach.\n\nIn total, foreign-born persons (including ''frontaliers'' and ''grenzgängers'' - guest-workers from Belgium/France and Germany) make up over 40% of the population of Luxembourg. The most common languages spoken by them, other than French and German, are [[Portuguese phrasebook|Portuguese]], [[Italian phrasebook|Italian]] and English.\n\nOver 60% of the native population of Luxembourg are fluent in English, however one should assume that the ''frontaliers'' do not speak any languages other than French and possibly German. Personnel such as bus drivers usually speak fluent English.\n\nApart from the more elderly inhabitants, virtually every Luxembourger understands and speaks fluent standard German and French. Unlike in Switzerland, where often \"monolingual meets monolingual\", Luxembourgers are true polyglots.\n\n==See==\nYou may not expect it from one of the smallest countries in [[Europe]], but The Grand Duchy of Luxembourg is a diverse land, full of beautiful nature and gorgeous historic monuments. Its turbulent history is filled with stories of emperors and counts as well as many battles and disputes. Today, the almost fairy-tale like castles and fortresses are a faint but impressive reminder of those days, and amidst their lovely natural setting, they make some superb and picturesque sights.\n\nMost of the country's population lives in rural areas and apart from the delightful historic [[Luxembourg (city)|City of Luxembourg]], the country's capital, settlements are mostly small. That said, the capital is a place not to be missed. It has a splendid location high on a cliff, overlooking the deep and narrow valleys of both the Alzette and Pétrusse rivers. Several parts of the old town are listed as UNESCO World Heritage Sites, and the most interesting places include the '''Gothic Revival Cathedral of Notre Dame''', the town '''fortifications''' and of course the '''Grand Ducal Palace''', which is surrounded by charming cobblestoned lanes. However, there's far more to see, such as the '''Bock casemates, Neumünster Abbey''' and the '''Place d'Armes'''. There are several World War II memorial sites and a number of high-end museums, but just wandering through the old centre, taking in the beautiful views from the '''Chemin de la Corniche''' and crossing bridges to the nearest plateaus is at least as great a way to discover the city.\n\nThe lively town of '''[[Echternach]]''' is the oldest city in Luxembourg. It boasts the country's most prominent religious structure, the '''basilica''' of the Abbey of Echternach where the country's patron saint Willibrord is buried. The annual Whit Tuesday celebrations in his honour involve lots of dancers in the towns old centre and are a popular tourist attraction. The  Apart from its own sights, Echternach makes a great base to explore the beautiful '''[[Müllerthal]]''', better known as \"Little Switzerland\". Hike or bike through its dense forests with myriad streams and even some caves.\n\nThe romantic village of '''[[Vianden]]''' with its stunning medieval Beaufort castle is a tourists' favourite, and well worth a visit even despite the crowds in summer. The beautiful location of the fortress in the Our river valley, surrounded by tight forests and a lake with swans, gives it a typical fairy-tale castle look and feel. If you're done wandering the streets and exploring the Gothic churches an fortified towers of this charming town, visit the Victor Hugo house. Afterwards, the pleasant cafés of the '''Grand Rue''' are a perfect place to kick back and enjoy. \n\nHead to '''[[Remich]]''' to start your own trip down the '''Route du Vin''' and discover the many fine wines that are produced here, in the '''Moselle Valley'''.\n\n==Do==\n\n==Buy==\n{{Euro}}\n\nIf you know any coin collectors, take a few local coins as keepsakes, since Luxembourgish coins are among the rarest of the euros &mdash; even in Luxembourg, most of your change will be in other countries' coins!\n\nDespite one of the lowest VAT rates in Europe (17%, with 3% for most restaurants and hotels), the general price level in Luxembourg is noticeably higher than in France and Germany, especially in central Luxembourg and particularly in any service-related fields.  Even cheap hotels tend to cost over &euro;100 a night and you won't get much change from &euro;20 after a modest dinner and a drink.  Basing yourself in [[Trier]] (or other cities across the border) and daytripping to Luxembourg might be a good bet.\n\nOn the upside, cigarettes, alcohol or petrol are comparatively cheap, making the small state a popular destination for long-haul drivers.\n\n==Eat==\n[[Image:JuddMatGaardebounen Beer.JPG|thumb|''Judd mat gaardebounen'', served with potatoes and washed down with a Diekirch beer]]\n\nTraditional dishes are largely based on pork and potatoes and the influence of German and central European cooking is undeniable.  The unofficial national dish is ''judd mat gaardebounen'', or smoked pork neck served with boiled broad beans. A must to try if you do get the opportunity are ''Gromperekichelchen'' (literally, Potato Biscuits) which are a type of fried shredded potato cake containing onions, shallots and parsley. Typically found served at outdoor events such as markets or funfairs they are absolutely delicious and a particularly nice snack on a cold winter's day.\n\nIn most restaurants however, the typical local food would be French cuisine coming in bigger portions. Italian food has been popular since the 1960s. Home cooking has been very influenced by the recipes of Ketty Thull, apparently the best-selling cooking and baking book in Luxembourg since WW II.\n\n==Drink==\nThe Luxembourg white wines from the Moselle valley to the east of Luxembourg include Riesling, Pinot Gris, Pinot Blanc, Rivaner and Elbling to name just a few and are good. In autumn, many villages along the Moselle river organise wine-tasting village festivals.\n\nYoung people tend to drink local or imported beer. Luxembourg has a number of breweries, with '''Diekirch''', from [[Diekirch|the village of the same name]], Bofferding, Battin, and Mousel being the most popular. All are excellent lagers.\n\nAs an after dinner digestive, Luxembourgers like to drink an ''eau-de-vie'' . The most commonly available are ''Mirabelle'' and ''Quetsch''. Both are made from plums and are extremely strong! Sometimes these are taken in coffee which may be a little more palatable for some.\n\n==Sleep==\nThanks to the heavy banking and EU presence, along with a wide range of congresses held in the city, hotels in central Luxembourg are generally expensive. For people on a budget, however, Luxembourg has an extensive network of camp sites especially Youth Hostels - there are currently nine of them around the country, including in [[Luxembourg (city)#Sleep|Luxembourg (city)]].\n\n==Work==\nLuxembourg is a major player in the financial service sector. Many thousands of people commute from neighbouring Belgium, France (''Les frontaliers'') and Germany (''Die Grenzgänger'') on weekdays, considerably swelling the population of the capital city. The majority work in the numerous financial institutions based in and around the capital (particularly in the Kirchberg district) and are drawn across the borders by the excellent salaries on offer. Luxembourg City has a very international flavour as in addition to ''les frontaliers'', it attracts young professionals from all over the globe. In this area, business is done predominantly in English, French or German and it is necessary to be fluent in one of these as a minimum although many jobs will demand proficiency in at least two.\n\n==Stay safe==\nIn many surveys, Luxembourg has been named \"safest country in the world\"; if you follow usual precautions, you should be fine. The area around the city centre station, particularly on the rue de Strasbourg, is a little dubious; you may encounter people panhandling. There are also some dubious nightclubs in this area that visitors should stay clear of.\n\n==Stay healthy==\nThe food and tap water supply in Luxembourg is perfectly fine and the country's healthcare system is first class. The climate is average even though the summers can get hot. However these temperatures rarely rise much above 30°C.\n\n==Respect==\nIt is important to show respect for the local language and make some effort to say a word or two of it even if just the standard greeting ''\"Moien\".'' Avoid calling Luxembourgish a dialect of German or assert that the country itself is merely an extension of France or Germany. Keep in mind that Luxembourgers are very proud of their heritage and that Luxembourgish is no longer the most common native language in the country, as your first impression when arriving in the capital may suggest. Nevertheless locals, especially those in the small towns and villages, are very friendly; saying \"Hello\" in whatever language will make you be greeted with a smile.\n\n==Contact==\n\n{{isPartOf|Benelux}}\n{{outline}}\n{{countryguide}}\n\n\n\n\n[[ar:لوكسمبورج]]\n[[ca:Luxemburg]]\n[[de:Luxemburg]]\n[[eo:Luksemburgo]]\n[[es:Luxemburgo]]\n[[fi:Luxemburg]]\n[[fr:Luxembourg]]\n[[hu:Luxemburg]]\n[[it:Lussemburgo]]\n[[ja:ルクセンブルク]]\n[[nl:Groothertogdom Luxemburg]]\n[[pt:Luxemburgo]]\n[[ro:Luxemburg]]\n[[ru:Люксембург]]\n[[sv:Luxemburg]]\n[[wts:Category:Luxembourg]]\n\n\n[[WikiPedia:Luxembourg]]\n[[Dmoz:Europe/Luxembourg/]]\n[[World66:europe/luxembourg]]"
        }
    }
}