{
    "parse": {
        "title": "Malaysia",
        "pageid": 642,
        "wikitext": {
            "*": "{{pagebanner|Malaysia Banner.jpg}}\n\n{{quickbar\n| image=PerdanaPutra Overview.JPG\n| caption=Prime Minister's Office, Putrajaya\n| location=Malaysia in its region.svg\n| flag=Flag of Malaysia.svg\n| capital=[[Kuala Lumpur]]\n| government=Constitutional monarchy\n| area=total: 329,750&nbsp;km²<br />''land: 328,550&nbsp;km²<br />water: 1,200&nbsp;km²''\n| population=28 million (Jan 2010)\n| language=[[Malay phrasebook|Malay]] (official), English (official for some purposes), Chinese languages ([[Chinese phrasebook|Mandarin]], [[Cantonese phrasebook|Cantonese]], [[Minnan phrasebook|Hokkien]], Teochew, Hakka, Hainanese, Foochow), [[Tamil phrasebook|Tamil]], [[Telugu phrasebook|Telugu]], [[Malayalam phrasebook|Malayalam]], Punjabi, and [[Thai phrasebook|Thai]]; in addition, several indigenous languages are spoken in East Malaysia, especially Iban and Kadazan\n| **=** (official), **, Taoism, Hinduism, **ianity, Sikhism; note - in addition, Shamanism/Animism is practiced in East and, to a lesser extent, West Malaysia\n| electricity=230V/50Hz\n| callingcode=+60\n| tld=.my\n| timezone=UTC+8\n| emergencies= dial '''999'''\n}}\n\n[http://www.tourismmalaysia.gov.my '''Malaysia'''] is a country in [[Southeast Asia]], located partly on a peninsula of the Asian mainland and partly on the northern third of the island of [[Borneo]]. \n\nWest (peninsular) Malaysia shares a border with [[Thailand]], is connected by a causeway and a bridge (the 'second link') to the island state of [[Singapore]], and has coastlines on the South China Sea and the Straits of Malacca.<br />\nEast Malaysia (Borneo) shares borders with [[Brunei]] and [[Indonesia]].\n\n==Understand==\n\nMalaysia is a mix of the modern world and a developing nation. With its investment in the high technology industries and moderate oil wealth, it has become one of the richest nations in Southeast Asia. Malaysia, for most visitors, presents a happy mix: there is high-tech infrastructure and things generally work well and more or less on schedule, but prices remain more reasonable than, say, [[Singapore]].\n\n{{infobox|Warning|The Malaysian federal government has implemented a tax on foreign tourists, starting September 1st 2017. Each foreign tourist is liable to a 10 Ringgit tax per day of stay at any hostel or hotel. This is a flat tax, regardless of the class of accommodation, which means if you are staying in a hostel for 30 Ringgit per day this tax amounts to a 33% increase on your accommodation costs. One normally gets something for paying money - not in this case. Details of this act here: https://www.myttx.customs.gov.my/CTTax/infopage/APPENDIX%20A%20-%20General%20Guide.pdf}}\n\n===History===\nBefore the rise of the European colonial powers, the Malay peninsula and the Malay archipelago were home to empires such as the Srivijaya, the Majapahit (both ruled from Indonesia, but also controlling parts of Malaysia) and the Melaka Sultanate. The Srivijaya and Majapahit empires saw the spread of Hinduism to the region, and to this day, many Hindu legends and traditions survive in traditional Malay culture. \n\nThis was to change in the 16th century when the Portuguese established the first European colony in Southeast Asia by defeating the Melaka Sultanate. The Portuguese subsequently then lost Malacca to the Dutch. The British also established their first colony on the Malay peninsula in Penang in 1786, when it was ceded by the Sultan of Kedah. Finally, the area was divided into Dutch and British spheres of influence with the signing of the Anglo-Dutch Treaty in 1824. With this treaty, the Dutch agreed to cede Malacca to the British and in return, the British ceded all their colonies on [[Sumatra]] to the Dutch. The line which divided the Malay world into Dutch and British areas roughly corresponds to what is now the border between Malaysia and [[Indonesia]].\n\nBefore World War II, the Malay Peninsula was governed by the British as the Federated Malay States (Selangor, Perak, Negeri Sembilan and Pahang), which were governed as a single entity, the Unfederated Malay States (Johor, Kedah, Perlis, Terengganu and Kelantan), which were each governed as separate protectorates, and the Straits Settlements (including Malacca, Penang and Singapore), which were crown colonies. Northern Borneo consisted of the British colony of North Borneo, the Kingdom of Sarawak, which was ruled by a British family known as the \"White Rajas\", and the British protectorate of Brunei.\n\nWorld War II was disastrous for the British Malayan Command. The Japanese swept down both coasts of the Malay Peninsula and despite fierce fighting, much of the British military was tied down fighting the Germans in Europe. Those that remained in Malaya simply could not cope with the Japanese onslaught. The British military equipment left to defend Malaya were outdated and no match for the modern ones used by the Japanese, while the only two battleships based in the region, the HMS Prince of Wales and HMS Repulse, were sunk by Japanese bombers off the East Coast of Malaya. By 31 January 1942, the British had been pushed all the way back to Singapore, which then fell to the Japanese on 15 February 1942. The situation was no different on Borneo, which fell to the Japanese on 1 April 1942 after months of fierce fighting. The Japanese occupation was brutal, and many, particularly the ethnic Chinese, suffered and perished during the occupation. Among the most notorious atrocities committed by the Japanese was the Sandakan Death Marches, with only six out of several thousand prisoners surviving the war.\n\nAfter World War II, the Federated Malay States, the unfederated Malay States and the Straits Settlements of Malacca and Penang were federated to form a single British colony known as the Malayan Union, with Singapore splitting off to form a separate colony. In the Malayan Union, the sultans of the various states ceded all their powers except those in religious affairs to the British crown. However, widespread opposition to the Malayan Union led the British to reconsider their position, and in 1948, the Malayan Union was replaced by the Federation of Malaya, in which the executive positions of the sultans were restored. In Borneo, the White Rajas ceded Sarawak to the British crown in 1946, making it a crown colony of the United Kingdom.\n\nMalaya gained independence from the British in 1957. The Union Jack was lowered and the first Malayan flag was raised in the Merdeka (independence) Square on midnight 31st August 1957.\n\nSix years later, Malaysia was formed on 16 September 1963 through a merging of Malaya and Singapore, as well as the East Malaysian states of Sabah (known then as North Borneo) and Sarawak on the northern coast of Borneo, with Brunei deciding not to join. The first several years of the country's history were marred by the Indonesian confrontation (''konfrontasi'') as well as claims to Sabah from the Philippines. Singapore was expelled from the federation on 9 August 1965 after several bloody racial riots, as its majority Chinese population and the influence of the People's Action Party led by Lee Kuan Yew (later the long-ruling Prime Minister of Singapore) were seen as a threat to Malay dominance, and it became a separate country.\n\n=== Politics ===\n\nMalaysia is a constitutional monarchy, nominally headed by the Paramount Ruler (''Yang di-Pertuan Agong''), who is \"elected\" by the rulers (7 sultans, the Yang Di-Pertuan Besar of Negeri Sembilan and the Raja of Perlis) for a five-year term from among the rulers of the 9 royal states of Malaysia, though in practice the election usually follows a prescribed order based on the seniority of the rulers at the time of independence. This gives Malaysia a unique political system of rotational monarchy, in which each of the state rulers would take turns to be the king of Malaysia. The current king, from Kedah, was sworn in on 13 Dec 2011.\n\nMalaysia's government is largely based on the British Westminster system, consisting of a bicameral national parliament, with each of the states also having their own unicameral ''Dewan Undangan Negeri'' (State Legislative Assembly). The lower house, known as the ''Dewan Rakyat'' (Hall of the People) is elected directly by the people. The upper house, known as the ''Dewan Negara'' (National Hall), consists of 26 members elected by the state governments, with each state having 2 representatives, while the remaining members are appointed by the king. The head of government is the Prime Minister, who is the party leader of the winning party in the lower house. The United Malays National Organisation (UMNO) party and its National Front (''Barisan Nasional'') coalition ruled Malaysia until 2018.\n\nIn practice, the king is only the nominal Head of State, while the Prime Minister is the one who wields the most authority in government.\n\n=== Geography ===\n\n'''Peninsular Malaysia''' (Bahasa Malaysia: ''Semenanjung Malaysia'') occupies all of the Malay Peninsula between [[Thailand]] and [[Singapore]], and is also known as '''West Malaysia''' (''Malaysia Barat'') or the slightly archaic '''Malaya''' (''Tanah Melayu''). It is home to the bulk of Malaysia's population, its capital and largest city [[Kuala Lumpur]], and is generally more economically developed. Within Peninsular Malaysia, the West Coast is more developed and urbanised and separated from the more rural East Coast by a mountain range - the Titiwangsa.\n\nSome 800 km to the east is '''East Malaysia''' (''Malaysia Timur''), which occupies the northern third of the island of [[Borneo]], shared with [[Indonesia]] and [[Brunei]]. Partly covered in impenetrable jungle where headhunters roam (on GSM networks if nothing else), East Malaysia is rich in natural resources but very much Malaysia's hinterland for industry, and focused more on mass than individual tourism. Both East and West Malaysia have been subjected to vast logging activities in the last decades, however, and much of its rainforests have been transformed into palm oil plantations, especially in the flatter areas. Areas with pristine rainforest do remain, though, especially inland where the terrain is more mountainous.\n\nThe '''terrain''' consists of coastal plains rising to hills and mountains. Peninsular Malaysia consists of plains on both the East and West coasts, separated from each other by a mountain range known as the ''Barisan Titiwangsa'' which runs from North to South.\n\n=== People ===\nMalaysia is a multicultural society. While Malays make up a 52% majority, there are also 27% Chinese, 9% Indian and a miscellaneous grouping of 13.5% \"others\", such as the Portuguese clan in Melaka and 12% of indigenous peoples (Orang Asli). There is hence also a profusion of faiths and religions, with Islam, Christianity, Buddhism, Taoism, Hinduism, Sikhism and even shamanism on the map.\n\n=== Holidays ===\n\n{{ramadandates}}{{CNYdates}}\nOne of the significant characteristics of Malaysian culture is its celebration of various festivals and events. The year is filled with colourful, exhilarating and exciting activities. Some are religious and solemn but others are vibrant, joyous events. One interesting feature of the main festivals in Malaysia is the 'open house' custom. This is when Malaysians celebrating the festival invite friends and family to come by their homes for some traditional delicacies and fellowship.\n\nMulticultural Malaysia celebrates a vast range of festivals, but the ones to look out for nationwide are Islamic holidays, most notably the fasting month of '''Ramadan'''. During its 29 or 30 days, Muslims refrain from eating, drinking and smoking from dawn to sunset. Not all Muslims follow the tradition, or sustain the full period or Ramadan fasting, but most do make a very serious effort. Pregnant, breast feeding or menstruating women are not expected to fast, nor are the elderly, the infirm, or travellers. Unless incapable those who do not fast during Ramadan are expected to catch up the missed days at a later time. People get up early before sunrise for a meal (''sahur''), and take off early to get back home in time to break fast (''buka puasa'') at sunset. At the end of the month is the festival of '''Eid ul-Fitr''', known locally as '''Hari Raya Puasa''' or '''Aidilfitri''', when many locals take one to two weeks off to 'balik kampung' or return to their home towns to meet family and friends. Accordingly, this is the one of the many times in a year when major cities like Kuala Lumpur has virtually no traffic congestions. Travelling around Malaysia is usually avoided by the locals. Another important festival is the Muslim festival of '''Eid ul-Adha''', known locally as '''Hari Raya Haji''' or '''Aidiladha'''. It is during this festival that Muslims perform the Hajj or pilgrimage to Mecca. In local mosques, cows and lambs are donated by the faithful and sacrificed, after which the meat is distributed to all. Family reunions are also celebrated during other main festivals in the country. Locals usually put on traditional costumes and finery as these festivals are an integral feature of Malaysia society. Information about Complete Sightseeing Plan of Malaysia and Singapore [http://www.nitworldwideholidays.com/malaysia-tour-packages/kuala-lumpur-and-singapore-package-tour.html].\n\nDuring the month of Ramadan, non-muslims are expected to be courteous of those fasting. Non-Muslims, as well as Muslims travelling (''musafir''), are exempt from fasting but it is polite to refrain from eating or drinking in public. Public school systems also adhere to this occasion thus assisting non-muslims to refrain from eating in front of those who are practicing. Many restaurants close during the day and those that stay open maintain a low profile. Business travellers will notice that things move rather more slowly than usual. The upside for foreign travellers are the Ramadhan bazaars in every city and town, bustling with activity and bursting at the seams with great food. Hotels and restaurants also pull out all stops to put on massive spreads of food for fast-breaking feasts. During the month of Ramadan, fast-breaking meals are usually considered as grand feasts.\n\nOther major holidays include '''Chinese New Year''' (around January/February), '''Deepavali''' or '''Diwali''', the Hindu festival of lights (around October/November), the Buddhist holiday of '''Wesak''' (around May/June), and '''Christmas''' (25 December).\n\nDuring Chinese New Year, Penang and Ipoh become the major cities as many local Chinese working and living in KL originated from there. However this situation is changing gradually, as more and more people are making Kuala Lumpur their home town. While visiting during such festivals, travellers will be able to experience many wonderful celebrations, but the downside is many ethnic shops/eateries will be closed. The best option is to visit during the period just after the first two days of the major festival (Hari Raya/Chinese New Year), when shops will open, and the festive mood has still not died down. \n\nAnother major celebration is Deepavali, celebrated by the Malaysian Hindus. [[Deepavali]] is the festival of light orignitaing from classical India and one of the main cultural celebration amongst Hindus. In Malaysia, locals practice this tradition by wearing new clothes and receiving token gifts of money. This practice has been adapted by all Malaysians without regards of the religion. The red packets or [[ang pow]] during Chinese New Year, green packets or 'duit raya' for Hari Raya Aidilfitri and multi-coloured packets during Deepavali.\n\nSome uniquely Malaysian festivals of note include the '''Harvest Festival''' at the end of May each year and the ''''Pesta Gawai'''' in early June, both thanksgiving celebrations held in [[East Malaysia]].\n\n'''Thaipusam''' is a Hindu festival that falls in January or February and is one of the must-see events. The largest procession in the country takes place at Batu Caves, north of Kuala Lumpur. Male devotees carry decorated altars or ''kavadi'' up a flight of 272 steps towards the temple, all this while also having religious spears and hooks pierced through external surfaces of their bodies. The ability is attributed to divine intervention and religious fervor. Female devotees join the procession carrying pots of milk on their head instead.\n\n===Climate===\n\nThe '''climate''' in Malaysia is tropical. The north-east monsoon (October to February) deluges Borneo and the east coast in rain and often causes flooding, while the west coast (particularly Langkawi and Penang) escape unscathed. The milder south-west monsoon (April to October) reverses the pattern. The southern parts of peninsular Malaysia, including perennially soggy Kuala Lumpur, are exposed to both but even during the rainy season, the showers tend to be intense but brief.\n\nMalaysia is close to the equator, therefore warm weather is guaranteed. Temperatures generally range from 32°C/89.6 ºF at noon to about 26°C/78.8 ºF at midnight. But like most Southeast Asian countries, Malaysia's sun-shining days are interrupted by Monsoon season from November and February every year, and night temperatures can hit a low of about 23°C/73.4 ºF on rainy days. \n\nTemperatures tend to be cooler in the highlands, with the likes of [[Genting Highlands]],[[Cameron Highlands]] and [[Fraser's Hill]] having temperatures ranging from about 17°C/62.6 ºF at night to about 25°C/77 ºF in the day. Mount Kinabalu is known to have temperatures falling below 10°C/50 ºF.\n\n==Regions==\n\n===Peninsular Malaysia===\n{{Regionlist\n| regionmap=Malaysia regions map.png\n| regionmaptext=\n| regionmapsize=500px\n\n| region1name=[[West Coast (Malaysia)|West Coast]]\n| region1color=#69999f\n| region1items=\n| region1description=The more developed side of Peninsular Malaysia, with the states of [[Kedah]], [[Malacca (state)|Malacca]], [[Negeri Sembilan]], [[Penang]], [[Perak]], [[Perlis]] and [[Selangor]], as well as two Federal Territories; Malaysia's capital city [[Kuala Lumpur]] and the new administrative centre of [[Putrajaya]], all located within this region. Majority of the chinese population lives on the West side.\n\n| region2name=[[East Coast (Malaysia)|East Coast]]\n| region2color=#71b37b\n| region2items=\n| region2description=More traditional Muslim, the islands here are glittering tropical jewels. Made up of the states of [[Kelantan]], [[Pahang]] and [[Terengganu]].\n\n| region3name=[[Johor|South]]\n| region3color=#d09440\n| region3items=\n| region3description=Comprising just one state, [[Johor]], two coastlines, and endless palm oil plantations.\n}}\n\n===East Malaysia===\nSome 800 km to the east is '''East Malaysia''' (''Malaysia Timur''), which occupies the northern third of the island of [[Borneo]], shared with [[Indonesia]] and tiny [[Brunei]]. Partly covered in impenetrable jungle where headhunters roam (on GSM networks if nothing else), East Malaysia is rich in natural resources but very much Malaysia's hinterland for industry, and focused more on mass than individual tourism.\n\n{{Regionlist\n| regionmap=\n| regionmaptext=\n| regionmapsize=\n\n| region1name=[[Sabah]]\n| region1color=#867ea9\n| region1items=\n| region1description=Superb scuba diving in [[Sipadan]] island plus muck diving at [[Mabul]], nature reserves, the federal enclave of [[Labuan]], and mighty [[Mount Kinabalu]].\n\n| region2name=[[Sarawak]]\n| region2color=#4f93c0\n| region2items=\n| region2description=Jungles, national parks, and traditional longhouses.\n}}\n\n== Cities ==\n<!-- Only cities of primary importance to tourists here, maximum 9 -->\n* [[Kuala Lumpur]] — the multi-cultural capital, home of the Petronas Towers\n* [[George Town (Malaysia)|George Town]] — the cultural and cuisine capital of Penang\n* [[Ipoh]] — capital of Perak with historic colonial old town\n* [[Johor Bahru]] — capital of Johor, and the gateway to Singapore\n* [[Kuantan]] - capital of Pahang, and commercial centre of the east coast\n* [[Kota Kinabalu]] — close to tropical islands, lush rain forest and Mount Kinabalu\n* [[Kuching]] — capital of [[Sarawak]]\n* [[Malacca]] (''Melaka'') — the historical city of Malaysia with colonial-style architecture\n* [[Miri]] — resort city of Sarawak and gateway to UNESCO World Heritage Site Gunung Mulu National Park\n<!-- Only cities of primary importance to tourists here, maximum 9 -->\n\n==Other destinations==\n[[Image:Tea Plantation.jpg|thumb|A tea plantation in the Cameron Highlands]]\n* [[Cameron Highlands]] {{-}} famous for its tea plantations\n* [[Fraser's Hill]] {{-}} a time warp to the colonial era\n* [[Kinabalu National Park]] {{-}} home of Mount Kinabalu, the tallest mountain in South East Asia\n* [[Langkawi]] {{-}} an archipelago of 99 islands known for its beaches, rainforest, mountains, mangrove estuaries and unique nature. It's also a duty-free island\n* [[Penang]] (''Pulau Pinang'') {{-}} formerly known as the \"Pearl of the Orient\", now bustling island with excellent cuisine which has retained more colonial heritage than anywhere else in the country\n* [[Perhentian Islands]] (''Pulau Perhentian'') {{-}} glittering jewels off the East Coast still undiscovered by mass tourism\n* [[Redang]] (''Pulau Redang'') {{-}} popular island destination for scuba divers\n* [[Taman Negara National Park]] {{-}} a large area of rainforest spanning [[Kelantan]], [[Pahang]] and [[Terengganu]]\n* [[Tioman]] (''Pulau Tioman'') {{-}} once nominated one of the most beautiful islands in the world\n\n== Get in ==\n{{infobox|Caution|Malaysian Immigration authorities started '''fingerprinting''' visitors on arrival and departure in 2011 and these fingerprints may well find their way to your country's authorities or other non-state agencies. As of February 2015 fingerprints are still taken at the Padang Besar train station border crossing.}}\n\n[[Image:Twin_Tower_night_scene.JPG|thumb|Petronas Twin Towers, [[Kuala Lumpur]]]]\nMost nationalities can enter Malaysia without a visa, and they would be issued a 14, 30 or 90 day entry permit stamp on their passport. This would indicate the length of stay granted. Details can be found at http://www.kln.gov.my/web/guest/requirement-for-foreigner.\n\nAdmission refused to nationals of Israel. However, if holding a letter of approval from the Malaysian Ministry of Home Affairs, admission is allowed. \n\nThe following is a list of foreign nationals who can enter Malaysia without a visa:-\n\n'''(A) Countries/territories that do not require a visa for stay up to 90 days:-'''\nAlbania, Algeria, Argentina, Australia, Austria, Bahrain, Belarus, Belgium, Bosnia-Herzegovina, Brazil, Bulgaria, Canada, Croatia, Cuba, Czech Republic, Denmark, Egypt, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland, Italy, Japan, Jordan, Kuwait, Kyrgyzstan, Latvia, Lebanon, Liechtenstein, Lithuania, Luxembourg, Morocco, Netherlands, New Zealand, Norway, Oman, Peru, Poland, Portugal, Qatar, Romania, San Marino, Saudi Arabia, Slovakia, Slovenia, South Africa, South Korea, Spain, Sweden, Switzerland, Syria, Tunisia, Turkey, Turkmenistan, United Arab Emirates, United Kingdom, United States, Uruguay and Yemen.\n\n'''(B) Countries/territories that do not require a visa for stay up to 30 days:-'''\nArmenia, Azerbaijan, Bahamas, Barbados, Benin, Bolivia, Botswana, Brunei, Burkina Faso, Cambodia, Cape Verde, Chad, Chile, Comoros, Congo (Democratic Republic of), Costa Rica, Dominica, Ecuador, El Salvador, Fiji, Gabon, Gambia, Georgia, Grenada, Guatemala, Guinea, Haiti, Honduras, Hong Kong SAR, Indonesia, Iraq, Jamaica, Kazakhstan, Kenya, Kiribati, Laos, Lesotho, Macao SAR, Macedonia, Madagascar, Malawi, Maldives, Mauritania, Mauritius, Mexico, Moldova, Monaco, Mongolia, Namibia, Nauru, Nicaragua, North Korea, Palestine, Panama, Papua New Guinea, Paraguay, Philippines, Russia, Samoa, Sao Tome & Principe, Senegal, Seychelles, Singapore, Solomon Islands, Somalia, St Kitts and Nevis, Saint Lucia, St Vincent and the Grenadines, Sudan, Suriname, Swaziland, Taiwan, Tajikistan, Togo, Tanzania, Thailand, Togo, Tonga, Trinidad and Tobago, Tuvalu, Uganda, Ukraine, Vanuatu, Uzbekistan, Vatican City, Venezuela, Vietnam, Zambia and Zimbabwe.\n\n'''(C) Countries/territories that do not require a visa for stay up to 14 days or others (if indicated):-'''\nIran , Ivory Coast, Libya, Macao SAR (Travel Permit/Portugal CI), Sierra Leone, Somalia\n\nIn addition, no visa is required for U.S.A. citizens visiting Malaysia for social, business or academic purposes (except for employment). \n\nNo visa is required for a stay of less than one month for nationals of all ASEAN countries except Myanmar. For a stay exceeding one month a visa will be required, except for nationals of Brunei and Singapore. \n\nVisas are required and permission must be granted from Ministry Of Home Affairs for citizens of Israel. For nationals of Republic of Serbia and Republic of Montenegro, visas are required without permission granted from Ministry Of Home Affairs. Nationals of countries other than those stated above (with the exception of Israel) are allowed to enter Malaysia without a visa for a visit not exceeding one month. \n\nFor people with Dual Citizenship (two passports), Malaysian immigration is pretty strict about this. It is advised that you exit your last port and enter into Malaysia with the same passport.\n\nUp to date details and particulars of visa related information can be found at '''Immigration Department of Malaysia''' website [http://www.imi.gov.my/index.php/en/main-services/visa/visa-requirement-by-country] and the '''Malaysian Ministry of Foreign Affairs''' website [http://www.kln.gov.my/?m_id=53].\n\nNote that Sarawak has separate immigration laws and you will get a new visa on arrival there. For those who require a visa to visit Malaysia, you'll need a separate one for Sarawak, so be sure to state this when applying at the Malaysian embassy/consulate.\n\nIf you require a visa to enter Malaysia, you might be able to apply for one at a British embassy, high commission or consulate in the country where you legally reside if there is no Malaysian diplomatic post. For example, the British embassies in [http://www.ukba.homeoffice.gov.uk/countries/serbia/commonwealth-bots/?langname=null Belgrade],[http://www.ukba.homeoffice.gov.uk/countries/colombia/commonwealth-bots/?langname=UK%20English  Bogota], [http://www.ukba.homeoffice.gov.uk/countries/bolivia/commonwealth-bots/?langname=UK%20English La Paz], Pristina[http://www.ukba.homeoffice.gov.uk/countries/kosovo/commonwealth-bots/?langname=null], Santo Domingo[http://www.ukba.homeoffice.gov.uk/countries/dominicanrepublic/commonwealth-bots/?langname=UK%20English], Sofia[http://www.ukba.homeoffice.gov.uk/countries/bulgaria/commonwealth-bots/?langname=null] and Tripoli[http://www.ukba.homeoffice.gov.uk/countries/libya/commonwealth-bots/?langname=UK%20English] accept Malaysian visa applications (this list is '''not''' exhaustive). British diplomatic posts charge £50 to process a Malaysian visa application and an extra £70 if the authorities in Malaysia require the visa application to be referred to them. The authorities in Malaysia can also decide to charge an additional fee if they correspond with you directly.\n\n'''Overstaying :-'''\nOverstaying in Malaysia is possible with $10 or 30RM fine per day. It is fairly simple to avoid overstaying by doing a visa run to a neighboring country overland or via a cheap flight.\n\n=== By plane ===\nNational carrier '''Malaysia Airlines''' (MAS) has extensive worldwide network coverage and regularly ranks high in airline quality assessments, while no-frills low-cost carrier '''AirAsia''' and its sister company, '''AirAsia X''', now cover an ever-expanding set of destinations including [[Australia]], [[China]], [[Cambodia]], [[Hong Kong]], [[India]], [[Indonesia]], [[Laos]], [[Macau]], [[New Zealand]], [[Philippines|the Philippines]], [[Singapore]], [[Sri Lanka]], [[Thailand]], [[Myanmar]] and [[Vietnam]].\n\n* AirAsia [http://www.airasia.com], ? +60 3 8775 4000 (hotline within Malaysia: 1-300-88-9933)\n\n* Malaysia Airlines [http://www.malaysiaairlines.com], ? +60 3 7846 3000 (hotline within Malaysia: 1-300-88-3000)\n\nMost international flights land at '''Kuala Lumpur International Airport (KLIA) [http://www.klia.com.my]''' ({{IATA|KUL}} | {{ICAO|WMKK}}). Low cost airlines such as Malindo Air and AirAsia flights land at '''Kuala Lumpur International Airport 2 (KLIA2) [http://www.klia.com.my/index.php?m=airport&aid=2]''' ({{IATA|KUL 2}} | {{ICAO|WMKK}}), a 5km road transfer away from the main KLIA terminal.  KLIA's predecessor, the '''Sultan Abdul Aziz Shah Airport''' ({{IATA|SZB}} | {{ICAO|WMSA}}) in Subang near [[Kuala Lumpur]] handles chartered and turboprop aircraft for regional operators '''Firefly''' [http://www.fireflyz.com.my/] and '''Berjaya''' [http://www.berjaya-air.com/flightschedule.htm] , ? +60 3 7846 8228 (ticketing only);, ? +60 3 2145 2828.  See the [[Kuala Lumpur#get in|Kuala Lumpur '''Get in''' section]] for detailed airport information.\n\nOther airports which have significant numbers of flights to regional destinations are [[Kota Kinabalu]] (Sabah), [[Kuching]] (Sarawak), [[Penang]], [[Langkawi]] and [[Johor Bahru]].  Many major Malaysian cities have service to [[Singapore]] via AirAsia or Firefly. Berjaya Air also operates routes from Singapore to the popular dive spots of [[Tioman]] and [[Redang]].\n\n=== By train ===\nThe national railway operator in Peninsular Malaysia is the [http://www.ktmb.com.my Keretapi Tanah Melayu] (KTM, also known as Malayan Railways), which offers international train services to [[Thailand]] (together with the State Railway of Thailand) and [[Singapore]]. KTM tickets up to 30 days in advance can be bought online at [https://intranet.ktmb.com.my/e-ticket/login.aspx the KTM e-ticketing website].\n\n* '''To/from Thailand:''' Direct sleeper train services (International Express) operated by the [http://www.railway.co.th/home/Default.asp?lenguage=Eng State Railway of Thailand] (SRT) connect [[Bangkok]] and [[Padang Besar]] on the Thai-Malaysian border. A few Diesel Railcar (DRC) services, also operated by the SRT, link [[Hat Yai]] and Padang Besar. Thai and Malaysia immigration formalities are all conveniently done in the Padang Besar station.  KTM has discontinued its through train service to Hat Yai, and has stopped hauling the International Express to [[Butterworth]] ([[Penang]]), instead preferring to run its new and fast Electric Train Services (ETS) as well as regional Komuter trains between Padang Besar and various destinations on the electrified West Coast Line. There is also a less used eastern route from Hat Yai to Thai border town [[Sungai Kolok]], but there are no through trains to the nearby Malaysian station at Wakaf Bahru (near [[Kota Bharu]]).\n\n* '''To/from Singapore:''' KTM runs the ''Shuttle Tebrau'' service (13 trips southbound and 11 trips northbound) between [[Johor Bahru]] and Woodlands Train Checkpoint in Singapore. From Singapore, immigration formalities for both countries are conveniently done at Woodlands. In the reverse direction, Malaysian immigration checks are done in Johor Bahru, and Singapore immigration checks are done upon arrival at Woodlands. From Johor Bahru there are direct trains to [[Gemas]] and Pulau Sebang/[[Tampin]] (you'll have to change to an ETS train to go further north to [[Kuala Lumpur]] and beyond), and a direct sleeper service on the [[Jungle Railway]] to Tumpat (near [[Kota Bharu]]).\n\n=== By bus === \nLong-distances buses/coaches into Malaysia run from Brunei, Indonesian Borneo, Singapore and Thailand. Please see the relevant city pages for more details.\n\n* '''[[Brunei]]''' - there are no direct buses into Brunei. However, there are buses from [[Miri]] and [[Limbang]] going to the border where there are connections to Bandar Seri Begawan.\n\n* '''[[Indonesia]]''' - direct buses operate between [[Pontianak]] in [[West Kalimantan]] and [[Kuching]] in [[Sarawak]].\n\n* '''[[Singapore]]''' - a multitude of bus companies operate direct routes from Singapore to various destinations in [[Peninsular Malaysia]], including [[Malacca]], [[Kuala Lumpur]], [[Penang]], [[East Coast (Malaysia)|East Coast]] cities and even the Kuala Lumpur suburbs of [[Petaling Jaya]] and [[Subang Jaya]]. Frequent buses make the short run between Singapore and [[Johor Bahru]], and you can save a few bucks by changing at JB's Larkin terminal to a cheap domestic bus instead of taking a more expensive direct bus. If you are planning to take on arrival visa, you must enter Malaysia via link 2. Most of the bus operators have banded together in one-stop online booking portal for bus tickets booking: [http://www.busonlineticket.com/ BusOnlineTicket.com] features a large number of bus operators in Singapore and Malaysia, providing more than 3,000 routes within the two countries.\n\n* '''[[Thailand]]''' - several companies operate services from [[Kuala Lumpur]] and other cities in Malaysia to [[Hat Yai]] in [[South (Thailand)|southern Thailand]], where direct connections are available to [[Bangkok]] and many other Thai destinations.\n\n=== By road=== \nLand crossings are possible from [[South (Thailand)|southern Thailand]] and Singapore into [[Peninsular Malaysia]], as well as from Brunei and [[Kalimantan]] (the Indonesian side of Borneo) into [[Sarawak]]. An International Drivers Permit (IDP) is required. See the respective city or state pages for more detailed information.\n\n* '''[[Brunei]]''' - the main crossings are at '''Sungai Tujoh''' on the [[Miri]], [[Sarawak]], to [[Bandar Seri Begawan]] (Brunei) road, and the '''Kuala Lurah-Tedungan''' checkpoint which is used for traffic travelling between Bandar Seri Begawan and [[Limbang]] in [[Sarawak]]. You can also access the [[Temburong]] district of Brunei by road from [[Limbang]] via the Pandaruan (Puni on the Brunei side) checkpoint and [[Lawas]] via Trusan (Labu on the Brunei side).\n\n* '''[[Indonesia]]''' - the main crossing is at the '''Tebedu-Entikong''' checkpoint on the main [[Kuching]]-[[Pontianak]] road. Various other minor border crossings used by locals are not necessarily open to foreigners.\n\n* '''[[Singapore]]''' - the two crossings are the '''Causeway''' which links [[Johor Bahru]] with '''Woodlands''' in Singapore, and the Malaysia-Singapore '''Second Link''' which links Tanjung Kupang in [[Johor]] with Tuas in [[Singapore]]. See [[Johor Baru#Get in|Johor Bahru '''Get in''' section]] and [[Singapore#Get in|Singapore '''Get in''' section]] for more details.\n\n* '''[[Thailand]]''' - international checkpoints (with the Thai towns in brackets) include '''[[Wang Kelian]]''' ([[Satun]]) and '''[[Padang Besar]]''' ([[Padang Besar (Songkhla)|Padang Besar]]) in [[Perlis]], '''[[Bukit Kayu Hitam]]''' ([[Sadao]]) in [[Kedah]], '''Pengkalan Hulu''' (Betong) in [[Perak]], and '''[[Rantau Panjang]]''' ([[Sungai Kolok]]) in [[Kelantan]].\n\n=== By boat ===\nFerries connect various points in [[Peninsular Malaysia]] with [[Sumatra]] in Indonesia and [[South (Thailand)|southern Thailand]], [[Sarawak]] with Brunei, and [[Sabah]] with [[East Kalimantan]] in Indonesia and [[Mindanao]] in the Philippines. Luxury cruises also run from Singapore and sometimes [[Phuket]] (Thailand) to Malaysia.\n\n* '''[[Brunei]]''' - ferries daily between the Muara Ferry Terminal in Brunei and [[Labuan]] island and Lawas in [[Sarawak]]. Speedboats, mostly in the morning, also run between Bandar Seri Begawan jetty and Limbang, [[Sarawak]].\n\n* '''[[Indonesia]]''' - the main jumping-off points from Indonesia are the [[Riau Islands]] of [[Batam]], [[Bintan]] and [[Karimun]]; [[Dumai]], [[Medan]] and [[Pekanbaru]] on the [[Sumatra]] mainland as well as [[Nunukan]] in [[East Kalimantan]]. Ferries link [[Batam]] with Batu Pahat and [[Johor Bahru]];[[Bintan]] with [[Johor Bahru]]; [[Karimun]] with Batu Pahat and Kukup in [[Johor]]; Dumai with [[Malacca]], Muar in [[Johor]], Port Dickson (in [[Negeri Sembilan]]) and [[Port Klang]], the port for [[Kuala Lumpur]]; Pekanbaru with [[Malacca]]. Daily ferries also link Nunukan with Tawau in [[Sabah]]. There are also minor crossings like between Bengkalis in [[Riau]] and Batu Pahat; [[Sumatra]] and [[Malacca]] and Muar in [[Johor]]; and Tanjung Balai Asahan in [[North Sumatra]] with [[Port Klang]], the port for [[Kuala Lumpur]].\n\n* '''[[Philippines]]''' - ferries run between the [[Zamboanga Peninsula]] and [[Sandakan]], [[Sabah]].\n\n* '''[[Singapore]]''' - daily passenger boats run between Changi Point and Pengerang, between Tanah Merah and Sebana Cover Resort, as well as between Changi and Tanjung Belungkor, all in [[Johor]]. See the [[Singapore#Get in|Singapore '''Get in''' section]] for details.\n\n* '''[[Thailand]]''' - four ferries daily (reduced to three during Ramadan) between Tammalang at [[Satun]] and Kuah on [[Langkawi]], Malaysia. Vehicle ferries operate between Ban Taba near [[Tak Bai]] in [[Narathiwat_(province)|Narathiwat province]] and Pengkalan Kubur in [[Kelantan]], Malaysia, while passenger boats run between Ban Buketa in [[Narathiwat_(province)|Narathiwat province]] and Bukit Bunga in [[Kelantan]].\n\n=== On foot ===\nYou can walk in/out of [[Thailand]] at [[Wang Kelian]] and [[Padang Besar]] (both in [[Perlis]]), [[Bukit Kayu Hitam]] ([[Kedah]]), Pengkalan Hulu ([[Perak]]) and [[Rantau Panjang]] ([[Kelantan]]). However, crossing the Causeway or the Second Link on foot from Singapore is not allowed.\n\n== Get around == \n\n=== By plane ===\nLargely thanks to budget carrier '''AirAsia''' [http://www.airasia.com], Malaysia is crisscrossed by a web of affordable flights with advertised \"promotional\" prices starting at RM9 for flights booked well in advance. Flying is the only practical option for traveling between peninsular Malaysia and Borneo, as well as reaching some of the more remote outposts of Borneo. State carrier '''Malaysia Airlines''' [http://www.malaysiaairlines.com/] also has competitive fares which now offers equal or even lower priced tickets if booked in advance through the internet, with sustaining class of hospitality. And their offshoot '''Firefly''' [http://www.fireflyz.com.my/] has a handy network radiating out of Penang previously, has also began operating from the Subang (Sultan Abdul Aziz Shah) airport. \n\n'''Berjaya Air''' [http://berjaya-air.com] also flies small Dash-7 turboprops from [[Kuala Lumpur]] and [[Singapore]] to its own airports on the resort islands of [[Pangkor]], [[Redang]] and [[Tioman]]. Prices are steep (from RM214 plus fees one way), but this is by far the fastest and more comfortable way of reaching any of these.  \n\nIn [[Sabah]] and [[Sarawak]], '''MASWings''' [http://www.maswings.com.my], operates turboprop services linking interior communities, including those in the [[Kelabit Highlands]], with coastal cities. MASWings took over the rural air services network from FlyAsian Express on October 1, 2007, which in turn took the service over from Malaysia Airlines 14 months before that.\n\n=== By train === \n[[Image:ETS 5.jpg|thumb|An ETS train at Pulau Sebang/[[Tampin]]]]\n[[Image:Guamusangstation.jpg|thumb|The Jungle Train at [[Gua Musang]]]]\nLong-distance trains in Malaysia can rarely match road transport in terms of speed, but state operator '''Keretapi Tanah Melayu Berhad''' (KTMB) [http://www.ktmb.com.my] provides relatively inexpensive and generally reliable services around [[Peninsular Malaysia]] (but not [[Sabah]]/[[Sarawak]] in [[Borneo]]). The main western line connects [[Butterworth]] (near [[Penang]]), [[Ipoh]], [[Kuala Lumpur]], [[Johor Bahru]] and Woodlands ([[Singapore]]), while the eastern line runs through [[Gua Musang]] and the [[Taman Negara National Park]] to [[Kota Bharu]], near the Thai border and the [[Perhentian Islands]].\n\nThe pride of KTMB's fleet is the '''ETS''' (Electric Train Service), modern air-conditioned electric trains running at 140-160 km/h. The initial run was between Kuala Lumpur to Ipoh with a travel time of just over 2 hours. With the completion of the railway electrification and double-tracking from [[Padang Besar]] to [[Gemas]], the ETS has been extended to the rest of the electrified line, offering fast connection between destinations with travel time comparable to or even faster than a bus. \n\nHowever, the introduction of the ETS spelled the end of diesel train services including sleeper services on the electrified line. The southern unelectrified line between Gemas and Johor Bahru is still served by diesel trains with only 2nd class seats. A change of trains between the ETS and diesel trains is required to continue north or south of Gemas.\n\nThe '''[[Jungle Railway]]''' is the apt description for the single-track eastern line between [[Tumpat]] (close to the Thai border) and [[Gemas]], including stops at [[Gua Musang]], [[Kuala Lipis]], [[Jerantut]] (for [[Taman Negara National Park]]) and Wakaf Bahru (for [[Kota Bharu]] and the [[Perhentian Islands]]).  The original \"Jungle Train\" is the slow daytime service which stops at every station (every 15-20 min or so).  It's 3rd class only, meaning no air-con and no reservations, and some stops may be lengthy as it's a single line and all other trains have priority - hence the \"Jungle Train\" waits in side loops along the way so that oncoming or overtaking trains can pass. Tourists may use this service to travel to  Some find it to be a fascinating and stunningly scenic ride; others feel there's not much to see when you're in the jungle. The eastern line night train between JB Sentral and Tumpat (for which reservations are possible and recommended) also have 2nd class berths and seats, and some have 1st class sleepers too.\n\nTickets can be booked and even printed online at KTMB's site.  Enquiries and reservations can be made by phone at KTMB's call centres, +60 3 2267 1200 (Malaysia) or +65 6366 6832 (Singapore).\n\nIn East Malaysia, the only railway line is run by '''Jabatan Kereta Api Negeri Sabah''' (JKNS) [http://www.sabah.gov.my/railway/indexeng.html], running from Tanjung Aru near [[Kota Kinabalu]] to the town of [[Tenom]].\n\n=== By car/taxi === \nMalaysia has an excellent highway network, culminating in the North-South Expressway along the West Coast from Singapore all the way to the Thai border. Gasoline or locally known as Petrol is slightly cheaper than market prices at RM2.20 per liter for the entire country. Tolls are payable on expressways, but these are priced at varying degrees, ranging from expensive to reasonable: driving the length of the country (734 km) from the Thai border to Singapore costs RM 108 (~US$25). While you can drive from Singapore to Thailand within a day on the West Coast, the highway system is considerably less developed on the East Coast, with no expressways, and even less so in Sabah and Sarawak in which the Pan Borneo Highway is still in construction, so be sure to factor in additional travel time if travelling in those areas. Toll prices for highways and causeways inside major cities, especially Kuala Lumpur, is priced exorbitantly ranging from RM4.00 to RM7.00 for each exit. \n\nFor those thinking of using GPS (Garmin, Papago, Galactio and Mio-Polnav), the Malaysia maps can be downloaded for free from http://www.malfreemaps.com/index.php Garmin user lucky enough to have another choice from http://www.malsingmaps.com/portal/. Both party maps is contributed by the amazing non-profit group of people who share a common passion to make a gps maps of Malaysia. \n\nWhile driving quality and habits in Malaysia are better than most of the rest of Southeast Asia, it is not necessarily great, especially if for travellers coming from a Western country.  Traffic in Malaysia drives on the left, a legacy left by the British. It should be advised, beware of reckless motorcyclists, especially during the night, and especially if you are a pedestrian: locals typically disregard a red light for left turns, putting pedastrians at risk. As a motorist, at traffic lights, they will accumulate in front of you - let them drive away first to avoid accidents.\n\nCare is needed when driving in larger cities, such as Kuala Lumpur and Penang. Problems include apparently suicidal motorcyclists, congested traffic lanes throughout the day, and bewildering roads especially in the older parts of the city where planning was virtually nonexistent by the then British colonial occupier. Out of town however, cars and motorcycles are the best and sometimes the only way to explore the country. Some of the more rural areas have motorcycles and scooters to rent for as little as RM25/day, a great way to explore the local area or larger islands like Langkawi. As expected, most rental agencies will require a valid drivers licence to be presented upon rental. Fuel levels are often compared before and after rental, as well as for damage, so ensure everything is documented, and request a refund of any excess fuel if possible. The bigger car rental companies like Hertz and Avis may also require you to have a valid credit card where a deposit will be authorised but not deducted from (unless there is damage to the car).\n\nTaxis are available in all cities and larger towns, although in smaller places you may have to call one (ask any shopkeeper or consult the yellow-pages).  You will generally need to negotiate the fare in advance, although prepaid coupon taxis are usually available at airports. RM5 should suffice for a short cross-town trip, while RM100 is enough to hire a taxi for a full day. \n\nIt is recommended for travelers to use the ride-sharing apps such as '''Grab''' since they are cheaper than the regular taxi most of the time. Their vehicles are clean and more comfortable than normal taxis, and their drivers friendly and professional. Charges are standard and you will not risk getting cheated by taxi drivers. Such apps are often the preferred option for locals, revolutionising the industry. In response, the government officially legalised them in June 2017, so they are regulated and co-exist alongside taxis. If you choose to use taxis, take note of the advise below to avoid getting cheated. \n\nIn Kuala Lumpur, the budget taxis are usually coloured Red and White (City taxi - these taxis are not allowed to travel out of the city e.g. to another state) or Yellow. Taxis are usually small saloons such as Proton Wira and run on NGV (Natural Gas). The Blue taxis are larger saloons or MPVs (Multi Purpose Vehicles) and more luxurious. These cost typically 25-30% more than the budget taxis and are normally available at taxi stands all over Kuala Lumpur including the major malls and hotels. \nThe Red-White taxis can be hailed off the roads and are metered. Ensure that the taxi driver is a Malaysian (all drivers must have a taxi permit and license with their photo on it) before you board, as unscrupulous taxi owners have been known to rent their taxi out to unlicensed stand-ins. Like in most other countries, a foreigner on a work visa are only allowed to work in the job/industry specified in the visa. All taxi drivers must be Malaysian or a PR holder as the Malaysian government does not issue work visa to foreigners to drive taxis.\n\nAdditionally, beware of unlicensed taxis (known as Ulat Teksi 'taxi worms') at the airports. They can literally take you for a ride. There will be touts at the airports offering travellers their taxi service, even pretending to be legitimate. As unbelievable as it may sound, some have been known to rob first time visitors hundreds of ringgit for a single trip into the city, charging 100 times more than the correct fare. At the airports '''always''' get your taxi from the authorised operators' booths set up in the airport itself. '''Never''' take taxis from anyone that solicits directly. They will always claim to be legitimate but are rarely licensed and may be unsafe. The taxi operator booths can provide you with receipts. Another tip is to book your taxis in advance. All good hotels' concierge will be able to assist you with this. If travelling in an unlicensed taxi you may not be covered by your travel insurance should that taxi be involved in a mishap.\n\nTaxi Meter Rate (as of 2018):\n\nRed Taxi (Budget Taxi)     : Min RM3.00 + RM1.00 every 1 KM\n\nBlue Taxi (Exclusive Taxi) : Min RM6.00 + RM2.00 every 1 KM\n\nGold Taxi (Teks1M): Min RM4.00 + 30 sen per 100m \n\nEven when getting taxi from the Airport, make sure you ask for Budget Taxi (Red Taxi), else you end up in Blue Taxi and pay double.\nIn Kuala Lumpur, the 8am to 10am, 12pm to 2pm and 4pm to 8pm are the busy time in the city. Insist on using the meter and if the driver refuses, just find another taxi or take the train.\n\n=== By bus === \n{{infobox|Report Bad Drivers|Bus drivers (especially on more \"rural\" routes) sometimes drive carelessly, speed like maniacs, overtake on blind corners, etc. The vast majority of journeys are problem-free but some horrific accidents attributed to reckless driving have, however, led to a crackdown and a nationwide hotline and SMS number for reporting these drivers/vehicles have been set up. These numbers are conveniently pasted on the back of every single large vehicle in the country.}}\n\nThe cheapest way to travel in Malaysia is by bus. All towns of any size have a bus terminal offering connections to other parts of the country. There are many companies of varying degrees of dependability, but two of the largest and more reliable are '''Transnasional [http://transnasional.com.my]''' and '''NICE/Plusliner [http://www.plusliner.com.my/]'''. 24-seater \"luxury\" buses are recommended for long-distance travel.\n\nIf travelling on holidays or even over the weekend, it is advisable to reserve your seats in advance. Note that air conditioning on some buses can be extremely cold so don't forget to bring a good sweater, pants and socks, especially for overnight journeys on luxury buses!\n\n== Talk ==\nThe sole official language of Malaysia is [[Malay phrasebook|Malay]] (officially ''Bahasa Malaysia'', sometimes also known as ''Bahasa Melayu''). The [[Indonesian phrasebook|Indonesian language]], spoken accross the border in Indonesia, is similar to Malay, and both languages are largely mutually intelligible. Some parts of Malaysia near the Thai border, most notably [[Kelantan]], have dialects of Malay which are nearly incomprehensible to speakers of standard Malay, though most people in these areas will be able to converse in standard Malay if needed.\n\n'''English''' is compulsory in all schools and widely spoken in the larger cities, as well as around the main tourist attractions, although in rural areas a little Malay will come in handy. There is also a colloquial form of English spoken among Malaysians in urban areas, not inappropriately known as '''Manglish''', which involves code switching between English, Malay and/or other languages, and takes a bit of getting used to if you intend to join in the conversation on local topics. Malaysians will almost always try to speak 'standardized English' when approached by Western travellers. In general, police stations and government offices will have English-speaking staff on duty.\n\n[[Arabic phrasebook|Arabic]] is taught to those who attend Islamic religious schools, and many clerics as well as other very observant Muslims will have a functional command of Arabic. However, it is not widely spoken, though the Malay language does have a large number of loan words from Arabic. You also might notice some examples of Malay written with Arabic letters. This is called Jawi, and it is still used for religious publications and inscriptions, especially in states like [[Kelantan]], although the Latin alphabet is much more commonly used throughout the country.\n\nThe Chinese community in Malaysia speaks a wide variety of Chinese languages including [[Cantonese phrasebook|Cantonese]], [[Chinese phrasebook|Mandarin]], Teo-chew, Hakka, Hainanese, Hok-chew and [[Minnan phrasebook|Hokkien]]. Mandarin is taught in most Chinese schools while Cantonese is commonly heard in the mass media due to the popularity of TVB serials from Hong Kong among the Chinese community, so many are conversant in both, in addition to their native language. The most commonly spoken Indian language is [[Tamil phrasebook|Tamil]]; others include [[Malayalam_phrasebook|Malayalam]], [[Punjabi phrasebook|Punjabi]] and [[Telugu_phrasebook|Telugu]]. \n\nIn the northern states of Peninsular Malaysia bordering Thailand, there are various ethnic Thai communities, known locally as the ''Orang Siam'', who speak various dialects of [[Thai phrasebook|Thai]]. [[Malacca]] in the south is also home to a Portuguese community which speaks a [[Portuguese phrasebook|Portuguese]] based creole. The remote forest areas of Peninsular Malaysia are also home to various tribal people known as the ''Orang Asli'', who speak various indigenous languages such as Semelai, Temuan and many others. In East Malaysia several indigenous languages are also spoken, especially [[Iban phrasebook|Iban]] and [[Kadazan phrasebook|Kadazan]].\n\nFilms and television programmes are usually shown in their original language with Malay subtitles. Some children's programmes are dubbed into Malay.\n\n==See==\n[[Image:SouthBeach_Curve.JPG|thumb|240px|South Beach, [[Perhentian Islands|Perhentian Besar]]]]\n\nThere are various beautiful national parks in Malaysia. There are many different types of expeditions available, ranging from those where you hardly lose sight of the hotel to those where you are fully immersed in the jungle with only the guide and yourself if you are willing to pay the money! Tours vary from about 4 days to 2 weeks or more. Do note that in Eastern Malaysia hiking without guides is often not possible (even for easy trails), with the notable exception on Bako national park. \n\nThe top places to see animals in the wild in Malaysia are more remote and more difficult to get to. These include Danum Valley (one of the oldest rainforests in the world where you can see Orangutans, pygmy elephants and leopard cats in the wild), Kinabatangan River (where you can see pygmy elephants, proboscis monkeys and orangutans) and Telupid Forest Reserve (also known as Deramakot Forest Reserve) where you can see the rare clouded leopard in the wild (there are only 700 left in Sabah). The more popular parks which are more accessible do offer publicly accessible wooden boardwalks and concrete walkways though parts of the park, allowing visitors to get a taste of the jungle beyond. It is very unlikely in these more accesible national parks that you get to see a tiger or an elephant as it is really likely only if you are going to be staying for longer than a few days, i.e., for a couple of weeks at least. One of the most common forms of wildlife that you will encounter in the jungle, however, are definitely leeches! In the rainforest it is very, very humid but actually it is not incredibly hot. This is because of the large amount of shade afforded by the canopy created by the interlocking trees. Shop around for deals of getting into the jungle and make your decision based on what type of person you are. If you are going to enjoy a lot of hiking without seeing any other people for days or even weeks then you can have that choice, alternatively you can have a much more 'packaged' tour in which you will probably stay in a very built up tourist town which has probably just grown out of the demand for people wanting to stay in the jungle (these packaged tours can be difficult to avoid in Eastern Malaysia, as tourism in Sarawak and especially Sabah is predominantly focused on large groups).\n\nTo escape from the muggy tropics, do as the English did and head up to the cooler highlands of West Malaysia or climb [[Mount Kinabalu]] in [[Sabah]].\n\nMalaysia is also well-known for some pristine beaches with great diving opportunities, such as [[Sipadan]] off the coast of Sabah and the [[Perhentian]] Islands, which are off the coast of northern [[Terengganu]]. Coastlines in the less industrialized parts of the country, in general, are well worth driving through for their natural beauty and relaxing seaside kampung (villages), though beware not to swim at any beach which is not protected by capes, lest you be swept away by a powerful undertow.\n\nIf zoological exhibits are more your thing or you are visiting with children, there are several well-maintained zoos all over Malaysia that are worth a visit or two, most notably [[Taiping ]] Zoo, [[Kuala Lumpur ]]'s Zoo Negara and [[Malacca]]'s Zoo.\n\nIf you are most interested in taking the pulse of a city, [[Kuala Lumpur]]'s crazy quilt ultra-modern skyline, including the famous Petronas Twin Towers, is worth visiting. [[Ipoh]] may be of more interest if you prefer a somewhat slower paced city that features elegant colonial-era buildings from about 100 years ago, and [[Malacca]] is for those who want to trace the colonial and imperial history of Malaysia several hundred years further back. [[Penang]] is known for its great food and relatively long-standing and institutionalized Chinese and Indian communities, who share the city with Malay and Thai communities. For a completely different experience, consider going to [[Kota Bharu]] to discover a unique conservative Islamic regional culture influenced by [[Thailand]], only a few kilometres away, or visit the diverse cities of [[East Malaysia]], like [[Kuching]] and [[Kota Kinabalu]].\n\n== Do ==\n[[Image:Penambang.JPG|thumb|240px|Penambang, [[Penambang|Sarawak River]]]]\n\n===Scuba Diving===\nMalaysia has excellent '''[[scuba diving]]'''.  The most popular spots are the islands off the [[East Coast (Malaysia)|East Coast]] of peninsular Malaysia ([[Perhentian]], [[Redang]], [[Tioman]] and many more), although the dive season is limited to April to September.  However, the most famous dive site &mdash; often ranked among the best in the world &mdash; is [[Sipadan]], off the easternmost tip of [[Sabah|Malaysian Borneo]].  At Sipadan you can see sharks, parrothead fish and a turtle tomb. There are many other less well known sites, like [[Layang Layang]].\n\n===Hiking===\n\nMalaysia has some of the oldest rainforests in the world, the tallest mountain in Southeast Asia and generally lots of great hiking trails. \n\nKota Kinabalu - Even if you don't climb Mt Kinabalu (which requires 2-3 days and booking of permits in advance), you can trek around the Kinabalu National Park, which is a UNESCO Heritage Site.\n\nGunung Mulu National Park - Also a UNESCO Heritage Site, this hike up to Gunung Api is a harder climb than Kota Kinabalu but has a wonderful view of the Pinnacles at the top, which are tall, jagged limestone formations. This park is also home to the world's largest cave chamber by surface area, as well as one of the largest cave passages on Earth.\n\nDanum Valley - this is a 130- million-year-old rainforest where you can see orangutans and other rare Borneo fauna and wildlife in the wild. Although this is older than the Amazon rainforest (which is only 60 million years old), this is much less well known than its South American counterpart. \n\nMaliau Basin Conservation Area - also known as Sabah's lost world, this is a pristine basin and one of the few remaining relatively untouched wilderness areas in the world. This is under consideration as a world heritage site.\n\n===Whitewater Rafting===\n\nYou can find  tame Grade I to incredibly difficult and dangerous Grade V rapids in Malaysia's many national parks:\n\n* Jeram Besu - Grade I-III - [[Pahang]]\n* [[Telom River]] - Grade V - [[Pahang]]\n* Kuala Perahu - [[Pahang]]\n* Lipis River - [[Pahang]]\n* Anak Jelai River - Grade I-II - [[Pahang]]\n* Tembeling River - Grade I-II - [[Pahang]]\n* Sedim River - Grade III-IV - [[Kedah]]\n* Sungai Selangor - Grade I-III - [[Selangor]]\n* Kiulu River - Grade II - [[Sabah]]\n* Padas River - Grade III-IV - Sabah\n* Sungai Itek (Kampar River) - Grade I-III - [[Perak]]\n* Sungkai River - Grade I-II - Perak\n* Singoh River - Grade V - Perak\n* Endau River - [[Johor]]\n* Nenggiri River - Grade I-III [[Kelantan]]\n* [[Kuala Kubu Bahru]], [[Selangor]]\n\n===Golf===\n\nMalaysia has an abundant supply of world class golf courses such as the Mines Resort and Golf Club and Kuala Lumpur Golf & Country Club, both which hosted the annual PGA sanctioned CIMB Classic. Other notable courses include Saujana Golf & Country Club, Clearwater Sanctuary, The Legends and many more.\n\n===Paintball===\n\nMalaysians love their extreme sports, and this can be reflected by the rather large community of Paintball players. There are both woodsball and speedball fields throughout the country. The Paintball World Cup Asia has been held at Langkawi for the past few years, attracting top team and players from around the world. Speedball tournaments are held throughout the year, such as the Malaysian Paintball Official Circuit(MPOC). Occasionally, the woodsball and milsim paintball communities would organize big games open to all, such as the Tanamera big games, Canyon Apocalypse or the M-SOG military simulation oriented events. Pellet rates are relatively higher as compared to the U.S. The average price for a box(2000 pellets) of field grade is around RM240. The all inclusive rental packages are priced at around the average of RM110 per head. Notable paintball parks are as follows:\n\n* Canyon Paintball Club (Petaling Jaya, Selangor) - Speedball and woodsball\n* Xtion Paintball Park (Kuala Lumpur) - Speedball\n* Mudtrekkers Paintball (Shah Alam, Selangor) - Speedball and woodsball\n* WTF Training Facilities (Puchong, Selangor) - Speedball\n* Tanamera Paintball (Sungai Buloh, Selangor) - Woodsball(large field)\n* 89 Arena (Klang, Selangor) - Speedball and CQB recball\n* Paintball@Shah Alam Extreme Park (Shah Alam, Selangor) - Woodsball(large field)\n* BPP Paintball (Kuching, Sarawak) - Speedball\n\nNote however that, foreign players are prohibited from transporting their own markers into the country, unless officially cleared by the government.\n\n===Cycling===\n\nCycling is a favourite pass time among most Malaysians. There are dedicated bicycle and motorcycle lanes available on some highways and expressways, the most notable one being the bike lane of the KESAS highway serving Kuala Lumpur and Selangor. Seasoned road cyclists would flock the lane almost every night throughout the year, rain or shine. Bike lanes within the larger city limits are slowly cropping out, such as those in Kuala Lumpur and Penang. However, the general attitude towards cyclists on the road is still rather primitive, so cyclists are to be mindful of their surroundings. There are tons of cycling events organized throughout the year ranging from the competitive Tour De Langkawi to the massive outings such as the OCBC Cycle KL, and down the more laid back officially sanctioned KL Car Free Morning events. \n\nAnother famous cycling spot would be the bike friendly administrative capital of Putrajaya, specially during the night. Government buildings, complexes and bridges would be lit up with colourful shades of light.\n\nMoving away from the public roads, are the immaculate mountain bike trails and routes such as but not limited to:\n\n* Bukit Kiara Trails (Kuala Lumpur) - World renowned for its vast interconnected network of trails. There is a trail for every mountain biking discipline, but it is mostly catered towards Downhill and Enduro/trail. Most of the trails are extremely challenging technical singeltracks with high elevation gains and fast flowing downhill sections. But there are also easier trails for the beginners alike. The trails are free for all and entrance is free of charge. This is a good way for riders to experience the Malaysian tropical rainforests, wildlife such as monkeys included. There are many ways to access the trails, but the most common way being through the Bukit Kiara Equestrian Club or through the suburbs of Taman Tun Dr.Ismail(TTDI). It must be noted that, some of the more common trails are to be shared equally among the riders and the trekkers, so caution is ought to be practiced. Night rides are common.\n\n* FRIM Kepong (Kepong, Selangor) - Mostly XC oriented trails and fire roads here, with some challenging climbs such as the Steroid Hill. Note that this is situated within one of the compounds of the Forest Research Institute of Malaysia, so a small entrance fee is applicable. Riders would be able to see how local tropical fruits are being cultivated, though for research purposes. The common trails are shared equally among the riders and trekkers alike. The fire roads are also accessible by automobiles.\n\n* Kota Damansara Community Forest Reserve (Petaling Jaya, Selangor) - There is a small network of trails of mostly singletrack. So they are not recommended for beginners. The tracks are extremely technical and are full of obstacles ranging from roots to boulders. The elevation gain can be steep too. The deeper parts can be quite dark . Wildlife such monkeys can be found. The trails are usually empty as it is not rather well known just yet, so riding alone in there can be a rather daunting experience. Entrance is free of charge but visitors are to be mindful of cleanliness since it is a community forest. Night rides are quite common.\n\n* Putrajaya Challenge Park (Putrajaya) - This is a complete bike park. There is a dedicated jump park for BMX and freeride. The trails are mostly XC oriented and is pretty laid back.\n\n== Buy ==\n\nThe Malaysian currency is the '''ringgit''', informally known as the dollar (the \"$\" symbol can be seen on older notes) and abbreviated '''RM''' or '''MYR''', is divided into 100 sen. There are coins of 5, 10, 20, and 50 sen as well as bills of RM1, 2 (rare), 5, 10,20, 50 and 100.  5 sen coins are mainly given as change in large establishments and supermarkets, peddlers and street vendors might be reluctant to accept them. Note that the Singapore and Brunei dollars are also known as ''ringgit'' in Malay, so when near border areas you might want to check to be sure which currency they are quoting the price in.\n\nRinggits are freely convertible.  Foreign currencies are ''not'' generally accepted, although you might get away with exchanging some Euros or US dollars even in more remote areas, but do expect a lot of stares and some persuasion. The major exception is Singapore dollars, which are accepted by KTMB and toll roads, but at a highly unfavorable 1:1 exchange rate (an anomaly dating back to the 1970s when the ringgit was interchangeable with the Singapore dollar).\n\nBanks and airports are not the best places to exchange money if it is not urgent. Licensed money changers in major shopping malls often have the best rates - be sure to say the amount you wish to exchange and ask for the 'best quote' as rates displayed on the board are often negotiable, especially for larger amounts.\n\nATMs are available in most cities and generally accepts Visa or Mastercard. Make sure to check the logo on the ATM machine that matches to your card (such as Cirrus, Maestro, MEPS, etc.). Most major establishments in big cities accepts credit cards. In rural areas, mainly cash are accepted. Just ask before doing any purchase. Some, but not all shops and attractions accept card payment, although be aware that if your card is not 'chip & pin' it may not be accepted. '''Skimming''' can be a problem in dodgier outlets.Overall it is advisable to have enough cash on you to make it through the day.  Do stock up on cash if heading out into the smaller islands or the jungle. \n\n=== Banking ===\n\nBanks in Malaysia do handle international transactions. These ranges from a nominal fee if you are an account holder to a slightly more expensive amount if you are only walking in to use a certain service. International banks such as CITIBANK & HSBC have their presence in Malaysia, with the latter having branches throughout the country. Local banking giants are MAYBANK & CIMB, & they are a very good alternative to the earlier mentioned banks, especially in terms of pricing, local knowledge & presence as well as international services available e.g. money transfers. For any enquiries and transactions, get a number, sit down and wait for your turn to be served. (There is no need to queue while you wait in air-conditioned comfort!)\n\nBanks are open Monday to Thursday from 9:30AM to 4PM Friday from 9:30AM to 12:30PM and resume 2:45PM to 4PM and selected banks are open on Saturday from 9:30AM -11:30AM except on the first and third Saturdays of each month. In the states of Kedah, Kelantan, Terengganu and Johore they are open Sunday to Thursday from 9.30AM to 4PM and Thursday from 9:30AM-11:30AM .\n\nUS Debit cards: Due high levels of fraud, many Malaysia ATMs do not allow you to withdraw using a US debit card. Numerous travellers have noted this on travel forums. This is unique to Malaysia and is not applicable to Thailand, Singapore, or Indonesia. If you call your bank or even Visa/Mastercard, they are often not aware because the transaction is declined by the Malaysia bank. Make sure to bring cash or other form of money in case your debit card is rejected.[http://www.flyertalk.com/forum/archive/t-682155.html]\n\n=== Costs ===\n\nMost visitors will find Malaysia quite cheap, although it is noticeably more expensive than neighbouring Thailand,Indonesia and Philippines. You can live in hostel dorms and feast on hawker food for less than RM50 per day, but you'll wish to double this for comfort, particularly if travelling in more expensive East Malaysia. Kuala Lumpur is also generally more expensive than the rest of the country. At the other end of the spectrum, luxury hotels and air fares are comparatively affordable, with even the fanciest 5-star hotels costing less than RM400/night.\n\n'''Tipping''' is not customary in Malaysia. Generally, Locals do not tip. However, hotel porters and taxi drivers will appreciate a small tip if you have been provided with exemplary service. Most expensive restaurants, bars and hotels may indicate prices in the form of RM19++, meaning that goods and services tax (GST) (6%) and service charge (10%) will be added to the bill. Hotel tax of 5% may also be added to this.\n\n=== Shopping ===\n\n[[Kuala Lumpur]] is a shopping mecca for clothes, electronics, watches, computer goods and much more, with very competitive prices by any standard. Local Malaysian brands include Royal Selangor and BritishIndia. Traditional Malaysian fabrics (''batik'') are a popular souvenir. The cheapest place to easily buy ethnic souvenirs (especially wood-based) is in [[Kuching]], East Malaysia, and the most expensive place is in the major, posh [[Kuala Lumpur]] shopping centres.\n\nIn general shops are open from 10.30AM-9.30PM (or 10PM) in the large cities. They open and close for business earlier in the smaller towns and rural areas.\n\nIf you buy too much while shopping in Malaysia (which is quite easy to do), surface postage rates are very reasonable. Excess luggage at the airport is still high but not as high as in many other countries. Check first with your airline.\n\n===Internet===\n\nDon't forget about the internet. There are various solutions available on the market. The best are eSim based connectivity hubs, such as Nommi. It provides internet in over150 countries at a nearly local price and gives free access to over 4 million Wi-Fi networks around the world which are available via Nommi App as a Wi-Fi map. Additionally, the device functions as a power bank, able to charge a smartphone a few times. Nommi also has a built-in VPN that works in China.\n\n== Eat ==\n\nThe crossroads of Malay, Chinese and Indian cuisine, Malaysia is an excellent place to ''makan'' (eat in Malay). Look out for regional specialities and Nyonya (Peranakan) cuisine, the fusion between Malay and Chinese cooking. There is even unique Eurasian cooking to be found in the Portuguese Settlement in Malacca, the heartland of the Eurasian community of Portuguese descent.\n\nMalaysians are very proud of their cooking and most towns or even villages have their own delicious specialities such as [[Penang]] ''char kway teow'', [[Kajang]] satay, [[Ipoh]] bean sprout chicken, [[Sarawak]] ''laksa'', [[Kelantan]]ese ''nasi dagang'', [[Sabah]]an ''hinava'', and many, many more. Most of them rely on word of mouth for advertising and are frequently located in the most inconvenient, out-of-the-way places so you might want to try asking the locals for their personal recommendations. \n\nIf you intend to travel around Malaysia trying out the local food, don't be fooled by the names. Sometimes two entirely different dishes from different parts of the country can be known by the same name. An example will be ''laksa'', which refers to completely different noodle dishes in [[Penang]] and [[Sarawak]].\n\nGenerally, you can eat pretty much anywhere in Malaysia. Food outlets are comparatively clean - the only thing you should avoid is ice for your drinks, when you frequent the street stalls since the blocks of ice used there might not be up to your hygienic standards.  In actual restaurants this is not a problem. Also you might want to avoid ordering water from stalls or the ''mamak'' restaurants as they are usually unboiled tap water.\n\nCheaper places often do not display prices; most will charge tourists honestly but check prices before ordering to make sure.\n\nEating habits run the gamut, but most foods are eaten by '''fork and spoon''': push and cut with the fork in the left hand, and eat with the spoon in the right.\n\nAs eating is a favourite 'pastime' of Malaysians, the majority are adept at using the chopsticks regardless of background. Noodles and Chinese dishes typically come with these, while Malay and Indian food can be eaten by hand, but nobody will blink an eye if you ask for a fork and spoon instead. \nIf eating by hand, always use your right hand to pick your food as Malays and Indians traditionally use their left hand for dirty things like washing up after using the restroom. When eating with chopsticks at Chinese restaurants, take note of the usual ettiquette and most importantly, ''do not'' stick your chopsticks vertically into a bowl of rice. This is reminiscent of incense sticks burning at the temple and has connotations of wishing death on those around you. If eating in a group, serving dishes are always shared, but you'll get your own bowl of rice and soup.\n\n===Local delicacies===\n\n====Malay cuisine====\n\n[[Image:MadamKwan NasiLemak.jpg|thumb|''Nasi lemak'' with ''sambal ikan bilis'' (curried dry anchovies), cucumber, chicken curry, and an egg]]\n\nSubtlety is not a priority in Malaysian Malay cooking, as it is characterised by a liberal use of spices (the most important are star anise, cinnamon/cassia, cardamom and cloves - dubbed ''rempah empat beradik'' or the four spice siblings), pungent edible rhizomes (mainly galangal, ginger and turmeric), coconut milk (''santan'' in Bahasa Malaysia), and occasionally fresh herbs (lemongrass, fresh coriander, pandan leaves and various kinds of wild herbs or ''ulam'').  Most Malaysian Malay dishes are curries, stews or dips of one kind or another, but all full of flavour.\n\n* '''Nasi lemak''' (lit. \"creamy rice\") is the definitive Malaysian Malay breakfast, consisting at its simplest of rice cooked in light coconut milk or coconut cream, some fried ''ikan bilis'' (anchovies), peanuts, slices of cucumber and a dab of chilli on the side. Originally, the 'ikan bilis' was cooked together with the chilli & spices to make \"sambal tumis ikan bilis\" but it makes more commercial sense to the business man to have them separated as it is easier to make & the fried anchovies will last longer. A larger fried fish or chicken wing are common accompaniments. More often than not, also combined with a variety of curries and/or ''sambal'' (see below).\n\n* '''Rendang''', occasionally dubbed \"dry curry\", is meat stewed for hours on end in an intricately spiced (but rarely fiery) curry paste until almost all water is absorbed.  Beef ''rendang'' is the most common, although relatively recent variations with chicken and mutton are not uncommon. \n\n* '''Sambal''' is the generic term for chilli-based sauces of many kinds. '''Sambal belacan''' is a common condiment made by mixing chilli with the shrimp paste ''belacan'', while the popular dish '''sambal sotong''' consists of squid (''sotong'') cooked in red chilli sauce.  '''Sambal ikan bilis''', a common accompaniment to ''nasi lemak'', consists of small dried fish with onions, chilli and sugar.\n\n* '''Satay''' are barbecued skewers of meat, typically chicken or beef.  What separates satay from your ordinary kebab is the slightly spicy peanut-based dipping sauce. \n\n* '''Kangkung belacan''' is water spinach wok-fried in shrimp paste (belacan) and hot chilli peppers.\n\n* '''Mee rebus''' is egg noodles served in a sweet and slightly spicy sweet potato-based gravy, usually with a slice of hard boiled egg and some lime.\n\n* '''Lontong''' is vegetables, tempeh and soohoon cooked in a yellow (from turmeric) coconut-based gravy, eaten with nasi himpit (cubed overcooked rice)-- one of the few vegetarian dishes in Malay cuisine!\n\n====Peranakan/Nonya cuisine====\n{{infobox|Culinary borrowings|Many regional terms and the odd euphemism tend to crop up in notionally English menus.  A few of the more common ones:\n\n; ''asam'' : tamarind (Bahasa Malaysia)\n; ''bee hoon'' : vermicelli, thin white noodles made from rice \n; ''garoupa'' : grouper, a type of fish (Portuguese)\n; ''gonggong'' : a type of conch (Chinese)\n; ''hor fun'' : very wide, flat rice noodles (Cantonese)\n; ''kangkung'' : water spinach, an aquatic vegetable (Bahasa Malaysia)\n; ''kelapa'' : coconut (Bahasa Malaysia)\n; ''kway teow''(hor fun) : flat rice noodles, slang derived from the common chinese dish\"char kway teow\"\n; ''kunyit'' : turmeric (Bahasa Malaysia)\n; ''lengkuas'' : blue ginger (Bahasa Malaysia)\n; ''mee'' : thick egg noodles \n; ''nasi'' : rice (Bahasa Malaysia)\n; ''serai'' : lemon grass (Bahasa Malaysia)\n; ''sotong'' : squid/cuttlefish (Bahasa Malaysia)\n; ''spare parts'' : giblets; offal such as liver, heart, gizzard\n; ''tang hoon'' : thin, transparent starch noodles, also known to many as glass noodles\n; ''gearbox'' : 'knee' or shin part of cow}}\n\nThe most identifiable cuisine in the region is '''Peranakan''' or '''Nonya''' cuisine, born from the mixed Malay and Chinese communities of what were once the British colonies of the Straits Settlements (modern-day [[Singapore]], [[Penang]] and [[Malacca]]).\n\n* '''Ayam pongteh''' is a chicken dish flavoured with fermented soy bean paste, dark soy sauce, sugar and other ingredients. This mild and slightly sweet is made daily in some Nyonya households.\n\n* '''Ayam Buah Keluak''' is a distinctive dish combining chicken pieces with black nuts from the Pangium edule or kepayang tree to produce a rich sauce.\n\n* '''Chilli crab''' originally a Malaysian specialty which is now available in Singapore as well, is a whole crab ladled with oodles of sticky, tangy chilli sauce. Notoriously difficult to eat but irresistibly delicious: don't wear a white shirt!  For a less messy but equally tasty alternative, ask for '''black pepper crab'''.\n\n* '''Enche Kabin''' are bite-sized pieces of fried chicken marinated in soy sauce, five-spice powder, black pepper, ginger and scallions.\n\n* '''Itek Tim''' is a soup containing duck, tomatoes, green peppers, salted vegetables, and preserved sour plums simmered gently together.\n\n* '''Kaya''' is a jam-like spread made from egg and coconut, an odd-sounding but tasty combination.  Served on toast for breakfast, canonically accompanied by runny eggs and strong, sweet coffee (''kopi''). \n\n* '''Laksa''' in Malaysia comes in many wildly different styles, and every state seems to have its signature style.  ''Laksa lemak'' is a fragrant soup of noodles in a coconut-based curry broth, topped with cockles or shrimp, while [[Penang]]'s ''assam laksa'' is made with a tamarind-infused broth instead of coconut, and has a spicy sourish taste.  [[Kelantan]]ese ''laksam'', on the other hand, comes with wide, flat rice noodles and a very coconutty broth.\n\n* '''Mee siam''' is rice flour noodles served with sour gravy made from tamarind, dried shrimp and fermented beans. Usually served with ''tau pok'' (bean curd) cubes and hard boiled eggs.\n\n* '''Popiah''' or spring rolls come fresh or fried. They consist of boiled turnips, fried tofu, fried shallots and garlic, chopped omelette, chopped stir fried long beans and (optional) chilli sauce, wrapped in a thin rice skin covering and eaten like a fajita.\n\n* '''Rojak''' means a mixture of everything in Bahasa Malaysia, and there are two very different types.  '''Chinese rojak''' is a salad of pineapple, white turnip, cucumber, ''tau pok'' (fried bean curd) with thin tiny slices of ''bunga kantan'' (torch ginger flower buds), tossed in shrimp paste sauce and sugar, then sprinkled with crushed peanuts.  '''Indian rojak''' consists of mainly fried fritters made from flour and various pulses with cucumber and tofu, with sweet & spicy peanut sauce.\n\n* '''Acar''' (''achar'') is thinly sliced vegetables and fruits (cucumber, carrot, pineapple) lightly pickled with vinegar, chilli and peanuts, a common side dish.  Not nearly as pungent as Indian-style pickles which happen to bear the same name.\n\n* '''Sup kambing''' is a hearty mutton soup slow simmered with aromatic herbs and spices, and garnished with fried shallots and fresh cilantro.\n\n* '''Keropok lekor''', a specialty of the state of Terengganu on the east coast of Peninsular Malaysia, is a savoury cake made from a combination of batter and shredded fish. Sliced and fried just before serving, it is eaten with hot sauce.\n\n* '''Tempoyak''' is fermented durian paste, served as a side accompaniment to a main meal.\n[[Image:Durian.jpg|thumb|240px|Durian, the King of Fruits]]\n\nMalaysian Malay desserts, especially the sweet pastries and jellies, are mostly based on coconut and palm sugar (''gula melaka'', named after [[Melaka]]). '''Kuih''' (or '''kueh''') refer to a plethora of steamed cake-like sweetmeats, mostly made with coconut milk, grated coconut flesh, glutinous rice or tapioca. Labour-intensive to make, they are often very colourful (made so with either natural or synthetic food colourings), and cut into fanciful shapes. Try the ''onde-onde'', small round balls made from glutinous rice flour that has been coloured and flavoured with pandan leaves, filled with palm sugar and rolled in grated coconut. A delight to eat as it pops in your mouth with a sweet sensation of oozing palm syrup.\n\n* '''Ais kacang''' literally means \"ice bean\" in Bahasa Malaysia, or in another name of '''ABC''' means '''Air Batu Campur''', is a good clue to the two major ingredients: shaved ice and red adzuki beans. However, more often than not you'll also get ''gula melaka'' (palm sugar), grass jelly, sweet corn, kidney beans, black eyed peas, attap palm seeds and anything else on hand thrown in, and the whole thing is then drizzled with canned condensed milk or coconut cream and coloured syrups.  The end result tastes very interesting and refreshing.\n\n* '''Apam balik''', also called \"Terang Bulan\" in some states, is a rich pancake-like dish slathered with liberal amounts of butter or magarine, and sprinkled with sugar, coarse nut and sometimes corn.\n\n* '''Bubur cha-cha''' consists of cubed yam, sweet potato and sago added into a pandan-infused coconut milk soup. This can be served warm or cold and can be a breakfast or a dessert.\n\n* '''Cendol''' is made with green pea noodles, served in a sweet broth of palm sugar and coconut milk. Usually served chilled, and a great respite in the sweltering tropical heat.\n\n* '''Pisang goreng''' literally means fried bananas, encased in batter. A common street food, it can be eaten for afternoon tea, dessert, or as a snack anytime of the day.\n\n* '''Pulut Hitam''' is a rice pudding made from black glutinous rice sweetened with brown palm sugar. Creamy coconut milk is swirled over the rice pudding before it is served.\n\n* '''Pulut Inti''' is a kind of rice cake made from glutinous rice & coconut milk. It is steamed and topped with fresh grated coconut sweetened with palm sugar. It is traditionally wrapped in banana leaves folded into a pyramid shape. \n\n* '''Sago gula melaka''' is a simple sago pudding served with gula melaka (palm sugar) syrup and coconut milk.\n\n====Chinese cuisine====\n\nChinese food as eaten in Malaysia commonly originates from southern [[China]], particularly [[Fujian]] and [[Guangdong]].  While authentic fare that is relatively unchanged from its Mainland Chinese origins is certainly available, especially in fancier restaurants, the daily fare served on the streets has absorbed a number of tropical touches, most notably the fairly heavy use of '''chilli''' and '''belachan''' (shrimp paste) as condiments.  Noodles can also be served not just in soup (? ''tang''), but also \"dry\" (? ''kan''), meaning that your noodles will be served tossed with chilli and spices in one bowl, and the soup will come in a separate bowl.\n\n* '''Bak chor mee'''(肉脞面)is essentially noodles with minced pork, tossed in a chilli-based sauce with lard, ''ikan bilis'' (fried anchovies), vegetables and mushrooms.\n\n* '''Bak kut teh''' (肉骨茶), lit. \"pork bone tea\", is a simple-sounding soup of pork ribs simmered for hours in broth until they're ready to fall off the bone.  It's typically eaten with white rice, ''mui choy'' (pickled vegetables) and a pot of strong Chinese tea, hence the name &mdash; the broth itself doesn't contain any tea.  To impress the locals, order some ''you tiao'' fritters from a nearby stall and cut them up into bite-sized chunks to dip into your soup.  The port town of [[Klang]] is said to be original home of the dish.\n\n* '''Char kui teow''' (炒粿条) is a favourite noodle type at Penang. Some flat egg noddle fried with soya source, prawn, cockles, bean sprouts, chives &amp;  ''bak you'' (Pork's Oil), though this last ingredient is sometimes absent due to the popularity & demand of this dish from the Malays & Indians who traditionally shun pork.\n\n* '''Chee cheong fun''' (猪肠粉) is a favorite breakfast consisting of lasagna-type rice noodles rolled up and various types of fried meats including fishballs and fried tofu. The dish is usually topped with a generous amount of sauce.\n\n* '''Chwee kway''' (水粿) is a dish consisting of rice cakes topped with ''chai po'' (salted fermented turnips), usually served with some chilli sauce.\n\n* '''Fish ball noodles''' (鱼丸面) come in many forms, but the type most often seen is ''mee pok'',  which consists of flat egg noodles tossed in chilli sauce, with the fishballs floating in a separate bowl of soup on the side.\n\n* '''Hainanese chicken rice''' (海南鸡饭) is poached chicken served with rice cooked in chicken stock and fat, and tasty ginger and chilli dipping sauces. The chicken has a delicate taste, but it's the quality of the rice and the dipping sauces that connoseurs get passionate about. Perhaps better known in Singapore, there is an interesting local variant found in [[Malacca]] and [[Muar]], [[Johor]], with the rice cooked until it is sticky and rolled into balls.\n\n* '''Hokkien mee''' (福建面) refers to at least three separate dishes. In Kuala Lumpur, this gets you thick noodles fried in dark soy sauce, while in Penang you'll get a very spicy shrimp soup. Interestingly, neither of them bear any resemblance to the dish of the same name served in neighbouring [[Singapore]].\n\n* '''Kway chap''' (粿汁) is essentially sheets made of rice flour served in some brownish soup, accompanied by a plate of braised pork and pig organs (usually intestines).\n\n* '''Lok-lok''' (??) consists of skewers of fish, meat and vegetables, cooked in boiling broth and eaten with sauces, the most popular being the \"kuah kacang\", which interestingly is a Malay sauce made from peanuts & traditionally served with satay and ketupat (compressed rice cubes eaten during Eid).\n\n* '''Steamboat''' (火锅), also known as '''hot pot''', is do-it-yourself soup Chinese style.  You get a pot of broth bubbling on a tabletop burner, pick meat, fish and veggies to your liking from a menu or buffet table, then cook it to your liking.  When finished, add in noodles or ask for rice to fill you up.  This usually requires a minimum of two people, and the more the merrier.\n\n* '''Wantan mee''' (云吞面) is thin noodles topped with ''wantan'' dumplings of seasoned minced pork. Unlike the soupy Hong Kong version, it is usually served dry.\n\n* '''Yong tau foo''' (酿豆腐) literally means \"stuffed tofu\", but it's more exciting than it sounds.  The diner selects their favorites from a vast assortment of tofu, fish paste, seafood and vegetables and they are then sliced into bite-size pieces, cooked briefly in boiling water and then served either in broth as soup or \"dry\" with the broth in a separate bowl.  The dish can be eaten by itself or with any choice of noodles.  Essential accompaniments are spicy chili sauce and a distinctive brown sweet sauce for dipping.\n\n====Indian cuisine====\n[[Image:Roti Prata Curry Large.JPG|thumb|240px|''Roti canai'' (left) and ''roti telur'' (centre) with a side order of ''kari ayam'' (chicken curry)]]\n\nThe smallest of Malaysia's 'Big 3', the Indians have had a disporportionately large impact on the culinary scene, with the ''mamak'' (Indian Muslim, see below) stall having acquired in every Malaysian city and town, and  '''nasi kandar''' restaurants offering a wide variety of these to ladle onto your rice. Authentic Indian food in Malaysia includes typical South Indian specialties such as ''dosai'', ''idli'', ''sambhar'', ''uttapam''; as well as some north Indian meals like ''naan'' bread, korma, and tandoori chicken. In addition, however, a number of Indian dishes have been \"Malaysianized\" and adopted by the entire population, including:\n\n* '''Fish head curry''' is, true to the name, a gigantic curried fish head cooked whole until it's ready to fall apart.  The head itself is not eaten, as there's plenty of meat to be found inside and all around. Note that there are two distinct styles, the fiery Indian and the milder Chinese kind (the latter is sometimes served as a broth for vermicelli noodles).\n\n* \"Mamak-style\" '''mee goreng''' is a ubiquitous dish found at ''mamak'' stalls, a stir-fried noodle dish loved by Malaysians.\n\n* '''Nasi briyani''' (sometimes spelled ''nasi beriani'') is assembled by layering the flavorful rice with tender pieces of spiced-cooked lamb, mutton or chicken. At ''nasi kandar'' restaurants, it refers to rice that is cooked without the meat, and is merely a choice of rice [instead of plain steamed rice] to eat with your selection of curries and side dishes.  \n\n* '''Roti canai''' is the Malaysian adaptation of the South Indian ''parotta'', flat bread tossed in the air like pizza, fried in oil, and eaten dipped in curry. Eaten plain with sides of dal gravy, curry sauce or both, it is usually dubbed \"roti kosong\". Variations include include ''roti telur'' (with egg) and ''murtabak'' (stuffed with chicken, mutton or fish), ''roti boom'' (with condensed milk) and ''roti tisu'' (made very thin like tissue paper, and laced with caramelized sugar).  \n\n* '''Putu mayam''' is composed of vermicelli-like rice noodles usually mixed with shredded coconut and some jaggery.\n\n====East Malaysia====\n\nEast Malaysia, especially Sarawak, also offers a wide range of local dishes, but these are very rarely seen in peninsular Malaysia.  See [[Sarawak#Eat]] for details.\n\n=== Where to eat ===\n\nThe cheapest places to eat are '''hawker stalls''' and '''coffeeshops''', known as ''kedai kopi'' in Bahasa Malaysia or ''kopitiam'' in Chinese. These shops sell, besides coffee, many other types of food and drinks. Particularly popular and tasty are '''''mamak''''' stalls, run by Indian Muslims and serving up localized Indian fare like ''roti canai''. Most hawker stalls stay open till late and some even operate on shifts so you can find the same stall offering different food at different points throughout the day, and some ''mamak'' stalls are open 24/7. You can also do take away from any stall, just ask for ''bungkus'' (Bahasa Malaysia) or ''ta pao'' (Chinese). A hawker meal will rarely cost you over RM5. Hygiene standards in Malaysia, while not up to that of neighbouring Singapore, are still much better than China or the majority of South East Asian countries. Just be observant, and generally speaking, if a stall is patronised by locals, it should be safe to eat there. If in doubt, opt for food that is cooked to order, not food that has been left on a tray.\n\nOne step up on the scale is the '''''kedai makanan''''' or the more Western-style '''''restoran'''''. A type to look out for is the ''nasi kandar'' restaurant (also known as ''nasi campur'' or ''nasi padang''), with a vast range of curries and toppings to ladle on top of your rice.\n\n'''Seafood restaurants''' (''makanan laut'') are comparatively pricy but still excellent value by most standards; do check prices before ordering though. Local prawns are gigantic, Chinese-style steamed fish is a treat and crab served with sticky chilli sauce or salted egg yolk is particularly popular.\n\nLast but not least, some less adventurous options. '''Food courts''' in shopping malls are a good way to sample local delicacies in air-conditioned comfort, paying only a small premium over hawker prices. And yes, you can also find McDonalds, KFC, Pizza Hut and the usual suspects plus imitators throughout Malaysia.\n\n=== Dietary restrictions ===\n\nBeing a Muslim-majority country, finding '''halal''' food in Malaysia is easy, but most Chinese stalls and restaurants are ''not'' halal. Ask if in doubt.  Meals at Malay restaurants and Western fast food restaurants like McDonalds, Kentucky Fried Chicken, Pizza Hut are halal. Restaurants at major hotels are not certified 'Halal' as they serve alcohol as well, but they generally dont serve pork. Local Muslims will eat at Western, Chinese and Indian eateries if there is a halal sign on the walls. Most of the restaurants tend to display their halal certification or halal sign on their places.Halal certification was awarded and enforced by government agency usually JAKIM.\n\n'''Vegetarianism''' is well-understood by the Chinese and Indian communities (not so by the Muslim Malays and other indigenous minorities) and many restaurants or hawker stalls will be able to come up with something on request (DO state \"no meat, no fish, no seafood - ASK for vegetables and/or eggs ONLY\"), but don't rely entirely on menu descriptions: innocuous-seeming dishes like \"fried vegetables\" etc will often contain pork bits, shrimp paste (''belacan'', commonly used in Malay and spicy Chinese dishes), fish sauce, etc.  Indian restaurants usually have very good vegetarian selections - the ''roti'' (Indian flat bread - any kind; including roti canai, roti naan, capati, tosai) are good choices, and DO insist on being given ''dhal'' (lentil-based curry dip) lest you'll be given a fish curry dip. Purely vegetarian Chinese restaurants (often serving remarkable \"mock meat\" products made from tofu, gluten etc) are quite easy to find in big urban areas with a large ethnic Chinese population. Getting vegetarian food in rural areas, especially those near fishing villages or in Muslim/Malay-dominated regions, may be more difficult, but learning some basic Bahasa Malaysia vocabulary will go a long way to help you get your message across &mdash; see the [[Bahasa Malaysia phrasebook#Eating|Bahasa Malaysia phrasebook]]. Upmarket Western restaurants, such as those serving Italian cuisine will normally have some good vegetarian options.\n\n'''Veganism''' is rarely understood in this part of the world and is largely mistaken as a synonym for vegetarianism, yet the safest bet for a vegan is to patronize a Chinese Buddhist vegetarian restaurant (most Chinese vegetarian restaurants are essentially vegan and operated on Buddhist principles of non-killing and compassion, and thus they abstain from using dairy products, eggs, and the 5 fetid vegetables [onions, garlic, leeks, etc.] discouraged in Mahayana Buddhism). And if you're still feeling uneasy or unsure, do not hesitate to ask.\n\n== Sleep ==\n\n===Budget===\n\nBudget hotels and youth [[hostels]] are available in most cities and around most tourist destinations. As with most budget accommodations, some are more reliable than others. Be cautious when selecting budget accommodation to avoid places that house illegal vice activities.\n\nLarger cities will have YMCAs that are safe bets. Another noticeable budget hotel chain is Tune Hotels, [http://www.tunehotels.com/] an affiliate of the budget airline, Airasia. They are expanding and have hotels at numerous locations throughout the country\n\n===Mid-range===\n\nMid range hotels are readily available just about anywhere. Prices of 3-4 star hotels are upwards from RM100 and are generally reliable in terms of quality.\n\n===Splurge===\n\n5 star hotels, service apartments and resorts are located in larger cities like Kuala Lumpur, Penang, Johor Bahru, Kota Kinabalu and Kuching. Also, almost all islands have upscale resorts and spas for the wealthy traveller. Malaysia is renowned for having among the cheapest 5-star hotels in the world.\n\n== Drink == \n\nMalaysians like both coffee (''kopi'') and tea (''teh''), especially the national drink ''teh tarik'' (\"pulled tea\"), named after the theatrical 'pulling' motion used to pour it. By default, both will be served hot, sweet and with a dose of condensed milk; request ''teh o'' to skip the milk, ''teh ais'' for iced milky tea, or ''teh o ais'' for iced milkless tea. Drinking with no sugar at all is considered odd, but asking for ''kurang manis'' (less sugar) will ease the pain. However, if you really want no sugar at all, you can try asking for \"teh kosong.\"\n\nAnother peculiar local favourite is the kopi tongkat ali ginseng, a mixture of coffee, a local aphrodisiacal root, and ginseng served with condensed milk that's touted as an alternative to viagra and red bull combined and is usually advertised with a picture of a bed broken in half.\n\nOther popular nonalcoholic options include the chocolate drink Milo, lime juice (''limau''), and ''sirap bandung'' (a rose-flavoured milky drink). Freshly made fruit juices are also widely available, as well as a wide range of canned drinks (some familiar, some less so).\n\nTopically and, perhaps, politically incorrect, is a local drink comprised of white soya milk and black grass jelly (''cincau'') called a Michael Jackson and can be ordered at most hawker centre and local roadside cafes (\"mamak\") \n\n=== Alcohol ===\n\n[[Image:Gawai.JPG|thumb|Tuak is widely consumed during Gawai Dayak festival and Christmas Day.]]\nAlthough Malaysia has a Muslim majority, alcohol is available freely in restaurants, pubs, night clubs, convenient stores, supermarkets and even hawker stalls for the consumption of its non Muslim citizens & visitors. Tax-free islands such as ([[Labuan]], [[Langkawi]], [[Tioman]]) and duty free shops (for example in [[Johor Bahru]]), prices are comparatively cheap compared to other states.\n\nIn East Malaysia, particularly [[Sarawak]], ''tuak'' is a common affair for any celebration or festivals such as Gawai Dayak and Christmas Day. ''Tuak'' is made from fermented rice which sometimes sugar, honey or other various condiments are added. It is normally served lukewarm without ice. Visitors can choose from 'strong' flavour of tuak (which is normally being fermented for years), or 'mild' flavour (which sometimes just being prepared a week or even a day before). In [[Sabah]], cheap liquors are very widely available at most supermarkets and mini markets in the state. Other alcoholic drinks such as beer and whisky are also widely available. On the other hand, ''Tuak'' in [[Kelantan]] is also can be considered as a liquor since that it contains trace amount of fermented ''nipah'' or sap juice. The alcohol content in Kelantan ''tuak'' can easily reach 50% after 3 days from the time it was extracted.\n\n''Tapai'', consists of cassava that is fermented and eaten as a food (though the liquid in the bottom can also be drunk).\n\n== Learn ==\n\nMalaysia's universities are generally well-regarded and draw exchange students from near and far.\n\n*'''Universiti Malaysia Pahang''' (UMP), [http://www.ump.edu.my]. It is the best technological and engineering in Malaysia, located in the East Coast region of the country, Pahang. Divided into two campuses, in Gambang and Pekan, on which, the distance between the two is about 60 kilometres.\n\n*'''Tunku Abdul Rahman University''' (UTAR),[http://www.utar.edu.my]. Tunku Abdul Rahman University also known as Universiti Tunku Abdul Rahman is a premier private university in Malaysia, it provides programs including business, finance, accounting, medical, Chinese medicine, Chinese studies research, science, creative, and journalism.\n\n*'''Multimedia University''' (MMU), [http://www.mmu.edu.my]. It is Malaysia's first private university. Multimedia University (MMU) is one of the leading private universities in Malaysia with a reputation for innovative education, It all began with an invitation from the Malaysian Government to Telekom Malaysia Berhad, to establish the first private university in October 1996.\n\n* '''University Teknologi Malaysia (UTM), [http://www.utm.my/] '''University Teknologi Malaysia is one of the Malaysian Universities, specializing in engineering and techology.\n\n* '''University of Malaya''' (UM), [http://www.um.edu.my]. Malaysia's oldest university. It is widely recognised as the top university in Malaysia, and many prominent Malaysians are alumni of UM. \n\n* '''Universiti Putra Malaysia''' (UPM), [http://www.upm.my/]. Formerly known as Universiti Pertanian Malaysia is among the oldest in Malaysia. Used to focus on agriculture sector but now is the leading universiti in Malaysia in the field of biology, medical science and biotechnology. The only universiti in Malaysia that offer vetenarian degree.\n\n* '''Universiti Sains Malaysia''' (USM), [http://www.usm.my/en/]. The second university in Malaysia, more geared towards technical studies and it is one of three universities in Malaysia that have been identified as research-intensive universities in Malaysia.\n\n* '''Universiti Malaysia Sarawak''' (UNIMAS), [http://www.unimas.my]. Focused on Tourism, Biotechnology and Information Technology, has a strong relationship with Australian universities.\n\n* '''International Islamic University of Malaysia''' (IIUM), [http://www.iium.edu.my]. Private publicly-funded university in Malaysia, sponsored by eight different governments from the Organization of the Islamic Conference (OIC).\n\n* '''Universiti Kebangsaan Malaysia''' (UKM), [http://www.ukm.my]. The third public university formed in Malaysia, but the first to use Bahasa Malaysia, as the medium of instruction.\n\n* '''Universiti Kuala Lumpur''' (UniKL), [http://www.unikl.edu.my]. Malaysia's private university. Focused on engineering technology and information technology.\n\n*'''Limkokwing University of Creative Technology''' is Malaysia's premier private university for an education in creative technology. It has one of the most international student populations in the country.\n\n* '''Universiti Utara Malaysia''' (UUM), [http://www.uum.edu.my]. It is one of the famous Management School for tertiary education in Malaysia which is located in the northern Peninsular Malaysia at Sintok, Kedah. This campus comprises more than 21,000 of undergraduates. \n\nIn addition to this, several foreign universities have established campuses in  Malaysia, providing the opportunity for foreign education in a Malaysian atmosphere. Among them are Monash University, Swinburne University of Technology and Nottingham University.\n\n== Work == \nObtaining a working visa takes some effort. The easiest way to work in Malaysia is probably to work for an overseas company and get posted to Malaysia. The Malaysian Immigration Department website [http://www.imi.gov.my] has basic advice. In order to obtain a work permit, you need to have an offer from your future employer who will have to do the paperwork for you. It's very expensive and comes with many restrictions if a company wants to hire a foreigner and as such next to impossible. As stated above, a feasible way is to get transfered. Finding a job is otherwise unlikely unless you are getting married to a local and even then it remains difficult.\n\nAnother possibility to work in Malaysia is as a '''volunteer''', even though it is unpaid. Whether you want to express your love for animals or support the local community, you will get plenty of opportunities to do good in this country. To get an overview over all the volunteering possibilities in Malaysia, it's best to visit a [https://www.volunteerworld.com/volunteer-in-malaysia comparison platform].\n\n== Stay safe ==\n\n{{infobox|Emergency numbers|Central emergency number '''999'''}}\n\nDespite the existence of street crime such as bag snatching and pick-pocketing, violent crimes are mainly among gang and triad members. Crimes towards tourists are rare but still it is important to keep a close eye on valuable items. Generally, you are unlikely to be assaulted if you avoid deserted areas and use your common sense. Please rely on the policemen in Malaysia, because most of them take up their job seriously. It is not a problem when you want to communicate with the policemen, the English proficiency of the policemen in Malaysia is average, most of them can speak Bahasa Malaysia (Official Language) and English. \n\nWomen need to be a little more vigilant, especially if carrying a handbag or wearing jewelry, as snatch thefts are fairly common in large urban areas. Local women in major cities do not usually walk alone late at night unless absolutely necessary. Unfortunately kidnapping of young women and children does occasionally happen, but can usually be avoided by practicing reasonable caution.\n\n===Crime===\n\n{{warningbox|Malaysia treats '''drug offenses''' ''extremely'' severely.  The death penalty is '''mandatory''' for those convicted of trafficking, manufacturing, importing or exporting more than 15 g of heroin, 30 g of morphine, 30 g of cocaine, 500 g of cannabis, 200 g of cannabis resin and 1.2 kg of opium, and possession of these quantities is all that is needed for you to be convicted.  For unauthorized consumption, there is a maximum of 10 years' jail or a heavy fine, or both. You can be charged for unauthorized consumption as long as traces of illicit drugs are found in your system, even if you can prove that they were consumed outside the country, and you can be charged for trafficking as long as drugs are found in bags that are in your possession or in your room, even if they aren't yours and regardless of whether you're aware of them - therefore be vigilant of your possessions.\n\nMalaysia Custom will tax 30% over each item purchased in Malaysia although it may come with any proof/evidence.}}\n\n===Beware of Scratch and Win Scams===\n\nScratch and Win Scams are rampant in all over Malaysia. Victims are given reward tickets to scratch/tear/peel off on spot to see if they win prizes. In these cases, victims would be informed that they had won prizes in foreign lottery or lucky draws.\n\nThe scammers would ask victims to make advance payment if they wanted to claim their prizes. They would even offer victims car rides to withdraw the large sums of money, reported a local news source. After which, victims would realise that the prizes never existed or were of lower value than previously promised. \n\nReports on [[pickpockets]] and snatch-and-run thieves have been sometimes heard in large cities like Kuala Lumpur, Georgetown and Johor Bahru. As a general precaution, never carry your bags on the side facing the road & always walk facing the oncoming traffic. Additionally, walk a few feet deeper away from the roads. Women travellers should take extra precautions at night.\n\n\nDo note that in Malaysia, certain crimes are punished with caning. Being convicted of rape, vandalism, illegal entry, bribery, overstaying your visa, and other certain crimes could get you caned. '''This is no slap on the wrist'''! Strokes from the thick rattan cane are ''very painful'' and can take weeks to heal, and even scar for life. This technique also applies to [[Singapore]].\n\nCredit card fraud is a growing problem. Use cards only in reputable shops. \n\nNever bring any recreational drugs into Malaysia, even as a transit passenger. Possession of even minimal amounts can lead to a '''mandatory death sentence'''.\n\n===Traffic safety===\n\nDrunk driving is a serious offense and breathalyzer tests by the police are common.\nYou should not offer bribes at all - if found guilty you can be sentenced up to 20 years in jail! Anyone who tries to bribe public officials may be arrested on the spot and placed in a lock-up overnight to be charged for the offence in the morning. If this happens on a Friday or on eve of public holidays, you will find yourself spending a few nights in the lock-up as the courts are only open Monday to Friday. Do not let this dissuade you from requesting help - generally Malaysian police are helpful to tourists. You should just accept whatever traffic summons you are being issued.\n\nWhen on foot, be careful when crossing the street, as vehicles will often ignore pedestrian (zebra) crossings. Also, be wary of motorcycles who usually weave in and out of traffic, do not assume you can cross without looking left and right if the cars are at a standstill. Road bullying during accidents is still common so if you are involved in an accident be very careful when negotiating or dial 999 for help.\n\n===Other===\n\nSome taxis will refuse to use the meter, even though the official rate has changed recently and most taxis now have a sticker on the rear door that informs tourists that haggling is prohibited. Be aware that taxi drivers, sensing that you are a tourist, may drive around and take a very long route to reach your destination.\n\nIf using a taxi late at night, it is best to use the dial-a-taxi service as there have been incidents where taxis flagged down during those hours being fake/unregistered. \n\nPublic demonstrations are uncommon in Malaysia due to police crackdowns, but a number of anti-government demonstrations have been held recently. Should one occur it may be dealt with in a heavy-handed manner, so '''avoid them at all costs'''.\n\nAlternatively, you can download apps such as GRAB or UBER and use it in major cities and pay using credit card or cash. It is very convinient and easy to book and you will know the price in advance. It is way cheaper and more comfortable than taxis. GRAB is more popular than UBER in Malaysia and south-east asian region. It is also available for airport transfers and cheaper than taxis.\n\n== Stay healthy == \n\nTap water is drinkable straight off the tap as it is treated (depending on location), but even locals boil or filter it first just to be on the safe side. When travelling it is best to stick to bottled water, which is very affordable.\n\nIce in drinks might be made from tap water but nowadays, most restaurants and even roadside stalls use the cylindrical variety with a hollow tube down the middle that are mass-produced at ice factories and are safer to consume.\n\nHeat exhaustion is rare, but do consume lots of fluids, use a hat and sunscreen and shower often!\n\nPeninsular Malaysia is largely [[malaria]]-free, but there is a significant risk in Borneo especially in inland and rural areas.  [[Dengue fever]] occurs throughout Malaysia in both urban and rural areas, and can be avoided only by preventing [[mosquito]] bites. The mosquito that transmits dengue feeds throughout the daytime, and is most active at dawn and dusk. If you experience a sudden fever with aches and lethargy, seek medical attention immediately. Aspirin and ibuprofen should not be used until dengue fever has been ruled out.  Mosquito repellents (''ubat nyamuk'') are widely available.  Be careful with mosquito coils, which can easily start fires: set them on a plate or other non-flammable surface and extinguish them before going to sleep.\n\nHaze from burning vegetation in neighbouring Indonesia may come and go without warning from the months of May to August so travellers with respiratory ailments should come prepared.\n\nMost public washrooms make a small charge (generally between RM0.20-RM5.00, usually depending on the standard of the facilities) so keep some loose change to hand. If the condition of the sitting toilets is questionable, use the squatting toilets instead - both are usually available, and some believe that the latter are more hygienic and (if you can get used to them) are just as easy to use as sitting toilets. \n\nMalaysia is largely free from earthquakes as there are no nearby faultlines, though tremors can occasionally be felt when a major quake occurs in neighbouring Indonesia. Typhoons also generally do not occur. However, the Nov-Jan monsoon season often results in flooding due to torrential rains, and landslides are known to occur, most notably on the East Coast. Tsunamis are a rare occurence, though Penang and a few islands on the north of the West Coast were hit by the infamous tsunami in 2004.\n\nGovernment health care facilities are cheap but good, but many visitors prefer to seek out private medical care.  Private medical costs can be high and having [[travel insurance]] is a very good idea.\n\nYou can find specialist private doctors and clinics here. But if you are in an emergency, please call 999, the national emergency contact number.\n\n== Respect ==\n\n{{infobox|What's in a name?|- '''Malay''' names are usually given name + ''bin'' or ''binti'' (son/daughter) + father's name. ''Mohammed bin Abdullah'' would usually be called Mohammed by his friends, and Mr. Mohammed for business. Sometimes, the person's given name appears after the Mohammed or Abdul (example: ''Mohammed Faizal bin Abdul Nasser'') so, in such a case, he would usually be addressed as Faizal by his friends, and Mr. Faizal for business.<br>\n- '''Chinese''' place their family name first, so ''Tan Ah Heng'' is Mr. Tan for business and Ah Heng to his friends. Many have Western names, so he may also be known as ''John Tan''.<br>\n- '''Indian''' names are complex, but the south Indian (Tamil) names usually found in Malaysia have two patterns: either given name + ''a/l'' or ''a/p'' (''anak lelaki'' (son of)/''anak perempuan'' (daughter of)) + father's name, or father's initial + given name. Given names are often long and may be abbreviated, so ''Thirumurugan a/l Govindasamy'' may just be addressed as Thiru by his friends and Mr Thiru for business. The foolproof method is to ask how the person wants to be addressed.<br>\n- '''Other ethnic minorities''' have their own naming conventions. The foolproof method is to ask how the person wants to be addressed.|print=fullpage}}\n\nIt is advisable to dress respectfully, particularly in rural areas (wearing trousers or a long skirt, not shorts, and covering your shoulders is recommended but not essential). In more metropolitan areas such as Kuala Lumpur, Johor Bahru, Penang, and Ipoh, as well as East Malaysian states (Sabah and Sarawak), attitudes are more liberal.\n\nWhen entering a home or a place of worship, always take off your shoes. Also, never eat with your left hand, or give a gift with your left hand; and never point with your forefinger (you may use a closed fist with the thumb instead), point with your feet or touch a person's head.\n\nPublic showing of affection in larger cities is tolerated but might invite unnecessary attention from the public. In more rural areas it is frowned upon and is to be avoided.\n\nSwastikas are an ancient symbol commonly seen in Hindu and Buddhist temples. They are typically a reverse image of those used by Nazis and do not express similar sentiments or anti-Semitism, so Western visitors should not feel offended when seeing it in the homes of their hosts.\n\n===LGBT Travellers===\nHomosexuality is '''illegal''' and penalties are '''severe'''. Penalties can range from fines to whipping and 20 years imprisonment. \n\nDespite this, Malaysia welcomes a large number of people from the gay community per year into the country. If you refrain from public displays of affection, immodest dressing (or atypical dressing aka men wearing dresses) and public advocacy of LGBT issues then you will find little trouble from any authority.\n\n== Contact ==\n \n=== Internet ===\nMalaysia is one of the first countries in the world to offer 4G connectivity. Free Wi-Fi is easily available in almost all restaurants, fast-food outlets, shopping malls, City-wide wireless connections and in some hawker stalls. Prepaid Internet cards are also available to access wireless broadband, in some cafes.\n\nCustomers usually pay RM1.00 to RM5.00 per hour for Internet services in a cybercafe (depending on which city you're in). Internet connections offered in restaurants and cafes are usually free and more and more food outlets are offering this. These include all Starbucks and Coffeebean, and some McDonald's and Subway, and an increasing number of smaller places.\n\nKuala Lumpur International Airport (KLIA) also provides free Wi-Fi throughout the airport.\n\n=== Telephone ===\n\nThe country code for Malaysia is 60.\n\nTo call a Malaysian number:\n\n* '''From overseas''' dial the international access code, the country code for Malaysia, the area code without the \"0\", and then the phone number.\n\n* '''From outside the local area''' dial the full area code, followed by the phone number. There are no exceptions to this rule, except when using a mobile phone.\n\n* '''From within the local area''' just dial the phone number without any code.\n\n'''Mobile phones'''\n\nMalaysia also has four mobile telephone service providers, Maxis [http://www.maxis.com.my], DiGi [http://www.digi.com.my], Celcom [http://www.celcom.com.my], and U Mobile [http://www.u.com.my] which utilise codes '''012, 013, 014, 016, 017, 018, 019.''' Network connection in Malaysia is excellent. Mobile number portability has been implemented in Malaysia, meaning a code like 012 that traditionally belonged to Maxis, can now be a DiGi subscriber. Mobile networks utilize the GSM 900 and 1800 systems. 3G (WCDMA), EDGE & HSPDA networks available in larger towns. International roaming onto these networks is possible if your operator allows it\n\nMalaysian SIM cards will usually come with free '''ringback tones''' for one month. Explain to your callers that you have it, otherwise they will assume that they have dialed the wrong number.\n\nTo call a Malaysian mobile number:\n\n* '''From overseas''' dial the international access code, the country code for Malaysia, the mobile telephone provider's code without the \"0\", and then the telephone number.\n\n* '''From within Malaysia''' dial the provider's code with the \"0\", and then the telephone number.\n\n* '''From mobile phone to mobile phone within Malaysia''' dial the provider's code with the \"0\", and then the telephone number. Although you can drop the provider's code if the two phones share the same provider, you will still get through if the provider's code is dialled.\n\nTo call from Malaysia to another country:\n\n* '''From a landline''' dial the international access code \"00\" followed by the country code and the phone number.  For example, dialing the United States from Malaysia you would dial 001 followed by the US area code and phone number.  On the Maxis network, take advantage of 50% IDD rates via IDD132, which doesn't require any registration, just dial \"132\" prior to the the \"00\".  \n\n* '''From a mobile phone''' same as from a landline (above).  An alternative, and simpler, approach on many mobile phones is to press & hold the zero button to enter a \"+\" (plus sign) before the country code and phone number.  The \"+\" represents (in any country) the appropriate international access code. On the Maxis network, take advantage of 50% IDD rates via IDD132, which doesn't require any registration, just dial \"132\" prior to the the \"00\" and note that you do not use the \"+\" symbol using this method.\n\n*If you are staying for a period, it is worth getting a Prepaid SIM card. Besides the big telco: Digi, Maxis, Celcom, there's MVMO - Mobile Virtual Network Operator that 'piggy back' the big telco's network but offer cheaper rates. eg U Mobile, Tune Mobile, Tron, etc. Most operators operate a tiered system where your credit is available a certain amount of days. eg RM5 lasting 5 days, RM30 lasting 50 days and RM50 lasting 75 days. An exception is the new MVMO, Tron, which offers 365 days validity on all balance. For rates comparison[http://savemoney.my/cheapest-prepaid-plans-comparison-of-prepaid-plans-in-malaysia/ Comparison of Prepaid]\n\n=== Postal services ===\n\nMany international courier services like Fedex, DHL and UPS are available in towns and cities but the main postal service provider is Pos Malaysia [http://www.pos.com.my] which reliably provides postal services to most countries in the world.\n\nPostage rates in Malaysia are cheap. Much much cheaper than Thailand ,Singapore or Vietnam, and surface post is available as well. In addition the mail is reliable and trustworthy.\nWhen posting, do not seal the box. This is to allow for inspection in case illegal items are posted this way.\n\nA local alternative to the international courier companies mentioned above is the Pos Laju, which provides just as reliable a service but at a fraction of the costs!\n\nNon-urgent letters and postcards can be dropped in postboxes inside post offices or red postboxes found outside post offices and along main roads. If there are two slots in a postbox use the one that says \"lain lain\" for international post.\n\nPost offices are open from 8AM to 5PM daily except Sundays and public holidays, although a few in Klang Valley stay open till 10PM. In the states of Kedah, Kelantan and Terengganu they are closed on Fridays and public holidays.\n\n=== Media ===\nThere are eight main radio stations in Malaysia:\n*Klasik Nasional FM (98.3) - Malay\n*TraXX FM (90.3) - English\n*Ai FM (89.3) - Chinese\n*Minnal FM (92.3) - Indian\n*Asyik FM (91.1) - Local languages\n*Hot FM (97.6) - Malay\n*Fly FM (95.8) - English\n*One FM (88.1) - Chinese\n\nMost radio stations in Kuala Lumpur broadcasts 24 hours a day. There are many local radio stations (both private and government) in the countryside. Most local radio stations do not broadcast 24 hours a day. The local radio stations in cities broadcast until midnight, and in towns until 8 or 9 pm. Radio jamming is common in Malaysia, and radio stations do not have the RDS, so you have to carefully listen to the ID to identify whether it's the one you want to listen or not.\n\nThere are seven television channels in Malaysia:\n*RTM 1 (Channel 5) - broadcasts in Malay, broadcasting hours: 6AM-1AM.\n*RTM 2 (Channel 8) - broadcasts in English, broadcasting hours: 24 hours.\n*TV3 (Channel 12) - broadcasts in Malay and English, broadcasting hours: 24 hours (since November 2011).\n*ntv7 (Channel 21) - broadcasts in Malay and Chinese, broadcasting hours: 7AM-2AM.\n*8TV (Channel 25) - broadcasts in Chinese, broadcasting hours: 8AM-2AM.\n*TV9 (Channel 33) - broadcasts in Malay, broadcasting hours: 7AM-1AM.\n*Alhijrah (Channel 55) - broadcasts in Malay and Arabic, broadcasting hours: 12PM-12AM.\n\n{{isPartOf|Southeast Asia}}\n\n[[de:Malaysia]]\n[[eo:Malajzio]]\n[[es:Malasia]]\n[[fi:Malesia]]\n[[fr:Malaisie]]\n[[hu:Malajzia]]\n[[it:Malaysia]]\n[[ja:?????]]\n[[nl:Maleisië]]\n[[pl:Malezja]]\n[[pt:Malásia]]\n[[ro:Malaezia]]\n[[ru:????????]]\n[[sv:Malaysia]]\n[[zh:????]]\n[[wts:Category:Malaysia]]\n\n\n[[WikiPedia:Malaysia]]\n[[World66:asia/southeastasia/malaysia]]\n\n\n{{outline}}\n{{countryguide}}"
        }
    }
}