{
    "parse": {
        "title": "Mali",
        "pageid": 612,
        "wikitext": {
            "*": "{{pagebanner|Mali Banner.jpg}}\n\n\n{{warningbox|As of 2018, travel to Northern Mali remains extremely dangerous and is therefore '''strongly discoraged.''' Violent crime, such as kidnapping and armed robbery, is common in the regions of northern and central Mali. Violent crime is a particular concern during local holidays and seasonal events in Bamako, its suburbs, and Mali’s southern regions. Roadblocks and random police checkpoints are commonplace throughout the country, especially at night.Terrorist and armed warlord groups continue plotting kidnappings and attacks in Mali. They may attack with little or no warning, targeting night clubs, hotels, restaurants, places of worship, Western diplomatic missions, and other locations frequented by foreigners.(''10 May 2018'') |australia=http://smartraveller.gov.au/zw-cgi/view/Advice/Mali |us=http://travel.state.gov/content/passports/english/alertswarnings/mali-travel-warning.html |uk=http://www.gov.uk/foreign-travel-advice/mali |canada=http://travel.gc.ca/destinations/mali |nz=http://www.safetravel.govt.nz//mali |southafrica= |india= |ireland=http://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/mali/}}<br clear=\"all\" /> \n\n{{quickbar\n| image=Great Mosque of Djenné (cropped).jpg\n| caption=Great Mosque of Djenné\n| flag=Flag of Mali.svg\n| location=Mali in its region.svg\n| capital=[[Bamako]]\n| government=Republic\n| currency=CFA franc (XOF)\n| area=1.24 millionkm²<br />''water: 20,000km²<br />land: 1.22 millionkm²''\n| population=11,716,829 (July 2006 estimate)\n| language=[[French]] (official), [[Bambara]] 80%, numerous African languages\n| religion=Muslim 90%, indigenous beliefs 9%, Christian 1%\n| electricity=220V, 50Hz (European plug)\n| callingcode=+223\n| tld=.ml\n| timezone=UTC\n}}\n\n[http://www.le-mali.com/omatho/index.htm '''Mali'''] is a landlocked country in the [[Sahel]], bordered by [[Algeria]], [[Niger]], [[Burkina Faso]], [[Cote d'Ivoire]], [[Guinea]], [[Senegal]], and [[Mauritania]]. Mali is a developing nation, and remains one of the poorest countries in the world. However, it has some incredible sights, including four UNESCO World-Heritage sites, and the historic city of [[Timbuktu]].\n\n==Understand==\nThe Sudanese Republic and [[Senegal]] became independent of France on 22 September 1960 as the Mali Federation. Senegal withdrew after only a few months, and the Sudanese Republic was renamed Mali. The country was then governed by dictatorship until 1991. In 1992 the country's first democratic presidential elections were held.\n\nJust under half the population is less than 15 years old. The great majority of Malians are Muslim, some also practice indigenous beliefs, and a tiny number are Christian. Around 10% of the population is nomadic. Most Malians work in agriculture and fishing.\n\nFestival in the Desert takes place in January on the sand northwest of Timbuktu.  Three days of amazing music, under the stars and the moon, tiny tents, camel races, and more music and dancing.\n\n===History===\nMali was once part of three famed West African empires which controlled trans-Saharan trade in gold, salt, slaves, and other precious commodities. These Sahelian kingdoms had neither rigid geopolitical boundaries nor rigid ethnic identities. The earliest of these empires was the Ghana Empire which expanded throughout West Africa from the 8th century until 1078. \n\nThe Mali Empire later formed on the upper Niger, and reached the height of power in the fourteenth century. Under the Mali Empire, the ancient cities of [[Djenné]] and [[Timbuktu]] were centres of both trade and Islamic learning.  The empire later declined, ultimately being supplanted by the Songhai Empire. The Songhai people originated in current northwestern [[Nigeria]]. In the late 14th century, the Songhai gradually gained independence from the Mali Empire and expanded until eventual collapse largely due to a Moroccan invasion in 1591. The fall of the Songhai Empire marked the end of the region's role as a trading crossroads. Following the establishment of sea routes by European powers, the trans-Saharan trade routes lost significance. \n\nIn the colonial era, Mali fell under the control of the French beginning in the late 19th century. By 1905, most of the area was under firm French control as a part of French Sudan. In early 1959, Mali (then the Sudanese Republic) and [[Senegal]] united to become the Mali Federation and gained independence from France on June 20, 1960. Senegal withdrew from the federation in August 1960, which allowed the Sudanese Republic to form the independent nation of Mali on September 22, 1960.\n\n===Climate===\nThe country's climate ranges from tropical savannah (trees and grass, with tree density increasing as one travels south) in the south to arid desert in the north, with Sahel in between. Much of the country receives negligible rainfall; droughts are frequent. Late May or early June (depending on how north one is) to mid or late October or early November is the rainy season. During this time, flooding of the Niger River is common, creating the Inner Niger Delta. After the rainy season is a cooler period when many plants are still green; this is from early November to around early February. From mid February until the rains start in May or June is the hot, dry, period, with daytime temperatures reaching maximum in March and April. This time of year is hot and extremely parched.\n\n==Regions==\n===Southern Mali===\n{{Regionlist\n| regionmap=Mali regions map.png\n| regionmaptext=\n| regionmapsize=upright=2\n\n| region1name=[[Kayes (region)|Kayes]]\n| region1color=#9da1c4\n| region1items=\n| region1description=\n\n| region2name=[[Koulikoro (region)|Koulikoro]]\n| region2color=#92c6a8\n| region2items=\n| region2description=By far Mali's most populous province, owing to the fact that it houses the capital, [[Bamako]]\n\n| region3name=[[Mopti (region)|Mopti]]\n| region3color=#d6ba78\n| region3items=\n| region3description=Most of Mali's travel riches are concentrated in this region: unique rock formations at [[Hombori]], the architecture of Djenné, and the unbelievable escarpment villages of [[Dogon Country]]\n\n| region4name=[[Segou (region)|Segou]]\n| region4color=#cba78a\n| region4items=\n| region4description=\n\n| region5name=[[Sikasso (region)|Sikasso]]\n| region5color=#bb95b6\n| region5items=\n| region5description=\n\n}}\n\n===Northern Mali===\n{{Regionlist\n| regionmap=\n| regionmaptext=\n| regionmapsize=\n\n| region1name=[[Gao (region)|Gao]]\n| region1color=#d0d398\n| region1items=\n| region1description=Bordering Niger, this region has ethnic Songhai, Tuareg, Tadaksahak, and Zarma. Arid, but not as arid as places farther north.\n\n| region2name=[[Kidal (region)|Kidal]]\n| region2color=#c0ce98\n| region2items=\n| region2description=Mali's most remote Saharan region, with a small population of Tuareg nomads, and the incredibly remote annual Saharan Nights festival in [[Essouk]]\n\n| region3name=[[Timbuktu (region)|Timbuktu]] (''Tombouctou'')\n| region3color=#c4bfa4\n| region3items=\n| region3description=The name isn't the only reason to visit; the town itself is a unique Tuareg desert trading center, and nearby is the magical Festival of the Desert in [[Essakane]]\n\n}}\n\n==Cities==\n* [[Bamako]] — the booming capital and largest city by far, fastest growing city in Africa, with a good claim to be the music capital of West Africa\n* [[Gao]] — small city on the Niger in the far east of the country, one time capital of the Songhai Empire, and home to the Tomb of Askia\n* [[Kayes]] — Mali's westernmost big city, by the border with [[Senegal]], and best known for being the hottest continuously inhabited location in [[Africa]]\n* [[Kidal]] — a remote Tuareg city, with notoriety as a centre of the Tuareg rebel movement and for Al Qaeda activity\n* [[Mopti]] — a city across three islands in the middle of the Niger; gateway to [[Dogon Country]]\n* [[Ségou]] — Mali's third largest city and one-time capital of the Bamana Empire\n* [[Sikasso]] — Mali's second largest city and one-time capital of the Kénédougou Empire\n* [[Timbuktu]] — the legendary Saharan city of gold, trans-Saharan trade, and Islamic scholarship is nowadays a (fairly commercialized) centre of Tuareg culture.\n\n==Other destinations==\n*[[Adrar des Ifoghas]] — a sandstone plateau in the Sahara home to rock paintings, salt mines operated for centuries, and a surprising array of wildlife.\n*[[Dogon Country]] —a trek through this landscape of scattered cliff-side villages is not to be missed by any Mali visitor. The famous [[Bandiagara Escarpment]] is a World Heritage Site\n*[[Djenne]] — once a religious and commercial center to rival Timbuktu, this small town of multi-storey mud buildings is quite a sight. It was declared World Heritage by UNESCO.  Seeing Djenee from a rooftop offers an intriguing and unusual landscape, with its soft texture, rounded lines and melancholic colouring.  It also features the largest mosque in the world made completely in mud, which is restored every year by the community after the rainy season.\n* The '''Niger Inland Delta''' where the Niger splits into many rivers across a broad floodplain, which forms a giant lake on the edge of the desert during the rainy season.\n\n==Get in==\nVisas are not required for citizens of [[Algeria]], [[Andorra]], [[Benin]], [[Burkina Faso]], [[Cape Verde]], [[Chad]], [[Côte d'Ivoire]], the [[Gambia]], [[Ghana]], [[Guinea]], [[Guinea-Bissau]], [[Liberia]], [[Macau]], [[Mauritania]], [[Monaco]], [[Morocco]], [[Niger]], [[Nigeria]], [[Senegal]], [[Sierra Leone]], [[Togo]] and [[Tunisia]]. For all other countries, a visa must be obtained before arrival to enter Mali. An invitation is required (copy of hotel reservations or company letter explaining purpose of trip) to obtain the visa. For [[U.S.]] citizens, the fee is USD131 regardless of the length of stay (up to 5 years). For other citizens, a visa costs: USD80 (3 month, single entry), USD110 (3 month, multiple entry), USD200 (6mo, multiple entry), USD370 (1 year, multiple entry).\n\nIt is possible to get a one month visa from the Malian embassy of Conakry for the GNF equivalent of 10€. Bring 2 photo, your passport, come in the morning to fill a form and you will get your visa in the afternoon. The embassy is located 200m away from the locally known Hotel Camayenne.\n\n===By plane===\nAir France flies daily non-stop from Paris-Charles de Gaulle to [[Bamako]] (and return). Royal Air Maroc (RAM) is a little cheaper than Air France and has daily flights from Europe and New York via [[Casablanca]] in [[Morocco]]. There are also smaller companies, such as [http://www.point-afrique.com Point Afrique], who fly cheaply to & from Mali in the busy tourist season. Both Air France and RAM unfortunately arrive and depart in the middle of the night - so even if you are planning a budget trip it may be worth splurging for a nice hotel the first night where you can make real reservations and maybe even get picked up at the airport.\n\nMany African and pan-African airlines fly into [[Mali]], for example: Air Mauritania, [http://www.Tunisair.Com.Tn/ Tunisair], and numerous others. Some of these airlines also have feature connections to Mopti.\n\nThe airport is about twenty minutes drive from the centre of [[Bamako]]. There are fixed rates for taxis to different parts of town: to find them, cross the roadway in front of the airport and go the the right-hand end of the block of kiosks. You will see a group of taxi drivers and a board with prices. As at August 2007, the price was XOF7500 (around USD15).\n\nHowever, if you know the local language enough, you might be able to bargain the official price down to XOF4000 or even XOF3000, especially if you arrive during the day. Make sure you board an official taxi though (see the \"Stay Safe\" section below). There is even well-hidden restaurant: follow the exit road past the barrier, and it is on the right, surrounded by trees, about 50m from the terminal building. They're very friendly and serve basic but filling and tasty snacks. For getting back to the airport from Bamako, try negotiating hard and you may get a rate significantly cheaper than the set rates for the airport to Bamako.\n\nIf you fly Royal Air Maroc, beware that Casablanca Airport is notorious for opening checked-in bags and removing valuables. Also luggage can arrive late.\n\nAs is common with many other airports, there will be people trying to push you into unauthorised taxis and to change money some are even allowed into the airport terminal itself, avoid them.\n\n===By train===\nThe only rail line, between Bamako and [[Dakar]], has not operated since the summer of 2009. For more info, see [http://www.seat61.com/Senegal.htm this page].\n\n===By car===\n{{infobox|From Europe|From Europe one has to cross the straits of [[Gibraltar]], [[Morocco]], [[Western Sahara]] and [[Mauritania]]. There are no longer any problems crossing Western Sahara along the coastal road. You will need to have your car and passport information ready to hand over at the various checkpoint however. There is now tarmaced roads all the way from Europe to Bamako and on to Gao (apart from 3 km at the border between Western Sahara and Mauritania).}}\n\nThere are several ways to get to Mali by car. \n\nThe most popular routes are from Senegal (especially since the Dakar-Bamako trains stopped) and Burkina Faso. The road from Gao to Niamey has recently been paved and a bridge is being built in Gao so the entire journey from Niamey to Bamako can be completed on paved (if not remote) roads.\n\nThere are also decent land crossings from Mauritania (recently paved) & Guinea. The Ivoirian crossing leads into a region of northern Cote d'Ivoire controlled by rebels and, while fairly safe, will lead you through countless roadblocks and \"officials\" demanding bribes; if travelling to southern Cote d'Ivoire, you're better off travelling through Burkina Faso & Ghana.\n\nThere is a remote desert crossing with Algeria near Tessalit, but it is dangerous (prone to banditry and used for smuggling) and remote. It may be closed to tourists; even if not, the Algerian side is dangerous (banditry and al Qaeda extremists!) and requires a military escort.\n\n===By bus===\nIt is possible to reach Mali by bus directly from a variety of African cities. These include, but are not limited to, [[Dakar]], [[Ouagadougou]], [[Abidjan]], [[Niamey]], & [[Accra]].\n\nThere is public transport almost all the way from Europe to Mali be it buses or bush-taxis. The only exception is from Dakhla, Western Sahara, to Noudhibou, Mauritania where you can easily get a ride with a Mauritanian trader. \n\n===By boat===\nMali has two large rivers that are navigatable at least part of the year, both of which cross into neighbouring countries, although only the Niger has much in the way of pirogues.\n\n*The '''Senegal River''' crosses into Mali from [[Guinea]] in the south and follows a northwest course into [[Senegal]].\n\n*The '''Niger''' crosses into, appropriately enough, [[Niger]]. Large boats are only active August-November and do not continue far past the border, but small ''pirogues'' regularly ply between Gao and Niamey with many stops along the way.\n\n==Get around==\n\n===By bus===\nThe main cities along the paved road into the north are connected via bus (Bamako, Segou, San, Mopti, Gao). A separate paved loop runs through the south (Bamako, Bougouni, Sikasso, Koutiala, Segou) There are many different companies with different schedules but they all have more or less the same prices. Normally a ride to Mopti (600km, half the way up), endures approximately nine hours; a ride to Gao at least 12. All times are very rough, however, and few bus companies will even give you an estimated arrival time as different drivers drive different speeds and it is not improbable that the bus breaks down and needs a repair or stops to help another bus. It is usually possible to make a reservation several days before, recommended during the tourist season, though one rarely has a problem just showing up 30-60 minutes before the bus leaves. More reliable companies include Bittar, Bani and Banimonotie (Sikasso region) among others.\n\n===By taxi brousse===\nTo get around one can take the \"Taxi - Brousse\", the bush taxis. They are the main connection between towns which aren't connected via bus. They are very slow and they sometimes break down or stop to help other broken down taxis. So sometimes the ride takes longer than expected. Unlike the buses, these rarely run on a set schedule, so you generally just need to show up at the station (in a larger town) or sit by the roadside (in smaller villages) and wait for the next to come along - locals may be able to give you some idea what to expect.\n\n===By taxi===\nIn any larger city, taxis will be plentiful and are usually an easy way for the tourist to get where they are going without trying to figure out the local public transport system (if one even exists). Be prepared to bargain, as they will generally try to overcharge you - in Bamako XOF1000 should get you anywhere in the city during the day (or up to XOF1500 at night), while crossing the river will be XOF1500-2000. Also, tell the driver clearly if you do not know the location of the place you want to go, as they are rarely forthcoming about admitting that they don't know it and will often expect you to give directions, especially if it is not a popular or common destination.\n\n===By private car===\nA good option for a larger group or travellers who value comfort over economy is to rent a private car. A 4x4 is strongly recommended if you will be leaving the main highways (this includes the trip to Timbuktu). There are very few asphalt roads, and they are all single-carriageway outside towns, though most are in good condition. One leads into the North of the country (Bamako, Segou, San, Mopti, Gao), another branches off after Segou to cross the Niger at the Markala dam and goes as far as Niono, while another goes from Bamako to Sikasso and on into Ivory Coast. There are private people who rent out their 4x4 cars for a ride (in which case make sure you've got insurance and a ''carnet de passage'', and plenty of petrol), but generally renting a car means renting a car and driver. This is strongly recommended as Malian roads and drivers can be unpredictable and the vehicles unreliable (better to have the driver figure out what that loud rattle is or why the engine started smoking!).\n\nTravel within Bamako can be difficult for the business traveller and leisure tourist alike. One of the best options is to rent a car with a chauffeur. This can be done on a by-day basis and is an enormous help for someone that is new to the city. When trying to visit numerous places in one day, it becomes difficult to rely on the local taxi system. The chauffeur is a local resident and will know most of the names of the places that you need to go. There is no hassle in finding a parking spot as the chauffeur can wait for you while you attend to the business at hand.\n  \nFor the tourist, this option can be your solution to seeing the city of Bamako in a care-free manner. Trips out of the city are available as well, although the fare can be somewhat higher than intra-city rates. Gas is an additional cost to the renter. A distinguished man by the name of Aldiouma (pronounced al-jew-ma) Togo runs a classy operation is open to negotiation for rates. Usually around XOF25,000-30,000 per day for intra-city use. Slightly less than double that fee for extra-city travel. His info: Aldiouma Togo: Cell: +223 642-6500 Home: +223 222-1624 [mailto:togoaldiouma@yahoo.fr togoaldiouma@yahoo.fr]\n\n===By plane===\nIt is possible to travel across Mali by plane, as numerous companies have sprung up in recent years. It is possible to fly (usually from Bamako) to cities such as: Mopti, Timbuktu, Kayes, Yelimané, Gao, Kidal, Sadiola, and others.\n\nThe planes, typically, are Czech turboprops (LET-410s) and small Russian jetliners (Yakovlev YAK-40s). Air travel in Mali is fast but, compared to a bus ride, expensive. It is not, however, foolproof - often you are at the mercy of the carrier, who may choose not to fly on a certain day if too few passengers show up! You can generally get tickets at the airport before flights, however the best bet is to book a ticket in advance. \n\nSociété Transport Aerienne (STA) and Société Avion Express (SAE) are the two most popular, and most reliable, carriers.\n\n===By boat===\nIt is possible to travel around Mali by boat, however this is very seasonal. The most common option, only really possible in the wet season, is a barge  to/from Timbuktu. There are also very small boats, \"pirogues\" in French, which are available to be hired almost anywhere - they are essentially large canoes.\nWhen the big boats are not running you can still charter a pinasse (like a big, motorised pirogue). Or use one of the public pinasses. These will run for another 3 months or so before the water levels being too low for them as well.\nYou can navigate the river all the way from near Bamako to Gao, though the level drops more rapidly in the portion between Bamako and Mopti.\n\n==Talk==\n[[French]] is the official language, but [[Bambara]] (or Bamanakan in the language itself), along with numerous other African languages (Peulh/Fula, Dogon, and Tamashek, the language of the Tuareg people), are spoken by 80% of the population. Few people speak French outside bigger towns, and even Bambara gets rare in some regions. Very few people speak English.\n\n==See==\n{{disclaimerbox|Tragically, the famous shrines of Timbuktu and the Muhave have largely been destroyed by a radical Islamist group during their occupation of Timbuktu in June/July 2012. There is talk of rebuilding these sites after the rebels have been driven out, but for now what is—arguably—Mali's greatest attraction lies in ruins. [http://www.bbc.co.uk/news/world-africa-18785895 article] The tomb of Askia in Gao has also reportedly been destroyed. Information found on Wikitravel, as well as most guides and other publications, may not have been updated since these events took place.}}\n'''The Great Mosque'''\nThe Great Mosque is made completely of mud, was made in 1906, and it has five stories and three towers.  Every spring the people replaster the Mosque.\nRegretfully, entrance to non-muslims is not allowed.  Apparently this prohibition is a consequence of a fashion photo-shoot more than 10 years ago, which was regarded by the locals as \"pornographic\". \n\n[[Image:Guelta.jpg|thumb|upright=1.3|A guelta in the [[Adrar des Ifoghas]].]]\n\n==Do==\n\n==Buy==\nThere are plenty of great crafts in Mali. Various ethnic groups have their own, trademark masks. There are some great musical instruments; blankets; bogolas (a type of blanket); silver jewellery and leather goods. The Touareg people, in particular, craft great silver and leather goods, including jewellery, daggers, spears, swords and boxes. Buying some local music makes also a good souvenir — some of the world's best musicians are from Mali.\n\nATMs are found at most every bank in Bamako. BDM banks have ATMs for VISA cards. The only ATM for Maestro/MasterCard is Banque Atlantique, across the river on the eastern bridge.\n\n==Eat==\nThe most universal Malian dish is rice with sauce (often peanut \"tiga diga na,\" tomato/onion/oil, or leaf/okra based - usually with some fish or meat if purchased or prepared for guests). \"To,\" a gelatinous corn or millet food served with sauce, is another Malian classic, though more a village food than something most tourists would encounter. In the north, couscous is also quite common.\n\nIn the largest cities, decent \"western\" restaurants can be found, charging near western prices. Bamako even has good Chinese, Vietnamese, Italian, Lebanese and more. In smaller places, the standard Malian restaurant serves chicken or beef with fries and/or salad - usually edible and affordable, but boring and not particularly Malian. The better places in the more touristy areas may also have some local specialities. \"Street food\" is a lot more fun (and super cheap) - breakfast will be omelet sandwiches, lunch is usually rice with a couple of sauces to choose from, and dinner presents many options including beans, spaghetti cooked in oil and a little tomato, potatoes, fried rice, chicken, meatballs, beef kebabs, fish, and salad. You can find little table along the road sides and near transport centres.\n\nSnacks you may find for sale include little cakes (especially in bus stations), various fried doughs (either sweet or with hot sauce), peanuts, roasted corn if in season, sesame sticks, and frozen juices in little plastic sacks. Fresh fruit is widely available and always delicious. Some of the best are mangoes, papaya, watermelon, guavas, bananas and oranges - the particular selection depends on the season.\n\nOf course, as in any tropical, underdeveloped country, food borne disease is a major concern for the traveller. The main culprits for diarrhoea are untreated water (especially in rural areas) and fruits and vegetables which have not been peeled or soaked in bleach water - salads (even in fancy restaurants!) are likely to cause problems. You should also be sure any food (especially meat) is thoroughly cooked - generally more of a problem with Western food in restaurants than with Malian foods (which are usually cooked for hours). Drink bottled water, and talk to your doctor about bringing an antibiotic to treat diarrhea that is severe or does not improve over a couple days.\n\n==Drink==\nThe legal drinking/purchasing age of alcoholic beverages is '''18'''. However because Mali is a predominately Muslim nation, many locals discourage anyone from drinking alcohol. '''There have been reports of locals and tourists alike being arrested and beaten for drinking alcohol.'''\n\nTreat tap water with suspicion. It is often so heavily chlorinated that one suspects few bugs could possibly survive in it. But short-term visitors will be safer with bottled water. There are several cheap local brands, but be warned that they are only drunk by foreigners and wealthy Malians: don't rely on finding bottled water in shops patronised by \"ordinary\" Malians. Soft drinks such as Coca-Cola or Fanta are more widely available and safe. But remember that Coke will make you want to go to the toilet, and so may leave you more dehydrated than before you drank it - a serious problem in this stunningly hot country.  \nStreet vendors sell water and home-made ginger and berry drinks in little plastic bags.  They are often iced which makes them very refreshing in the heat.  Generally, you shouldn't drink these without treating them first.  \nHowever, one which is called \"bissap\" in French and \"dabileni\" (\"red hybiscus\") in Bambara, is made from hibiscus flowers that are boiled during preparation, and so generally is safe to drink.  It is a particularly delicious non-alcoholic drink you shouldn't miss.  In Bamako, it is possible to purchase at most corner stores treated water in small plastic bags for XOF50;  these are much cheaper, and of course more environmentally friendly, than bottles.  The bags are marked with a brand name;  be careful not to mistake them for the tap water that is sold in unmarked plastic bags by street vendors.  Also widely sold in this way is sweet milk and yoghurt, which are normally clean because the bags are industrially filled. Fresh milk can also be bought from buckets at the roadside in some villages, although it should always be thoroughly boiled before drinking as it can carry tuberculosis bacteria (often Malians do this before selling, but it is safer to do it yourself or at least ask).\n\n==Sleep==\n{{disclaimerbox|Because of the dramatic decline in the number of tourists/visitors due to the conflict in the north, many hotels have closed across the country...even high-end ones. This includes some of the hotels in Mali listed on Wikitravel pages. Since this is likely a temporary closure until tourist numbers bounce back, closed hotels haven't been deleted from lists of hotels in Mali (on city pages). When travelling to Mali, travellers should keep in mind that the hotel where they plan to stay may be closed and plan appropriately. (July 2012)}}\nThere are various types of accommodation options of various prices and qualities. You will pay USD60-100 per night (and up) for a what would be a decent to nice hotel by western standards. At the other end of the spectrum you can pay about USD5-10 per night for a bed or mattress (usually with mosquito net and sheets) in a room or on the roof. Such places will usually have toilets and showers in a shared facility (think campsite camping with less gear). All tourist areas have hotels or auberges and many places will also have homestays. Sleeping on the roof terrace, if available, is not only the cheapest option but also usually the coolest and gives you the pleasure of sleeping under the stars (which are incredibly bright outside of Bamako because there is so little light pollution) - just use your mosquito net and be prepared to wake to prayer call at 05:00.\n\n==Learn==\nMali has numerous musical instruments you can learn. In particular it is a popular place to learn how to play various drums (bongo, djembe,...)\n\n==Work==\nMali is one of the poorest countries in the world. the average worker's annual salary is approximately USD1,500 However, seasonal variations lead to regular temporary unemployment of agricultural workers\n\n==Stay safe==\nMali is politically unstable and jihadism and lawlessness is wide spread. Since June 2012, Mali has been hit by a political crisis and a civil war, which has split the country into two parts: the north having proclaimed independence as \"Azawad\" in April 2012, yet the secular ethnic Tuareg movements which had control of the North were betrayed by their Islamist allies, who now have control of the Region. whilst the south experiences a military junta. Travelling in Timbuktu and Gao provinces are particularly extremely dangerous, and as of July 2012, the Islamist and jihadist rebel groups have ordered all shrines which are considered to involve idolatry to be destroyed. Travel advice varies depending on the country: Some advise against travel to all of Mali, while others currently do not.  However, northern Mali remains dangerous, and hence governments generally '''advise against all travel to northern Mali and the areas bordering Mauritania'''.  \n\nThe train between Bamako and Kayes is notorious for theft: if taking the train, you should exercise extreme caution, carry a pocket torch, and keep your belongings with you and valuables directly on your person at all times.\n\nYou also have a good chance of encountering the police. They are generally mostly concerned with directing traffic and fining people for improper papers, so you have little to fear from them, but always at least carry a copy of your passport and visa (and preferably the original, keep it secure!).\n\nCarrying only a driving license is not sufficient and might lead to a ride to the police office unless you bribe your way out. Notice that the police in Bamako often stop taxis, although this can be somewhat avoided by never putting more than four passengers in the car and by taking only \"official\" cabs (the ones with the red plates ''only'': in Bamako, a car with white plates is not an official taxi even if it has a taxi sign on top, regardless of what the driver may tell you).\n\nThe '''northeast''' half of Mali (everything north and east of Mopti Province) is simply not safe for travel, as the murky alliance of Al Qaeda and Tuareg rebel groups have been targeting foreigners for '''kidnappings'''. Unfortunately, in late 2011, these kidnappings have occurred in other parts of the country as well (including the capital), and tourist-kidnapping by terrorists is a real concern.\n\n==Stay healthy==\n\n===Vaccinations===\nAlthough it is rarely enforced, you are technically required to have an international vaccination card showing immunization against [[yellow fever]]. It is also recommended to get Hepatitis A, Hepatitis B, typhoid, and meningitis vaccinations. You may also consider getting a polio vaccination due to the recent outbreak of polio in Northern Nigeria that has spread around the region.\n\n===Malaria===\nMali is highly endemic for malaria, including ''S. falciparum'' malaria, the most acute variety. All travelers should plan to take a malaria prophylaxis throughout their time in Mali (mephloquine and Malarone are the most common). The other main precautions are to use insect repellent in the evenings and to sleep under a mosquito net in all but the fancy, sealed, air-conditioned hotels. This will significantly lower your exposure to malaria as the mosquitoes that carry the parasite are only active at night, but you would want to take these precautions even without the risk of malaria simply to avoid being covered in itchy mosquito bites! You will almost never see or be bothered by mosquitoes during the day.\n\n===Food and water===\nStay away from dirty food and water. The rule \"cook it peel it or forget it\" should be followed. Also water should only be drunk out of sealed bottles or after it is sterilized through boiling or chemical utensils. The food is another issue. It's sometimes difficult to know if it's cooked long enough. Also the, to Westerners, unusual spices are sometimes the cause for sickness, especially diarrhoea. Also expect little stones or bits of grit in the meal, especially the local couscous (this doesn't mean it's unsafe though, as it has been cooked long and thoroughly). For the traveller the main danger is diarrhoea. For mild diarrhoea you should be sure to get lots of rest, drink lots of clean water and eat soft plain foods. If the diarrhoea is severe or lasts several days, be prepared to take antibiotics. During the illness the body will lose a lot of water and salt. Coca Cola (sugar and water) and pretzel sticks (salt) are available everywhere and do a good job of getting travellers back to full strength. There are also instant powders that have the necessary glucose and salts available to purchase.\n\n==Respect==\nGreeting people is very important. You should get familiar with the greetings in French or, better, in Bambara. Vendors should be treated in a proper way, even when you buy just fruit or bread. It is very important to show a general interest in the other person, so ask about family, work, kids, and so on. The answer is simple: \"Ça va\" (It's all right). The interlocutor should not answer in a negative way.\nExample: \n*\"Bonjour. ça va?\" (Good morning. Are you all right?)\n*\"Et votre famille?\" (And your family?)\n*\"Et vos enfants?\" (And your kids?)\n*\"Et votre travail?\" (And your job?)\n\n==Cope==\n\n\n{{isPartOf|Sahel}}\n{{outline}}\n{{countryguide}}\n\n{{Wikipedia|Mali}}\n\n[[ca:Mali]]\n[[de:Mali]]\n[[eo:Malio]]\n[[es:Malí]]\n[[fi:Mali]]\n[[fr:Mali]]\n[[hu:Mali]]\n[[it:Mali]]\n[[ja:マリ]]\n[[nl:Mali]]\n[[pl:Mali]]\n[[pt:Mali]]\n[[ru:Мали]]\n[[sv:Mali]]\n[[zh:马里]]\n[[wts:Category:Mali]]\n\n[[WikiPedia:Mali]]\n[[Dmoz:Africa/Mali/]]\n[[World66:africa/mali]]"
        }
    }
}