{
    "parse": {
        "title": "Monaco",
        "pageid": 615,
        "wikitext": {
            "*": "{{pagebanner|Monaco Banner.jpg}}\n\n{{quickbar\n|location=Monaco in its region.svg\n|flag=Flag of Monaco.svg\n|capital=Monaco\n|government=constitutional monarchy\n|currency=euro (EUR)\n|area=1.95 sq km\n|population=32,671 (July 2007 est.)\n|language=[[French]] (official), English, [[Italian]], Monegasque\n|religion=Roman Catholic (90%)\n|electricity=230V/50Hz (European plug)\n|tld=.mc\n|callingcode=+377\n|timezone=UTC +1\n}}\nThe principality of [http://www.visitmonaco.com/ '''Monaco'''] is a tiny city-state on the Mediterranean Sea and surrounded by [[France]], although the Italian Riviera lies a few kilometres farther east. \n\nThis is the second smallest independent state in the world (after the [[Rome/Vatican|Vatican]]) and is almost entirely urban.\n\n==Understand==\n'''Monte Carlo''' is not the capital of '''Monaco''' but a government district. The country is divided into four areas: Monaco-Ville (the [[old city]]), the Condamine (port quarter), Monte-Carlo (business and recreation), and Fontvieille (recreation and light industry). With no natural resources to exploit other than its location and climate, the principality has become a resort for tourists and a tax haven for businesses. Monaco is six times the size of the Vatican and the world's most densely populated independent country.\n\n==Get in==\nAlthough not a member of either the [[EU|European Union]] or the [[EEA|European Economic Area]], Monaco maintains an open border and customs union with France and is treated as part of the Schengen Area. Both French and Monégasque authorities carry out checks at Monaco's seaport and heliport.\n\nA souvenir passport stamp may be obtained at the national tourist office.  This is located at 2a Boulevard des Moulins, which is north of the garden across from the Casino. Weekend hours are short.\n\n===By plane===\nThe nearest airport is the [[Nice]] [http://www.nice.aeroport.fr/include_en Côte-d'Azur International], which is around 40 kilometres (24 miles) away from the city-centre in neighbouring France. It operates daily flights from nearly all of Europe's main cities, such as [[London]] and [[Paris]]. There are regular [http://www.rca.tm.fr Rapide Cote D’Azur] buses connecting [[Monte Carlo]] with both the terminals at Nice Côte-d'Azur airport, and taxis are always available outside the terminal buildings - although make sure a fee is agreed in advance or the meter is indeed switched on at the start of the journey, as shady French taxi drivers are notorious for charging tourists whatever they see fit.\n\n===By helicopter===\n[https://www.monacair.mc/en/ Monacair] is the sole operator of regular helicopter transfers between Nice Airport and the Monaco Heliport. After collecting your luggage at the Nice airport, present yourself at the Monacair reception desks (in terminals 1 and 2). A ground crew will carry your luggage and drive you to the heliport. The flight along the coast is beautiful and only lasts 7 minutes. When arriving right at the Monaco heliport along the water's edge, a chauffeur will take you directly to your hotel. When leaving Monaco, a partnership with more than 40 airlines allows for a direct transfer to the boarding gate with your cabin luggage. Rates are €140 for one-way transfers, and €260 for round trips.\n\n===By train===\nThe Monaco-Monte Carlo the boss station is very large, modern and mostly underground. There is an exit adjacent to platform C that, while not visible on Google Maps, is a five minute walk to the port. During the day tourist officials are typically available to help foreign travelers. It has good service to most of neighboring France and Italy. There are 2-4 services per hour to Nice, [[Cannes]], [[Menton]] and [[Ventimiglia]] (Italy). Most international trains will stop, such as the 'Ligure' which links [[Marseilles]] and [[Milan]], the 'train bleu' which operates between [[Paris]] and [[Ventimiglia]], and the famous high-speed TGV which runs between Nice and Paris [http://www.idtgv.com]. A TGV train between Paris and Monte Carlo takes around 6 and a half hours. Be aware that there's no left-luggage in the train station nor in the rest of Monaco. There's a law in Monaco forbidding leaving bags etc. in any place.\n\nIf you are planning to visit Monte Carlo from Ventimiglia, don't wait for a ticket in the Trenitalia counters or auto-machines. Go straight to the travel agency (the only one) inside the station, which is marked with the sign of SNCF (French Railways). If you plan to come back buy your return also (€5.40 with return), ticket is open and you can validate it in auto machines without hour commitment of a particular train. Trains to and from Monte Carlo run every 15 minutes until late at night. The line is serviced by SNCF Regional Trains, which is the railway provider of Monaco.\n\nThe closest major airport is in Nice and, while the airport does not have a train station, the Nice-St. Augustin terminal is a 15 minute walk. The ticket is a flat €4.80 and is roughly 40 minutes. There are multiple trains per hour all day. The train travels more inland and through more tunnels and the bus - there are less coastal views - but is much easier from the airport.\n\nFor further information like price and times visit Trenitalia [http://www.ferroviedellostato.it/ferrovie/util/inglese.jsp]\n\nThe train ticket machines only accept credit cards that have computer chips (no magnetic stripe reader) or coins, and the ticket desk can be slow. So if your credit card does not have a computer chip, you can save time by bringing Euro coins with you.\n\n[[Image:Monaco map.png|thumb|400px|right|Map of Monaco]]\n\n===By car===\nMonaco is accessed by its land borders from France or Italy by a network of highways, most commonly used of which is the A8 which runs west from Monte Carlo to Nice and Marseille, and east towards the Italian border. Make sure to take into account frequent traffic jams when approaching and leaving Monaco.\n\nBetween Nice and Monaco, there are also three more scenic roads: the Basse Corniche (Low Coast-Road - Highway 98), along the sea, the Moyenne Corniche (Middle Coast Road - Highway 7), going through Eze-Village, and the Grande Corniche (Great Coast Road), going through La Turbie and Col d'Eze (Eze Pass).  All are pretty drives offering spectacular views over the Coast line.  For an extra-special treat, rent a convertible sports car from the many airport rental services and take in the [[French Riviera]] in style. \n\nTaxi trips to and from Nice cost around €80.\n\nYou can also use a private driver service for your displacements in Monaco [http://www.chauffeur06.com Car with driver].\n\n===By bus===\nThere is no bus station in Monte Carlo. Instead, international buses stop at various points throughout the city. Regular buses, run by [http://www.rca.tm.fr Rapide Cote D’Azur], connects Monte Carlo with Nice and other French destinations. Services run regularly to many major French towns and cities.  Route 100 leaves every 15 min from the port (Le Port) in Nice and costs €1.50. The bus trip offers fantastic views of the coast, but can get extremely crowded during peak hours. \n\nAn express shuttle, route 110, links the Nice Côte d'Azur Airport and the principality. A bus leaves every half hour and a single ticket costs €22 (May 2017). The bus stops near all major hotels throughout Monaco, not just Monte Carlo.\n\n===By boat===\n\nMonaco's two ports are no strangers to private yachts.  '''Port Hercule''' is exceptionally beautiful and offers mooring and anchoring possibilities for up to five hundred vessels, some of which are extremely large and elegant (in fact, many tourists often take time out of their day to simply have a drink by the water and admire the fantastic super yachts).  The '''Port of Fontvieille''', integrated into the new district, can receive as many as 60 vessels of at least 30 meters in length.  Both are large and well-equipped.\n\nMonaco also serves as an embarkation port and port-of-call for cruises, so cruise ships can often be spotted using Port Hercule.  It's breakwater offers a large pier able to support one large cruise ship.  If in use, other ships must moor/anchor offshore, where tenders shuttle passengers to/from shore to either port...with preference for Port Hercule which offers substantially better walking distances than Fontvieille to the more popular sites. \n\nAt close proximity, the Port of Cap d'Ail is also a choice destination for pleasure-boats.\n\n* [http://europe-yachts.com/ Luxury Yacht Charter France] offers a wide range of Luxury Mega Yachts for charter from Monaco\n* [http://http://www.globeyachtcharter.com/ Luxury Yacht Charter Monaco] are experts for private Luxury Yachts on French riviera\n\n==Get around==\n\n[[Image:PortOfMonaco.jpg|thumb|right|350px|Port of Monaco from the Palace]]\n\n===By foot===\n\nWalking is by far the best way to get around Monaco; however, there are some areas, such as the Exotic Gardens, that require a large change in elevation and therefore make for rather strenuous hikes.   There are also seven public escalators and elevators (all free) that help negotiate the steep slopes of the city.  If you find yourself afoot and wanting to reach the opposite bank of Port Hercule, look for the small pedestrian-only ferry that runs each 20 minutes or so during daylight; it costs only one Euro.\n\n===By bus===\nMonaco has an urban bus service, operated by the Compagnie des Autobus Monaco [http://www.cam.mc/informations-pratiques.php?lang=en], which comprises of five bus routes (labeled 1, 2, 4, 5 and 6) serving 143 stops. Each stop has the bus number(s) that stop there, and most stops feature a real-time display showing waiting times for the next service. Each stop has a name and a network map. The service usually starts at around 0600 and runs right through until about 2100. Tickets can be purchased on board the buses themselves (€2), at many news vendors and shops throughout the city and at auto ticket machines in the stops (€1.50) - often it will be advertised as to where you can do this. A 24 hour pass can also be purchased from ticket machines or onboard the bus (€5.50). A night bus service operates in a circular route from 22.00 until 04.00.\n\n===By motor scooter===\nYou can easily rent a motor scooter in Nice and take a short trip east along the sea into Monaco. The views are beautiful and the ride is fun along the twisty seaside road.  There are plenty of places to park for free.  Theft is not a concern, as there are cameras throughout and police everywhere. To rent one whilst there, you must be 16.\n\n===By bicycle===\nIt is possible to hire a bicycle from the Auto-Moto-Garage on the Rue de Millo.\n\n===By car===\n\nPrivate cars are singularly useless for getting around Monaco, as you'll spend more time trying to park than if you walked or took a taxi instead.  \n\nInternational car hire companies do have offices at the airport in Nice and also in Monte Carlo city. These include Avis, Gare Monte Carlo, Europcar and Hertz - drivers must have held a national driving license for at least one year and it is usually requested that the cost is paid for with the driver’s credit card. Driving in the city center can be intimidating in Monte Carlo with heavy traffic - however, it is often worth this to drive alongside the more expensive vehicles in the city! Make sure to request a car with an automatic gearbox if you are not used to driving manual.\n\n===By taxi===\n\nTaxis cannot be hailed on the streets (they won't stop) and there are two main taxi stands open around the clock at the Avenue de Monte Carlo and the railway station, although it is always best to agree a fee beforehand or make sure the meter is running.  Most hotels will provide taxis or courtesy drivers. The best is to get the taxi service phone number to be able to call a taxi wherever your are.\n\n==Language==\n\nThere are 125 different nationalities that reside in Monaco, hence many languages are spoken. [[French phrasebook|French]] is the sole official language, however Monégasque is the national language. [[Italian phrasebook|Italian]] and English are widely understood and spoken.\n\n==See==\n\nThe principality of Monaco offers a great balance of historical and modern attractions. There are various museums and palaces to visit as well as shopping malls and casinos. Monaco also offers relaxation spots along the harbor and even around the attractions. It is relatively easy to navigate Monte Carlo and Monaco if you take the time to learn where the various \"short cuts\" are. City maps are generally available at most news vendor stands and shops for a small fee.  \n\n[[Image:MonacoPalace1.jpg|thumb|250px|right|Guards at the Monaco Palace]]\n*Take a walk through '''Monaco-Ville''', also known as “le rocher” or “the rock.” Monaco-Ville is still a medieval village at heart and an astonishingly picturesque site. It is made up almost entirely of pedestrian streets and passageways and most previous century houses still remain. There a number of hotels, restaurant and souvenir shops tourists can stay, eat and shop at. You can also visit the Prince's Palace, the Cathedral, the Oceanographic Museum, the City Hall, and the Saint Martin Gardens. \n\n*The '''Palais Princier''' (Prince's Palace) is in old Monaco-Ville and is worth a visit. There are audio-guided tours of the palace each day and usually run around the clock. The Palace also offers a breathtaking panoramic view overlooking the Port and Monte-Carlo. Everyday at 11:55 AM, in front of the Palace's main entrance visitors can watch the changing of the guard ceremony performed by the \"Carabiniers.\" “Carabiniers” are not only in charge of the Prince's security but they offer Him a Guard of Honor and on special occasions, are His escorts. The “Compagnie des Carabiniers du Prince” has a military band (Fanfare); which performs at public concerts, official occasions, sports events and international military music festivals.\n\n* The '''Monaco Cathedral''' was built in 1875 and stands on the site of a 13th century earlier church. It is  a mock Romanesque-Byzantine church dedicated to Saint Nicolas and houses the remains of former Princes of Monaco and Princess Grace.  The church square also contains some of Monaco-Ville's finest restaurants.\n\n* The '''Oceanographic Museum and Aquarium''' is a world-renowned attraction. Located 279 above sea level, the museum contains stunning collections of marine fauna, numerous specimens of sea creatures (stuffed or in skeleton form), models of Prince Albert’s laboratory ships, and craft ware made from the sea’s natural products. On the ground floor, exhibitions and film projections are presented daily in the Conference room. In the basement, visitors can take pleasure in watching spectacular shows of marine flora and fauna. With 4,000 species of fish and over 200 families of invertebrates, the aquarium is now an authority on the presentation of the Mediterranean and tropical marine ecosystem. Lastly, visitors can have lunch in “La Terrasse” and visit the museum gift shop. The entrance fee is 16€ for adults. Students can get discount by showing valid student ID. You need to take bus number 1 or 2 from the Monaco Monte Carlo train station to reach this aquarium.\n\n* The '''Jardin Exotique''' (Exotic Gardens) is one of the many gardens Monaco has to offer. Several thousand rare plants from around the world are presented in a walking tour that is quite memorable for the views as well as the flora and plants. The collection is mostly cacti, so do not expect to see a broad variety. Due to the rise in altitude, not only are there many displays of desert plants but there are a handful of subtropical flora displays as well. There is also a grotto (cave) that has scheduled guided tours. The tour (in French only) starts at the beginning of every hour and lasts for around 25 minutes. In the cave, you will have to climb the stairs equivalent to around a 6 storied building. The entry cost is a bit steep (€8) unless you're under 16 or a student (€3.50). You need to take bus number 2 to reach this Garden. You can take this bus either from the train station or from the Oceanographic Museum.\n\n* The '''Church of the Sacred Heart''' (Eglise du Sacré-Coeur) or Church of the Moneghetti, not far from the Jardin Exotique, stands out as as one of the most representative ''art déco'' churches in Monaco. Built by the Italian Jesuit fathers from 1926 to 1929 as a sanctuary for prayer and adoration, its remarkable frescoes by Italian painter Franzoni revealed their original bright colors in the renovation works completed in 2015. \n\n* '''La Condamine''' is the second oldest district in Monaco, after Monaco-Ville. Here you can stop and marvel at the many luxurious yachts and cruise ships which usually adorn the docks in the marina. La Condamine is a thriving business district where you can visit the Condamine Market and rue Princesse-Caroline mall. With enjoyable landscaped areas and modern buildings, La Condamine is surely worth a visit.\n\n* The '''Monaco Opera House''' or '''Salle Garnier''' was built by the famous architect Charles Garnier. The auditorium of the opera house is decorated in red and gold and has frescoes and sculptures all around the auditorium. Looking up to the ceiling of the auditorium, the visitor will be blown away by the superb paintings. The opera house is flamboyant but at the same time very beautiful. There have been some of the most superior international performances of ballet, opera and concerts held in the opera house for more than a century; consider taking in a show during your visit... but expect to pay top dollar! \n\n* The '''Marlborough Fine Arts Gallery'''  was founded in London by Frank Lloyd and Harry Fischer. A second gallery was opened in Rome, another in New York, and one more in Monaco. The gallery holds a grand collection of post-World War II artists and even paintings by Pablo Picasso, Joan Miró, Jules Brassai, Louise Bourgeois, Dale Chihuly, David Hockney and Henri Matisse. Admission is free and the gallery also offers group exhibitions.\n\n* The '''Grimaldi Forum''' is the Monaco convention center. Completed in July 2000, the sun filled building on the sea has a remarkable glass entrance, two convention restaurants, an auditorium for ballet and opera, and two more auditoriums for meetings and other affairs. The Forum also offers two large exhibition halls that can be used for trade shows or other exhibitions. It is also a short walking distance from surrounding hotels.\n* The '''Prince's car collection''' For any car enthusiast, it is the place to go, there is everything, from carriges and old cars, to formula 1 race cars.\n\n==Do==\n[[Image:Casino_Monte_Carlo2.jpg|thumb|right|300px|The Old Casino in Monte Carlo]]\n* If your wallet permits it, try your luck in the '''Grand Casino''' and gamble alongside the world's richest and often most famous. You'll need your passport to enter (as Monégasque citizens are prohibited from gambling at the casino), and the '''fees for entry range enormously''' depending on what room you are going to - often from €30 right up into the hundreds. You can also visit the casino without gambling, but also for a nominal fee. The '''dress code inside is extremely strict''' - men are required to wear coats and ties, and casual or tennis shoes are forbidden. The gaming rooms themselves are spectacular, with stained glass, paintings, and sculptures everywhere. There are two other more Americanized casinos in Monte Carlo. Neither of these has an admission fee, and the dress code is more casual.\n\n* '''Scenic flights''': enjoy Monaco and the surrounding French Riviera from above with a scenic helicopter tour. [https://www.monacair.mc/en/booking/panoramic-flights-monaco/ Monacair] offers flights starting from €65 per passenger on a 6 passengers flight. Their helicopters with air-conditioning and open-cabin design allow for a 180° sweeping view to admire the breathtaking view over the Principality. Tours can be booked online or at the Monacair reception desk at Monaco Heliport. \n\n* Monaco's streets hosts the best known '''Formula 1 Grand Prix.''' It is also one of Europe's premier social highlights of the year. The Automobile Club of Monaco organizes this spectacular Formula 1 race each year. The Grand Prix is 78 laps around 3.34 kilometers of Monte Carlo's most narrow and twisted streets. The main attraction of the Monaco Grand Prix is the proximity of the speeding Formula One cars to the race spectators. The thrill of screaming engines, smoking tires and determined drivers also makes the Monaco Grand Prix one of the most exciting races in the world. There are more than 3,000 seats available for sale on the circuit ranging from €90 to more than €500. Monaco residents often rent out their terraces for the event with prices ranging from €8,000 to €140,000 for the four days. During the off season, it is possible to walk around the circuit. Tourist office maps have the route clearly marked on their maps, although devotees won't need them! For those who can afford it, you can also take a ride around the track in a performance car.\n\n* '''Aquavision:''' Discover Monaco from the sea during this fascinating boat tour! “Aquavision” is a catamaran-type boat equipped with two windows in the hull for underwater vision, thus allowing the passengers to explore the natural seabed of the coast in an unusual way. The boat can take up to 120 people per journey. The cost for adults is €11, while the cost for children and students ages 3-18 is €8.\n\n* '''Azur Express:''' Fun tourist trains make daily tours all over Monaco. You will visit the Monaco Port, Monte-Carlo and its Palaces, the famous Casino and its gardens, the Old Town for City Hall and finally the royal Prince’s Palace. Commentaries are in English, Italian, German and French. This enjoyable tour runs about 30 minutes long and cost is €6; children under age 5 ride free. \n\n* In the summer time, Monte-Carlo is illuminated with dazzling concerts at the exclusive '''Monte-Carlo Sporting Club.''' The club has featured such artist as Natalie Cole, Andrea Bocelli, the Beach Boys, Lionel Richie and Julio Iglesias among others. The club also hosts a small casino which includes basic casino games. With no one under the age of 18, the rate per person is €20.\n\n* While staying in Monaco, you can take a full-day-journey (or half-day-journey, whichever you prefer) to surrounding areas like [[France]] and [[Italy]].  Monaco is connected to France by highways so renting a car would be the best way to go. You can also take the \"train bleu\" or a bus to European cities closer to Monaco including [[Paris]], [[Nice]] and [[Ventimiglia]]. If you want to travel to farther countries in Europe, do so by plane. [[Amsterdam]], [[Rome]], [[London]], [[Brussels]], [[Frankfurt]] and [[Zurich]] are less than two hours away by plane.\n\n* Yacht charters in Monaco are very popular and there are several companies who can arrange a trip either on a small boat, a bareboat yacht or on a luxury superyacht. \n\n* Monaco and the surrounding areas are beautiful and the region and especially the Casino are famous for being a mecca for luxury cars, such as Ferraris, Lamborghinis and Bentleys. One very popular activity for visitors to Monaco is to rent a luxury car for a few hours or for a day to enjoy the stunning coastal roads.\n\n* Get a Monaco stamp in your passport at the tourist information center. It's free.\n\n==Buy==\n{{Euro}}\nShopping in Monte Carlo is usually quite exclusive and is certainly no place for a budget holiday. There are plenty of places to melt the credit card alongside Europe's high rollers. The chic clothes shops are in the '''Golden Circle''', framed by Avenue Monte Carlo, Avenue des Beaux-Arts and Allees Lumieres, where Hermes, Christian Dior, Gucci and Prada all have a presence. The area on and around Place du Casino is home to high-end jewelers such as Bulgari, Cartier and Chopard. You will find, however, that most tourists will simply enjoy wandering the area and window shopping, even if you don't buy anything. The normal shopping hours are from 9AM to noon and 3PM to 7PM.\n\nFor a more cultured take on shopping in Monte Carlo, try the '''Condamine Market'''. The market, which can be found in the Place d'Armes, has been in existence since 1880 and is lively and attractive - many hours can be spent simply wandering around, bargaining for souvenirs from the many tiny shops, boutiques and friendly locals. If however, your shopping tastes are more modern, just take a short walk along the esplanade to the rue Princess Caroline pedestrian mall.\n\nThe '''Fontvieille Shopping Centre''' is also a  more \"normal\" shopping experience with 36 shops selling electronic goods, CDs, furniture, and clothes as well as a Carrefour supermarket and McDonald's. The tourist office also issues a useful free shopping guide to the city.\n\nSome stores to browse or buy:\n\n* <buy name=\"Fred Boutique\" alt=\"\" address=\"6, av des Beaux-Arts, Monte Carlo 98000\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"\">Located on the exclusive avenue of des Beaux-Arts, this is one of only a handful of Fred boutiques in the world. An official jeweler of Monaco's royal family and a favorite of celebrities, you may not be able to afford much in this boutique, but its worth a jaw dropping visit.  If you go to Monte Carlo, you shouldn't miss this.</buy>\n\n* <buy name=\"Boutique du Rocher\" alt=\"\" address=\"1, av de la Madone, Monte Carlo 98000\" directions=\"\" phone=\"\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">Opened by Princess Grace in the 60's, travelers still flock here to grab the very best in take home souvenirs. Choose from hand-carved frames and mirrors, ceramics, homewares and toys. Prices are moderate and all proceeds go to local charities. </buy>\n\n* <buy name=\"Davidoff\" alt=\"\" address=\"17, av des Spélugues, Les galeries du Métropole, Monte Carlo 98000\" directions=\"\" phone=\"\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">High end cigar and cigarette store, where you are assisted by staff that know their product well. </buy>\n\n* <buy name=\"Galerie Moghadam\" alt=\"\" address=\"23 & 41, bd des Moulins, Monte Carlo 98000\" directions=\"\" phone=\"\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">Award-winning speciality shop that offers superb hand woven tapestries and carpets.</buy>\n*<buy name=\"Pratoni Monaco\" alt=\"\" address=\"7, Avenue Princesse Grace\" directions=\"Larvotto\" phone=\"\" url=\"http://www.pratoni.com\" hours=\"10-12:30/14-19:30\" price=\"\" lat=\"\" long=\"\">Monaco fashion brand Pratoni offers a variety of ready-to-wear clothing & accessories for gentlemen in addition to wide range of made-to-measure services. All items are of high quality and made in Italy or Monaco.</buy>\n\n==Eat==\n<!-- Even though this is technically a \"country\" article, it is also the article for the city of Monte Carlo.  Individual listings are welcome, and encouraged. -->\n\nHow to go wrong?  Food in Monaco is universally excellent.  There are many fine restaurants, beginning with the Cafe de Paris across the street from the casino, to the waterfront restaurants along the Port de Fontvieille. During the winter months, you will find the restaurants to be decently priced--for Monaco. Bouillabaisse is excellent here.\n\n===Budget===\nThere are a huge variety of other restaurants and cafés in the city with a moderate price tag and excellent food. There are a few simple cafés along the marina-side, more like beach bars than anything else, that serve simple meals such as pizza, salads and hotdogs throughout the day. These can be excellent for simply sitting back during the hot midday with a cold beer or glass of wine, a snack to recharge your batteries from exploring the city, and the gentle lapping of the Mediterranean (and often the roar of supercars) in your ears. Most of these restaurants are equipped with water-misters in the ceilings that gently cool and refresh the clientele.\n\n* <eat name=\"Stars 'n' Bars\" alt=\"\" address=\"6 quai Antoine-1\" directions=\"\" phone=\"97-97-95-95\" email=\"\" fax=\"\" url=\"\" hours=\"June-Sept daily 11AM-midnight; Oct-May Tues-Sun 11AM-midnight. Bar open until 3AM\" price=\"\">American style sports bar serving standard burgers pizzas and sandwiches. Drinking or dining during Happy Hour offers reasonable value for money.</eat>\n\n* <eat name=\"Pizzeria Monégasque\" alt=\"\" address=\"4 rue Terrazzani\" directions=\"\" phone=\"93-30-16-38\" email=\"\" fax=\"\" url=\"\" hours=\"Mon-Sat noon-1:45PM and 7:30-11PM (until midnight Fri-Sat)\" price=\"\">For those on a budget, be sure to grab a slice of one of their delicious gourmet pizzas that taste even better when sitting on the outdoor terrace. Main courses are also available from 10€-22€.</eat>\n\n===Mid-range===\nSomewhere in between these two dining experiences comes the world-famous Café de Paris, just outside the Casino. Tourists and locals alike can often be found during the afternoon and all through the night laughing, drinking, and eating some fabulous (but verging on expensive) meals. It is definitely a must-go during your stay in Monte Carlo, even if it is just for a snack in the afternoon - it is well worth it. A new favorite in Monaco is '''Beefbar''' located in the Port of La Condamine, they serve excellent meat.\n\n* <eat name=\"Cafe de Paris\" alt=\"\" address=\"Place du Casino\" directions=\"\" phone=\"92-16-20-20\" url=\"\" hours=\"Daily 8AM-3AM\" price=\"\" lat=\"\" long=\"\"> The nerve centre of Monte Carlo, where people go to see and be seen, buzzing with the feel of old time Monte Carlo, circa early 1900s. Menu items change frequently, as do the waiters, who seem intent on rushing patrons through their meals. For people-watching, you could try a diet Coke for a mere €6(Beer glass 14€,ice cream 16€).  Reservations to dine are recommended.</eat>\n\n* <eat name=\"Beefbar\" alt=\"\" address=\"quai Jean Charles Ray, 98000\" directions=\"\" phone=\"\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">Quality cuts of beef on offer, attached with high,  though surprisingly worthwhile price tag. Small cups on puree are available for the meat, though an additional cup (one is far too small), costs 8.5€. Wine selections are paired perfectly with the red meat. Chic atmosphere and the staff are extremely attentive.</eat>\n\n* <eat name=\"Baccarat\" alt=\"\" address=\"4 Escalier Saint-Charles\" directions=\"\" phone=\"93-50-66-92\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">Serving some of the finest Italian fare in Monte Carlo, Baccarat has an airy and authentic atmosphere. The oven-baked turbot with artichokes has customers such as Robbie Williams coming back again and again.</eat>\n\n* <eat name=\"Yoshi\" alt=\"\" address=\"4 av de la Madone\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"\">Sleek and sexy Japanese restaurant of Metropole Hotel that offers authentic sushi favorites at reasonable prices.</eat>\n\n===Splurge===\nDining in Monaco can be a very sobering experience to whomever is paying the bill. Perhaps the most exclusive and famous restaurants in the city are the '''Louis XV Restaurant''' and the '''Le Grill de L'Hotel de Paris''', both centered on the very exclusive Hotel de Paris. You are more than likely to be seated next to a member of the rich and famous, and the gourmet food is simply out-of-this-world - however, these experiences come with a rather hefty price tag!\n\n* <eat name=\"Louis XV\" alt=\"\" address=\"Hôtel de Paris, place du Casino\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"\">In one of the finest hotels in the world, run by one of the finest chefs in the world (Alain Ducasse) this Michelin 3 star rated restaurant serves dining perfection amongst luxurious glitterati. The level of sophistication for all dishes is hard to be surpassed, the sea bass with Italian artichokes regularly reaches a score of 19/20 by restaurant critics. The restaurant contains the world's largest wine cellar: 250,000 bottles of wine (many priceless) stashed in a rock cave. Reservations are essential, as are jacket and tie for men.</eat>\n\n* <eat name=\"Le Grill de L'Hotel de Paris\" alt=\"\" address=\"In the Hôtel de Paris, place du Casino\" directions=\"\" phone=\"92-16-29-66\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">Although often overlooked by the famed 'Louis XV', look above to the Hotel de Paris's rooftop for its equally elegant contender. Less intimidating than the Ducasse citadel downstairs, Le Grill offers every imaginable sort of grilled fish, and meat that come from the nearby Alps. The selection of 600,000 wines are the perfect accompaniment to every dish, and the service is impeccable. Dining on the rooftop affords you stunning, panoramic views of Monte Carlo, and in the summer, a blanket of starry sky.</eat>\n\n==Drink==\nThe legal drinking/purchasing age of alcoholic beverages is '''18''' and is strictly enforced.\n\nChampagne has the status of a national beverage in Monaco. A single glass can cost as much as €40 at a fashionable restaurant!\n\n* <drink name=\"Zelos\" alt=\"\" address=\"Top Floor Grimaldi Forum Ave. Princesse Grace\" directions=\"\" phone=\"+377 99 99 25 50\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">Showcasing panoramic views from the top floor of the Grimaldi Forum, the outdoor seating area offers the perfect spot to see yachts cruising into the harbor. Top models and the people who want to be with them dance the early mornings away here and we defy you not to do the same. Cocktail list is impressive and bite sized treats are available.</drink>\n\n* <drink name=\"Bar at the Columbus Monaco\" alt=\"\" address=\"23 Avenue des Papalins Monte Carlo\" directions=\"\" phone=\"00 377 92 059000\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">More laidback and informal than some of its counterparts, its subdued atmosphere is a refreshing change from some of the high energy Monaco bars. Decked out in shades of chocolate, its almost as sweet as the chocolate martinis, which come with a big truffle in each glass which slowly melts into your drinks and tastes heavenly. Formula One race car driver David Coulthard is a co owner, which means you're likely to run into some of his race car competitors.</drink>\n\n* <drink name=\"Jimmy'z\" alt=\"\" address=\"Le Sporting Club Avenue Princesse Grace, Monte Carlo\" directions=\"\" phone=\"+ 377 9216 20 00 \" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">The ultimate night club in Monte Carlo, the famed Jimmy'z is frequented by royalty and the uber-rich, which isn't a surprise considering some of the hefty price tags, a beer will cost you upwards of £20. If you can't afford it, there are other clubs to go to. There are two entrances -one, two floors down in Le Sporting Club, the other at street level, and many a rock star and billionaire have walked through both. Staff can be quite rude, but so are most of the patrons. Definitely an experience. </drink>\n\n==Sleep==\nIf you're on a budget, Monaco is not the best place to be. For example, a two star hotel without breakfast and bathroom will cost around €60 per person. A better option is to stay in one of the many towns outside of Monaco, for example Ventimiglia, which is a sea-side town situated on the French-Italian border on the Italian side. Nice is only 1/2 hour away from Monaco and it's very cheap to use the frequent trains. During the winter season, a comfortable two star hotel will only cost you about €20 a person.\n\nThe Monaco Tourism center staff will also sit down and make phone calls to assist walk-ins in finding accommodation. Even if you ask for \"cheap\" lodging.\n\n\n\n===Mid-range===\n\n*'''Pierre et Vacances''' have severals properties in the '''area''' [https://www.pierreetvacances.com/fr-fr/zt_location-var-cote-d-azur]. Each room is a self-catering studio or apartment. Located in Beausoleil and Cap-d'Ailproperties, their range is from €150-€160 per night. +33 1 58 21 55 84\n\n* '''Colombus Hotel''': [https://www.hotelscombined.com/Hotel/Columbus_Monte_Carlo.htm?a_aid=75668&label=wiki]Situated in La Condamine, the Colombus Hotel is co-owned by successful Glaswegian hotelier Ken McCulloch, designer Amanda Rosa and British F1 racing driver David Coulthard (all Monaco residents today). There is an excellent restaurant and the lobby is a great spot to relax on the comfortable sofas. Rooms are modern. The hotel is located just by the heliport, and about 200 meters from the Stade Louis II.\n\n* <sleep name=\"Hotel Ambassador\" address=\"corner of ave Prince Pierre\" directions=\"\" phone=\"\" email=\"info@ambassadormonaco.com\" fax=\"\" url=\"http://www.ambassadormonaco.com\">Suprisingly standard mid range hotel that is good value for business travellers and those watching their euros. Rooms are kitted out with the usual TV, mini bar air con, with wi fi access and cable making it a nice touch.</sleep>\n\n* <sleep name=\"Hôtel Cosmopolite\" alt=\"\" address=\"4 rue de la Turbie\" directions=\"\" phone=\"93-30-16-95\" email=\"\" url=\"\" price=\"75€-105€ ($98-$137) double without bathroom; 80€-180€ ($104-$234) double with bathroom\">Simple hotel that is well priced given the hotels location. There's no elevator, and only some rooms have bathrooms, but its reasonably cheap and the hotel owner, Madame Gay Angèle is welcoming and makes you feel right at home.</sleep>\n\n* <sleep name=\"TwilightBlue Hotels\" url=\"http://www.twilightblue.eu/en/france/principality-of-monaco/monaco/monaco/hotels.aspx\" checkin=\"\" checkout=\"\" price=\"€80-€150\" lat=\"\" long=\"\" email=\"\" fax=\"\">Selection of Hotels in Monaco.</sleep>\n\n* <sleep name=\"Bw Hotel Prince De Galles\" address=\"\" directions=\"\" phone=\"\" url=\"\" checkin=\"12:00\" checkout=\"11:00\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"\">Facing the Mediterranean, with panoramic terrace and bar, lush tropical garden and Mediterranean Restaurant. \n.</sleep>\n\n===Splurge===\n\n* <sleep name=\"Hotel Hermitage\" alt=\"\" address=\"Square Beaumarchais\" directions=\"\" phone=\"98-06-59-77\" email=\"\" fax=\"\" checkin=\"\" checkout=\"\" price=\"320€-528€ ($416-$686) double; 568€-792€ ($738-$1,030) junior suite; from 1,596€ ($2,075) suite\">Perched on a clifftop, the Hermitage offer idylic living at its best. The majority of rooms have balconies, so guests can have stunning views from their rooms. While the hotel is quite old, all amenities and features and modern and elegant in their styling and a stay here is truly well deserved.  The SBM's Carte d'Or offers the Hermitage's guests transport and access to the facilities of the Monte Carlo Beach Hotel and Les Thermes Marins spa.</sleep>\n\n* <sleep name=\"Hotel de Paris\" alt=\"\" address=\"Place du Casino\" directions=\"\" phone=\"92-16-30-00\" url=\"\" checkin=\"\" checkout=\"\" price=\"400€-940€ ($520-$1,222) double; from 1,995€ ($2,594) suite\" lat=\"\" long=\"\" email=\"\" fax=\"92-16-26-26\">Offering a level offrgregergregerrrrr sophistication that has awarded itself as one of the world's most famous hotels. Featuring marble pillars, crystal chandeliers, Louis XVI chairs, and sumptous carpets, it's a vision of luxury and a favorite amongst the world's travellers. Rooms are simply enormous with marble and brass furnishings and the hotel is home to the country two finest eating establishments, the Le Grill de l'Hôtel de Paris and Le Louis XV.  The SBM's Carte d'Or offers the de Paris' guests transport and access to the facilities of the Monte Carlo Beach Hotel and Les Thermes Marins spa.</sleep>\n\n* <sleep name=\"Monte Carlo Bay Hotel and Resort\" alt=\"\" address=\"40 av. Princesse Grace\" directions=\"\" phone=\"98-06-02-00\" email=\"\" fax=\"98-06-00-03\" url=\"\" checkin=\"\" checkout=\"\" price=\"€300-€800 double; €750-1,400 suite\">Awe impressive 4-hectare (10-acre) resort. The high price reflect the quality of stay. Only steps away from Monte Carlo's sandy beaches, more than than 3/4 of rooms open onto sea views. Marble bathrooms feature flat screen TVs with cable ties, the hotel pool has an indoor pool covered with an ornate glass dome, and the hotel bar is none other than Jimmy'z's. The furnishings are sandstone floors, soft Mediterranean pastels and sleek modern amenities. The service to detail is outstanding, different shampoos and towels on different days, and the staff are polite and attentive without being intrusive. The SBM's Carte d'Or does not offer the Bay Hotel's guests access to the facilities of the Monte Carlo Beach Hotel or Les Thermes Marins.  The Bay Hotel is rather self-contained, but lacks a beach.</sleep>\n\n==Work==\n\nIf you are seeking a career aboard one of the many superyachts in Monaco a good place to register and start looking is [http://www.ypicrew.com'''YPI Crew'''] based in nearby Antibes or Crew Central [http://www.crew-central.com] and on the Work Monaco Community [http://www.work-monaco.com]\n\n==Respect==\n\n===National Identity===\n\nDue to Monaco's close cultural relationship with France, this had led some, even in France, to think that Monaco is part of France. But as stated, Monaco is a separate country with its own identity. When in Monaco, '''DO NOT''' insult locals by calling them French as this hurts the Monegasque and Monegasque pride. In many ways, the Respect section of the [[France]] page can detail how to be respectful toward the Monegasque population, but it should be noted that Monaco is a separate nation and it would be very insulting to casually conflate the two. Keep in mind that Monaco's population retain their own history, their own culture, and their own lifestyle. With that in mind, everyone is approachable, happy to chat with you and globally simply kind. Directions or other help are only a smile and a question away.\n\n==Contact==\n\n==Stay safe==\n\nMonaco is a very safe, virtually crime-free location, with a strong police presence. In fact, there is one police officer for every 68 people, which means that Monaco has the largest police force and police presence in the world on both a per-capita and per-area basis. Every public space is blanketed with cameras, and any kind of disorder may produce an immediate reaction and the attendance of many officers.\n\nThe only time you ought to be careful is during the week of the Formula One Grand Prix, widely regarded as the most famous F1 Race. Bringing in thousands of tourists, the event renders Monaco extremely packed during the day. As a result, there has been a marked increase in pickpockets in recent years during the event.\n\n==Cope==\n\n==Get out==\n\n[[Category: Countries]]\n[[Category: Monaco]]\n\n{{countryguide}}\n{{guidecountry}}\n{{isPartOf|Europe}}\n\n\n[[ca:Mònaco]]\n[[de:Monaco]]\n[[eo:Monako]]\n[[es:Mónaco]]\n[[fi:Monaco]]\n[[fr:Monaco]]\n[[hu:Monaco]]\n[[it:Principato di Monaco]]\n[[ja:モナコ]]\n[[nl:Monaco]]\n[[pl:Monako]]\n[[pt:Mónaco]]\n[[ro:Monaco]]\n[[ru:Монако]]\n[[sv:Monaco]]\n[[wts:Category:Monaco]]\n\n\n[[WikiPedia:Monaco]]\n[[Dmoz:Europe/Monaco/]]\n[[World66:europe/monaco]]"
        }
    }
}