{
    "parse": {
        "title": "Morocco",
        "pageid": 618,
        "wikitext": {
            "*": "{{pagebanner|Morocco Banner.jpg}}\n{{quickbar\n| image=Mehndi on hand with camel.jpg\n| caption=Mehndi on hand with Camel\n| location=Morocco in its region (undisputed).svg\n| flag=Flag of Morocco.svg\n| capital=[[Rabat]] \n| government=Constitutional Monarchy\n| currency=Moroccan dirham (د.م  MAD)\n| area=446,550km²<br />''land: 446,300km²<br />water: 250km²''\n| population=32,725,847 (July 2006 estimate)\n| language=[[Arabic]] and Tamazight (official), [[French]] and [[Spanish]] are often the languages of business\n| religion=Muslim 98.5%, Christian 1.3%, Jewish 0.2%\n| electricity=220V, 50Hz (European plug)\n| callingcode=+212\n| tld=.ma\n| timezone=UTC+1\n}}\n\nMorocco is a country located in [[North Africa]] that has a coastline on both the North Atlantic Ocean and the Mediterranean Sea.Morocco has got \nMoroccan western Sahara independence in 1973. It has borders with Algeria, [[Algeria]] to the east and the [[Spain|Spanish]] North African territories of [[Ceuta]] and [[Melilla]] on the Mediterranean coast in the north. It is just across the Strait of Gibraltar from [[Gibraltar]].\n\n==Understand==\nEthnically speaking, [https://www.viriksonmoroccoholidays.co.uk/ Morocco] is composed mainly of Arabs and Berbers or a mixture of the two. Sizeable numbers of Berbers live mainly in the country’s mountainous regions, long areas of refuge where they have preserved their language and culture. Some segments of the population are descendants of refugees from Spain and Portugal who fled from the Reconquista, the Christian reconquest of the Iberian Peninsula, that spanned until the 15th century.\n\nMorocco's long struggle for independence from France ended in 1956. The internationalized city of Tangier was turned over to the new country that same year. Morocco annexed much of the [[Western Sahara]], a former territory of Spain, in 1975.\n\nGradual political reforms in the 1990s resulted in the establishment of a bicameral legislature in 1997, although the King still possesses the actual political power. The press is mostly state controlled, even though there are free newspapers, and clampdowns have occurred following criticism of the authorities or articles concerning the [[Western Sahara]] situation. \n\nThe foreign policy of independent Morocco has often differed from that of its Arab neighbors. Throughout the Cold War, Morocco generally sided with the Western European powers and the United States rather than with the Eastern bloc, whereas other Arab states usually chose neutral or pro-Soviet positions.\n\nThe major resources of the Moroccan economy are agriculture, phosphates, tourism and textiles.\n\nCritical development challenges include lingering widespread corruption and improving the education system.\n\n===Electricity and voltage===\nThe voltage in Morocco is generally '''220 V''', and outlets will fit the 'two-pin plug known as the '''Europlug'''. It's probably the most commonly used international plug, found throughout continental Europe and parts of the Middle East, as well as much of Africa, South America, Central Asia and the former Soviet republics. Europlugs are included in most international plug adapter kits.\n\nWatch out for American and Canadian appliances, which are made to be used with 110V. That means that even with an adapter, plugging them into a 220V socket may damage them. If your appliance is \"dual-voltage\", it should be fine (it's designed for both 110 and 220V). If not, you'll need a '''power converter''' as well as an adapter.\n\n===Holidays===\n{{ramadandates}}\nThe biggest event on the Moroccan calendar is the month of '''Ramadan''', during which Muslims fast during the day time and break the fast at sunset. Most restaurants are closed for lunch (with the exception of those catering specifically to tourists) and things generally slow down. Traveling during this time is entirely possible, and the restrictions don't apply to non-Muslims, but it's respectful to refrain from eating, drinking or smoking in public during the fast. However, outside tourist \"trap\" areas it may be difficult to find any food at all all day. Surprisingly this applies even to cities like Casablanca. At the end of the month is the holiday of '''Eid al-Fitr''', when practically everything closes for as long as a week and transport is packed as everybody heads back home. Although alcohol consumption is not prohibited for tourists during Ramadan, only a few restaurants and bars serve alcohol. In addition, alcohol can be purchased in a supermarket if a tourist shows their passport to the staff (Moroccans are not allowed to buy or consume alcohol during the holy month).\n\n==Regions==\n{{Regionlist\n|\n|\n| regionmapsize=upright=1.7\n| region1name=[[Mediterranean Morocco]]\n| region1color=#d5b66b\n| region1items=\n| region1description=hosts all sorts of towns and cities, several [[Spain|Spanish]] enclaves and some important ports\n| region2name=[[North Atlantic Coast (Morocco)|North Atlantic Coast]]\n| region2color=#d5dc76\n| region2items=\n| region2description=the northern half of Morocco's coast is home to the capital and Casablanca, interspersed with more laid back beach towns\n| region3name=[[South Atlantic Coast (Morocco)|South Atlantic Coast]]\n| region3color=#4da9c4\n| region3items=\n| region3description=the southern coast is more laid back, home to gorgeous beach towns like [[Essaouira]]  and [[Agadir]] \n| region4name=[[High Atlas]]\n| region4color=#b383b3\n| region4items=\n| region4description=covering the High Atlas mountains and the surrounding areas including Marrakech\n| region5name=[[Middle Atlas]]\n| region5color=#71b37b\n| region5items=\n| region5description=covering the Middle Atlas mountains and the surrounding areas including Fez and Meknes\n| region6name=[[Saharan Morocco]]\n| region6color=#d56d76\n| region6items=\n| region6description=the vast desert region of Morocco runs along the border with Algeria; camel safaris and sand dunes are the name of the game here\n| region7color=#a78379\n| region7items=\n| region7description=the southern portion, covering Tarouddant down to the  Moroccan Western Sahara ( Dakhla City )\n}}\n<  for tourists Morocco map from Tanger to Dakhla, there is no western Sahara as you found in the internet, feel free if you travel to Morocco.\n\n==Cities==\n[[Image:Man with Bike in Marrakech.jpg|thumb|upright=1.3|A street scene in Marrakech - entrance to a mosque, arrow shows directions showing separate entrances for men and for women]]\n\n* [[Rabat]] &ndash; The capital of Morocco; very relaxed and hassle-free, highlights include a 12th-century tower and minaret.\n\n* [[Casablanca]] &ndash; This modern city by the sea is a starting point for visitors flying into the country. If you have the time, both the historical medina and the contemporary mosque (the third largest in the world) are well worth an afternoon\n\n* [[Fez]] &ndash; Fez is the former capital of Morocco and one of the oldest and largest medieval cities in the world.\n\n* [[Marrakech]] (Marrakesh)&ndash; Marrakech is a perfect combination of old and new Morocco. Plan to spend at least a few days wandering the huge maze of souks and ruins in the medina. The great plaza of Djeema El Fna at dusk is not to be missed although the sheer number and concentration of tourists may be off putting for some.\n\n* [[Meknes]] &ndash; A laid back city that offers a welcome break from the tourist crush of neighbouring [[Fez]]. Was once an imperial capital and retains its extensive walls and an \"old city\" smaller yet similar to that of Fez. There are a number of vineyards in the area around Meknes.\n\n* [[Ouarzazate]] &ndash; Considered the Capital of the South, Ouarzazate is a great example of preservation and tourism that hasn't destroyed the feel of a fantastic and ancient city. \n\n* [[Tangier]] &ndash;Tangier is the starting point for most visitors arriving by ferry from Spain.  An enigmatic charm which has historically attracted numerous artists (Matisse), musicians (Hendrix), politicians (Churchill), writers (Burroughs, Twain) and others (Malcolm Forbes). \n\n* [[Taroudannt]] &ndash; A southern market town.\n\n* [[Tetouan]] &ndash; Nice beaches and is the gateway to the Rif Mountains.\n*[[Al Hoceima]] &ndash; Beach town on the Mediterranean coast\n* [[Laayoun]] one of Morrocco western Sahara, knows about its seafood, and considering as the capital of Sardines in the world.\n* [[Dakhla]] one of the best city in Morocco western Sahara knows about its seafood and its seas and beaches, it knows also about surf.\n\n==Other destinations==\n* [[Agadir]] &ndash; Agadir is best-known for its beaches.  The town is a nice example of modern Morocco, with less emphasis on history and culture. Take the local bus for MAD5/10 to the north town of [[Auorir]] and [[Tamri ]] where there are great beaches\n\n* [[Amizmiz]] &ndash; With one of the largest Berber souks in the [[High Atlas]] Mountains every Tuesday, Amizmiz is a popular destination for travelers looking for a day trip that is easily accessible (about an hour) from Marrakech\n\n* [[Chefchaouen]] &ndash; A mountain town just inland from Tangier full of white-washed winding alleys, blue doors, and olive trees, Chefchaouen is clean as a postcard and a welcome escape from Tangier, evoking the feeling of a Greek island\n\n* [[Essaouira]] &ndash; An ancient sea-side town newly rediscovered by tourists. From mid-June to August the beaches are packed but any other time and you'll be the only person there. Good music and great people. Nearest Coast from [[Marrakech]]\n\n* [[High Atlas]]\n\n* [[Imouzzer]] a traditional Berber town perched in the Atlas mountains, beautiful scenery and a wonderful waterfall. Excellent handicrafts, argan oil and berber jewellery. \n\n* [[Merzouga]] and [[M'Hamid]] &ndash; From either of these two settlements at the edge of the Sahara, ride a camel or 4x4 into the desert for a night (or a week) among the dunes and under the stars\n\n* [[Tinerhir]] &ndash; This town is the perfect point of access to the stunning [[High Atlas]]\n\n===Archaeological sites===\n* [[Volubilis]] &ndash; 30km North of [[Meknes]], biggest Roman ruins in Morocco, next to the holy town [[Moulay Idriss]]\n\n==Get in==\n\n===Visa-free entry===\nAll visitors to Morocco require a valid passport, but visitors from \nthe following countries are exempted from having a visa for 90 days unless otherwise stated:\n\n'''[[Europe#Schengen|Schengen member states]]''', \n[[Argentina]], \n[[Australia]],\n[[Bahrain]],\n[[Brazil]],\n[[Bulgaria]],\n[[Canada]],\n[[China]],\n[[Chile]],\n[[Côte d'Ivoire]],\n[[Croatia]],\n[[Republic of Congo]],\n[[Guinea]],\n[[Hong Kong]](30 days),\n[[Indonesia]],\n[[Ireland]],\n[[Japan]],\n[[Kuwait]],\n[[Libya]],\n[[Macau]],\n[[Mali]],\n[[Malaysia]](Just signed on July 19th 2017)\n[[Mexico]],\n[[New Zealand]],\n[[Niger]],\n[[Oman]],\n[[Peru]],\n[[Philippines]],\n[[Qatar]],\n[[Romania]],\n[[Russia]],\n[[Saudi Arabia]],\n[[Senegal]],\n[[Singapore]](30 days),\n[[South Korea]],\n[[Tunisia]],\n[[Turkey]],\n[[United Arab Emirates]],\n[[United Kingdom]],\n[[United States]],\n[[Venezuela]]\n\n===Visa===\nBe advised that visas can be difficult to obtain. Even if you are approved for a visa, it may be difficult to receive a copy before you travel. There have been cases of individuals who were approved for visas, but the visas were printed with incorrect information, and even after months of trying, it was not possible to get the visas reprinted with the correct information. If you must apply for a visa, it is never too early to start, as the actual processing time may greatly exceed posted guidelines.\n\nFor tourists from countries that need a visa to enter Morocco, the Moroccan embassy or consulate in your country of residence is usually the first port of call. The embassy charges the equivalent of GBP17 for a single entry and GBP26 for double or multiple entries. (Double or multiple entry visas will be issued at embassy discretion.) Visas are usually valid for 3 months. They can take anywhere from around 5-6 working days to several months to process, despite posted waiting times. \n\nVisa requirements include completed application forms, four passport-size photos taken within the previous six months; valid passport with at least one blank page and a photocopy of the relevant data pages; fee, payable by postal order only; photocopy of all flight bookings and a hotel reservation.\n\nTourists can stay for up to 90 days. Visa extensions can be a frustrating and time-consuming process. (You may find it easier to duck into the Spanish-controlled [[Ceuta]] or [[Melilla]] and then re-enter Morocco for a new stamp). Anti-cholera '''vaccination certificates''' may be required of visitors coming from areas where this disease is prevalent, and pets need a health certificate less than ten days old and an anti-rabies certificate less than six months old.\n\n===By plane===\nThere are flights from [[New York City|New York]], [[Montreal]], [[Dubai]] and various [[Europe]]an cities to [[Casablanca]] as well as seasonal charter flights to [[Agadir]].  \n\nMany European carriers serve Morocco including Iberia, TAP Portugal, Air France, Lufthansa, Swiss, Turkish Airlines, Norwegian, BMI, British Airways, Brussels Airlines, Alitalia, Transavia, Portugalia, and Germanwings. \n\n[http://www.aerlingus.com '''Aer Lingus'''] &mdash; Flies weekly from [[Dublin]] to [[Agadir]].\n\n[http://www.easyjet.com '''Easyjet'''] &mdash; Now fly from [[London]], [[Manchester]] and [[Milan]] to [[Marrakech]] and [[Casablanca]].  Another option is from [[Paris - Charles de Gaulle]] to [[Casablanca]].\n\n'''Ryanair''' [http://www.ryanair.com] &mdash; Has signed an agreement with the Moroccan government and flies to Morocco from [[Bergamo]], [[Girona]], [[Reus]], [[Bremen]], Madrid, [[Brussels]], Frankfurt-Hahn, Eindhoven,[[London]], [[Porto]]. Flying to [[Fez]] 3 times per week. Flights to Marrakesh are also available. A [[Bergamo]]-[[Tangier]] route has been opened in July 2009.\n\n'''Royal Air Maroc''' [http://www.RoyalAirMaroc.com] &mdash; More commonly known as RAM, is the Moroccan national carrier, as well as the country's largest airline. RAM is fully owned by the government of Morocco, and has its headquarters on the grounds of Casablanca-Anfa Airport. From its base at Mohammed V International Airport, the carrier operates a domestic network in Morocco, scheduled international flights to Africa, Asia, Europe, and North and South America, and occasional charter flights that include Hajj services.\n\n'''Air Arabia Maroc'''\nAir Arabia Maroc, owned by Air Arabia, is another low cost carrier which flies to other Moroccan destinations as well as France, Italy, Spain, Netherlands, Belgium, Germany, Tunisia and Turkey. \n\n'''Aigle Azur'''[http://www.aigle-azur.fr/] &mdash; A small North-African carrier with reasonable rates.  \n\n'''Thomson fly''' [http://www.thomsonfly.com] &mdash; Flights from Manchester to Marrakech and are very reasonably priced.\n\n'''Binter Canarias''' [http://www.bintercanarias.com] &mdash; Flights from Canary Islands to Marrakech.\n\n'''Emirates''' [http://www.emirates.com] &mdash; Flights from Dubai to Casablanca.\n\n'''Egypt Air''' [http://www.egyptair.com.eg] &mdash; Flights from Cairo to Casablanca.\n\n'''Turkish Airlines''' [http://www.thy.com.tr] &mdash; Flights daily from İstanbul to Casablanca.\n\n'''WizzAir''' [http://www.wizzair.com] &mdash; Flights from [[Budapest]] and Vilnius to Agadir.\n\n\nMany visitors also fly to [[Gibraltar]] or [[Malaga]] (which are often considerably cheaper to get to) and take a ferry from [[Algeciras]], [[Tarifa]] or [[Gibraltar]] to [[Tangier]]. This is not recommended in summer as literally millions of Moroccans living in [[Europe]] use this passage during the summer holidays.\n\n===By car===\nThe only open border posts on land are the ones at the Spanish enclaves of [[Ceuta]] and [[Melilla]]. The frontier with Algeria has been closed for ten years. For the closest maritime connection you head for [[Algeciras]] or [[Tarifa]] in southern [[Spain]]. At Algeciras, there are ferry services to Ceuta and [[Tangier]] that carry cars. Tarifa has a similar service to Tangier, and this is the shortest and fastest route (just 35 minutes).\n\nIt's also possible to enter [[Mauritania]] by car from [[Dakhla]]. Most countries' citizens need a visa to get into Mauritania, which are available at the Mauritanian embassy in Rabat (visas are no longer issued at the border).\n\nIt might be hard to get into Morocco with a commercial vehicle. Campervans are acceptable (but they must look like a camper van), but other commercial vehicles might get turned around and prevented from traveling onwards. If you want to take a commercial vehicle and there is more than one person traveling, it may be worthwhile if a French-speaking person travels to any international border with Morocco of your choice and meets with the head of customs before you try to bring in a commercial vehicle.\n\nBe aware: In Morocco there are frequently police controls for speeding (with laser gun). These are on all main roads between the coast and cities (Rabat, Agadir, Essaouira, Marrakech, Ouarzazate, Casablanca). So be aware particularly on the roads where the maximum speed is 40 or 60 km/h.\n\n===By boat===\n\n====Summary====\nThere are several ferry connections to Morocco, mainly from [[Spain]]. [[Algeciras]] is the main port and serves [[Ceuta]] and [[Tangier]]. A ferry between Algeciras and Ceuta takes 40 minutes, and less than 2 hours to get to Tangier. You can also get to Tangier from the small port of [[Tarifa]], on the southernmost tip of mainland Spain. This will take 35 minutes. Some companies run buses between Tarifa and Algeciras for free (25 minutes), so you will have no problems getting to the train station. Other Spanish ports that have connections to Morocco are [[Malaga]] and [[Almeria]] who connect to [[Melilla]] and its Moroccan neighbor town of [[Nador]].\n\nFerries from France go to Tangier from the port of [[Sète]] near [[Montpellier]] and [[Port Vendres]] near [[Perpignan]]. However, these ferries are rather expensive. The Italian towns of [[Genoa]] and [[Naples]] also have direct connections to Tangier. The British crown colony of [[Gibraltar]] connects to Tangier through a high-speed boat service.\n\n====Details====\nFrom Tarfia to Tangier the ferry costs €37 as of August 2016. Return cost €81 with the date of return open. However, you can get the ferry ticket from Tangier at MAD390, about €36. To Algeciras from Tangier, it costs MAD395 single.\n\n==Get around==\n'''Trains''' are generally the best option because of their speed, frequency and comfort; however, the network is limited. The train network links [[Marrakech]] and [[Tangier]] via [[Casablanca]] and [[Rabat]], and a branch line to Oujda starts at [[Sidi Kachem]], linking [[Meknes]] and [[Fez]] to the main line. \n\nLuxury '''buses''' are the next best bet, with almost universal coverage, if with somewhat odd departure times in some places. CTM, Supratours and some smaller companies provide good comfort at reasonable prices. Supratours buses offer tickets that allow you to link with the rail system. All bus companies charge for baggage separately; however, CTM is the only one that does this officially and provides baggage receipts. On Supratours, whoever takes your bag will demand up to MAD20; pay no more than MAD5.\n\nLocal '''buses''' are a completely valid choice for the hardier traveler and often even have more leg room than luxury buses (although this may be just because the seat in front of you is disintegrating). They can be extraordinarily slow as they will stop for anyone, anywhere, and only luxury buses are air conditioned (and locals hate open windows).\n\nShared taxi services ('''grand taxi''') also operate between towns; fares are semi-fixed and shared equally between passengers. However, note that there are six passenger seats per car, not four, (this is for the ubiquitous Mercedes; there are 8 or 9 seats in the bigger Peugeots in the southeast). Two people are expected to share the front seat, with four across the back. If you want to leave immediately or want extra space, you can pay for any additional empty seats. Grand taxis generally cost less than a luxury bus but more than the local. Late at night, expect to be charged a little more than during the day; also expect to pay for all the seats in the car as it probably won't show up other customers late. '''Petit taxis''' are not allowed to leave the city borders and thus are not an option for traveling between cities.\n\nHowever you are traveling, work out which direction you are heading and where the sun will be for the majority of your trip and choose a seat on the shady side.\n\n===By plane===\nDomestic flying is not a popular means of transportation; however, Royal Air Maroc, the national flag carrier, has a network to most cities. Another option is Air Arabia Maroc.\n\n===By train===\nPeople are incredibly sociable and friendly on the trains in Morocco, and you will find yourself perpetually talking to strangers about your journey. Each new person will advise you on some new place you should go or invite you to their home for couscous. Stations in smaller cities are often poorly marked, and your fellow passengers will be more than happy to let you know where you are and when you should get off. It's expected to greet (''Salam'') new passengers entering your compartment, and if you bring fruit, cake, etc., it's common to offer the other passengers something as well. If you spend a little extra for 1st class you increase your chances of meeting someone proficient in many languages. \n\nThere are three daily departures from Tangier bound for either [[Oujda]] or [[Marrakech]], although all of them can be used to reach either destination as there are corresponding trains in Sidi Kachem using the opposite branch of the train coming from [[Tangier]]. The night trains (''train de nuit'') between [[Tangier ]] and [[Marrakech]] offer couchettes for an extra MAD100. This is the only option if you would like to lie down sleeping as there are obstacles between the seats in regular compartments.\n\nThe only disadvantage of Moroccan trains is that they are very frequently delayed, so don't count on the timetables if you are in a hurry. \n\nThe train network is operated by [http://www.oncf.ma/ ONCF].\n\n====Availability====\nThe major cities, [[Marrakech]], [[Meknes]], [[Fez]], [[Tangier]], [[Rabat]], [[Casablanca]], etc are all linked by reliable (if not very fast) rail links. There are usually several trains every day to or from every major town. There is also a night train between Marrakech and Tangier.\n\n====Cost====\nThe trains are very cheap (compared to Europe). For example, a single from [[Tangier]] to [[Marrakech]] costs about MAD200 (GBP16) second class, or MAD300 (GBP24) first class.\n[[Casablanca]] to [[Marrakech]]- MAD90 for second class.\n\nIn order to check costs on the ONCF website, don't be alarmed by the French. Scroll down to Billets Normaux (under Prix & Reservation) and choose your ride.\n\nFor longer rides (> 2 hours) it is good to spend some more money (30%) for a first class upgrade. These seats are better and you have good air conditiong.\n\n===By bus=== \nNearly every city has a central bus station where you can buy tickets to travel from region to region. You can either choose the buses for tourists with air conditioning and a TV or you can take the local buses which cost only 25%-50% and are much more fun. Local buses are not very comfortable, but you can get in contact with the local people and learn a lot about the country. The local buses often take longer routes than the big ones, so you can see villages you would never get to see as a \"normal\" tourist. This is not advisable for heat-sensitive people, though, as locals may tell you that 35 degrees is \"cool\" and no reason for opening a window. The route from Rissani, Erfoud, and Er Rachidia to Meknes and Fez, while long, runs through the Middle and High Atlas and is particularly scenic.\n\nLuxury buses operated by CTM [http://www.ctm.ma] are also inexpensive and offer an easier travelling experience than local buses.\n\nHere is CTM's timetable and tariff rates: [http://www.ctm.ma/Horaires_et_Tarifs_CTM.pdf]\n\nSupratours [http://www.supratours.ma/], a major rival of CTM, complements train network to Essaouira and all major Atlantic-coast towns south to Marrakech.\n\n===By taxi===\nTravel by taxi is common in Morocco. \n\n===By car===\nThe main road network is in good condition. Road surfaces are good but roads are very narrow, in most cases only one narrow lane in each direction. Note that many roads in the south marked as sealed are actually only one lane total sealed with wide shoulders to be used every time you meet oncoming traffic.\n\nThe main cities are connected by toll expressways still being extended. Example tolls as for standard car (Feb 2017): Tanger-Kenitra 66 dirhams; Kenitra-Rabat 13 dirhams.\n* The expressway between '''Casablanca and Rabat''' (A3) was finished in 1987.\n* It was extended from '''Rabat to Kénitra''' in 1995 and today reaches the northern port of '''Tangier''' (A1).\n* Another expressway (A2) goes eastwards from '''Rabat to Fez''' some 200km down the road. It comprises part of the planned transmaghrébine expressway that will continue all the way to Tripoli.\n* South from '''Casablanca''' runs the A7. It is planned to reach Agadir in December of 2009 but currently only goes as far as '''Marrakech''' 210km south of Casablanca.\n* Around '''Casablanca and''' down the coast is the A5 expressway which connects Mohammedia and '''El Jadida'''.\n* Construction started in 2007 for the A2 between '''Fez and Oujda''' on the Algerian border which will be completed in 2011. [http://www.adm.co.ma/projects.cfm?id=3]\n\nFuel is not so common in the countryside, so plan ahead and get a good map. Roads are varied and mixed with many cyclists, pedestrians and horse-drawn vehicles.\n\nRoad signs are in Arabic and French and the traffic law is as in much of Europe, but you give way to the right. This means that traffic on a roundabout gives way to that entering it. Be very careful as many drivers respect signs only if a policeman is nearby. There are numerous police checks on the main roads where you must slow down to allow them to see you. The speed limit is enforced, especially the 40km/h in towns and at dangerous intersections, where fines are imposed on the spot. A general rule to follow is that vehicles larger than yours should be given priority/yielded to (trucks, buses and even grand taxis).\n\nDriving safely in Morocco takes practice and patience but can take you to some really beautiful places.\n\nThe centre of Marrakech can be a scary place to drive. You will be constantly beeped at regardless of how well you drive. Marrakechis like to beep their horns at anyone they feel is holding them up. This may mean even if you're just in front of them at a red light. Also, pay very close attention to your wing mirrors and your blind spots. The two lane roads often become free-for-alls, to the point where you may see four cars wing to wing at a red light. One of the major hazards on the roads in Marrakech are the mobilettes. These pushbikes with an engine will zig-zag around you and generally make themselves a nuisance; however, on longer stretches of road, they tend to keep to the right. Often a few beeps of the horn will cause a mobilette rider to pay a little more attention to his surroundings. However, be warned that some drivers pay absolutely no attention to your horn. Drive defensively and keep your speed down so any accident causes minimum damage. Do not be intimidated by other drivers. Make sure that you drive predictably, and don't do anything rash.\n\n====[[Renting a car]]====\nRental firms abound in the large cities. Most worldwide rental networks have offices in Morocco. There are also several local rental companies (5-7 have rep offices in Casablanca airport). They offer lower prices, but be sure to check a vehicle's condition, spare tire, jack,  etc. Local companies' employees may be less proficient in English, but if you are ready to take a risk in order to try to save money, when you rent in an airport, try to negotiate with them first; if you fail, you always have worldwide rivals to go next.\n\nMultinational companies seem to easily share cars with each other (although prices and service level may vary), so if your company of choice doesn't have what you need, they may ask another company.\n\nCheck where you can drive - some rental companies won't allow travel on unmade roads. \n\nNext, stay to the main (Western) companies as the local ones are not always as reliable and try to charge you afterwards (scratches, cleaning, etc).\n\n=====Alamo/National=====\nAll Alamo and National Car Rental offices are co-located in Morocco. International companies like Sixt, Liligo and Europcar are usually situated in strategic places like airports and tourist centres but they are much more expensive than national companies. However, lots of small national companies do not have sufficiently professional methodologies. The best solution between the extremes are big local companies which have agencies in at least three different cities, like Abid Cars. These companies have the best service quality at better prices. They also offer the possibility of returning a car in a different city, and they generally deliver the car to the airport for free.\n\nDuring low season (November), expect at least a 20% discount from the list price if you come without a reservation, at least for economic class (Peugeot 206, Renault Logan Dacia). In high season, avoid coming without a reservation; if you do, you may not find a car or you may find a bad quality car at a very expensive price.\n\nDeposit is taken as a paper slip of a credit card; Alamo is unable to transfer your slip to the city of your destination if it's different from your starting point.\n\nSome economy class cars (like Peugeot 206) are as old as 4 years, with mileage up to 120,000km.\n\n====Renting a vehicle with driver/guide====\nSome tour operators will arrange for you to hire a 4x4 or SUV with a driver/guide, and offer customized itineraries, including advanced booking in hotels, riads, etc. \nmost of the drivers are fluent in foreign languages (French, English, Spanish...).\n\n===By thumb===\nHitchhiking is a routine form of travel in the country, particularly in large farm trucks which supplement income by picking up paying passengers. The price is about half that of a grand taxi. Expect to ride in the back with lots of locals.\n\n==Talk==\n[[Image:Maroc arabe français.png|thumb|upright=1.3|French and Arabic coexist in Moroccan administration and commerce.]]\n\nIt would greatly enhance your visit, increase your understanding of signs and notices, and avoid difficult situations if you were to brush up on your high school French or embark on a course of Arabic.\n\n*'''Modern Standard [[Arabic phrasebook|Arabic]]''' is the first official language, and is frequently used in administrative offices, mosques and education. However, the vernacular is '''[[Moroccan Arabic phrasebook|Moroccan Arabic]]''' - a dialect of Maghreb Arabic - also known as Moroccan Darija. The language is extremely different from Standard Arabic, and is also slightly influenced by French or Spanish depending on where in the country you are, so don't expect to understand a word of what the locals say to each other even if you are competent in Standard Arabic, or any non-Moroccan dialect. However, all Moroccans learn standard Arabic in school, so while not the first language of choice, speakers of standard Arabic should not have any problems communicating. Officially, about half the population cannot read or write, so there are always translators around and people to assist filling in forms (for a small fee) around most places where such forms are required such as ports, etc.\n\n*'''[[Berber phrasebook|Berber]]''', or the Amazigh language, is the second official language and is spoken by Morocco's Berber population. In the mountainous regions of the north the dialect is ''Tarifit'', the central region the dialect is ''Tamazight'', and in the south of the country the dialect is ''Tachelheet''. \n\n*'''[[French phrasebook|French]]''' is widely understood and spoken in Morocco due to its history as a French protectorate and is taught in schools from relatively early grades, making it by far the most useful non-Arabic language to know. Most urban locals (especially young people) you meet will be trilingual in Moroccan Arabic, Standard Arabic and French. \n\n*In the northern and southern parts of the country, many people speak [[Spanish phrasebook|Spanish]] instead of or in addition to French owing to the proximity to and former colonisation by Spain. Additionally, many Moroccans go to Spain on temporary work visas and learn the language while living there.\n\n*While knowledge of the English language is increasing among the younger generations, most Moroccans don't speak a word, and even those that do will most likely speak better French. Although you will find a few people who speak English among the most educated people, in urban areas most of them are touts and faux guides. Some shop owners and hotel managers in urban centres also speak English.\n\n==See==\n[[File:Marokko Wüste 01.JPG|thumb|upright=1.3|Morocco sand dunes]]\nAt just a few hours from the main European cities, Morocco has everything to overwhelm you with the amazing colors, smells and sounds of Islamic Africa. Imagine bustling souqs and spice markets, stunning mosques, white-washed sea side towns and medieval city centres. With panoramic views varying from snow-covered peaks in the High Atlas to the endless sand dunes of the Sahara, no-one ever has to be bored in this beautiful country.\n\nMovie-famous '''[[Casablanca]]''' might be the most famous of Moroccan cities and is home to the huge '''Hassan II mosque''', the second largest mosque in the world with only the Grand Mosque of Mecca surpassing it. Many travellers quickly leave this vibrant and modernist metropolis on a search for a more traditional Moroccan experience, but admiring the impressive colonial architecture, Hispano-Moorish and art-deco outlook of the city centre is actually time well spent. '''[[Marrakesh]]''', known as the \"Red City\" and probably the most prominent former imperial capital, will leave you with memories to cherish for life. Spend your days wandering through the lively souqs, admiring the old '''gates and defensive walls''', see the Saadian Tombs, the remnants of the El Badi Palace and visit the Koutoubia Mosque with its 12th century minaret. However, when evening falls make sure to head back to '''Jamaa el-Fnaa''', the largest square in Africa, as it fills up with steam-producing food stalls. Indulge in the bustling activity there, listen to Arabic story tellers, watch magicians and Chleuh dancers. '''[[Fez]]''', once Morocco's capital, is another gorgeous imperial city. Get lost in its lovely labyrinth of narrow Medieval streets, enjoy its huge medina, see the beautiful city gates, the ancient '''University of Al-Karaouine''' and the '''Bou Inania Madrasa'''. Also, make sure to visit a traditional '''leather tanning factory'''. The city of '''[[Meknes]]''' is often called the \"Versailles of Morocco\" for its beauty. Its lovely Spanish-Moorish style centre is surrounded by tall city walls with impressive gates and you'll be able to see the 17th century blend of European and Islamic cultures even today.\n\nFor a more laid-back experience of city life, catch a sea breeze at '''[[Asilah]]''' or lovely '''[[Essaouira]]'''. The blue-washed town of '''[[Chefchaouen]]''' is an old time travellers' favourite and a great starting point to explore the impressive High Atlas Mountains. Climb '''Jebel Toubkal''', the highest peak in North-Africa, passing lovely adobe villages and exploring the gorgeous Ourika and Amizmiz valleys on the way. The stunning panoramic view from the top will make it worth every bit of your effort to get there. Other praised hiking routes lead through the beautiful Ameln Valley in the Anti-Atlas and the wooded Rif Mountains in the very north. \n\nHop on a camel back for a trip through the golden '''Sahara sand dunes''' at [[Erg Chebbi]], near [[Merzouga]]. Spend the night in a desert tent, under the incredibly starred sky. The Sahara is also accessible near the town of Zagora; it's easier to get to from Marrakech but doesn't have the imposing dunes of Erg Chebbi. Somewhat less easy to reach but therefor also less crowded are the dunes of [[Erg Chigaga]] near [[M'hamid]]. On your way to the desert, make sure not to miss the stunning '''Todra gorge''' near [[Tinghir]]. The ancient fortified city of '''[[Aït-Benhaddou]]''' is another must-see sight. Although rainstorms damage the mud-brick kasbahs time and again, this mostly abandoned village remains an impressive sight and has been the decor for a range of movies, including Lawrence of Arabia and Gladiator.\n\n==Do==\n\n===Hammams===\nThere are two types of Hammam (steam baths) across Morocco.\n\nThe first is the '''tourist hammam''', where you can go and be pampered and scrubbed by an experienced staff member. As these are promoted only to tourists they are the more expensive option with pricing usually around DH 150 for a hammam. They can not be technically referred to as a proper hammam, but they are nonetheless enjoyable, especially for the timid. Your hotel can recommend a good one.\n\nThe second option is to visit a '''\"popular\" Hammam'''. Popular hammams are the places where the locals go. Ask the staff at your hotel where they would go.\n\nAt the popular hammams, you do it all yourself. To make the most of a popular hammam, you need to take a scrubbing mitten (available cheap in the Souks), a towel, and some extra underwear (otherwise, you will be going home without any, as it will be sopping wet). Popular hammams are often only identified by tiles around a door and entrance way. If you do not speak French or Arabic, it could be a daunting, or at least a very memorable, experience. Men & women have either separate session times or separate hammams.\n\n'''Nudity in a popular hammam is strictly forbidden''' for men, so be prepared to wear your underwear or a bathing suit. For women, you'll see some wearing underwear and some going naked.\n\nWhilst in a popular hammam, you may be offered help and a massage from another person. It is essential to remember that this '''massage is nothing but a massage''', with no other intentions. Sexual contact or presumption of sexual contact does not occur in these places. If you accept a massage, be prepared to return the favour.\n\nNormal entrance prices for a popular hammam are MAD7-15, a scrub will cost around MAD30, and a massage another MAD30.\n\n'''Volunteering''' Get to know the beautiful country by giving back and doing something meaningful at the same time.\n\n'''Trekking''' The Rif Mountains, the Atlas Mountains are the best areas for trekking. Also Staying in the Sahara desert is definitely an experience everyone should have at least once in their lifetime.\nIs a place well you will have fond memories to last you forever. Imagine yourself on top a camel crossing through the Merzouga Sahara desert.\n\n==Buy==\n\n===Money===\nThe local currency is the '''Moroccan dirham''' ('''MAD'''), which is divided into 100 centimes (c).\n\nAs of October 2018: 1 USD = 9.5 MAD\n\nThere are 5c, 10c, 20c, 50c, MAD1, MAD2, MAD5, MAD10 coins, although coins smaller than 20c are rarely seen these days. Notes are available in denominations of MAD20, MAD50, MAD100, and MAD200.\n\nWhile the dirham is the only currency officially accepted in Morocco, some hotels may accept your EUR/USD unofficially.\n\n===Currency exchange===\nIt's illegal to bring more than MAD100 of local currency out of the country, however you can buy dirhams outside Morocco.  By law, exchange rates should be the same at all banks and official exchanges. Make a note of the exact rates before you go to make sure you're getting a fair deal.\n\nDon't expect to see many banks in the ''souqs'' or ''medinas'', although in larger cities there are often an ATM near the main gates, and even one or two inside the large souqs (if you manage to find your way). You may also encounter \"helpful\" people who will exchange dollars or euros for dirhams. Unofficial exchange on the streets outside souqs or medinas doesn't seem to exist.\n\nBesides banks and dedicated exchange offices, major post offices provide exchange, and work until late hours. There are several exchange offices in Casablanca airport.\n\n'''ATMs''' can be found near tourist hotels and in the modern ''ville nouvelle'' shopping districts. Make sure that the ATM accepts foreign cards (look for the Maestro, Cirrus or Plus logos) ''before'' you put your card in.\n\nTry to have as much small change as possible and keep larger bills hidden separately.\n\n===Plastic cards===\nMost businesses in Morocco accept credit cards(In big cities of course). Those that do are most likely to accept Visa or MasterCard however will often apply a surcharge to cover the cost of processing your transaction.\n\nAdvise your bank or card issuer that you intend to travel abroad so that no block will be put on the usage of your credit or ATM cards. Notify the issuer and give them a 'phone number where you can be contacted abroad.\n\nBefore travelling, ensure you make a note of all credit card numbers and associated contact numbers for card issuers in case of difficulty. The numbers are usually free to call as you can reverse the charges, make it clear to the operator at your hotel, riad etc that you wish the call charge to be reversed. Preferably get a pre-paid card, with good exchange rates and low withdrawal fees eg fairFX.\n\nWhen making payments with a credit card, for example at a hotel for services, it is vital to memorise the PIN as signatures in many instances are no longer accepted, however certain establishments such as restaurants may still use the old method of signing.\n\nMany people now use a prepaid FairFX or Caxton card. Theses offer good exchange rates, are safe and money is protected if the card gets lost or stolen. These are accepted in Moroccan ATMs anywhere you see the MasterCard logo and in some shops too.\n\n===What to buy?===\nApart from classic tourist souvenirs like postcards and trinkets, here are some things from this region that are hard to find elsewhere, or even unique:\n* '''Dates''': MAD10 for an orange box seems an adequate price after some bargaining.\n* '''Leatherware''': Morocco has a really huge production of leather goods. Beware some Markets are full of mediocre models. Designer shops are found in the big malls.\n* '''Argan oil''' and products made of it such as soap and cosmetics.\n* '''Tagines''': Classic Moroccan cooking dishes made of clay will improve oil/water based meals you make if you plan to bring Morocco to your kitchen back home.\n* '''Birad''': Classic Moroccan tea pots.\n* '''Djellabah''': Classic Moroccan designer robe with a hood. Often come in intricate designs and some are suited for warm weather while other heavier styles are for the cold. Chefchaouen is an excellent place to buy a heavy wool djellaba.\n* '''Carpets''': Genuine handmade Berber carpets can be purchased direct from the artisans who weave them. If you go to small villages, such as Anzal, in the province of Ouarzazate, you can visit the weavers, watch them work, and they will happily serve you tea and show you their products.\n* '''Spices''': Outside the medinas (cheap) in hot dry cities (high quality) will be the best. \nIf you're looking for T-shirts, consider designer items by Kawibi--they look much more inspiring than boring traditional set of themes. They are available in duty-free stores, Atlas Airport Hotel near Casablanca and other places.\n\n===What not to buy===\n* '''Geodes''': Pink and purple dyed quartz are widely sold along with fake galena geodes which are often described as \"cobalt geodes\".\n* '''Trilobite fossils''': Unless you are an expert, you will most likely be buying a fake.\n\n===Bargaining===\nRemember that [[haggle|bargaining]] in the souks is expected. It is not really possible to give an accurate indication of how much to start the bargaining at in relation to the initial asking price, but a general idea would be to aim for approximately 50% off. Prices are set on a daily, even, hourly basis, depending on how much has been sold on a given day (or period of hours), while also reflecting the vendor's personal estimation of the potential client. The souks are often a good reflection of the basic economic principles of supply and demand, particularly with regard to the demand side. If a lot of products have been sold by a particular merchant he/she will raise the price, and may refuse to sell any more products for the rest of that day (or for days) unless the price is much higher than usual. If there are many tourists around prices go higher and bargaining even small amounts off the asking price becomes quite difficult. In addition, the seller will generally inspect the client, whose dress and possessions (particularly if the potential client sports an expensive Swiss watch, camera, etc) are usually the main indication of how high the price may be set above the usual. However, the potential client's attitude is also taken into consideration.\n\nTaking all this and other factors into account (such as the time of day, day of the week, season, etc.), initial prices may be up to 50 times or more in excess of normal prices, especially for more expensive items, such as carpets. '''Carpets''', however, are a very specialized item and it is necessary to have at least a cursory understanding of production techniques and qualities. If possible, an ability to distinguish between hand-made and machine-made carpets, hand-dyes, and the like is helpful to avoid being utterly duped. \n\n'''Bargaining is an enjoyable experience for most vendors''' and they prefer clients that don't appear hurried and are willing to take the time to negotiate. It is most often actually necessary to give reasons why you believe the price should be lower. The reasons you might give are limited only by your imagination and often lead to some very entertaining discussions. Common reasons may include: the price of the item elsewhere, the item not being exactly what you are after, the fact that you have purchased other items from the stall/store, that you have built a rapport with the vendor after discussing football and so forth. On the other hand, '''if there is little movement in the price after some time, the best advice is to begin leaving''', this often has the result of kick-starting the bidding anew, and if not, it is likely that the merchant is actually unwilling to go further below a given price, however absurd. \n\nIt is also important to '''show a genuine interest for the workmanship''' of the product for sale, no matter how uninterested you may actually be in what you are buying. This does not, however, mean that you should appear over-enthusiastic, as this will encourage the vendor to hold his or her price. Rather, it is important to project a critical appreciation for each article/object. Any defects are either unacceptable or a further opportunity to bargain the price down. \n\nYou should take caution to never begin bidding for unwanted items or to give the vendor a price you are unwilling or unable (with cash on hand) to pay. Try to avoid paying by credit card at all costs. In the event you do pay by credit card, never let it out of your sight and demand as many receipts as possible. There is typically a credit card carbon copy and an official shop receipt. \n\n'''Never tell a vendor where you are staying''' and ''''never tell a vendor how much you paid for any other purchases'''. Just say you got a good price and you want a good price from him or her too. And, above all, never be afraid to say 'No'.\n\nIt must also be said that, as is true for buyers, not all sellers are actually very good at what they do. A vendor that is completely uninterested or even aggressive is unlikely to give a good price. Move on.\n\n===Internet===\nDon't forget about the internet. There are various solutions available on the market. The best are eSim based connectivity hubs, such as Nommi. It provides internet in over150 countries at a nearly local price and gives free access to over 4 million Wi-Fi networks around the world which are available via Nommi App as a Wi-Fi map. Additionally, the device functions as a power bank, able to charge a smartphone a few times. Nommi also has a built-in VPN that works in China.\n\n==Eat== \n[[Image:Couscous.jpg|thumb|Couscous]]\n[[Image:Tagine.jpg|thumb|Tagine]]\n[[Image:Souk Medina Casablanca.jpg|thumb|Spices pyramids in Casablanca's ''souk'']]\nMoroccan cuisine is often reputed to be some of the best in the world, with countless dishes and variations proudly bearing the country's colonial and Arabic influences. Unfortunately as a tourist through Morocco, especially if you're on a budget, you'll be limited to the handful of dishes that seem to have a monopoly on cafe and restaurant menus throughout the country. Most restaurants serve dishes foreign to Morocco considering that Moroccans can eat their domestic dishes at home. Apart from major cities, Moroccans do not generally eat out in restaurants so choice is generally limited to international fare such as Chinese, Indian and French cuisine. \n\n===Traditional cuisine===\n* '''Couscous''' made from semolina grains and steamed in a colander-like dish known as a ''couscoussière'' is the staple food for most Moroccans, and is probably the best known Moroccan meal. It can be served as an accompaniment to a stew or ''tagine'', or mixed with meat and vegetables and presented as a main course. Almost all Moroccan restaurants uphold the tradition of serving couscous on Fridays.\n\n* '''''Tagine''''' (or ''tajine''), a spicy stew of meat and vegetables that has been simmered for many hours in a conical clay pot (from which the dish derives its name). Restaurants offer dozens of variations (from MAD25 in budget restaurant) including chicken ''tagine'' with lemon and olives, honey-sweetened lamb or beef, fish or prawn ''tagine'' in a spicy tomato sauce. There are many variations of this dish.\n\n* A popular Berber contribution to Moroccan cuisine is '''''kaliya''''', a combination of lamb, tomatoes, bell peppers and onion and served with couscous or bread.\n\n* A popular delicacy in Morocco is '''Bastella''', made by layering thin pieces of flakey dough between sweet, spiced meat filling (often lamb or chicken, but most enjoyably pigeon) and layers of almond-paste filling. The dough is wrapped into a plate-sized pastry that is baked and coated with a dusting of powdered sugar. \n\nA MAD3-5 serve of ''harira'' or ''besara'' will always include some bread to mop the soup up and will fill you up for breakfast or lunch:\n\n* Moroccans often elect to begin their meals with warming bowl of '''''harira''''' (French: ''soupe marocaine''), a delicious soup made from lentils, chick peas, lamb stock, tomatoes and vegetables. Surprisingly, among Moroccans harira has a role of nourishing food for \"blue-collars\" rather than a high-flying cuisine.\n\n* Soups are also traditional breakfasts in Morocco. '''''Bissara''''', a thick glop made from split peas and a generous wallop of olive oil can be found bubbling away near markets and in medinas in the mornings.\n\nMany cafes (see Drink) and restaurants also offer good value '''''petit déjeuner''''' breakfast deals, which basically include a tea or coffee, orange juice (''jus d'Orange'') and a croissant or bread with marmalade from MAD10.\n\n===Snacks and fast food===\nSnackers and budget watchers are well catered for in Morocco. '''Rotisserie chicken''' shops abound, where you can get a quarter chicken served with fries and salad for around MAD20. '''Sandwiches''' (from MAD10) served from rotisserie chicken shops or hole-in-the-wall establishments are also popular. These fresh crusty baguettes are stuffed with any number of fillings including tuna, chicken, ''brochettes'' and a variety of salads. This is all usually topped off with the obligatory wad of French fries stuffed into the sandwich and lashings of mayonnaise squeezed on top.\n\nYou may also see hawkers and vendors selling a variety of '''nuts''', as well as steamed '''broad beans''' and BBQ'd '''corn cobs'''.\n\n'''Clarify the price''' before ordering and make sure about what you order (the best is asking for the menu). Otherwise you might be charged more or get food you haven't orderd, but last one happens very infrequent.\n\n==Drink== \nAlthough a predominantly Muslim country, Morocco is '''not dry'''. You can legally buy alcohol when you're 18. However, there is no minimum legal drinking age. \n\nAlcohol is available in restaurants, liquor stores, bars, supermarkets, clubs, hotels and discos. Some Moroccans enjoy a drink although it is disapproved in public places. The local brew of choice carries the highly original name of Casablanca Beer. It is a full flavoured lager and enjoyable with the local cuisine or as a refreshment. The other two major Moroccan beers are Flag Special and Stork. Also you can find local judeo-berber vodka, mild anise flavoured and brewed from figs.\n\n'''Driving under the influence of alcohol is illegal even if you drank just one beer'''\n\nAs a rule, do not drink tap water at all in Morocco, even in hotels, as it contains much higher levels of minerals than the water in Europe. For local people this is not a problem as their bodies are used to this and can cope, but for travellers from places such as Europe, drinking the tap water will usually result in illness. Generally this is not serious, an upset stomach being the only symptom, but it is enough to spoil a day or two of your holiday.\n\nBottled water is widely available. Popular brands of water include Oulmes (sparkling) and Sidi Ali, Sidi Harazem and Ain Saiss DANONE (still). The latter has a slightly mineral and metallic taste. Nothing with a high mineralization produced (so far?).\n\nAny traveller will be offered (sometimes very sweet) '''mint tea''' at least once a day. Locally known as \"Moroccan whiskey\" due to its similarity in color, the small glasses it is usually drunk from, and the fact that most Moroccans do not drink alcohol, even the most financially modest Moroccan is equipped with a tea pot, a few glasses, and an almost reverent attitude toward sharing this drink with a guest. Sometimes the offer is more of a lure into a shop than a hospitable gesture -- use your wits to determine when to accept. Before drinking, look your host in the eye and say ''\"ba saha ou raha\"''. It means \"enjoy and relax,\" and any local will be impressed with your language skills.\n\nNote that a solo woman may feel more comfortable having a drink or snack at a pastry shop or restaurant as cafes are traditionally for men. This doesn't apply to couples though.\n\n==Sleep== \nHotels in Morocco are a matter of choice and fit every budget. Classified hotels are 1 star (simple) to 5 star (luxury), and are classified as an ''auberge'', ''riad'', rural ''gîtes d'étape'' or hotel. Stays usually include breakfast, and many include dinner. \n\n===Places to stay===\n'''''Auberges''''' are found in the country or in rural small towns, and are built in the traditional mud (''kasbah'') style, many with wood burning fireplaces and salons or roof terraces for taking meals. Auberge are very comfortable, small and usually family run and owned.\n\n'''Riads''' or '''Dars''' In [[Marrakech]], [[Essaouira]], [[Fes]] or anywhere there is a medina (old city), small hotels renovated from old houses are called '''''riads''''' or '''dars'''. These are often small (about 6 rooms or less), clean and charming, often with to a lovely walled garden where breakfast is served on an inner patio or up on a roof terrace. Dars are usually too small to have a swimming pool, but riads may have what is called a plunge pool to cool off in during summer months. Some are in former merchant houses or palaces and may have large opulent rooms and gardens. These are ideal places to stay in Morocco, and can range in price from budget to splurge depending on size and amenities.\n[[File:RiadEssaouira.jpg‎|thumb|upright=1.3]]\n\n'''''Gîtes d'étape''''' are simple country inns and hostel style places, where mountain trekkers can grab a hot shower, a good meal, and have a roof over their head for one night. \n\nDesert bivouacs are traditional nomad carpeted wool tents with a mattress, sheets and blankets. You can shower at the auberge where you will also have breakfast.\n\nOtherwise there are the usual more modern hotels or equivalent found anywhere in the big cities and larger towns around Morocco.  On the lower end of the budget scale, HI-affiliated '''[[Hostels|youth hostels]]''' can be found in the major cities (dorm beds from around MAD50) while the cheapest '''budget hotels''' (singles from around MAD65) are usually located in the ''medina''. These hotels can be very basic and often lack hot water and showers, while others will charge you between Dh 5 and Dh 10 for a hot water shower. Instead, consider public ''hammams'' as there are quite a lot of them in the ''medina'' and in rural areas.\n\nNewer, cleaner and slightly more expensive budget (singles from around MAD75) and mid-range hotels that are sprinkled throughout the ''ville nouvelles''.\n\nMany hotels, especially those in the ''medina'' have delightful roof terraces, where you can sleep if the weather's too hot. If you don't need a room, you can often rent mattresses on the roof from MAD25.\n\nFor those looking to '''camp''', almost every town and city has a campground, although these can often be some way out of the centre. Many of these grounds have water, electricity and cafes. In rural areas and villages, locals are usually more than happy to let you camp on their property; just make sure you ask first.\n\nWith the exception of large high end hotels, expect the hot water supply in hotels to not be as stable as in more established countries. In Marrakech, MHamid, near Ourzazate and possibly other places, the hot water temperature varies dramatically while you take a shower.\n\n==Learn==\nMost foreigners looking to study in Morocco are seeking either Arabic or French '''language courses'''. All major cities have language centres, and some will even arrange homestays with an Arabic-speaking family during your course.\n\n*[http://www.mcas-arabic.com '''Moroccan Centre for Arabic Studies'''], 10 Ave Allal Ben Abdellah, Second Floor, Rabat ☎ +212 6 01 38 25 36, ''info@mcas-arabic.com info@mcas-arabic.com''. Offers affordable quality Language courses in Modern Standard Arabic, Colloquial Moroccan Arabic, and volunteering as well as internship placements in a wide range of fields. MCAS also provides accommodations with host families, single or double accommodations that are just walking distance to its location.\n\n*[http://www.qalamcenter.com '''Qalam wa Lawh Centre for Arabic Studies'''], 22 Ave Omar ibn Alkhattab, Agdal Rabat ☎ +212 5 37 68 38 66, [mailto:arabic@qalamcenter.com arabic@qalamcenter.com]. Offers courses and academic study abroad programs in Modern Standard Arabic, Colloquial Moroccan Arabic, Arabic Calligraphy, Moroccan Culture, and Islamic History. Qalam wa Lawh offers accommodations in students residences as well as Moroccan host families.\n\n*[http://www.sacal-fez.com '''Subul Assalam Centre for the Arabic Language (SACAL)'''], Meknes way, Lotissement Al Hadika, Lot no. Q4/008, Fez. ☎ +212 35 65 07 06, ;;sacal_fez@yahoo.com sacal_fez@yahoo.com''. Offers courses in Modern Standard Arabic, Moroccan Colloquial Arabic and a series of English language courses on Islam and Morocco. \n\n* '''The Institute for Language Communication Studies''' [http://www.ilcs.ac.ma], 29 Oukaimeden St, Agdal in Rabat. Tel: (37) 67 59 68, Fax: (37) 67 59 65, [mailto:ilcs.adm@ilcs.ac.ma ilcs.adm@ilcs.ac.ma]. The Insitute is one such centre with accelerated and intensive courses starting from Dh 3,000.\n\n* '''The Arabic Language Institute in Fez (ALIF)''' [http://www.alif-fes.com], B.P. 2136, Fez 30000, Morocco. Tel: (212/35) 62 48 50, Fax: (212/35) 93 16 08, [mailto:info@alif-fes.com info@alif-fes.com] This is language school offering a variety of coursework in both Moroccan Arabic and Modern Standard Arabic.\n\n* '''Dar Loughat - Cross-Cultural Language Center''' [http://www.cclc-morocco.org], Tel: +212 66 66 8 77 88, [mailto:info@cclc-morocco.org info@cclc-morocco.org]. Dar Loughat is a professional language center in Morocco providing intensive courses in all levels of Modern Standard Arabic and Colloquial Moroccan Arabic throughout the year. Through various immersion and language exchange activities, Dar Loughat provides its students daily contact with Moroccan life, allowing them to expand their vocabulary, improve their spoken language performance and better understand the local culture.\n\n* '''Arabic and Tamazighte Language Tours ''' [http://www.marrakech-sightseeing-tours.com], B.P. 1356, Marrakech 80000, Morocco. Tel: 00212 662 59 2034, Fax: 00212 528 53 6443, [mailto:haridomar@gmail.com haridomar@gmail.com] This is language tour organisation offering a variety of coursework in both Moroccan Arabic and Tamazighte.\n\nNote; At most places, both in cities and in the countryside, you have the possibility to sleep on the roof or terrace. This will normally cost you MAD20-25 and you're provided with matresses and a warm  blanket. Just ask the receiptionist in the hotel/auberge/gite. If you wanna ask in French, which works fairly good, you can say ''ca serait possible de dormir sur la terrace, s'il vous plait?''\nOften you can bargain on the price and if it's more than MAD30 you should bargain.\n\n==Cope==\nSome Moroccans that you meet on the streets have come up with dozens of ways to part you from your money. Keep your wits about you, but don't let your wariness stop you from accepting any offers of generous Moroccan hospitality. Put on a smile and greet everybody that greets you, but still be firm if you are not interested. This will leave you significantly better off than just ignoring them. The average Moroccan gets paid approximately 10,000 MAD/month (100 USD). \n\n* '''''Faux guides'' and touts''' congregate around tourist areas and will offer to show you around the ''medinas'', help you find accommodation, take you to a handicraft warehouse, or even score some drugs. While these men can often be harmless, never accept drugs or other products from them. Be polite, but make it clear if you're not interested in their services, and if they get too persistent, head for a taxi, ''salon de the'', or into the nearest shop - the shopkeeper will show the faux guide away. \n\n:The best way to avoid Faux guides and touts is to avoid eye contact and ignore them, this will generally discourage them as they will try ''to invest'' their time in bothering another more willing tourist. Another way is to walk quickly; if eye contact happens just give them a smile, preferably a ''strong'' and ''beaming'' one rather than a ''shy'' one meaning ''no! thanks'' (they are very clever in judging human emotions and will bother you if they feel a weakness). The word ''La'' ( Arabic for No ) can be particularly effective, since it doesn't reveal your native language. Just another is to pretend you only speak some exotic language and don't understand whatever they say. Be polite and walk away. If you engage in arguing or a conversation with them, you will have a hell of time getting rid of them, as they are incredibly persistent and are masters in harassment, nothing really embarrasses them as they consider this being their way of earning their living.\n\n*Some of the more common tactics to be aware of are as follows.\n:Many '''Faux guides''' will pretend they are students when they approach you and that they just want to practice their English and learn about your culture, invariably if you follow them, there is a big chance you will end up in a carpet or souvenirs shop. A variant is they will show you an English letter and will ask you to translate it for them, or will ask for your help to their English speaking friend/cousin/relative etc abroad.\n\n:Expect to be told that anywhere and everywhere is 'closed'.  Invariably, this is not the case, but a con to get you to follow them instead.  Do not do this.\n\n:Do not accept 'free gifts' from vendors.  You will find that a group of people will approach you accusing you of stealing it, and will extort the price from you.\n\n:Always insist that prices are fixed beforehand.  This is especially true for taxi fares, where trips around a city should cost no more than 20 Dirham, in general, or be done on the meter. This cannot be stressed enough. In ALL situations (including Henna tattoos) always agree on a price before!\n\n:In general, do not tell a false guide which hotel you are staying at. Also do not tell them if you are staying at an Airbnb. If you do, they may leave you alone but if you are standing around, waiting to meet your Airbnb host, you may be approached by someone claiming to be part of the host’s family. They may even offer you their phone where someone on the other end (who speaks decent English) will tell you there was a mistake and that your expected place is no longer available - but they have a different place for you to stay at. Don’t fall for this sophisticated scam - book an Airbnb with a verified host and trust that your booking is valid.\n\n:When bargaining, never name a price that you are not willing to pay.\n\n:At bus/train stations, people will tell you that there have been cancellations, and that you won't be able to get a bus/train.  Again, this is almost always a con to get you to accept a hyped-up taxi fare.\n\n:In general, do not accept the services of people who approach you.\n\n:Never be afraid to say no.  \n\n*'''Drugs''' are another favourite of scam artists. In cities around the Rif Mountains, especially [[Tetouan]] and [[Chefchaouen]], you will almost certainly be offered ''kif'' (dope). Some dealers will sell you the dope, then turn you in to the police for a cut of the ''baksheesh'' you pay to bribe your way out, while others will get you stoned before selling you lawn clippings in plasticine.\n* '''Ticket inspectors''' on trains have reportedly attempted to extricate a few extra dirham from unsuspecting tourists by finding something 'wrong' with their tickets. Make sure your tickets are in order before you board, and if you find yourself being hassled, insist on taking the matter up with the station manager at your destination.\n* '''Moroccan toilets''', even those in hotels or restaurants, could lack '''toilet paper'''. It is worth buying a roll (french: \"'''papier hygenique'''\"). \n\nTry to learn at least a phrasebook level of competency in French or Arabic (Spanish may help you in the North - but not largely). Just being able to say ''\"Ith'hab!\"'' (\"Go Away!\") may be useful to you... Many locals (especially the nice ones who are not trying to take advantage of you) will speak limited English. If you can at least verify prices in French with locals, you could end up saving a lot of money.\n\n===What to wear===\nYou won't need high and heavy mountain boots unless you go in coldest time of the year like February: it's quite warm in the country even when it's heavy raining in November. Even in medinas, streets are paved if not asphalted--just be sure your footwear is not toeless in medina, as it may be dirty or unsanitary.\n\nFor trekking in valleys, low trekking shoes will be likely enough.\n\nFor a desert trip to dunes, ensure your pockets can be easily shaken out as sand gets in there very quickly.\n\n===Time===\nMorocco does not normally operate Daylight Saving Time, but has adopted it during recent years. In 2011, legal time is advanced one hour from 2 April to 31 July.\n\n==Stay safe==\n*'''Overall''': Morocco remains a safe place with one of the lowest homicide rates in the world and among, if not the safest country in Africa. Morocco has its share of problems, but they can be easily avoided should you follow common sense. Avoid walking at night or in dark alleys. Travel in a group whenever possible. Keep money and passports in a safety wallet or in a hotel safety deposit box. Keep backpacks and purses with you at all times. Make sure there is nothing important in outside or back pockets.\n\n*'''Women (General) ''': Women especially will experience almost constant harassment if alone, but this is usually just cat-calls and (disturbing) hisses. Don't feel the need to be polite--no Moroccan woman would put up with behaviour like that. Dark sunglasses make it easier to avoid eye contact. If someone won't leave you alone, look for families, a busy shop, or a local woman and don't be afraid to ask for help.  If you are so inclined, you could wear a ''hijab'' (headscarf), which is not necessary. Morocco can be a very liberal country and many Moroccan women do not wear headscarves.  However, women should ''always'' dress conservatively (no low-cut tops, midriffs, or shorts), out of respect for the culture they are visiting. \n\nThe general rule is to follow the lead from local women. Locals will assume that Moroccan women venturing into nightclubs or bars alone are prostitutes in search of clientèle but foreign women entering such places will be not be so considered but will be thought of as approachable. Be careful about being drugged, especially as a solo traveler. \n\n*'''Hustlers''': They can be a big problem for people travelling to Morocco. It's sometimes difficult to walk down the street without being accosted by somebody offering to give you directions, sell you something, etc. Your best bet is to politely refuse their services and keep walking, as all they are after is money.  There are some legitimate tour guides, never let yourself be pressured into purchasing anything you don't. Also at tourist attractions they will come up to you and start explaining the history or offer to take your pictures, do not forget to say stop or you'll end up being overcharged.\n\n*'''Con Artists''': Con artists are a persistent problem in Morocco. Most are relatively easy to spot, but others seem quite genuine for several days. This latter type pretends to be the tourist's friend for multiple days, shows them the city, and gives them tips on where to stay. It is only when the tourist finally believes them to be genuine that the con artist steals everything they can from them. Some of these people are quite well-known for employing this lengthy confidence trick. \n\n*'''Driving''': '''Driving under the influence of alcohol is strictly illegal''' \n\n*'''Drinking''': Avoid drinking in public. (alcohol)\n\n*'''Homosexuality''': ''Be aware that homosexuality is '''illegal''' (also in Western Sahara) and is punishable.’’ However, homosexual travelers should not be frightened away. There are many homosexuals who are partially “out” in the larger cities. As always, be cautious but do not miss out on visiting this country.\n\n*'''Other''': ''Armed fighting in the disputed areas of the Western Sahara near the southern borders is extremely rare. However, don't wander too far off the beaten paths either as this region is also '''heavily-mined'''.\n\n==Stay healthy==\n\n===General concerns===\n*'''Inoculations''': No particular inoculations are needed for Morocco under normal circumstances, but check with the [http://www.cdc.gov/travel/ CDC's travel web pages] for any recent disease outbreaks. As with most travel, it makes good sense to have a recent tetanus immunization. If you plan to eat outside the circle of established restaurants, consider a Hepatitis A inoculation.\n*'''Food and Drink''': Avoid uncooked fruits and vegetables that you can not peel. Avoid any food that is not prepared when you order it (i.e. buffets, etc). Usually fried and boiled foods are safe. Some travellers have also had problems with unrefrigerated condiments (such as mayonnaise) used in fast food outlets.\n*'''Water''': It is advisable to drink bottled water (check that the cap is sealed - some people might try to sell you tap water in recycled bottles). Be wary of ice or cordials that may be made with tap water. Some hotels provide free bottled water to guests and its wise to keep a supply in your room so as not to be tempted with tap water.\n*'''Shoes''': Keep your sandals/tevas etc for the beach. Moroccan streets double as garbage disposal areas and you do not want to wade though fish heads and chicken parts with open-toe shoes.\n*'''Malaria''': Present in the northern, coastal areas of the country but is not a major problem. Take the usual precautions against being bitten (light coloured clothing, insect repellent, etc) and if you are really worried see your doctor about anti-malarial medication before your departure.\n\n===Medical help===\nTravellers will often be required to pay for drugs/treatements received up front.\n\n*'''Pharmacies''': Pharmacies are denoted by a green cross, usually in neon. They sell medicines, contraceptives, and often beauty and related products . \n\n*'''Self-employed doctors''':\n\nMost general practitioners, specialists, and dentists are self-employed; look for signs saying \"Docteur\" . An average doctor’s check-up in a city costs between 150 and 300 dirhams. In general, the quality of the doctors work is decent, but you should always try to ask some locals for a good doctor recommendation. There are few English-speaking doctors, though French is widespread.\n\n*'''Private clinics''':\n\nTreatments in private clinics  will be quite expensive and travelers will be required to pay for any treatment received up front.\n\n*'''Public Hospitals''':\nGovernment hospitals are cheap and okay for minor injuries and minor problems, but they tend to lack of money and be very crowded. For anything serious, a private clinic is generally preferable. \n\n*'''Rural Areas''' : Medical care can be difficult or impossible to find in rural areas\n\n==Respect==\n*'''Greetings''' among close friends and family (but rarely between men and women!) usually take the form of three pecks on the cheek. In other circumstances handshakes are the norm. Following the handshake by touching your heart with your right hand signifies respect and sincerity.\n*'''Left hands''' used to traditionally be considered 'unclean' in the Muslim religion and Amazigh nomadic cultures, as they used to be reserved for hygiene in toilets. As in many cultures it could be considered impolite to shake hands or offer or accept something from someone with your left hand, more so is giving money by your left, so try to avoid that. While left-handed people may get an occasional exclamation, and local children may get pressured by parents to use their right in traditional societies, most people will understand if you do your own business with your left hand.\n* '''Elders''' Moroccans still have the tradition of highly respecting their elders and the sick. If someone who is handicapped, or older than you is passing, then stop and allow room for them. Or if a taxi arrives and you are waiting with an elder, then you should allow the older person to take precedence over you. Tourists are not held to these expectations, but it improves regard for tourists in Morocco when they adhere to the same traditions.\n\n==Contact==\n\n===Telephone===\n'''Public telephones''' can be found in city centres, but private '''telephone offices''' (also known as ''teleboutiques'' or ''telekiosques'') are also commonly used. The international dialling prefix (to dial ''out'' of the country) is 00, but international rates are comparatively expensive. If you have a lot of phone calls to make, it may be worth ducking into the Spanish enclaves of [[Ceuta]] or [[Melilla]].\n\n'''The telephone numbering scheme was changed in March 2009. All fixed telephone numbers have a ''5'' inserted after the ''0'', and all mobile telephone numbers have a ''6'' inserted after the ''0.'' All numbers are now ten-digit long, counting the initial ''0.'''''\n\n'''Useful Numbers'''\nPolice: 19; \nFire Service: 15; \nHighway Emergency Service: 177; \nInformation: 160; \nInternational Information: 120; \nTelegrams and telephone: 140; \nIntercity: 100.\n\nThe GSM '''mobile telephone''' network in Morocco can be accessed via one of two major operators: Meditel [http://www.meditel.ma] or Maroc Telecom [http://www.iam.net.ma/]. Prepaid cards are available. More infos on available services, coverage and roaming partners are available at:  GSMWorld [http://www.gsmworld.com/roaming/gsminfo/cou_ma.shtml].\n\nIt is very easy and cheap to buy a local GSM prepaid card in one of the numberous phone shops showing a Maroc Telecom sign. The SIM card (carte Jawal) costs only MAD30 (&euro;3) with MAD10 (&euro;1) airtime. The rate is national: MAD3-4, to Europe ca. MAD10, SMS MAD3. The card is valid 6 month after the last recharge.\n\n===Post===\nThe Moroccan postal service is generally reliable and offers a ''post restante'' service in major cities for a small fee. You will need some identification (preferably your passport) to collect your mail.\n\nItems shipped as '''freight''' are inspected at the post office before they are sent, so wait until this has been done before you seal the box.\n\nDon't leave postcards with the small post office at Marrakech Airport as they'll never be delivered, despite taking your money for postage stamps. Postboxes on streets seemed to be a more reliable means to send postcards.\n\n===Email & internet===\nMoroccans have really taken to the internet. '''Internet cafes''' are open late and are numerous in cities and smaller towns that see significant tourist traffic. Rates are about 4 - 10 dirhams per hour and they are often located next to, above, or below the ''telekiosque'' offices. Speeds are acceptable to excellent in the north, but can be a little on the slow side in rural areas. Most internet cafes will allow you to print and burn CDs for a small charge.\n\nMoroccans have also really taken to 4G coverage. There is excellent access to email and the internet via Mobile Phones and it is relatively cheap.  As a result, there are fewer Internet cafes in tourist areas. There is 4G access throughout the mountains and in the desert, as well as in all cities.  To obtain 3G  pay-as-you-go  SIM cards from the phone network's stores, you will need to show your passport.  These stores cost the same as the unauthorised vendors but often provide better service for tourists, telling you your phone number, showing you how to top up and giving you tariff information, etc.  These extra services make the long queues worthwhile!\n\n[[WikiPedia:Morocco]]\n[[World66:africa/morocco]]\n\n{{isPartOf|North Africa}}\n{{hasDocent|DenisYurkin}}\n\n{{outline}}\n{{countryguide}}\n{{geo|32.0000|-5.0000}}\n\n\n\n[[ca:Marroc]]\n[[de:Marokko]]\n[[eo:Maroko]]\n[[es:Marruecos]]\n[[fi:Marokko]]\n[[fr:Maroc]]\n[[hu:Marokkó]]\n[[it:Marocco]]\n[[ja:モロッコ]]\n[[nl:Marokko]]\n[[pl:Maroko]]\n[[pt:Marrocos]]\n[[ro:Maroc]]\n[[ru:Марокко]]\n[[sv:Marocko]]\n[[zh:摩洛哥]]\n\n[[wts:Category:Morocco]]\n\n\n[[wmc:category:Morocco]]"
        }
    }
}