{
    "parse": {
        "title": "Palau",
        "pageid": 713,
        "wikitext": {
            "*": "{{pagebanner|Palau banner.jpg}}\n\n{{quickbar\n|image=Palau.jpg\n|caption=limestones, Palau\n|location=Palau in its region.svg\n|flag=Flag of Palau.svg\n|capital=[[Melekeok]]\n|government=constitutional government in free association with the [[United States]]\n|currency=US dollar ($, USD)\n|area=458km²\n|population=20,579 (July 2006 est.)\n|language=English and [[Palauan phrasebook|Palauan]]; also Sonsorolese, Tobi, Angaur, [[Japanese]]\n|religion=Roman Catholic 42%, Protestant 23%, Modekngei 9% (indigenous to Palau), Seventh-Day Adventist 5%, Jehovah's Witness 1%, Latter-Day Saints 0.6%, other religion 3%, unspecified or none 16%\n|electricity=120V, 60Hz (North American plug)\n|tld=.pw\n|callingcode=+680\n|timezone=UTC +9\n}}\n[http://www.visit-palau.com/ '''Palau'''] (''Belau'')  is a group of islands in the Micronesia area of [[Oceania]], to the southeast of the [[Philippines]].\n\n==Understand==\nAfter three decades as part of the UN Trust Territory of the Pacific under US administration, this westernmost cluster of the Caroline Islands opted for independence in 1978 rather than join the [[Federated States of Micronesia]]. A Compact of Free Association with the US was approved in 1986, but not ratified until 1993. Palau officially became independent on 1 Oct 1994.\n\n===History===\nEarly Palauans may have come from [[Polynesia]] and [[Asia]]. Depending on the origin of a family, Palauans may represent many parts of [[Melanesia]], [[Micronesia]] and Polynesia. However, they are not traditionally considered to be Micronesian. For thousands of years, Palauans have had a well established matrilineal society, believed to have descended from Javanese precedents. \n\nPalau had limited relations before the 18th century, mainly with [[Yap]] and [[Java]]. Had it not been for shipwrecked islanders who took refuge in the Philippines, Europeans likely would not have found Palau until much later. Englishman Captain Henry Wilson was shipwrecked off the island of Ulong in 1783 and it was Wilson who gave the archipelago the name \"Pelew Islands\".\n\nIn the late 19th century, possession of the islands was claimed by Britain, Spain, and Germany. In 1885, the matter was brought to Pope Leo XIII for a decision. The Pope recognized the Spanish claim, but granted economic concessions to Britain and Germany. Palau then became part of the Spanish East Indies, along with the [[Northern Mariana Islands]], the Caroline Islands and the [[Marshall Islands]]. They were all administered from the [[Philippines]]. Spain sold the Palau archipelago to Germany in 1899 after which it was  administered from German New Guinea, and a period of economic development began. German engineers began exploiting the islands' deposits of bauxite and phosphate, and a rich harvest in copra was made. WWI intervened and the German period lasted only 15 years after which the League of Nations awarded Palau to Japan. The Japanese presence made Palau a major target for the Allied forces in World War II, and there were several major battles in the area.\n\n===Climate===\nPalau enjoys a tropical climate all year round with an annual mean temperature of 82°F (28°C). Rainfall can occur throughout the year, averaging a total of 150 inches (3,800mm). The average humidity over the course of the year is 82%, and although rain falls more frequently between July and October, there is still much sunshine. Typhoons are rare, as Palau is outside the main typhoon zone.\n\n==Regions==\n[[Image:Palau Regions map.png|thumb|upright=2]]\n\n{{Regionlist\n\n| region1name=Babeldaob  \n| region1color=#71b37b\n| region1items=[[Melekeok]]\n| region1description=the largest Island, with a population of roughly 6,000 people, also ''Babelthuap, Babelthwap, Babeldoub, Babeldaub, etc''. \n\n| region2name=[[Koror]]\n| region2color=#d56d76\n| region2items= \n| region2description=home of the largest city of the same name\n\n| region3name=Rock Islands \n| region3color=#d09440\n| region3items=\n| region3description=made up of almost 300 mostly uninhabited islands, home to Jellyfish Lake, a lake with millions of jellyfish with very weak stingers where snorkelers can safely swim.\n\n| region4name=Peleliu \n| region4color=#008080\n| region4items=\n| region4description=about 700 people live here, mostly in the village of Kloulklubed\n\n| region5name=Angaur \n| region5color=#782121\n| region5items=\n| region5description=remote southern outpost with about 200 inhabitants, site of a major WWII naval battle and a modern day surfing destination of some repute\n\n| region6name=Sonsorol Islands \n| region6color=#b675a0\n| region6items=\n| region6description=consists of Sonsorol and Hatohobei states, these islands are home to about 100 people way to the southwest of the rest of Palau. \n}}\n\n==Cities==\n* [[Melekeok]] - is the new capital with a population of just 381 (!) This is on the island of Babeldaob and is a pleasant drive from Koror along the new road constructed by Daewoo. Head out over the bridge and the road to Melekeok is clearly signposted.\n* [[Koror]] - the largest city and former capital. Koror contains Palau's only real concentration of shops, restaurants, and hotels. Many of the largest dive operators are also based here.\n\n==Other destinations==\nThe South West islands of Palau are worth a visit if you have your own marine transport such as an ocean-going yacht. There are Sonsorol, Fana, Meriil, Hatohobei and Helen Reef, a conservation area. However be sure to take mosquito repellent if visiting Meriil as its local name is dancing island. Go there and you will find out why! If intending to visit any of these islands it is a wise idea to make the acquaintance of the governors at their offices in Koror itself. If you are lucky you just might be able to take a trip on the island supply vessel the Atoll Way. Sleeping is on a hard wooden platform along with the other souls who are either returning to their home islands or maybe the doctor from Peleliu island hospital who is making a routine visit to check up on the health of the islanders.\n\n==Get in==\n===Visa-free===\n[[Marshall Islands|Marshallese]], [[Federated States of Micronesia|Micronesian]], and [[United States|US]]/[[American Samoa|American Samoan]] citizens do not require a visa to enter Palau for up to a year. Citizens of [[Israel]] do not require a visa for up to 90 days.\n\n===Visa===\nNearly all other visitors can receive a free 30-day tourism visa on arrival.  Citizens of [[Bangladesh]] and [[Myanmar]] must obtain a visa in advance for entry. For the latest information, contact the Palau Embassy in your country. Most travellers arrive by air from Guam, South Korea, Japan, Taiwan (Taipei), or the Philippines (Manila). Visitors must have a current passport, and a return airline ticket to travel to Palau.\nWarning: there is not one, but TWO taxes you will have to pay on exit from Palau -- $30 green tax and $20 head tax -- a total of $50 (December 2016).\n\n===By plane===\nThe only realistic choice.  There is only one airport, Airai (ROR), on Babeldaob.  \n\nVisitors can take United Airlines' daily flights from [[Guam]] (c. $600), which has connections to [[Japan]] and the [[United States]], as well as from [[Manila]], Philippines.\n\nDelta Air Lines launched daily service to (ROR) from Tokyo-Narita (NRT) on December 2010 with connections on to many destinations throughout Asia as well as to its hub cities in the US (including Hawaii).\n\nAsiana Airlines and Korean Air currently operate regularly scheduled flights from [[Seoul]]'s Incheon airport.\n\nThere are also chartered flights direct from [[Taipei]], [[South Korea]], and [[Japan]] on a variety of operators.\n\nThe airport is small and has few facilities, and it might happen that no taxis are available on arrival. The best option is to book in advance local transportation with your hotel, otherwise you should call taxi from downtown to pick you up. There are some car rental booths, but they might be closed on weekend. Again, if you need to rent a car, is better to book in advance.\nAs of December 2016, airport facilities are deplorable -- you cannot buy even a bottle of water.  Taxis are extremely expensive -- $20 to $30 for a distance of about 6 km to Koror- this is a complete rip-off.  The airport has no Internet connection whatsoever, paid or free; there is no air conditioning in the main hall.  Be warned that the airport is simply dirty and filthy -- and except for a few tiny seats, there are no places to sit.\n\n===By boat===\nPossible but not very easy.\n\n==Get around==\n\n===By road===\n\nTaxis and rented cars are available. Lots of local taxis can be found in Koror - they are not metered and fares are negotiable.\n\nIf you rent a car, be prepared to drive slowly on some bumpy roads. The road north was recently paved and is very nice... once you get past the airport.\nTraffic moves on the right, however many cars are right hand drive which can cause some confusion. The national speed limit is 40 km/h (25 mph). If you drive south, to Ice Box Park, please note that the facility behind it is a sewage treatment plant.\n\n===By sea===\n\nTo move between the islands, you can make use of private boats or use the [https://en.wikipedia.org/wiki/Palau \"government run boats\"] as a cheaper alternative.\n\n==Do==\n[[Image:Bull shark.jpg|thumb|upright=1.3|Bull Shark]]\n\nPalau is most famous for [[scuba diving]]. One of the most famous dive sites - Blue Corner, with constant sharks and a high current - is located less than 1 hour's boat ride from most resorts. There are also tours to WWII battle fields on Palau.\n\n'''The Blue Corner, German Channel, Ulong Channel''' and '''Blue Holes''' are all amazing dive sites. You can dive the same site again and again and have completely different experiences each time. \n\nPalau is also famous for its Jellyfish Lake. This lake contains jellyfish which have evolved away their stingers in the absence of predators. Prior to 2017 there were many tours which took visitors to Jellyfish Lake to snorkel (no SCUBA diving allowed). '''Palau Jellyfish Lake''' [http://www.kororstategov.com/tourist.html] was included in the category of natural phenomena and scientific mysteries. Aside from the cost of the tour (around $100), there was a $100 permit for the jellyfish lake which was valid for ten days. As of early 2018, Jellyfish Lake has been closed to visitors for over a year. The jellyfish have almost all died due to irresponsible tourists wearing sunscreen in the water, damaging the fragile and unique ecosystem of this incredible lake. The few remaining jellyfish are being protected, with the hope that their population will rebound. The lake reopened to visitors in late 2018.  Please beware that to access the lake you must hike up and down a rather steep, slippery set of stairs.  Make sure you have good shoes for both walking and water (water booties or sport sandals).  You should NOT wear sunscreen in the water to protect the jellyfish so instead wear rashguards and swim leggings/pants.  There are many tourists who behave irresponsibly here-picking up and throwing the jellyfish, intentionally hitting them with flippers.  Do not do this and report to your guide if you see this kind of behavior.\n\n'''Long Island Park''' offers a mildly interesting snorkeling area. It's located just south of the two bridges that connect Koror and Malakal. From Koror, cross the first bridge and then turn left.\n\n'''Icebox Park''', at the southern tip of Malakal, offers a nice view. However, swimming is not advised as it is immediately adjacent to a waste water outlet (clearly visible at low tide).\n\n'''Nikko Bay''' is a great place for kayaking and snorkeling. A good place to launch your kayak is Ngermid Boat Pier. Head a few hundred meters south from the pier and you will see a floating wooden dock, under which lives a huge Napoleon fish. Snorkeling around the islets to the immediate west of the dock is quite impressive.\n\n'''IMPAC''', short for Imperial Palau Corporation provides day tours to Rock Islands including jellyfish tour and kayaking tours.\n\n*<do name=\"Expedition Fleet\" url=\"http://www.expeditionfleet.com/\">, is the largest privately owned live-aboard fleet in the Philippines. Their ships operate all over the Philippine Island and Palau. Expedition Fleet is known for experienced and professional Dive Masters as well as excellent service on board.</do>\n\n*<do name=\"Splash\" url=\"http://www.splash-palau.com/\">, the dive shop attached to the Palau Pacific Resort is recommended. The equipment available for rental is of high quality, and either new or well maintained. The dive masters are also very experienced, responsible and know the dive sites very well. Angelo at Splash is highly recommended as a dive master especially if you have not dived in stronger currents. It should be noted that Splash runs a rather large, wide dive boat, containing 20+ divers.</do>\n\n*<do name=\"Fish 'n Fins\" url=\"http://www.fishnfins.com/\"> is the oldest dive center in Palau. They currently have two live-aboard vessels, as well as seven smaller (and faster!) dive boats, operating from the base in Koror. The guides are very professional and are more than willing to share their extensive knowledge of the ocean and the life in it. Divers can use Nitrox EAN 32 for the same price as air. Gas mixtures for technical divers are also available.</do>\n\n*<do name=\"Sam's Tours\" url=\"http://www.samstours.com/\"> is another dive shop in Palau that offers diving, snorkeling, kayaking, fishing and land tours. They have some great guides that provide educational and environmental information about the locales. Sam's Tours uses small, fast narrow boats which carry 4~8 divers.</do>\n\n*<do name=\"Palau Dive & Scuba\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"http://www.palaudive.com\" hours=\"\" price=\"\" lat=\"\" long=\"\">Small, personable service that brings together all the information on dive sites, conditions and dive centers for Palau. </do>\n*<do name=\"Sara Guide Service\" alt=\"\" address=\"\" directions=\"\" phone=\"488 6856\" url=\"http://www.saraguideservice.com/\" hours=\"\" price=\"\" lat=\"\" long=\"\">Environmentally responsible professional sports fishing guides in Koror. They have experienced Palauan boat captains and Japanese and Western guides that make you feel welcome. Catch and release fish and have a great time! Great food too on their 8 and 10m boats.</do>\n*<do name=\"Palau Dive Adventures\" alt=\"\" address=\"\" directions=\"\" phone=\"888-334-3483 (DIVE)\" url=\"http://www.palaudiveadventures.com/\" hours=\"\" price=\"\" lat=\"\" long=\"\">is located on the premises of the popular Sea Passion Hotel. Palau Dive Adventures dive shop runs tailored group trips (8-10 divers)on a weekly (M-F) basis. Divers dive all week from the same boat, with the same group and dive guide. At night they stay in comfortable,land-based accommodations. The entire week's dive site itinerary is tailored to the desires of the guests and the staff at Palau Dive Adventures works with the groups to ensure maximum time on the water by day and comfort on land at night. Palau Dive Adventures supplies Nitrox EAN 32 and will accommodate special dive needs and requests. </do>\n\n*<do name=\"Palau 7th Wonder Dive and Tours\" alt=\"\" address=\"\" directions=\"\" phone=\"+680 775 8099\" url=\"http://www.palau7w.com\" hours=\"\" price=\"\" lat=\"\" long=\"\"> it is located at Koror, Palau . The exact location of it is at the back of WCTC Shopping Mall. The owner, office staff, boat captain and Tour Guides are all professional. The languages that they can speak are English, Chinese and Palauan. They give the standard Service.</do>\n*<do name=\"NECO Marine Palau\" alt=\"\" address=\"P.O. Box 129 Koror, Palau 96940 \" directions=\"Located at the NECO Malakal Marina\" phone=\"+(680) 488-2009\" url=\"www.necomarine.com\" hours=\"7:30-5:30\" price=\"$\" lat=\"\" long=\"\">Neco Marine is a locally owned and operated tour operator that was also PADIs first dive center on Palau. NECO Marine Palau provides custom tours and boat charters, specializing in scuba diving, special discounted palau resort packages, snorkelling, and fishing. Whether looking to book an activity for a large group or a customized private tour, Neco Marine Palau can accommodate almost any request. Divers are also able to enjoy up to 32% EAN Nitrox complimentary on any dive.</do>\n\n==Talk==\n\n'''English''' and '''[[Palauan phrasebook|Palauan]]''' are spoken widely and are the official languages.\n\nPalauan is a Malayo-Polynesian language that is influenced by Japanese, Spanish, and German. For example: ''mado'' (window) or ''tanjobi'' (birthday) are Japanese words, and ''ikelesia'' (church) comes from Spanish. \n\nIn the states of Sonsorol and Hatohobei, the local languages Sonsorolese and Tobian respectively are official languages alongside Palauan.\n\n[[Japanese phrasebook|Japanese]] is an official language in the state of Angaur, and is widely spoken across Palau by older Palauans.\n\n[[Filipino phrasebook|Filipino]] (largely based on [[Tagalog phrasebook|Tagalog]]) is widely spoken in hotels, restaurants, and shops due to the large number of Filipinos working in these establishments. Kuya (older brother) and Ate (older sister) are even used as general terms for calling out to people.\n\n==See==\n* <see name=\"Palau International Coral Reef Center\" alt=\"\" address=\"\" directions=\"\" phone=\"680.488.6950\" email=\"picrc@picrc.org\" fax=\"\" url=\"http://www.picrc.org/\" hours=\"\" price=\"\">Very educational aquarium with a good souvenir shop. Emphasis of displays is on education. They include a topographical map of Palau; a recreation of a mangrove swamp, a seagrass aquarium; an inner reef aquarium; an exhibition of coral and another of the country's famed jellyfish; deep-water aquariums and a couple of salt-water crocodiles to end the tour. Easy walk from downtown Koror in the direction of Malakal</see>\n*<see name=\"Etpison Museum\" alt=\"\" address=\"Main Road, Koror, Palau\" directions=\"on the right side of the road coming from the airport going to Koror\" phone=\"(680) 488-6730\" url=\"http://www.etpisonmuseum.org/\" hours=\"Monday - Saturday: 9am - 5pm\" price=\"$10 (tourists)\" lat=\"\" long=\"\">The museum is dedicated to the late Palau President Ngiratkel Etpison (1989-1993). The 3-story building houses 2 floors of Palauan and Micronesian artifacts, displays, photography and information. The top floor has restrooms, more displays, and a large gift shop selling art, jewelry, books and souvenirs.\nIt also doubles as the French Consulate office in Palau. </see>\n\n==Buy==\nPalau uses the '''US dollar''' as its currency. Visa and Master cards are commonly accepted, however, American Express generally is not accepted.  WCTC and Surangel and Sons are the two biggest stores with a grocery and department stores. There are numerous souvenir shops, convenience stores, and boutiques throughout Palau but the largest concentration is in downtown Koror. If you are from a country or territory with the US dollar as a official currency, you will not need to worry about understanding prices and currency transferring. Also if you are from [[Bermuda]], [[East Timor]], [[Panama]], or [[Bahamas]], the official currency(ies) of the mentioned countries and territories have fixed exchange rates to the US Dollar. Meaning what price is said in Palau will be understood with your country's/territory's official currency. Example; $150 US Dollars will equal $150 Bermudian dollars, but you will still have to exchange currencies.\n\n*<buy name=\"W.C.T.C. Shopping Center\" alt=\"\" address=\"Koror\" directions=\"Located at the heart of Koror\" phone=\"+680 488-1633/2394/1484\" url=\"\" hours=\"7:00am-10pm\" price=\"\" lat=\"\" long=\"\">This is the shopping destination in town.  It has a full-size grocery store, a drug-store, digital photo printing, The Athlete's Foot, and a full-service department store with a broad selection of local souvenirs.</buy>\n\n\n*<buy name=\"Surangel and Sons Company\" alt=\"\" address=\"Main Road, Koror, Palau\" directions=\"\" phone=\"+680 488-2608\" url=\"http://www.surangel.com/storehome.html\" hours=\"Sunday - Thursday (7am - 10pm); Friday (7am to sunset); Saturday (sunset - 10pm)\" price=\"\" lat=\"\" long=\"\">The store has a grocery at the ground floor, department store on the second floor, and other shops and offices on other floors. Surangel and Sons Company (SASCO) is a multi-faceted company carrying a wide range of products for wholesale and retail distribution.\n\nSurangel's Grocery offer the islands most complete selection of fresh produce, frozen meats, canned goods and health food.\n\nMason's Hardware Do-It Center offers a large selection of quality hardware and construction supplies at low prices.\n\nSurangel's Department Store carries a broad range of products from Bench, Rusty Lopez, Dickies, Huffy, Freestyle, Fisher Price, Hufty, V-tech and Sony are but a few of the brands we carry.\n\nRAW Surf & Dive Shop offers a wide range of surf wear, scuba diving gear, sporting goods and fishing supplies.  Brands carried include: Quiksilver, Roxy, Billabong, O'Neil, Oakley, Levis, Scuba Pro, Adidas, Accel Sports, Wilson, Crossman, Strike Pro Lures,  Yo-Zuri, Omoto Fishing Tackael and Pen Reels among others.</buy>\n\n===Costs===\nAs you might expect from a remote island where tourism is the main industry, prices are comparatively high, and even a low-end daily budget would be around $100/day. Meals in restaurants and cafes are generally between $5 and $10. Snack shops that also serve hamburgers, pasta, and rice meals offer food starting at $3. Meals in mid- to high-end restaurants start at $20.\n\n===Shopping===\nPalauan '''storyboards''' are traditional wood carvings depicting Palauan myths and legends.\n\n==Eat==\n* '''Almost everything.''' Palau has large communities from Taiwan, the Philippines, Korea, Japan and the USA and the local stores have evolved to supply their needs. So Koror offers an amazing range of foodstuffs in its stores, at a price of course. Japanese-inspired '''Bento''' lunch boxes are very popular.\n\n*'''The Rock Island Cafe''' in Koror is a great place for a quick bit of American-style food. It is located a little west of the Court House on Koror Island.\n\n* '''Kramer's''' - on the wharf at Malakal. A bit hard to find for the first time but food is good and the nightlife always interesting.   \n\n*'''Bem Ermii''' is in a small trailer near the courthouse in downtown Koror, and makes great burgers and milkshakes.\n\n*'''Carp''' is a good medium-range option with generous portions and well prepared dishes of Japanese and local flavor, including coconut crab.  It's located adjascent to the Palau Royal hotel next to the dock that takes you to the Carp Island resort.\n\n*<eat name=\"Keanos\" alt=\"Formerly Little Italy\" address=\"Main Street, Koror\" directions=\"Across from Palasia Hotel\" phone=\"488-6637\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">Keanos has an extensive, tasty menu, primarily Italian cuisine, serving breakfast, lunch and dinner.  The atmosphere is bright, and two entrees and two drinks came to $45.  </eat>\n*<eat name=\"Anathias Cafe\" alt=\"\" address=\"Main Street\" directions=\"Across from Palau High School\" phone=\"488-6491\" url=\"\" hours=\"7 AM - 11 PM, Closed Sunday\" price=\"\" lat=\"\" long=\"\">Anthias Cafe is an inviting bar/restaurant, playing American jazz in both the enclosed downstairs and open air upstairs sections.  Large menu with a reasonable bar selection, $5 local draft beers served in chilled glasses.  Prices are typical of Palau.  Only downside is substantial traffic noise when on the upstairs deck.</eat>\n*<eat name=\"Drop Off Bar and Grill\" alt=\"\" address=\"129 Malakal Road \" directions=\"visit the Neco Marine Marina, right next to the Cove Resort and Palau Royal Resort\" phone=\"(680) 488-7505\" url=\"www.necomarine.com/dropoff\" hours=\"10:30am-2:00pm, 4:00pm-10:30pm\" price=\"$\" lat=\"\" long=\"\">Popular hangout located near the Palau Royal and Cove Resorts, Drop Off is a outdoor restaurant that is frequented by tourists and locals alike. Most ideal for a relaxing casual afternoon by the swimming pool, or for a night of conversation and drinks. The bar specializes in fresh locally caught fish served in a various tasty varieties. Dont miss their famous Poke or spicy Poke Bowls. Palau's local beer is readily available on draft. The menu also offers large burgers, sandwiches, steak, pizza and fish and chips. Vegetarian options are also available</eat>\n\nSeveral other places of note in Koror are the '''Taj''', an excellent Indian restaurant, '''Fuji''', a reasonably-priced pseudo-Japanese restaurant or '''Dragon Tai''' on the way into Koror.\n\n==Drink==\nThe legal drinking and purchasing age of alcoholic beverages is '''21'''.\n\n'''Red Rooster Beer.'''Despite its size Palau has a small brewery, to be found next to the West Plaza by the Sea hotel (see below). It offers Amber and Stout and three other beers.\n\n'''Drop Off Bar and Grill''' (488-7505) a Popular hangout located near the Palau Royal and Cove Resorts, Drop Off is a outdoor bar that is frequented by tourists and locals alike. Drop Off is popular with local sports fans and is a great place to catch the latest game or enjoy a cold draft beer after a day of diving. After dinner hours the bars a great place to enjoy a lively conversation with a variety of locals or relax with friends\n\nMany licensed establishments in Palau -- from quiet little bars to \"Japanese\"-style karaoke bars complete with bar girls. For a decent affordable drink, try '''Sam's Dive Shop''' or '''High Tide'''.  Alcohol is readily available at most stores. Public drinking is not allowed, and the local police are more than happy to inconvenience you if you are caught.\n\n*<sleep name=\"Q-ball club\" alt=\"\" address=\"\" directions=\"koror\" phone=\"4881832\" url=\"\" checkin=\"\" checkout=\"\" price=\"\" lat=\"\" long=\"\">you can play pool and chill out</sleep>\n\n==Sleep==\n*<sleep name=\"Rose Garden Hotel\" alt=\"\" address=\"Meyuns, Koror\" directions=\"\" phone=\"680-488-7672\" url=\"www.palaurosegarden.com\" checkin=\"\" checkout=\"\" price=\"\" lat=\"\" long=\"\">Built into a hill side, the rustic Rose Garden has a lot of steps, which would be difficult for elderly or disabled guests to negotiate.  The on-site restaurant serves large portions of good quality local, Japanese, Korean and American staples.  A hotel shuttle is available to ferry you into town for $6.</sleep>\n\n===Budget===\nPalau offers a number of '''guest house''' style boutique accommodations. Some are close to or within Koror, some are not. These are available for international bookings via dive shops that offer holiday packages (such as Sam's Tours[http://www.samstours.com/]). Prices range from US$50 a night upward.\n\n* <sleep name=\"Guest Lodge Motel\" alt=\"\" address=\"\" directions=\"Free transfer from airprot. Short walk from \"downtown\" Koror\" phone=\"(680) 488-6320/21/22\" email=\"shmull@palaunet.com\" fax=\"(680) 488-5616\" url=\"\" checkin=\"\" checkout=\"\" price=\"\">The Guest Lodge Motel offers a nice and clean place to stay if you just need a place to sleep and relax between days of outdoor activities. Note that the building looks a bit shoddy from the outside, because the top floor is not finished. Rooms have AC, refrigerator, Cable TV, 130 V as well as 230 V power outlets, shower/bath, towels etc.</sleep>\n\n* <sleep name=\"Ms. Pinetrees Hostel / Bed and Breakfast\" alt=\"\" address=\"\" directions=\"Transfer from airport at extra cost. Quick walk from \"downtown\" Koror\" phone=\"(680) 488-2441 / (680) 775-3570\" email=\"mspinetrees@gmail.com\" url=\"\" checkin=\"\" checkout=\"\" price=\"\">This is a beautiful hostel-style villa with modern amenities and two types of rooms: dormitory or private. Air conditioning and wifi available; common areas make guests feel right at home—two living rooms, large outdoor terrace, dining room, and fully-equipped kitchen, movie collection, etc. Guests can reserve a bed, room or the entire villa (sleeps up to 16 guests). Not located on the water, but down a quiet street and an easy two-minute walk to the main street with shops and restaurants.</sleep>\n\n===Mid-range===\nThere are also a number of nice basic hotels available in Palau.\n\n* <sleep name=\"Sea Passion Hotel\" phone=\"+680.488.0066\" url=\"http://www.palauseapassion.com/intro.html\" price=\"″>The hotel has many room types to choose from, including sea view and mountain view rooms accommodating 1-4 people in a room. On-site facilities include a dive shop (Palau Dive Adventures- see url-\"http://www.palaudiveadventures.com/\") and a Watersports Center specializing in day snorkel and kayaking trips.</sleep> \n\n* <sleep name=\"Airai Water Paradise Hotel &amp; Spa\" phone=\"+680.587.3530\" url=\"http://www.airaiwaterparadise.com\" price=\"″>The hotel features three of the largest things of Palau—the largest storyboard full of Palau history, the largest water park with two water slides, and the largest olympic-sized swimming pool. Standard rooms, honeymoon suites, and newly-renovated ocean view suites are available.</sleep>\n\n* <sleep name=\"The Penthouse Hotel\" phone=\"+680.488.1941\" url=\"http://http://www.penthousepalau.com/\" price=\"″>The hotel is located in downtown Koror, just across WCTC. A favorite among locals for meetings and functions. It has rooms with two double beds or a singe queen-sized bed. Each room has a refrigerator, TV, bath tub, and iron, ideal for businessmen and visiting students. Breakfast is not included in the rate but their in-house restaurant serves American, Palauan, and Filipino dishes plus baked goods and cakes. </sleep>\n\n* <sleep name=\"West Plaza by the Sea\" phone=\"+680.488.2133\" url=\"http://www.wphpalau.com\" price=\"″>Features 36 rooms overlooking the ocean lagoon and nearby islands. Rooms range from standard class to deluxe rooms with kitchenettes, and a penthouse suite on the roof deck with a large private veranda, whirpool bath, kitchenette, and plenty of spacious living area. West Plaza By the Sea also features the Red Rooster Cafe. The cafe offers a wide selection of Japanese Cruisine, open for breakfast, lunch and dinner. The nightly happy hour features Palau's only locally brewed beer on tap, Red Rooster Draft.</sleep>\n\n* <sleep name=\"West Plaza Desekel\" phone=\"+680.488.2133\" url=\"http://www.wphpalau.com\" price=\"″>Conveniently located near museums, restaurants and banks. West Plaza Desekel offers 30 rooms ranging from deluxe to standard accommodations. Located on the Hotel's ground floor is the Deskel Market, a full service grocery store complete with ice cold beverages, fresh local and imported produce and a large assortment of Western and Asian foods.</sleep>\n\n* <sleep name=\"The Caroline's Resort\" phone=\"+680.488.3754\" url=\"http://www.carolinesresort.com\" price=\"\"> A few minutes outside of downtown Koror, this charming option offers accomodation in several bungalows nestled in the hills amongst the jungle.  The bungalows are quite well equipped with A/C, satellite TV, attached bathrooms and bar fridges.  Each also has an external patio with views over the ocean.  Nice touches include the option to have breakfast served on your patio, and guests also have access to the Palau Pacific Resort's amenities so you can enjoy the beach and pool during the day.</sleep>\n\n===Splurge===\nThere are lots of reasonably high end resorts on Palau, most catering for scuba divers. \n*'''Palau Pacific Resort''' [http://www.palauppr.com/] is a world class resort on the outskirts of Koror. Known locally as PPR, it is very nice (beautiful beach, excellent restaurant, vaulted ceilings) but it is also quite a ways out of Koror (10-15 minute drive). They do run an hourly shuttle into Koror most evenings, or it will set you back about $7 each way for a cab.\n*'''Palau Royal Resort''' [http://www.palau-royal-resort.com/en/] One of the newest hotels in Palau - catering largely to Japanese. Conveniently located in Malakal, only a couple minutes walk away from either '''Sam's Dive Shop''' or '''Neco Marine'''.\n*'''COVE Resort Palau''' [http://www.covepalau.com/] is a waterfront haven designed for adventure and relaxation alike, offering 71 rooms and three suites with Sealy Deluxe mattresses and upgraded amenities like 48-inch flat-screen TVs, stocked minibars and room service. Resort features include complimentary international daily buffet breakfast, the largest lagoon pool in Palau, with relaxed island cocktail bar, onsite dining at The Hungry Marlin Restaurant and Bar and concierge assistance offering tailor made dive and rock Island tours and dolphin encounters.\n\n==Learn==\n[http://www.palau.edu Palau Community College] offers both AS/AA degrees and occupational certificates. The campus library is open to the public, and offers computer terminals for community members and visitors to check email. \n\n==Work==\nUS citizens and citizens of the U.S. territory of [[American Samoa]] may live and work freely in Palau.\n\nAside from U.S. military aid, Palau's economy is heavily focused on tourism and offshore banking. However in comparison to most other Pacific island territories and countries, the average Palauan can earn up to US$8,000 a year. Which in the case of money, Palau is one of the best options.\n\n==Stay safe==\nPalau is quite a safe country to visit. Walking in downtown Koror at night, even past midnight is quite safe. But as with any place in the world today, common sense prevails. Pedestrians should be careful, as sidewalks are limited even in downtown Koror.\n\nThe constitution prohibits private ownership of firearms. Mere possession of bullets (used as a necklace or amulet by some) is punishable by law.\n\n==Stay healthy==\n[[Image:HelensReef.jpg|thumb|upright=1.3|The remote atoll of Helen Reef]]\n'''Saltwater Crocodiles''' (''Crocodylus porosus'') still exist in Palau's mangroves and in the beautiful '''Rock Islands''' and can potentially be found anywhere on the island. Despite their fearsome and, in some areas, very justified reputation, here they rarely grow to the immense size that they do in Australia and New Guinea. There was only one fatal attack by a crocodile in Palau within recorded history and that occurred in 1965. The biggest crocodile in Palau's history was 14', 2\" in length - large, but this is an average size for saltwater crocodiles in most other countries. The rarity of attacks probably stems from the fact that there are no more than 450 adult individuals currently on the island. Snorkeling and scuba diving are very popular in Palau and there has never in recent history been a report of an attack on a tourist. Judging from a recent survey, it appears crocodiles are quite unjustly hated by the locals, in harsh contrast to the worship they are given by the indigenous peoples of Australia, New Guinea and the Solomon Islands. The reasons for this is that crocodiles are a delicacy to some native islanders.\n\n\n'''Bull Sharks''' are common in the coastal waters and estuaries, so caution must always be taken while scuba diving or snorkeling\n\n==Respect==\nPalauans have been known throughout history for their hospitality. Many Palauans are very understanding, and realize cultural differences and easily give respect for foreign visitors. Be sure however, to always pay respect to the local culture. As with any other ethnic group, rude remarks or any form of prejudice against the local culture is not taken kindly. Palauans can be just as angry and rude as they are kind. As long as you do not disrespect the culture, violate historic areas, pollute, or harm the ocean in any way, you will find the local atmosphere very laid back and easy going. Note that Palau is a matrilineal society with very strict roles for men and women. Western ideas such as feminism are not standard to the Palauan population, and an overly zealous attempt at instilling such ideas is taken as annoying, ignorant, and obnoxious. Most Palauans however, gladly engage in such debates and find intellectual conversations interesting. Be sure to keep in mind that locals do not expect foreigners to understand the national identity and local culture, so a quick apology for any wrongdoing is more than enough to satisfy a little friction.\n\n==Contact==\n\n===Consulates===\n\n* [[Image:sp-flag.png|20px]] <listing name=\"Spain (Honorary Consulate)\" alt=\"\" directions=\"\" address=\"NECO Marina Building, Koror\" phone=\"+680 488 1755\" email=\"etpison@palaunet.com\" fax=\"+680 488 5245\" url=\"\" hours=\"\" price=\"\"></listing>\n\n===Mail===\nAs a Compact Free Association nation, Palau's official postal service is the United States Postal Service. For travel reasons, the USPS treats Palau as a territory. So the postal requirements in Palau are the same in the other C.F.A. nations and the US.\n\n===Internet===\nAlmost all internet and telecommunications services in Palau are provided by Palau National Communications Corporation (PNCC). \n\nInternational sim cards (US, Philippines, Japan, and other countries) will be assigned a local number upon arrival as long as the phone can access GSM 900. This conveniently allows you to use your own cellphone and sim card without buying a $25 PNCC sim card. If you do not receive a local number automatically, you may have to manually select PalauCel or PNCC as network provided. After receiving your local number, you have to load it with airtime that are available at a minimum of $10 prepaid card. After your load has been confirmed, you can now make and receive calls. To send and receive text messages or SMS, you need to change your message center to +680 779 0000.\n\nMany hotels, restaurants, and coffee bars offer free Wi-Fi service. It may be relatively slow especially when there are several people trying to connect. PNCC also provides Wi-Fi service with prepaid cards available at $5 and $10 denominations. Wi-Fi service is better in downtown Koror.\n\n==Get Out==\nThere is a $50 Embarkation Tax (consisting of a $20 Airport Departure Tax and a $30 Environmental Protection Fee) levied on most passengers departing by air. [http://www.iatatravelcentre.com/PW-Palau-Islands-customs-currency-airport-tax-regulations-details.htm] The tax is paid just before you go through immigration and is cash-only. There is an ATM in the airport lobby.\n\n{{outline}}\n{{IsPartOf|Micronesia}}\n{{Wikipedia|Palau}}\n{{Countryguide}}\n\n\n\n[[de:Palau]]\n[[eo:Palaŭo]]\n[[es:Islas Palau]]\n[[fi:Palau]]\n[[fr:Palaos]]\n[[hu:Palau]]\n[[it:Palau]]\n[[ja:パラオ]]\n[[nl:Palau]]\n[[pl:Palau]]\n[[pt:Palau]]\n[[ru:Палау]]\n[[sv:Palau]]\n[[wts:Category:Palau]]\n\n\n[[WikiPedia:Palau]]\n[[Dmoz:Oceania/Palau/]]\n[[World66:australiaandpacific/palau]]"
        }
    }
}