{
    "parse": {
        "title": "Panama",
        "pageid": 704,
        "wikitext": {
            "*": "{{pagebanner|Panama Banner.jpg}}\n{{cautionbox|The CDC has identified [[Panama]] as an affected area of the Zika outbreak. Pregnant women are advised to be cautious as the virus can lead to birth defects. Adults affected by the virus experience fever, rash, joint pain, and conjunctivitis (red eyes) typically lasting a week.  You can learn more by visiting [http://www.cdc.gov/zika/index.html the official CDC website].}}\n\n{{otheruses}}\n{{quickbar\n| image=PuenteDeLasAméricas.JPG\n| location=Panama in its region.svg\n| flag=Flag of Panama.svg\n| capital=[[Panama City]]\n| government=Republic\n| currency=US dollar ($, USD; banknotes only)<br>Panamanian Balboa (PAB; coins only)\n| area=78,200km²\n| population=3,039,150 (July 2006 estimate)\n| language=[[Spanish]] (official), English\n| religion=Roman Catholic 85%  Protestant 15%\n| electricity=120V, 60Hz \n| callingcode=+507\n| tld=.pa\n| timezone=UTC-5\n}}\n\n[http://www.visitpanama.com '''Panama'''] is a country in [[Central America]] with coastlines on both the Caribbean Sea and the North Pacific Ocean, with [[Colombia]] (and [[South America]]) to the southeast and [[Costa Rica]] (and [[North America]]) to the northwest. It's strategically located on the isthmus that forms the land bridge connecting North and South America and controls the Panama Canal that links the North Atlantic Ocean via the Caribbean Sea with the North Pacific Ocean, one of the most important shipping routes in the world.\n\n==Understand==\nThe ease of travel and wide array of experiences make Panama one of the most attractive emerging tourism destinations in the world. In just one week, visitors can enjoy two different oceans, experience the mountains and rainforest, learn about native cultures and take advantage of vibrant urban life. The capital, Panama City, is a modern, sophisticated metropolis that resembles Miami and has established commerce, arts, fashion and dining. Fodors, Frommers and National Geographic have all recently begun publishing guides for Panama, only the second country in Central America, behind Costa Rica, to have such extensive travel coverage.\n\nThe Canal itself is best seen via an aerial view through the local operator (www.panamaflightadventures.com) and is the central marvel and spectacle of Panama among many. Even stunt and trick flights with veteran air force pilots and skydives are available over the marvel of engineering, to appreciate the entire scale of and ambition behind it.\n\nPanama is known as the \"Crossroads of the Americas\" due to its privileged position between North and South America. The indigenous meaning of the country's name, \"abundance of fish\", reflects Panama's reputation as a paradise for water sports enthusiasts and eco-tourists alike. As the isthmus connecting two massive continents, Panama's flora and fauna is incredibly diverse. For example, Panama boasts over 900 different bird species. Panama's many indigenous tribes are still thriving, living in the same ancient manner as their ancestors, making its cultural fabric exceptionally rich.\n\nPanama's government has strong ties to the United States and strongly supports business, development and tourism. The International Monetary Fund applauds the country's diversified economy and predicts it to have one of the strongest GDP growth rates in the world for the next several years. Panama is known for its highly developed international banking sector, with about 80 banks from several countries establishing local branches, including HSBC and Citibank. Having recently finished its expansion, the Canal continues to drive Panama's service-based economy and remains one of the most important transportation links in the world. In addition to the country's strong economic base, Panama's physical infrastructure, including modern hospitals, airports and roads, is more highly developed than its Central American neighbors. \n\nPanama boasts a large expat community; about 25,000 U.S. citizens live in the country. It is worth spending some time reading up on Panama and communicating with locals, expats and fellow travelers alike before arriving in the country. Consider joining some local forums [http://www.panamaforum.com] or blogs for expats or the Central America Forum. Many of the local blogs can give you the most current info on: floods, earthquakes, trail closings, and the best restaurant reviews.\n\n===Climate===\nLess than 9 degrees north of the equator, most of Panama enjoys temperatures that are fairly consistent year round, with daytime temperatures 30-33°C and night time around 21-23°C). Tropical maritime; hot, humid, cloudy; prolonged rainy season, called winter or ''invierno'' (May to November); short dry season, called summer or ''verano'' (December to April). The most popular time to travel to Panama is December through March, when lower humidity and nearly zero percent chance of rain make it more ideal for travellers.\n\nDuring most of the rainy season, mornings and early afternoons are usually sunny, while late afternoons and evenings have intermittent rainfall.\n\nMost areas are quite warm, but a few places, such as [[Boquete]], [[Cerro Punta]] and [[El Valle]] can get a little chilly at night.  You definitely want a heavy rain-proof jacket if you're going to the top of Volcan Barú since you will be above 3000m for a little while.\n\n'''Natural hazards''': Occasional severe storms and forest fires in the remote Darien area.  Hurricane-strong winds are only a very small possibility in Panama.  Because of its geographic position, it is very unlikely that Panama could be in the path of any hurricane, unlike the other Central American countries.  Hurricanes normally hit farther north.\n\n===Terrain===\nInterior mostly steep, rugged mountains and dissected, upland plains; coastal areas largely plains and rolling hills\n''Highest point'' : Volcan Barú in Chiriqui Province 3,475 m. On a clear day they say you can see both oceans from the peak.\n\n===History===\n[[Image:Tower.jpg|thumb|Watch Tower (Old Panama City)]]\n; '''Independence''' : 3 November 1903 (from Colombia; became independent from Spain 28 November 1821)\n; '''National holiday''' : Independence Day, 3 November (1903)\n\nPanama's public holidays reflect  its patriotism [http://bestplacesintheworldtoretire.com/questions-and-answers/1046-what-are-the-holidays-of-coronado-panama] and its Catholic roots.[http://bestplacesintheworldtoretire.com/questions-and-answers/796-what-are-the-holidays-of-pedasi-azuero-peninsula-central-panama-province]\n\nWith US backing, Panama seceded from [[Colombia]] in 1903 and promptly signed a treaty with the US allowing for the construction of a canal and [[United States of America|US]] sovereignty over a strip of land on either side of the structure (the Panama Canal Zone). The '''Panama Canal''' was built by the US Army Corps of Engineers between 1904 and 1914. \n\n; '''Constitution''' : 11 October 1972; major reforms adopted 1978, 1983 and 1994\n\nOn 7 September 1977, an agreement was signed for the complete transfer of the Canal from the US to Panama by the end of 1999. Certain portions of the Zone and increasing responsibility over the Canal were turned over in the intervening years.  The entire Panama Canal, the area supporting the Canal, and remaining US military bases were turned over to Panama by or on 31 December 1999.\n'''\n\n===Cost of Living===\nPanama is a relatively cheap country (but not comparing countries in Latin America), with areas such as hospitality and transportation seeming cheap to many foreigners. Food might be a bit more expensive than in the United States or other countries, depending if the food is able to be produced in Panama or not. A gallon of milk can set you back around $3.80-$4:50 which compared to milk's US average price of $3.80 on December 2013 is not much of a difference. Food in Panama's top restaurants is relatively inexpensive, with a meal in the highest end of restaurants costing around $30-$40. If you really want the true Panamanian experience, you might also want to visit a \"fonda\", which might sometimes not be hygienic (most of the time they are, the government is pretty much on top of them and as soon as someone complains about them, an inspection ensues) or Niko's Cafe, a buffet-style cafeteria where you can eat a wide variety of Panamanian meals at inexpensive prices, from around $3-$10. \n\nAccommodation is cheap compared to prices in the USA or in Western Europe, with a night at a top hotel in luxury rooms costing around $120-$150 in the capital, Panama City. However if you compare prices with other parts of Latin America, Asia or Eastern Europe, Panama is not the best deal. If you go to the interior of the country, you may find better prices for hotels. Low-budget hostels (if available) are relatively expensive compared to other places in South America, Asia or Eastern Europe. Certainly if you take into account quality.\n\nPublic transportation is not expensive, and relatively reliable. A trip in one of the city's \"Metro Bus\" will cost you $0.25 (they operate in the metropolitan area of Panama City), while taxi fares are not that expensive (if you know the price). It is advisable to always have precaution with using public transportation, as the \"Metro Buses\" are known to be a place where petty larceny occurs (might get your cellphone etc. stolen) and taxis may charge you exorbitant prices just for being a tourist, while taking a cab at night might get you in a very dangerous situation, especially if the cab is already occupied by other people when you get in. If using a cab, travel in group and get a chart with taxi prices per distance for Panama City. In the interior of the country, public transportation is cheap and safe, as most people from the countryside are honest and hardworking. Taxis, however might still try to make you pay exorbitant prices. Always exercise caution.\n\n==Get around==\nGetting around Panama is a task of itself, traffic at the daily times of 8-9 am and 3-7 pm can be gruelling at best, guaranteed to cause you frustrations, one with the drivers, then with everything else, toll booths, intersections and discourteous drivers. You will find many times that drivers simply ignore all rules when it comes to the traffic, they will drive on the shoulder, in the wrong lane and down sidewalks if it benefits them. There is no such thing as a line in Panama. Give the Panamanians an inch and you will lose your spot. Driving is much easier done with a GPS, the best available GPS is provided by the copyrighted map produced in Panama and updated quarterly. Panama-GPS.com is the supplier of most car rental companies such as National, Avis, Dollar, Budget, Alamo, Hertz the other car rental companies are using pirated outdated maps to guide their customers into the wrong directions and misguided information.\n\nPamama also has a lot of financial issues in traffic, such as \"cruddy\" cars. If you think Panama's traffic is bad, you should see their cars.\n\n==Regions==\n[[Image:Panama Regions map.png|thumb|right|575px|Map of Panama with regions colour-coded]]\n{{Regionlist\n\n| region1name=[[Central Panama]]  \n| region1color=#578e86\n| region1items=\n| region1description=Panama City plus Colon and Cocle Provinces.\n\n| region2name=[[Caribbean West]]\n| region2color=#c59bc5\n| region2items= \n| region2description=Bocas del Toro province and Ngöbe-Buglé Province as well as the northern portion of Veraguas Province. \n\n| region3name=[[Pacific West]] \n| region3color=#b5d29f\n| region3items=\n| region3description=Many of Panama's major attractions in Chiriqui Province plus all of Herrera and Los Santos Provinces, and the southern portion of Veraguas Province. \n\n| region4name=[[Eastern Panama]] \n| region4color=#71b37b\n| region4items=\n| region4description=The forests and swamps of Darien Province, some of Panama Province, Kuna Yala and the San Blas Islands. \n}}\n\n==Cities==\n*[[Panama City]] &mdash; The capital with 3 districts of interest: the new city, the old city, and the ruins of the original colonial city.\n*[[Balboa]] &mdash; Tucked between Panama City proper and the canal.\n*[[Boquete]] &mdash; Adventure capital with whitewater rafting, zip lining, rock climbing, as well as the coffee growing capital of Panama in the Chiriquí highlands, home to Volcan Baru, the highest point in Panama. \n*[[Colon (Panama)|Colón]] &mdash; Port town for cruise ships, a bit dangerous of a town on the Caribbean side. \n*[[Coronado, Panama]] &mdash; A coastal town near Panama City and the first resort community established in Panama.\n*[[David (Panama)|David]] &mdash; The largest city in the Chiriqui Province, located on the Pan-American and serves as a transit point between Panama City, Boquete, Bocas del Toro, and Costa Rica. \n*[[Gamboa]]\n*[[Portobelo]] &mdash; Historic Spanish forts, boats to Colombia, and dive centers.\n\n==Other destinations==\n\n[[Image:Cityhall.jpg|thumb|350px|City Hall (Colonial) Panama City]]\n\n* [[Comarca Embera-Wounaan]] In the remote and underdeveloped province of the Darien. Here one can experience traditional Embera culture while exploring the pristine jungle of the Panamanian frontier.\n\n* [[Coiba National Marine Park]] &mdash; frequently referred to as the Galapagos of Central America for its abundance of rare species in both the water and on land. Here, in the Pacific Ocean, you can scuba and snorkel and see some of the most rare pelagic species of marine life in the world.\n\n* [[El Valle]] &mdash; Charming little town nestled in the second biggest inhabited volcanic caldera in the world.\n\n* Isla Bastimentos National Marine Park (Parque Nacional Marino Isla Bastimentos)  &mdash; For the unique diversity in the tropical forest, pristine beaches and Caribbean Sea ecosystems, Panama designated this region it's first National Park in 1988. It covers more than 11,000 hectares of Isla Bastimentos in the Bocas del Toro archipelago, as well as surrounding Caribbean Sea, and the two uninhabited islands nearby, Cayos Zapatillas. This National Park protects more than 10,000 species of plants and animals within its borders, including 4 species of endangered sea turtles that nest here, tropical birds, caiman, the popular Strawberry Dart Frogs, sloths, coral, starfish, nurse sharks and more. Visitors come for the views, beaches, experiencing wildlife in it's natural state, day trips to Zapatilla, snorkeling and diving, hiking, and seasonal world-class surfing.\n\n*[[Islas Secas]] Islands in the Chiriqui Gulf that offer world-class sport fishing.\n\n* [[La Amistad International Park]] &mdash; Panama's second largest park, located near [[Boquete]], covering over 850 square miles (207,000 hectares). It is a bi-national park, as an additional 193,929 hectares stretch to the Costa Rica side. \n\n* [[Parque Nacional Marino Golfo de Chiriquí]] &mdash; In the Gulf of Chiriqui on the Pacific side, which has some of the best humpback whale watching in the region during August-October, as well as beautiful islands with white sand beaches, snorkeling, sea kayaking, and sport fishing. Located out of Boca Chica. \n\n* [[Pearl Islands]] &mdash; \n\n* [[San Blas Islands]]\n\n* [[Taboga]]\n\n* Playa Venao This amazing beach at 30 minutes of [[Pedasi]] by car is one of the best Surf spot of Panama and also one of the most beautiful beach of the pacific coast\n\n* [[Volcan Barú]] National Park &mdash; 35,000 acres/14,325 hectares in size, and Panama's highest peak at 11,401 feet/3,475 meters is near to [[Boquete]].\n\n* The Panama Canal and [[Miraflores Locks]]\n* Boca Chica, [[Boca Brava|Isla Boca Brava]]\n\n==Get in==\n\n===Visa-free===\nCitizens from the following countries DO NOT need a visa to enter Panama because their countries hold treaties with Panama that entitle their citizens to visit for up to 180 days without a visa: Andorra, Angola, Antigua y Barbuda, Arabia Saudita, Argentina, Armenia, Austria, Australia, Bahamas, Barbados, Belize, Belarus, Belgium, Botsuana, Bhutan, Brazil, Bolivia, Bosnia and Herzegovina, Brunei Darussalam, Bulgaria, Cape Verde, Cambodia, Canada, Czech Republic, Chile, China, Colombia, Comoros, Costa Rica, Croatia, Cyprus, Denmark, Dominica, Ecuador, El Salvador, Egypt, Fiyi, Estonia, Finland, France, Gabon, Germany, Georgia, Gibraltar, Granada, Greece, Guatemala, Guyana, Holland, Honduras, Hungary, Iceland, Italy, Ireland, Israel, Japan, Jamaica, Kenia, Kiribati, Latvia, Lebanon, Lithuania, Kuwait, Letonia, Liechtenstein, Luxembourg, Macao, Macedonia, Madagascar, Malaysia, Maldivas, Malta, Marshall Islands, Mauritius, Micronesia, Mexico, Moldovia, Monaco, Mongolia, Montenegro, Namibia, Nauru, Netherlands, New Zealand, Nicaragua, North Korea, Norway, Palaos, Papua New Guinea, Paraguay, Peru, Poland, Portugal, Qatar, Romania, Russian Federation, Saint Kitts y Nevis, Saint Lucia, Salomon Islands, Samoa, São Tomé and Príncipe, San Marino, Serbia, Seychelles, Singapore, Slovak Republic, Slovenia, South Africa, South Korea, Spain, Sweden, Switzerland, Thailand, Tonga, The Vatican, Trinidad and Tobago, Turkey, Tuvalu, Ukraine, United Arab Emirates, United Kingdom, United States, Uruguay, Vanuatu, Venezuela and Vietnam.\n\nThis usually also applies to people of other nationalities (India, for example), if they have a residence permit issued by any of the above countries. For example, an Indian living in the USA will be able to enter Panama without any visa. However, it is advisable to check with closest representation of Panama embassy near your place of residence. Update: As of 2018, third-country nationals who could enter Panama based on a residence permit issued by Schengen countries are required to normally apply for a Panama visa before flying there.\n\nCitizens from these countries can apply for an extension for up to another 30, 60 or 90 days. Petitions are approved or denied on a case-by-case basis. Immigration recommends you apply at least a week before your time is up. For more information about extending your stay in Panama please read on or click here.\n\nThey can always also leave the country for 30 days (Costa Rica is right next to Bocas del Toro and Boquete so it's easily done) and then come back and get 180 days more.\n\nCountries whose citizens have passports valid for at least 6 months upon entry do not require a visa to enter Panama include (amongst others) [[Andorra]], [[Argentina]], [[Austria]], [[Belgium]], [[Bolivia]], [[Brazil]], [[Germany]], [[Ireland]], [[Israel]], [[Malta]], [[Netherlands]], [[Portugal]], [[San Marino]], [[Singapore]],[[Sweden]], [[Switzerland]], [[United Kingdom]] and [[Uruguay]].\n\nCitizens of China with a endorsed \"public of affairs\" passport do not require a visa for 180 days also. Holders of diplomatic, official or service passports of China, Cuba and Philippines do not require a visa.\n\n===Visa===\nCitizens of some countries, [[Australia]], [[Canada]], [[Japan]] and [[US]] citizens included, may enter Panama with a tourist visa that is stamped on arrival (the cost is automatically included in your airfare and is valid for a 180-day stay as of August 2010). The cost is $13 (US) for a visa stamp to enter at Bocas del Toro, when arriving by airplane, as of September 2012. Entry requirements are proof of:\n* a return ticket out of Panama \n* Bank Statement to show that you have 500$+ or you can show the money in cash (screenshot from online banking account is enough)\n* proof of accommodation-if you don’t have it they will make you go back to the terminal and book it online\n* Recommended vaccination for yellow fever--only if coming from a country where yellow fever occurs (includes most of South America and Africa but not USA).\nIn practice, border officials may be lax about checking clean-cut travelers coming from the USA or other developed countries.  \n[http://www.embassyofpanama.org]\n\nAlso, because your tourist visa will be stamped in your passport, it is important to carry at least a photocopy of the ID page AND the page with the tourist visa stamp at all times.  \n\n===By plane===\nInternational flights arrive at Tocumen International Airport (PTY), which lies about 20 miles east of Panama City (from all countries) or David Airport (from Costa Rica in AirPanama [http://www.flyairpanama.com/]). Panama City's PTY is well connected with the Americas and has non-stop flights to almost 20 countries in the region. Neighbor Colombia is specially well served with daily flights to more than 7 cities, including Bogota, [[Medellín]], Cali and [Cartagena].  \n\nStarting January 2015, Copa Airlines flies from most major North American cities directly to the David International Airport (layover in Tocumen for immigration), providing an excellent alternative to travelers hoping to save time and money, as well as bypassing the headache of Panama City, by coming to the Adventure Capital of Panama: Chiriqui. \n\nLocal travelers and tourists can also fly in and out of Bocas del Toro via Costa Rica.\n\nBy modern standards, the original main terminal at Tocumen was not well designed. For example, it has long, thin, crowded corridors leading out to the circular satellites where most of the gates are concentrated. The air conditioning in those corridors and satellites is not strong enough for Panama's heat and humidity; the management has apparently compensated by turning up the air conditioning in the main building.  Therefore, as you walk from the plane into the main building, you will transition rapidly from too hot to too cold. There are not quite enough immigration and customs stations, so expect a lengthy wait to enter the country (two hours) if you arrive at a busy time. \n\nFrom Tocumen, you will have to take a taxi or bus or rent a car to get to the city.  Airport taxis use set rates, and can be shared--the transportation information booth in the lobby will help you make arrangements. Uber is also an effective option and is supported by free wifi in the terminal near the pickup area. There are a couple of hotels near the airport where you can spend the night at relatively high prices (US$60).\n\nThe country has more private airstrips per square mile than any other country in the world, and it is technically feasible for the adventurous private pilot to fly to one of them, either directly or through country hopping through Central America.  Many of the remote interior regions of the country are best accessed by private plane, although a combination of hiking and canoeing can get you to most places, too.  If you are flying a private aircraft into Panama, it is important to verify where you can clear customs and immigration--not all airstrips are equipped to clear you.\n\nBusiness jet FBO services are available in Panama City (Albrook and Tocumen), David (by appointment), Howard, and Bocas del Toro.\n\n===By car===\n\n* From Costa Rica: You can drive across at Paso Canoas (Pacific side) which closes at 11PM (Panama side) or 10PM (Costa Rica side), but be aware that it is one of the busiest (if not the busiest) and disorganized border crossings in Central America.  It is very easy to accidentally drive across the border without realizing it.  The various offices at the border are randomly scattered throughout the bordertown, and you can do quite a bit of trekking while finding them, as they don't look distinct from the surrounding buildings in any way.  This is one crossing where it is definitely worth your money to hire a tramitator, or helper, to assist you through the stations, if you do not speak Spanish.\n\nThere are also road crossings at Rio Sereno (Pacific side) and Sixaola/Guabito (Atlantic side).  The Rio Sereno crossing sees very little traffic, so make sure all your papers are in order, as police can be very strict. \n\n* From Colombia: Be aware: there are no roads at all connecting the 2 countries.\n\nYou will not be allowed to leave the country without your car (i.e. change your mind, abandon the car, and fly home) without getting a stamp on your passport proving that you have paid the proper impuestos (importation taxes) on your vehicle.  Expect to be stopped frequently by police, but don't worry, they are usually more curious about seeing a foreign car than interested in a bribe.\n\nIf you have car trouble in Panama, you will find dealers with service departments for almost all of the major car manufacturers from the USA (All), Europe (almost all) and Japan (All). Most of them, like in the USA require appointments to service your car. Most of the service personnel in all of the car dealers are manufacturer certify. If you need car repairs and do not want to go to a dealer to save some money or you have an emergency repair, you can find good independent mechanic services/shops in all of the major cities by looking in the yellow pages(paginas amarillas), in addition to towing services. If you need parts for your vehicle, you can find a great number of autopart stores for all major car manufacturers in the yellow pages (paginas amarillas)too. \n\nThe use of \"shade tree mechanics\" and parts from junkyards are the same as in the USA; these options are for do-it-yourself type of persons.\n\n===By bus===\n\nYou can't cross from Panama to Colombia by bus--the Darien Gap begins at Yaviza, where the Interamericana runs out. \n\nIf you're coming in from Costa Rica, however, things will be a bit easier.  There are three possible entry points, the main one being Paso Canoas closing at 11PM (Panama time) or 10PM (Costa Rica time).  Panaline and Ticabus, among others, can get you straight from San Jose, Costa Rica to [[David (Panama)|David]] or [[Panama City]].  The trip from San Jose is quite cheap, but takes about 18 hours.  If you want to see things in between, you can also go by local buses, although the trip will take much longer.\n\nKeep in mind that Panamanian law requires you to have a return ticket to get into Panama.  The border guard may not check, but you never know.  A return flight from San Jose, Bogotá or Abu Dhabi won't work.  The return ticket has to originate from within Panama.  If you run into this problem, you can always buy a return ticket from the bus driver.  In general, if you're having a hot-tempered day, it may not be a good day to cross any borders.  Some border officials in Central America seem to love being sticklers about their crazy rules if they decide they don't like you.\n\n===By boat===\n[[File:Panama_Canal.jpg|thumb|300px|Transit through the Panama Canal onboard cruise ship]]\nMany cruise lines have the Panama Canal on their itineraries.  You can make tours on Panama City or Colon City and take part in many packages. Recommendation is to take the Panama Canal Railway from Panama to Colon or vice versa.  This train goes back since 1855 and it was the first interoceanic train in the American Continent.  It has been rebuilt recently and it has very nice passenger cars.\n\nIt is possible to arrange for passage on banana boats traveling from Ecuador, Colombia, and Venezuela, but such passage is recommended only for the truly adventurous, as the boats are often structurally unsound, terribly over-burdened, and are very likely to be smuggling drugs as well.\n\nPrivate sail boats also provide service between Panama and [[Cartagena (Colombia)|Cartagena]] in Colombia. Fare can vary from US$400-500, and the trip takes usually four nights/five days including a 2 days stopover in San Blas Islands (Carti Islands). The best way to find a boat is to ask around in hostels in Panama City or Portobelo popular with backpackers. You can also go by speed boat along the coast by visiting the San Blas Islands, for example with MIA San Blas, which offer a 3 day / 2 night all-inculuded trip at prices around 290 USD. The tour starts from [[Capurganá]], which you can be reached from [[Turbo]] or [[Necocli]] by boat. Especially for people, who get seasick on a sailing boat, this could be a good option to cross the border. \n\nAnother way to reach Panama by boat from Colombia is by ferry from [[Turbo]] to [[Capurganá]] (COP$ 55000, daily around 8AM) and by small boat from [[Capurganá]] to [[Puerto Obaldia]] (COP$ 25000, , daily around 7AM). From there by plane to Panama City (USD 95) or by boat to Colon and Carti Islands (USD neg).\n\n===On foot===\n\nIt is possible to hike across the Darien Gap from Colombia with the help of trained guides, but this route is generally considered one of the most dangerous in the world.  A large percentage of attempts have ended with the trekkers dead as victims of the Colombian guerrillas and paramilitaries or the oppressive jungle environment, which is considered the densest and most difficult to breach in the world.  Despite the bravado-filled tales of backpackers who will try to convince you that ''real'' travelers aren't afraid to cross the Gap, it really is a very dangerous trip and the Panamanian police are not interested in going in to look for you if you get into trouble.\n\nThe guidebook \"Getting to Know Panama,\" by Michele Labrut, gives the following advice for surviving in the Darien.\n\n\"Do not go naked into the water, some very undesirable protozoans can get into you. Do not drink untreated water. Never stray from the group, you can easily lose your bearings and get lost. If this happens, stay right where you are, do not panic. Shout or scream at intervals.\n\nIt must be noted, however, that the rest of Panama has delicious, drinkable water.\n\n==Get around==\n\n===By bus===\n\nThere are two kinds of buses in Panama.  The ones you find on the highway, and \"city buses\". The highway buses are constantly making journeys from terminals in Panama city to different destinations along the Pan American Highway, and back to the terminal. They're pretty frequent, and the buses will pick you up or drop you off at any point along their route, and most of them are air conditioned.  The roughly linear shape of the country makes it ideal for a bus system, so ideal in fact that you don't really need to rent a car to get around most areas.  Take a bus to the intersection on the Pan American highway that you want. You can get on a bus any place on the Pan American highway going towards Panama City, but all trips originating from within the city require a ticket. The Grand Terminal in the city is large and modern, and will remind you of an American shopping mall or airport (it actually is a shopping mall, Albrook Mall, too). Schedules for all Panama are listed here [http://horariodebuses.com/pa].\n\nIf you want to get on a bus, stand by the side of the road, hold you out your arm and make obvious pointing motions toward the ground.  If you're on the bus and want to get off, yell \"parada!\" or tell the driver in advance.  You'll get the hang of it pretty quick. The locals are very helpful with tourists on buses, and may offer help. \n\nThe highway buses are very cheap, count on a fare of about US$1 per hour traveled, sometimes less.  One exception is fares from Tocumen airport, which both buses and taxis charge through the roof for (by Panamanian standards), simply because they can.\n\nCity buses are different.  in which is call \"Diablos Rojos\" or \"Red Devils\" They are crowded, decoratively painted school buses, often without air conditioning, with a flat rate of 25 cents to any location in Panama City.  They can be fun, but have a reputation for being dangerous, both in driving and the likelihood of encountering criminals.  They can be fun to take a couple of times, but once you've done it, best to take a taxi, which won't be that much more expensive anyway.  They definitely have a particular style apart from other Central American countries.  They look as if a bunch of 60's hippies decided to drive as far south as they could go in school buses, and when they could go no further, they stopped and started a bus company.  If you like Salsa Music, you'll be happy as a clam on these buses.  Most locals aren't.\n\nHowever, beginning in December of 2010, a new government regulated public bus system utilizing modern air-conditioned buses will go into effect called MetroBus.  The old and dangerous \"Diablos Rojos\" will be outlawed and slowly replaced by the new Volvo buses.  from February 15, 2012; the panamanians and foreigner people will have to buy the \"Metrobus Card\" to get on the bus and pay the flat rate that costs $2.00 (the metrobus card) and then it can be recharged from $0.50 until $50.00 with a flat rate of $0.25 cents until all the \"Diablos Rojos\" dissappeared and then the new flat rate will be $0.45 cents from that moment.\n\n===By taxi===\n\nIf your destination actually happens to lie far off the bus route, or if you just want to be lazy, taxis are also a decent way to get around in Panama.  Taxi rates within Panama City are set by a zone system.  However, the zone rates are complicated and fares are typically negotiated, depending on location, time of day and how well you know the city and can speak Spanish. Most short taxi rides range from $1.25 to $2.50.  Going across town should be about $5, but it is often more if you fail to negotiate a price before getting into the taxi. Unlike the urban taxis you may be used to, they can take you way out into the country.\nA taxi fare, including tolls, from Tocumen airport to central Panama City, should be US$28. It can easily exceed your taxi fares for the rest of your trip combined.   If you share a taxi ride with other passengers going from the airport to the city, your fare per person can be cheaper, at around US$12.  You can save quite a bit of money by taking the bus to the Gran Terminal, but even the bus fares will be higher than normal.\n\nBeware of taxi drivers who wait outside the main bus terminal. Make sure you negotiate a reasonable fare before you get in or they will claim to be 'official' taxis charging 3 normal times the price.\n\nAs of 2014, Uber is available throughout Panama City [http://pty.life/uber-panama/] and, depending on peak rates and times, can be more affordable and with less hassle then the taxi system. Most Uber rides vary in cost between $2 and $10 and you don't need to haggle with a taxi driver. The default is UberX, where you'll most likely have Spanish speaking drivers, but if you're very uncomfortable not being able to speak fluently with your driver, UberEnglish is also available for a 10-15% surcharge. \n\nAs of 2017, Lyft has not yet appeared as a challenger to Uber's dominance in the Panama ride-sharing industry.\n\n===By car===\n\nPanama is in the south of Central America and can easily be discovered independently. The road system of Panama is in very good condition (for Central and South American standards). You can rent a car and drive it around the country if you are an excellent defensive driver. While traveling by car you can discover attractions which are hardly or even not to reach by public transportation. \n\nPanama City is more difficult to navigate than any big city in the United States, with terrible traffic jams at rush hours, few signs for names of streets, poor street design, and a lack of traffic lights at busy intersections. You must be aggressive about positioning your car to get anywhere, yet highly alert to erratic and irrational behavior by others. Drivers have little respect for or even knowledge of traffic laws, and drivers from North America or Western Europe will be stunned by their recklessness. In the rest of the country, driving is mostly stress-free.\n\nThe Pan American Highway is paved for the entire length of the country, and has many roads which branch off to towns off the highway, most of which are paved, and most of the rest are still easily navigable in a sedan. However, road engineering standards are low, so be on the lookout for off camber turns, deep potholes, and sharp turns with no warning. It is highly recommended to drive well informed about your route. Use the detailed information which ''cochera andina'' provides on its site when planning your trip and check out road conditions, distances and travel times. On the road, don’t forget to take also a good road map with you. Or you download apps like WAZE for your smartphone and works as an cheap GPS that covers most roads and many people post roads hazards, traffic cops locations, road blocks, etc so any fellow traveler can see.  \n\nFor driving in Panama you need the driver’s license of your country but to avoid trouble at police controls it is better to have an international driver's license with you as well. The traffic rules are almost the same as in Europe or the U.S. Road signs are frequent. The speed limits are 40 km/h within cities, 80 km/h outside and 100 km/h on the highways. You will find gas stations all over Panama. A lot of stations are open around the clock. You get gas of three types: unleaded, super and diesel.\n\n===By plane===\nLocal airlines serve many airports in Panama. AirPanama [http://www.flyairpanama.com/] is one of the companies providing domestic flights. Flights leave Panama City from [[Marcos Gelabert Airport]] in Albrook.\n\nCopa Airlines [http://www.copaair.com/sites/pa/en/pages/homepage.aspx] provides daily 1-hour flights from Tocumen International Airport in Panama City to David for only $85 one-way. A great new alternative to the monopoly that Air Panama had, which has driven down prices for tourists and locals. \n\nBooking private aircraft charters are available through online ([http://monarchairgroup.com '''Monarch Air Group'''], [http://www.mercuryjets.com '''Mercury Jets''']) and local companies. \n\nIt is advisable to check the tail number of any aircraft chartered in Panama. All registered aircraft authorized for public charter work (air taxi) will have a letters after their numeric tail number (e.g. HP-0000TD). This signifies the aircraft is insured for charter work and is subjected to more inspections and increased maintenance requirements.\n\n==Talk==\n\n; '''Languages''' : Spanish (official), English 14% <br>''note:'' many Panamanians bilingual\n\n===Spanish Dialect===\n\nIf you cross the border from Costa Rica into Panama, you will notice a large change in the dialect.  True to its Caribbean orientation, Panamanian Spanish sounds much closer to [[Puerto Rico|Puerto Rican]] than [[Costa Rica|Tico]] or [[Nicaragua|Nicaraguan]] Spanish.  For students of [[Mexico|Mexican]] or [[Spain|European]] Spanish, it may take a little getting used to. However, it is very easy to understand and it is by no means more difficult than other Spanish-speaking countries. Panamanians tend to pronounce \"h\" instead of \"s\" and to not pronounce certain D's at the end of certain words. It is part of their dialect but Panamanians are fully capable of speaking Spanish in a manner more intelligible to students of Mexican or Castillian Spanish, and they are aware of their regional idiosyncrasies.\n\nPanama City has a different dialect in which they mix English words with Spanish. Although educated Panamanians try to speak standard Spanish, they are very proud of their dialect and would rather use it unless it is a formal conversation or public speaking.\n\n===Indigenous Languages===\n\nPanama has a lot more indigenous culture than some neighboring countries.  In [[Kuna Yala]] you will hear the native Kuna language spoken.  In the [[Comarca de Ngobe-Bugle|Ngöbe-Buglé Comarca]], as well as in [[Chiriqui]] or [[Bocas del Toro]], you might hear the native Ngöbe-Buglé (Guaymí) language, although the Ngöbe and the Buglé are very quiet around  foreigners.  If you ask directions from one of them, you will probably just get a hand or lips pointed wordlessly in the right direction.\n\nOn the north coast you may encounter Emberra, in the Darien either Emberra or Woun Meu.\n\n===English===\n\nMuch of the Caribbean Coast of Panama was settled by people from Jamaica and Barbados.  More recently, the descendants of those settlers seem to be speaking more Spanish, but a lot of them still speak English, albeit a very Caribbean variety, called Guari Guari.\n\nUntil only a few years ago, the canal was controlled by the [[USA]].  The US has given the canal back to Panama, but many people in [[Panama City]] and other areas near the canal still speak English as a first or second language.  Surprisingly, English is not as common as you would think for how long the Americans spent in the country.  It's not so common for people working in shops or people in the street to speak English.  There are a number of English News and Blog [http://panamapulse.com] sites to help with your travels.\n\n== Do ==\n<!--This section is not for individual tour companies. It is for general prose describing the range of interesting activities for travelers in the country.-->\nPanama´s strongest attraction is its diversity. In less than five days you can visit it all: beach, mountain, modern city and historic ruins. While in Panama city don´t miss the four \"must do\": the Panama Canal, Panama Viejo, Casco Antiguo (also known as Casco Viejo) and the jungles surrounding the Canal area. \n\n=== Panama City ===\n\n* '''Panama Viejo''' was the first city of Panama, founded by the Spanish back in 1519. It was the first city founded at the Pacific and it became rapidly a prosperous point where gold from the southern colonies would make it to the Caribbean and later on to Europe. It was attacked by pirates several times, the last of them by Pirate Henry Morgan who destroyed it forever in 1671. In 1673, a new city was built, but this time using the knowledge painfully acquired by experience. The Spanish by then knew well the risks of settling cities in tropical swamps: mosquitoes, tropical diseases and difficulty to defend its territory. The second city was founded at the opposite side of the bay in very different conditions: a rocky peninsula easy to defend and with crossed winds that would ensure the health of its inhabitants. This city is known today as Casco Antiguo, and it is here where the Republic of Panama was born as it is known today. \n\n* '''Casco Antiguo''' (or Casco Viejo), currently a UNESCO protected site, is Panama City´s second touristic destination and the reason is that its buildings reflect the diversity of Panamanian society. Although a Spanish colonial city, because of several fires and the influence of merchants from all around the world, it became a vibrant city with styles ranging from Caribbean to French and even Art Deco. Today, Casco Antiguo undergoes an interesting revitalization process. Boutique hotels have started to appear, and some of the best bars and restaurants of the city can be found here. It has also become Panama City´s artistic center with the recurrent art events and shows such as the Panama Jazz Festival, the Music Festival, Sobresaltos Dance Festival and many others. \n\n* '''Parque Soberania, Parque Chagres and Parque Metropolitano''': fifteen minutes away from modern Panama City, you´ll be able to hike primary and secondary tropical rainforests. There are several activities you can do here, from birdwatching at Gamboa´s Pipeline Road to fishing at the Gatun Lake or visits of the caves at Madden. For those interested in research, the Smithsonian Tropical Research Institute offers visitors educational tours to Barro Colorado Island, one of the most studied jungles in the world.\n\n* '''The Panama Canal''' is probably the most important item in the traveler´s list. There are several ways you can experience the canal, it will depend on your level of interest. For the curious visitor, there are two museums devoted to it: the Canal Museum at Casco Antiguo, featuring Panama´s history as a crossroads of cultures, oceans and a bridge between continents and a second museum is located at the Miraflores Locks. This museum shows the technical aspects of the Canal. You can observe the transits at the balcony of the restaurant on the top. Nowadays a new visitor center opened in Colon for one of the new locks called Agua Clara, which has a beatifully positioned balcony from which to see the new operations. \n\nAnother way to experience the Canal is to cross it. Either partial crossing which takes four hours or complete crossing which might be done in eight, in both cases it is recommendable to hire a guide that is knowledgeable in history of the Panama Canal.\n\nAn interesting twist on viewing the Panama Canal is to travel the length by train. The Panama Railroad was first built in 1855 and then rebuilt in 1909 during construction of the Panama Canal. For many years the railway provided an invaluable link between the Atlantic and Pacific. Ocean to Ocean by railway, the trip will take one day and transits through the tropical jungle.\n\nAlthough the Panama Canal is the most famous destination in Panama, travel outside the City is growing in popularity. Adventure travelers can take a bus or short flight, and in just a few days, can see both the Atlantic and Pacific coasts.\n\n=== Beaches ===\n*'''Beaches:''' Panama has an unlimited list of activities to do, but every traveler wants to find a beach to relax on. Luckily, Panama offers some amazing beaches all over the country. \n*[[Bocas del Toro]] on the Caribbean side offers several islands. Isla Colon, the main island with Bocas town is a central hub for backpackers looking to party at the beach. The other islands, such as Bastimentos, offer more secluded getaways.\n*[[Boca Chica]] is on the Pacific side and is the entrance to the Gulf of Chiriqui National Marine Park, featuring hundreds of uninhabited islands with white sand beaches. Tours can be booked from [[Boquete]] or [[Boca Brava]]. \n*[[San Blas]] islands are on the Caribbean side, closer to Panama City. The indigenous group of the Kuna inhabit this autonomous region, and most travelers book a week-long boat ride, island hopping between the gorgeous white sand beaches.\n*[[Santa Catalina]] is a small beach town on the Pacific side, offering some of the best surfing in Panama. It also serves as the port to Isla Coiba. \n=== Whitewater Rafting ===\n*'''White Water Rafting:''' With hundreds of rivers, Panama offers world-class whitewater. Amazing white water rafting can be found in the [[Chiriqui]] Province, in [[Boquete]], on the Rio Chiriqui Viejo. There is usually enough water to paddle year around. However, the highest water level is in October and November, at the end of the rainy season, and the lowest water level is in May, at the end of the dry season. Other phenomenal rivers that can be run during the rainy season include the Gariche, Chiriqui, and Fonseca Rivers in the Chiriqui Province. [[Boquete]] offers solid Class III continuous rapids for a very fun and adventurous day.  '''Boquete Outdoor Adventures''' is a licensed and reputable company that offers daily whitewater rafting excursions on the Chiriqui Viejo.\n\n=== Hiking and Bird Watching ===\n* '''Hiking:''' There are many hiking trails in Panama through the numerous National Parks. Most are accessible and easy enough to traverse with out a guide. However, due to the density of some of the rainforests, staying on the designated trail is recommended, if you don’t have a guide. To increase your chance of actually seeing wildlife, birds, or Quetzals in [[Boquete]], you can hire a guide.  In the [[Eastern Panama|Darien]] unguided travel can be dangerous. Because Panama is one of the top adventure destinations, there are many reputable tour companies offering guided treks throughout the country, with some of the best being in the charming mountain town of [[Boquete]].\n* '''Birding:''' There are over 960 species of birds in Panama. Many are only found in this region. The Panama Audubon Society is a good source of information on the bird population by region. [[Boquete]] birding is not to be missed. \n* '''Quetzal Trail:''' Within the National Park, [[Boquete]], the area around this trail, including multiple other shorter and easier trails, is perhaps the most famous hiking area in all of Panama. Visitors come from all over the world to have an opportunity to see the Resplendent Quetzal. Although the trails are easy enough to hike by yourself, unless you are an experienced birder, you might not spot a Quetzal. It is wise to hire a guide.\n=== Zip Line ===\n* '''Zip Line Canopy:''' There is nothing more exciting than flying over the canopy on a zip-line. You can find zip line canopy adventures in [[Panama City]], [[Cocle]], [[Bocas del Toro]], and [[Boquete]].\n=== Horseback Riding ===\n* '''Horseback Riding:''' Horses are a way of life in Panama. It is not unusual to look out the window of your casita, and have a horse looking back. Horseback riding in Panama is mostly Western horses and Western saddles. Privately owned horses can vary from Quarter Horse to a mix of Columbian or Peruvian Paso. By breeding the two, you get a larger horse, than the traditional Paso Fino, with the smooth and lovely gait of the Paso. There are two great areas for riding: on the beaches of [[Bocas del Toro]] near Dolphin Bay' and in mountains of [[Boquete]].\n=== SCUBA and Snorkeling ===\n* '''Scuba Diving''' and '''Snorkeling''': Both the Atlantic (Bocas del Toro) and Pacific ([[Gulf of Chiriqui]]) offer incredible water sport opportunities. For Caribbean coral and reef fish, go Atlantic. For rare pelagic species and the best whale watching in the world, go Pacific. Isla Coiba, named the Galapagos of Panama, offers over-sized scuba diving with sharks, turtles, big fish, rays, and crocodiles. \n=== Sport Fishing ===\n* '''Fishing''': The Gulf of Chiriqui is known among sport fishermen to be one of the best spots in Central America. Saltwater Sportsman Magazine recently named Panama as the best place on earth to catch the Black Marlin. With inshore and offshore trips available out of Boca Chica, fishermen find unlimited options. On the other side of the country, near the border with Colombia on the Pacific side, you can also find Piñas Bay and the Zane Gray Reef, which is renown worldwide as one of the best fishing spots in the worlds (and in Piñas Bay, you will also find the Tropic Star Lodge).\n=== Coffee ===\n* '''Coffee Tasting:''' [[Boquete]], Panama has now become synonymous with some of the best coffee in the world. It has always been a coffee producing region. You can visit a coffee estate for a tasting and explanation of the coffee process. Many different tours are available, from intimate hands-on roasting and tasting on a small scale farm like Finca dos Jefes, or tours of large-scale coffee farms such as Ruiz or Kotowa. \n=== Kayaking ===\n* '''Kayaking:''' Ocean and river kayaking can be found in the [[Chiriqui]] Province. [[Boquete]] has many outfitters as the rivers are perfect for rafting and kayaking. And the Gulf of Chiriqui is protected by many islands, making the calm waters perfect for kayaking; white powdery beaches filled with wildlife. '''Boquete Outdoor Adventures''' is a reliable company out of [[Boquete]] that offers both river kayaking and sea kayaking trips to the Pacific.\n\n=== Boating ===\n* '''Boating''': Panama touches both oceans and is only 50 miles wide at its narrowest point, so there's plenty of opportunities for boating. From David, a 5 minute cab ride will get you to the port of [[Pedregal]] and into the sparkling [[Gulf of Chiriqui]].  In Panama City, you will find many options for taking a boat, including Flamenco Resort and Marina, Balboa Yacht Club, Diablo Spinning Club, the Club de Yates y Pesca, and the Miramar Marina.  There are also some other marinas in the lakes of the Panama Canal, as well as some near the city of Colon in the Atlantic side\n=== Rock Climbing ===\n* '''Rock Climbing:''' The best rock climbing is in the [[Chiriqui]] Province, in the highlands of [[Boquete]]. The Basaltic Rock was formed after the last volcano eruption. Cesar Melendez has developed over 30 routes, from beginner to advanced. He is also pioneering 'bouldering', climbing rocks while suspended over the river.\n=== Hot Springs ===\n* '''Hot Springs:''' Even though the Baru Volcano has been dormant for over 600 years, there are still thermal springs bubbling up around it. [[Boquete]], in the [[Chiriqui]] Province, has several areas with active springs. In Volcan, on the northern side of the Volcan Baru, about 30 minutes from town, there are several springs; however, due to the mineral content, there is a slight sulfur smell. In the [[Boquete]] region there are several hot springs to choose from. A local land owner in Caldera has started to develop his bubbling spring (no sulfur smell), and hopes to make it more like a 'spa'. However, it is not that easy to access yet; 4 wheel drive is required, or join a reputable tour company.\n=== Volunteering ===\nForeigners also enjoy volunteering. In Panama, there are various opportunities for community service. To get a great overview of the opportunities available in Panama you can also have a look at an online comparison platform for volunteering such as Volunteer World [https://www.volunteerworld.com/volunteer-in-panama].\n\n==See==\nPanama affords a great many visual delights, both exotic and familiar at once. It is an exciting mix of modern skylines, surfer villages, tony retirement towns, cattle ranches, sleepy mountain hamlets, and charming colonial enclaves, a changing perspective of Central America, whether examining its dynamic present or preserved past.  With portals to two oceans and the jungle interlaced, this slender isthmus country has altitudes that range from sea level to the heights of cloud-draped volcanoes. It abounds with scenic views and dramatic changes, all which can be seen from very good roads. For those who eschew quotidian travel, Panama is an adventure lover’s dream.  View the tropical rainforest by drifting down [http://bestplacesintheworldtoretire.com/questions-and-answers/1164-how-s-the-kayaking-in-and-around-panama-and-the-rafting-in-and-around-panama/ Lake Gatun by kayak,] watch humpback whales in their yearly migration, scan both Pacific and Atlantic oceans from the same lofty perch, bird watch from the many [http://bestplacesintheworldtoretire.com/questions-and-answers/1393-hows-the-ecotourism-in-panama/ national parks,] stare face to face with sea turtles in the marine reserves, and see how the native [http://bestplacesintheworldtoretire.com/questions-and-answers/1157-hows-the-adventure-travel-and-activities-in-panama/ Embera people] live in their own villages.  Taking pictures in Panama makes anyone look as good as a National Geographic photographer.\n\n==Buy==\n\n===Money===\nPanama has used the ''US dollar'' as the banknote currency - although Panamanians often refer to it as ''balboa''. While the ''Panamanian Balboa'' has been used as the coin currency and originally banknote currency since 1904. The Balboa coins are currently one of the three currencies (the others being the Bermudian dollar and Bahamian dollar) with exact extange rates to the US Dollar. Example; $1 US Dollar will equal 1 Panamanian Balboa or $560.75 US Dollars will equal 560.75 Panamanian Balboas. So if you're from a country with the US Dollar as accepted currency, The Bahamas, or Bermuda, you will have no problem understanding prices in Panama.\n\nIf you're from the US or any other country with the US Dollar as the sole official currency, the only oddity about Panama will be change. Panama mints its own coins in the same weights and sizes as US coinage, but with Panamanian stampings. The Panamanian coinage is completely interchangeable with standard US coinage in Panama. You may get a handful of change back with a conquistador on the quarter and an Indian on one of your pennies, but Lincoln on the other penny and Roosevelt on the dime. Panama also still mints half dollars. You may hear these half dollars called pesos (which is because at the time Panamanians started calling their half-dollar coins \"pesos\", Argentina's \"peso\" was equivalent to 50 U.S.-cents), so don't think you've accidentally ended up in [[Mexico]]. Panama also prints their own unique $1 coins, nicknamed \"Martinellis\" (so-called because it was at-the-time--Panamanian-president Ricardo Martinelli's idea to mint them and make them and produce them (i.e. Balboa coins with a value of 1 U.S. dollar)), however most vending machines, payphones, bus card recharge stations, etc. do not accept them, so it's more convenient to exchange them for regular $1 bills when possible.\n\nIf you run short on change in the United States, Panamanian coins (except $1 coins) work in parking meters, payphones, vending machines, etc.\n\nYou can typically use a credit card at all hotels in the capital, as well as medium-sized regional cities (David, Las Tablas, Colon, Santiago, Bocas del Toro, etc.).  Restaurants, grocery stores, and department stores in major cities will also usually take credit, or even debit cards.  However, outside the capital using your card could be difficult. \n\nThough Panamanian ATMs function on the Cirrus/Plus system, they may not take cards with the Interlink symbol.  Make sure you're carrying a lot of cash (especially small bills) and understand how to take cash advances out on your credit card. Maestro works in Panama (September 2014 in Changuinola). Traveller's checks are not widely used.\n\nMany businesses do not accept USD50 or USD100 bills at all. Most of those that do will ask for your passport and store your data/serial numbers of your notes in a special book. The reason is that many $50 and $100 bills have been counterfeited.\n\n'''Euros and other other currencies that USD''' can best be changed in Panama city in an area just North from Iglesia del Carmen metro station (one block up on Via Espana and Via Argentina). Probably because the market for these currencies is very limited, there are few outlets for changing cash in the country or even Panama city. For instance there are no money changers in Panama's Casco Viejo area. There are only two in Albrook mall and terminal, but exchange rates here are generally rather unfavorable. An alternative is to use ATMs. However many if not all banks in Panama charge access fees in the range of 2 USD to 5 USD. In addition to the flat charge of your own bank, there may also be international transaction charges (usually a percentage) and a currency exchange fee charged by the interbank network (e.g. Plus and Cirrus charge 1%). It all adds up and to find out where you can get the best deal is almost impossible as banks do not provide adequate information. Even if you ask about an ATM inside the bank where it is placed, employees do not know the charges or even the rate you will get. You may get a better rate than at the money changer, but even that is not sure.\n\nThere are [http://www.panamaforum.com/panama-banks/9372-panama-banks-complete-list.html 91 banks in Panama].  Opening hours vary widely from bank to bank. On weekdays, all banks are open until at least 3PM, and some until 7PM  On Saturdays many banks are open until noon, and some branches located in shopping centers are also open on Sundays.  Note that most banks will not allow you to enter wearing shorts and/or flip-flops.\n\n===Shopping===\nPanama is home to the hemisphere's largest free trade zone, the Colon Free Zone [http://www.zolicol.gob.pa/index.php].  There are also a number of large, American-style malls, such as Multicentro [http://www.multicentropanama.com.pa], Albrook Mall [http://www.albrookmall.com], Multiplaza Pacific [http://www.multiplaza.com/visitenosPAN], Metromall [http://www.metromallonline.com/m/panama-panama], and the latest Altaplaza Mall [http://altaplazamall.com/]. However, prices vary widely from mall to mall - Albrook is quite cheap, while Multiplaza is home to designer boutiques and very high prices. Generally Panama is a good place to buy consumer electronics, clothing and cosmetics.\nBut you will not find a better selection or prices than in the US, most cheap cloth stores sell stuff that are leftovers and out-dated stuff that in the US doesn't sell anymore. Electronics usually are $20-50 more expensive than the US.\n\nTraditional Panamanian crafts can be found most cheaply at artisanal markets, such as the YMCA in Balboa and the market in Panama Viejo.  In Panama City, the best handicrafts can be found at REPROSA.  Panama's best-known craft is the mola, intricate reverse-applique handwork made by the Kuna.  Molas can also be bought from vendors on the seawall in Casco Viejo[http://www.cascoviejo.com].  Other Panamanian crafts include carved tagua nuts, cocobolo carvings of animals, and woven palm-fiber baskets. There is a smaller craft market in El Valle, which specializes in soapstone carvings and other central Panamanian crafts. \n\n*<buy name=\"REPROSA Treasures of Panama\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"http://www.reprosa.com\" hours=\"\" price=\"\" lat=\"\" long=\"\">Since 1975 REPROSA has been dedicated to the promotion of Panama's history, cultural traditions, ecological beauty and ethnic diversity. All their handicrafts are hand-made in Panama by Panamanian artisans, and there is something for every budget. REPROSA has three locations: Costa del Este Industrial Park (271-0033), Ave. A in Casco Viejo (228-4913), and Ave. Samuel Lewis in Obarrio (269-0457). REPROSA also offers a tour of their award-winning workshop where visitors can see first-hand how the Treasures of Panama are made. Their factory is in the Costa del Este Industrial Park just minutes from Panama Viejo. Tour $10 per person, Monday thru Friday at 9:30AM and 2PM. </buy>\n\n*<buy name=\"Country Store & Café\" alt=\"\" address=\"583, Cl Tomás Guardia, Altos de Balboa, Ancon\" directions=\"Near the Canal Administration Building\" phone=\"(507) 232-7204\" url=\"http://countrystorepanama.webs.com/\" hours=\"8:00 a.m. 6:30 p.m.\" price=\"$12\" lat=\"\" long=\"\">Offers fresh organic food in a natural setting where it's easy to enjoy the local wildlife. The store has produce as well as artisan crafts.</buy>\n\n==Eat==\nIn the larger cities you can find all types of food ranging from the French haute cuisine to the freshest sushi. There are Arabic restaurants, Italian, Chinese, Indian, Mexican... whatever you're in the mood for. \n\nOutside of the cities, the selection is largely Panamánian with bountiful seafood and beef due to the abundance of cattle farms and the fantastic fishing in the area.  Panamanian cuisine is a mix of several cultures.  Reminiscent of the country's Afro-Caribbean, French and Spanish influences, the dishes take on a complete character of their own.  If you get tired of eating beans or gallo pinto in the rest of Central America, you might want to head towards Panama.  Since Panama has a little more Caribbean influence than other Central American countries, you'll see a lot more plaintain than beans here. Most dishes are served with coconut rice and a type of squash or other native vegetable. If Panamanian food has to be summed up in one word, that word would be culantro, which is a local plant that tastes like cilantro, except that it has a much stronger flavor.  \n\nA typical plate in a humble, family restaurant can range from $1.25 up to 5.00, including your choice of meat: mondongo (beef stomach), fried or baked chicken, pork, beef and sometimes fried fish; rice, beans, salad: cabbage, carrot & mayonnaise; beet salad; green salad; potato or macaroni salad; and patacones (fried green plantains). The Panamanians also enjoy their \"chichas\" (fruit, water & sugar), of which there is always a selection, ranging from tamarindo, maracuya  (passionfruit), mango, papaya, jugo de caña (sugar cane juice), or agua de pipa (juice from young green coconuts). If you like your food picante, Panama may not be the place for you.  They definitely have several hot sauces, but the emphasis is not on the heat.  \n\nYou can get excellent food really cheap if you look around.  A quick and cheap lunch can be found at the so called '''Fondas''', which are small eateries located near schools, sports stadiums and in industrial areas where workers and students will have their afternoon meal. There are often several of these Fondas clustered together so just look for the one with the longest line and you can count on it having the best food for the money. A full plate of rice and beans with a large piece of chicken and a small salad will cost around $2-$2.50 plus the cost of a Coke (Squirt is very popular with lunch). If you chose to eat your food at the Fonda you will be given a real plate and actual silverware as well as a glass bottle of soda with a straw (be sure to return the empty bottle). The local food is far more tasty than the typical Subway sandwich, Whopper or KFC meal and a lot cheaper. If you eat at the same location often enough you will move from the status of a crazy gringo who must have gotten lost on the way to the Burger King to just another one of the locals enjoying lunch and casual conversation (in an industrial area the patrons will be mostly men and the subject of conversation mostly football and women). \n\nThe equivalent of a 5-star meal with drinks can be US$8-30 in some places.\n\n==Drink==\n\nNational beers are produced (Balboa, Atlas, Soberana, Panamá), but don't measure up to a good import or excellent local craft Beer like La Rana Dorada.  La Rana Dorada is probably the best of the domestic brands, however, Atlas is the most commonly purchased; many women favor Soberana. Beer can cost as low as .30/cents per 12 oz. can in a supermarket or anywhere from $ .50 in a local town bar up to $2.50 in upscale bars.\n\nCarta Vieja and Ron Abuelo [http://www.varelahermanos.com/es/] are the main domestically produced rum.  Seco, a very raw white rum, is the national liquor. Seco con leche (with milk) is a common drink in the countryside.  \n\n===Listen===\n\nMusic is definitely one of the highlights of Panama.  Salsa music seems to permeate everything in the Latin parts of the country.  Reggaeton originated in Panama and is also very popular and is known by the name [[Plena]].  There are over 100 radio stations in Panama broadcasting online, some in English [http://www.coolpanama.com]. In Bocas del Toro, you will hear a lot of Reggae with Spanish lyrics. Check out the summer music festival in Las Tablas.\n\n===Party===\n\nHow the Panamanians love their \"fiestas\"! They know how to let loose and have a genuinely good time, dancing, conversing and drinking. \n\nCarnaval is the main celebration in the country. It is held 40 days before the Christian Holy Week, running through the weekend and ending on Ash Wednesday (February 28-March 4 in 2014). The largest celebration being held in the province of Azuero, in the town of Las Tablas, where two streets compete with separate queens, activities, parades and musical performances. \n\nThe party begins on Friday with a presentation, parade and crowning of the queens, a fireworks show; with drinking in the streets legal, the party begins and doesn't stop until 5AM.\n\nEvery carnival day has a theme: Friday is the Opening, Saturday is International Day, Sunday is Pollera day, Monday is costume day, Tuesday is the Queens day and on Wednesday is the \"entierro de la sardina\"(the sardine burial) before 5AM.\n\nMany discos and bars fill the Capital City.  The area known as \"Calle Uruguay\" has probably a dozen or so nice discos and bars within a 2 block radius, and is the best place for partying. \n\nCalle Uruguay bar area is a very trendy scene. You will find here many restaurants such as La Posta, Peperoncini, Habibis, Tomate y Amor, Madame Chang, Burgues or Lima Limon, which make up a great pre-party event. After diner you can cross over to Prive, Pure, Loft, Guru or People for a more fashionable club scene. If you want a more relax bar, Sahara or The Londoner both offer retro music and pool tables.\n\nAnother great spot for \"bar hopping\" is Zona Viva in the Amador Causeway. Zona Viva is a closed off area so it is very easy for you to find everything in one place. You will find here clubs such as Jet Set Club, the Building, the Chill Out Zone, X Space, etc. \n\nCasco Viejo is a more cultural zone of Panama. Art galleries in the area coordinate Art Block parties once a month and there are always exhibits. The National Theater offers ballets, opera, and concerts weekly. Restaurants in this area are highly recommended. After dinner you can cross over to Relic, La Casona, Mojitos sin Mojitos, Platea, Havana Cafe or Republica Havana.\n\n==Sleep==\n\n<!-- Accommodation listings go in destination articles -->\nPanama’s hotel accommodations are as diverse as its geography. '''[[Panama City]]''' has as much glamour and glitz as an average North American city, without the high price tag. You can find 5 star high rise hotels in the heart of downtown; or you can venture out to the smaller neighborhoods, where old Canal military barracks have been converted into B&B’s. In terms of an authentic Panama experience, the historic district of Casco Viejo provides the charm of yester-year with modern amenities of today. Because tourism is so new to the district, lodging accommodations are still limited. An option are short term apartment rentals at Los Cuatro Tulipanes \n\n'''Bocas del Toro''' has your typical island cabanas and small hotels, some literally right on the water (similar to the cabanas in Bali). The '''Chiriqui''' Province, in the western lowlands, has small hotels on some of the outer islands, and an Eco-Preserve in Chorcha where you can spend the night in Jungle Hammocks with the monkeys. In the western highlands, around '''Boquete''', there are hostels for $11 a night, and 5 star hotels for $300+ a night. No high rises here, but small very artsy boutique hotels and casitas. Recently, David Panama, Capitol of the Chiriqui Province has become a stop-over option for backpackers criss-crossing from Panama City to Bocas Del Toro and Costa Rica.\n\n==Learn==\n\nPanama offers many universities and high schools that are bi-lingual and world class.\nThere's an ongoing project called City of Knowledge [http://ciudaddelsaber.org], that consists of several educational programmes in the old installations of a former US military base (Clayton). There is also a school at Justo Arosemena who teaches mainly to German speaking people, but it might be worth a glance at the UDI-Universidad del Istmo [http://www.spanischinpanama.com]. There's also a Florida State University branch [http://www.fsu.edu/%7Ecppanama/], as many other alternatives.\n\nUniversidad Tecnológica de Panama [http://www.utp.ac.pa] (Technological University of Panama, the best University in Panama in Engineering and Logistics programs) has a Language Center where you can learn Spanish, English, French, German, Japanese, Korean, Mandarin, Italian and many other languages. You can find people from these countries teaching in this Center.\n\nIn the western part of the country, such as in Bocas del Toro and in Boquete, there are other well reputed Spanish language schools which cater to university students and young professionals traveling to study abroad.\n\n==Stay safe==\n\nMost of Panama is very safe.  People in rural areas are generally extremely friendly and very helpful.  If you want to visit Latin America, but are paranoid about security, Panama might be a good place to cut your teeth. One exception is the border region between Panama and Colombia, which is considered extraordinarily dangerous due to Colombian rebel groups and drug traffickers. Most of the city of Colon is considered dangerous [http://bobarno.com/thiefhunters/2010/02/panama-muggers-2/], and some neighborhoods in Panama City are a bit sketchy, in particular El Chorrillo, Curundu and El Marañón, poor and crime-ridden areas.  The old colonial quarter, Casco Viejo (also called San Felipe) has a lingering bad reputation among travelers and some Panamanians, but is gentrifying rapidly. During the daytime, San Felipe is perfectly safe for foreigners.  At night, the main streets and plazas, as well as the district of bars and restaurants toward the point, are also safe, but visitors should exercise caution as they move north along Avenida Central towards El Chorillo.\n\n== Stay healthy ==\n\nPanama is well known for its excellent medical care, making it a recent hot spot for medical vacations.\n\n[[Yellow fever]] vaccination is recommended for all visitors over 9 months of age travelling to the provinces of Darien, Kunayala (San Blas) and Panama, excluding the Canal Zone. Most countries require proof of yellow fever vaccination before permitting travelers to enter from Panama.\n\nThe U.S. Centers for Disease Control [http://www.cdc.gov/travel/regionalmalaria/camerica.htm#malariarisk] state that risk of [[malaria]] exists in rural areas of Bocas del Toro, Darién, and San Blas provinces; no risk in Panama City or in the former Canal Zone. NB: Chloroquine is no longer effective for San Blas Province.\n\n[[Dengue fever]] is endemic, particularly in the province of Darien.\n\nTap water is safe in virtually all cities and towns, with the exception of Bocas del Toro, where bottled water is recommended.  \n\nFemale travelers should be aware that the moisture and heat of the tropics can encourage yeast infections. 3-day and 5-day treatment courses are available in pharmacies, but must be purchased from the pharmacist.  \n\nThere are many hospitals that can give tourists first class attention. Many can take international insurance policies, though your insurance company may require you to pre-pay and submit a claim form.  Verify with your company prior to travel what the requirements are for filing a foreign claim, as you will not typically be provided with a detailed receipt (one that includes diagnosis and treatment codes) unless you ask for it. Here are some of the best ones in Panama City:\n\n* Hospital Nacional [http://www.hospitalnacional.com/] - State-of-the-art '''private''' hospital located on Avenida Cuba, between street 38 and 39, Tel. 207-8100.\n\n* Clinica Hospital San Fernando\n\n* Hospital Paitilla is a well-equipped hospital where Panama's wealthy upper class traditionally have gotten there medical services.\n\n* Punta Pacifica Hospital [http://www.hospitalpuntapacifica.com/] is a newly-opened hospital near Multiplaza Mall and is now managed by Johns Hopkins International.  It is attracting some doctors away from Paitilla.\n\n* Hospital Santo Tomas is considered by many emergency doctors and medical professionals to be the best for trauma care due to the volume of their trauma patients. Much like [[Cook County Hospital]] in [[Chicago]], Santo Tomas medical teams see many types of trauma each day and are well equipped to handle these cases. Once a patient is triaged, they can be moved to a private facility.\n\nFarmacia Arrocha, a drugstore chain, has branches throughout the country.  Gran Morrison department stores also often operate pharmacies.\n\nThe new 911 system is now operational for medical emergencies only. Most coverage is in and around Panama City. However, during major holidays or national festivals, 911 units are stationed around the country especially in Las Tablas, David, Chitre, and Santiago.\n\nMedical evacuation flights are not as organized as in the EU, Canada, and the US. Until a dedicated helicopter emergency service is operational, the only choice for fast evacuation from the interior is to charter either a small plane or helicopter capable of holding a litter. Charges are billed to a credit card or paid in cash. Contact charter aircraft companies for a quotation. Typically, a medical flight on a small twin-engined plane from David to Panama City will cost $4,000. Helicopters are significantly more. A new private membership air medical transport service is now available. Tourist memberships are $10 for 90 days coverage.\n\nEvacuation flights out of the country are normally provided by air ambulance services from Miami and range from $18,000 to over $30,000 depending on the patient's medical needs. \n\nTravelers with a prior medical condition, or who are at risk, should check their insurance coverage for these flights. Do not assume that a credit card's travel insurance will cover the cost. Many only cover up to $1,000.\n\nPersonal cleanliness and sanitation:  The bathrooms in even the most remote areas and smallest restaurants of the country are amazingly clean and well-kept. They far exceed most North American public facilities in this respect.  In most areas, the standard practice is to throw toilet paper into the provided bin - not the toilet.  Most remote areas do not have the proper septic systems to handle toilet paper waste.  This is especially true along the Pacific and Caribbean coastal areas.\n\n==Respect==\n\n===What to wear===\n\nPanamanians appear to care about their appearance.  Don't try to dress to 'fit in', just be yourself.\n\nThat being said, there is no need to wear a suit everywhere, either.  Just dress conservatively and nice.  For men, a clean pair of jeans and ironed collared shirt will do nicely for most excursions, you could dress more casually or more formally depending on the situation.  Shorts are considered extremely casual wear suitable only for the beach, although this attitude has begun to change in some areas. Also, the longer Bermuda shorts made of nice fabrics are viewed as appropriate in many places.\n\nHowever there is a dress code to follow to enter in all banks and governmental institution as well as many stores and supermarket. If you enter these establishments with inappropriate dress like wearing Bermuda or skirts above the knee, security will probably refuse access and ask you to leave.\n\nThink nice, neat, and clean, and you will already be showing a great deal of respect for locals.\n\nIf you are making a side trip to [[Boquete]], especially during the rainy season (April thru November) please dress in layers, bring a light rain jacket, and waterproof hiking boots.\n\n==Contact==\n\nPanama has one of the most advanced telecommunications systems in Latin America. this is due to the fact that most major submarine fiber cables cross the Panama Canal, either by land or water.  Calls to the USA and Europe are between 4 and 10 cents a minute. The best way to make international calls from Panama is to buy prepaid telephone cards that are sold at every corner. The most popular is the TeleChip card. These cards work from everywhere and they even work from the USA, Mexico, Europe, Brazil, Costa Rica, Colombia etc.\n\nPanama's country code is 507. All cellular numbers start with the number 6 and have 8 digits. Land line phone numbers have 7 digits.\n\n\n[[Category: Countries]]\n[[Category: Panama]]\n\n\n[[ca:Panamà]]\n[[de:Panama]]\n[[eo:Panamo]]\n[[es:Panamá]]\n[[fi:Panama]]\n[[fr:Panama]]\n[[hu:Panama]]\n[[it:Panamá]]\n[[ja:パナマ]]\n[[nl:Panama]]\n[[pl:Panama]]\n[[pt:Panamá]]\n[[ru:Панама]]\n[[sv:Panama]]\n[[wts:Category:Panama]]\n\n[[WikiPedia:Panama]]\n[[Dmoz:Central America/Panama/]]\n[[World66:centralamericathecaribbean/panama]]\n\n{{IsPartOf|Central America}}\n{{outline}}\n{{countryguide}}"
        }
    }
}