{
    "parse": {
        "title": "Romania",
        "pageid": 728,
        "wikitext": {
            "*": "{{pagebanner|Romania Banner.jpg}}\n\n{{quickbar\n|image=124.jpg‎\n|caption=Brasov \n|location=Romania in its region.svg\n|flag=Flag of Romania.svg\n|capital=[[Bucharest]]\n|government=Parliamentary Republic\n|currency= leu (RON)\n|area=237,500 sq km\n|population=19,942,642 ( 2015 estimate.)\n|language=[[Romanian phrasebook|Romanian]]\n|religion=Eastern Orthodox 87%, Protestant (mostly Calvinist, Unitarian and Lutheran) 6.8%, Catholic 5.6%, other (mostly Muslim) 0.4%, unaffiliated 0.2%\n|callingcode=+40\n|tld=.ro\n|timezone=UTC +2\n|electricity=220V/50Hz (European plug)\n}}\n'''Romania''' (''România'') [http://www.romaniatourism.com/] is situated in the north of the [[Balkans|Balkan Peninsula]] on the western shores of the Black Sea. It enjoys great natural beauty and diversity and a rich cultural heritage. Romania enchants visitors with its scenic mountain landscapes and unspoiled countryside areas, and also with its historic cities and its busy capital. Over the last decade Romania had undergone a significant development and it is one of the recent members of the European Union. Tourists from western countries might still, even today, enjoy some surprising experiences in Romania. This is a large country which can sometimes be shocking with contrasts: some cities are truly Western Europe; some villages can seem to have been brought back from the past. While it has significant cultural similarities with other Balkan states, it is regarded as unique due to its strong Latin heritage. Things for which Romania is famous include: the Carpathian mountains, sculptor Constantin Brancusi, wine, salt mines, George Enescu, medieval fortresses, Eugene Ionesco, \"Dacia\" cars, Dracula, stuffed cabbage leaves, Nadia Comaneci, primeval dense forests, the Black Sea, Gheorghe Hagi, sunflower fields, wolves and bears, painted monasteries, the Danube Delta, etc. etc. \n\n==Understand==\n\nWith a Black Sea coast to the south-east, it is bordered by [[Bulgaria]] to the south, [[Serbia]] to the southwest, [[Hungary]] to the northwest, [[Moldova]] to the northeast  and [[Ukraine]] in both the north and the east. While its southern regions are usually seen as part of South-east European Balkans, [[Transylvania]], its central and largest region, has a more western-central European look. \n\n\n===History===\n\nIn ancient times the territory of present day Romania was inhabited mainly by [[:wikipedia: Dacians|Dacian]] tribes, who had a remarkable, although not very well known, culture. The Dacian kingdom reached its peak in the 1st century BC, when their king Burebista ruled from his power base in the Carpathian Mountains over a vast territory stretching from Central Europe to the Black Sea. The intriguing network of fortifications and shrines built around the historical Dacian capital [[:wikipedia: Sarmisegetuza|Sarmizegetusa]], in today's south-western Transylvania, has been relatively well preserved through the ages and is now recognized as a [[UNESCO World Heritage site]].\n\nIn 106 AD the Dacians were defeated by the Romans, most of their homeland becoming a province of the Roman Empire. Being quite rich in natural resources (including gold, silver, salt, etc.), the region prospered under the Roman administration: cities developed rapidly, imperial roads were built and people from all over the Empire settled there. That's why, despite the fact that Roman administration lasted in Dacia less than 200 years, a population with a distinctive Latin character and language emerged there. Naturally, later on they were influenced by the neighbouring Slavic peoples with whom they were in contact.\n\n[[Image:250px-Timisoara_unirii_brightened.jpg|250px|thumb|[[Timișoara]]]]\n\nIn the Early Middle Ages Hungarians began settling in the area today known as Transylvania, which would eventually become after years a part of the Kingdom of [[Hungary]]. German Saxons also settled in that area (in several waves), starting from the 12th century. In order to protect themselves from frequent Tartar or Turkish invasions, they set about building fortified cities and castles, many of which remained to this day. South and east of the Carpathians, the two Romanian speaking principalities of [[:wikipedia:Wallachia|Wallachia]] and [[:wikipedia:Moldavia|Moldavia]] were created in the 14th century. Starting with the 15th century, both of them (and for a while Transylvania too) fell under the domination of the [[:wikipedia:Ottoman Empire|Ottoman Empire]].\n\nFor a short period in 1600, Michael The Brave ([[Mihai Viteazul]]) ruled over all three principalities, thus briefly becoming historically the first de-facto ruler of a unified Romania.  The international scene, however, was not ready yet to accept and recognize a unified Romania, thus his union fell a short while later.\n\nA Romanian national revival movement started in Transylvania in the late 1700's and swept across the Carpathians, inspiring the 1859 unification of Moldavia and Wallachia, thus creating modern national Romania. In 1917-1919 Transylvania and Eastern Moldavia (today part of the Republic of [[Moldova]]) were united with Romania (\"Greater Romania\").\n\n\"Soviet occupation following World War II led to the formation of a Communist \"people's republic\" (\"R.P.R\") in 1947 and the abdication of the king. Between 1947 and 1965, Romania was led by Gheorghe Gheorghiu-Dej with a pro-Soviet stance throughout most of his administration. In 1965, he was succeeded by [[:wikipedia:Nicolae Ceauşescu|Nicolae Ceauşescu]] who was less enthusiastic towards the Soviet Union and maintained a more neutral foreign policy than his predecessor alongside a harsh internal terror regime. During the 1980s, his notorious [[:wikipedia:Securitate|Securitate]] secret police became a strong force. The leader was overthrown and executed in late 1989.\"(CIA World Factbook). Former Communists, regrouped around the Front of National Salvation and the Romanian Party for Social Democracy dominated the government until the 1996 elections, when they were swept from power by a fractious coalition of centrist parties, after failed reforms were replaced by the Social Democratic Party. Both groups attempted to amend ties with Hungary, which were deeply fractured back in the 1980s, when Ceausescu either encouraged the large Hungarian community to leave the country or exiled them outright (5.000 Hungarians left Romania anually). The 2004 elections brought to power an alliance formed by the National Liberal and Democratic parties. They currently govern the country with the support of most minority parties in Romania. In 2008 Romania held its legislative elections with the right wing party of the PDL (Democratic Liberal Party) winning the national elections by a small margin against the PSD (Social Democratic Party). The current Prime Minister is Viorica Dancila while the Deputy Prime Minister is Liviu Dragnea of the Social Democratic Party.\n\nAs of the year 2009 the Romanian Government has decided to implement a massive infrastructure investment programme which will benefit the whole country. The Romanian Government hopes to successfully implement the massive infrastructure program by the end of their mandate in 2012.\n\nWhen the economic, social and political development is concerned Romania is doing well in comparison to other countries in the Western Balkans region and other surrounding countries in Eastern Europe such as Ukraine and Moldova. However when compared to Western Europe, Romania still has some ways to go to reach that level of development that is enjoyed by the Western Europeans. However Romania's membership in the European Union will help in closing the gap in the years to come.\n\n==Regions==\n<!-- The map has two mistakes. The first is that Sinaia and Vatra Dornei are misplaced, either of them being on the other's position. The other one, the city Ploiesti has been miss-speled: Ploietsi. Plus, some of the city names don't have the romanian diacritics written in their name -->\n{{Regionlist\n| regionmap=Romania Regions map.png\n| regionmaptext=The regions of Romania\n| regionmapsize=449px\n| region1name=[[Transylvania]]\n| region1color=#71b37b\n| region1items=\n| region1description=It is the most famous region of Romania, a land of medieval castles and towns, dark forests, snowy peaks (especially those in [[Transylvanian Alps]]). At the same time a region experiencing rapid economical development, with modern youthful cities, huge shopping centers, massive infrastructure projects etc.\n\n| region2name=[[Banat]]\n| region2color=#578e86\n| region2items=\n| region2description=This western-most province is probably the most economically developed in Romania. It has beautiful baroque cities and traditional German villages in the western plains and huge mountain forests in the eastern parts.\n\n| region3name=[[Oltenia]]\n| region3color=#b383b3\n| region3items=\n| region3description=The south-western region, with impressive monasteries, caves and health resorts along the mountains in its northern part and a bizarre desert-like area in the south.\n\n| region4name=[[Southern Bukovina]]\n| region4color=#608860\n| region4items=\n| region4description=This north-eastern region is famous for its [[Painted Monasteries]], tucked away between picturesque rolling hills.\n\n| region5name=[[Maramureş]]\n| region5color=#dde58b\n| region5items=\n| region5description=The northern-most region, it's best known for its timeless villages, traditional wooden churches and beautiful mountain landscape.\n\n| region6name=[[Crişana]]\n| region6color=#a4c28d\n| region6items=\n| region6description=Located along the border with Hungary, this western region is the entry point for most travelers into Romania, who often neglect its Central-European style cities, numerous medieval sites and resorts on the western side of the Apuseni mountains.\n\n| region7name=[[Dobrogea]]\n| region7color=#c8b7b7\n| region7items=\n| region7description=A seaside province dotted by ruins of ancient Greek and Roman cities, with various summer resorts along the [[Black Sea Coast]] and  the unspoiled natural landscape of the [[Danube Delta]] and the [[Black Sea]] lagoons (all of which are Biosphere Reserves and UNESCO World Heritage Sites) in the region's north. Also very ethnically diverse region with many small minority groups.\n\n| region8name=[[Moldavia]]\n| region8color=#c5995c\n| region8items=\n| region8description=Certainly one of the most extraordinary regions in Romania, it offers a pleasant blend of historical cities, medieval fortresses, churches, wine and friendly locals.\n\n| region9name=[[Muntenia]]\n| region9color=#6698bb\n| region9items=\n| region9description=Also known as Wallachia. The capital, [[Bucharest]], is in this southern region, as well as the early residences of the Wallachian princes and the mountain resorts on the [[Prahova Valley]]. It is also the name of the old kingdom of leaders such as the notorious Vlad Ţepeş (The Impaler).\n}}\n\n==Cities==\n\n*[[Bucharest]] — the capital of Romania, in which megalomanic monuments, including \"House of the People\" (now the Palace of Parliament), built during Ceauşescu's regime, overlook medieval and later neo-classical neighbourhoods.\n*[[Brașov]] — located in south-eastern Transylvania, its main attractions are the well kept medieval downtown, the nearby luxury resort of [[Poiana Braşov]] and the proximity to [[Rasnov]] and the Bran (\"Dracula's\") Castle.\n*[[Cluj-Napoca]] — the largest town in Transylvania, is a major economic  center and a youthful city, housing one of the largest universities in Europe.\n*[[Constanţa]] — Romania's main Black Sea port and one of the major commercial hubs in the region. The northernmost Litoral district, [[Mamaia]], is thought to be one of the best Black Sea resorts.\n*[[Iaşi]] — in Moldavia, the second largest Romanian city, once the historic capital of the Moldavian principality until 1861, and for some time capital of Romania. Today it is one of the major economic and cultural centres in the country.\n*[[Sibiu]] — one of the most beautiful cities in Transylvania, it has the best preserved historical sites in the country, many museums and exhibitions, proximity to the stunning Făgăraş mountains, for which reasons it became the 2007 European Capital of Culture. \n*[[Sighişoara]] — the city's downtown area, the Sighisoara Citadel, is the last inhabited medieval citadel in Europe and one of the best historical monuments preserved nowdays.\n*[[Suceava]] — the main city in Bukovina and the medieval capital of the Moldavian principality; it can be the starting point for visiting the famous painted Monasteries in the region.\n*[[Timişoara]] — the largest town in the Banat region, it is one of the most prosperous and modernized cities in Romania; it was there that the 1989 Romanian anti-communist revolution began.\n*[[Oradea]] — a beautiful city, situated in the north-west of Romania, at about 10 kilometers from the western Romanian border. Capital of the Crisana region, it has a long and rich history, being mentioned for the first time in a document in the year 1113. Oradea is rich in beautiful buldings and historical sites, featuring a mixture of architectural styles: baroque, rococo, and Renaissance. It is indeed a place to visit.\n\n==Other destinations==\n*[[Sinaia]], [[Predeal]], [[Poiana Brasov]], Baile Herculane, [[Vatra Dornei]], and all ski resorts;\n*[[Transylvanian Alps]];\n*[[Carpathian Mountains]];\n*[[Painted Monasteries]];\n*Saxon villages with fortified churches in Transylvania;\n*[[Danube Delta]];\n*The Black Sea resorts.\n*[[Craiova]] — the 6th largest city in Romania, located near the east bank of the river [[Jiu River|Jiu]] in central [[Oltenia]] at approximately equal distances from the [[Southern Carpathians]] (north) and the [[Danube|River Danube]] (south). It is a longstanding political center, being formerly the capital of Oltenia.\n*[[Ploiesti]] — the 9th largest city in Romania,located at 60 km north of Bucharest. It is recognized as the center of the Romanian oil industry - has four refineries and numerous companies operating in industries related to this branch.\n*[[Alba Iulia]]- is a municipality in Alba County, located in the central-western part of Romania, in the valley of Mureş River, on the right of the Mureş River, in the confluence with the Ampoi River, at the southern foothills of the Aiud Hills. \n\n==Get in==\n\nGetting to Romania is easy from nearly all parts of the world, due to its position, as well as the fact that it is served by an array of transport types and companies.\n\n{{Schengen-not-implemented}}\n\nCitizens of [[Canada]], [[Japan]] and the [[United States]] are permitted to work in Romania without the need to obtain a visa or any further authorisation for the period of their 90 day visa-free stay. However, this ability to work visa-free does not necessarily extend to other Schengen countries. \n\nIf you do need to obtain a visa from outside your own country, try obtaining it from somewhere else beside Budapest, where it can take 3 to 4 days. From [[Ljubljana]] the process can sometimes be done in a day because they are not so busy.\n\n===By plane===\nRomania has 17 civilian airports, out of which currently 12 are served by scheduled international flights. The main international  airports are:\n\n*[[Bucharest]]'s '''Henri Coanda (Otopeni) Airport''' [http://www.otp-airport.ro/www/index.html?&setLanguage=EN] is the largest and busiest, it has flights to nearly all the major cities in Europe, to a few [[Middle East]]ern capitals, to all other Romanian cities, but no direct flights to the [[USA]]; Since 2012 all traditional carriers and low cost airlines operate flights on this airport.\n* [[Bucharest]]'s '''Aurel Vlaicu (Baneasa) Airport''' [http://www.baneasa-airport.ro/] was used as a major low cost airlines hub until 2012. It is not used as a passenger airport anymore, and all low cost airlines now operate from the Henri Coanda Airport.\n* The '''Traian Vuia International Airport''' [http://aerotim.ro/en/home/index/] in [[Timisoara]] it has flights to several large cities in [[Germany]], [[Italy]], [[Austria]], [[Hungary]], [[Greece]], [[Ukraine]], [[Moldova]], [[France]], [[United Kingdom]] as well as to various cities in Romania. The airport is the base of Carpatair and a focus city for low-cost Wizz Air. Lufthansa and Austrian Airlines are also important operators on the airport.\n* '''[[Cluj-Napoca]] International Airport''' [http://www.airportcluj.ro/], as the largest airport in [[Transylvania]] and the second largest airport in Romania, it is served by a growing number of flights from various European destinations; It is one of the many hubs of low-cost Wizz Air, with services to over 10 destinations daily. Lufthansa also serves the airport.\n**Other smaller international airports are located in:\n* [[Sibiu]] (flights to [[Austria]], [[Germany]], [[Britain]], [[Italy]] and [[Spain]] on Lufthansa, Austrian Airlines and Blue Air). Focus city for Blue Air.\n* [[Bacau]] (flights mainly to [[Italy]] and [[London]] on Blue Air. Secondary hub for Blue Air).\n* [[Constanta]] - In June 2013 Turkish Airlines [http://www.turkishairlines.com/en-tr/] started direct flights between [[Constanta]] and [[Istanbul]] three times a week. A small number of inbound seasonal charters also serve this airport, as well as a (small) number of seasonal domestic flights from Transylvania and Bucharest.\n* [[Suceava]] - Two flights to Italian destinations.\n* [[Iasi]] - Flights to [[Austria]], [[Britain]], [[Italy]], [[Israel]] by Austrian Airlines and TAROM. Domestic flights to Bucharest on TAROM.  Hub for TAROM.\n* [[Targu-Mures]] - flights to [[Hungary]], [[Germany]], [[Britain]], [[Italy]], [[France]], [[Belgium]]  and [[Spain]] on Wizz Air. Domestic flights to Bucharest on TAROM. Focus city for Wizz Air.\n* [[Craiova]] International Airport - flights to many Italian, Spanish and British cities.\n* [[Arad (Romania)|Arad]] - Seasonal flights to one or two Italian destinations. \n* [[Baia Mare]] - Seasonal (and very infrequent) international flights.\n\nThere are three important Romanian airlines:\n# '''TAROM'''[http://www.tarom.ro], the Romanian flag carrier, based in Bucharest Otopeni \n# '''Carpatair'''[http://www.carpatair.ro], based in Timisoara, connects this city with eight Italian and three German destinations, and also has collector/distributor flights to the following Romanian airports: Cluj-Napoca, Bucharest, Constanta, Oradea, Sibiu, Iasi, Suceava, Satu-Mare and Bacau .\n# '''Blue Air'''[http://www.blueairweb.com], the only Romanian low-cost airline, based in Bucharest Baneasa with a secondary hub in Bacau and a focus city in Sibiu.\n\nIn recent times Romania became increasingly attractive for low cost carriers. Blue Air, a Romanian low-fare airline, serves various destinations in Europe from Bucharest (Aurel Vlaicu Airport), Arad, Targu Mures and Bacau. A Hungarian budget airline, Wizzair [http://www.wizzair.com], introduced direct flights from London Luton to Bucharest in January 2007. Several others, including Wind Jet [http://w4.volawindjet.it/], AlpiEagles [http://www.alpieagles.com/], Ryanair [http://www.ryanair.com], GermanWings [http://www.germanwings.com], and AirBerlin [http://www.airberlin.com/]) already operate flights to Romania. Easyjet [http://www.easyjet.com] operates flights from [[London]], [[Milan]] and [[Madrid]], SmartWings [http://www.smartwings.com] operates flights from [[Prague]]. Turkish low-cost carrier Pegasus [http://www.flypgs.com/en/] connects [[Bucharest]] (Otopeni) and [[Istanbul]] (Sabiha Gökçen) five days a week.\n\n===By train===\n\nRomania is relatively well connected with the European rail network. There are daily international trains to [[Vienna]], [[Budapest]], [[Sofia]], [[Istanbul]], [[Chişinău]], [[Kiev]] and [[Moscow]]. But due to the poor quality of rail infrastructure in the region train travel on long distances takes considerable time.\n\nNonetheless, trains are the ideal way of reaching cities in western and central Romania such as [[Brasov]], [[Sighisoara]], [[Oradea]] or [[Cluj-Napoca]] coming from [[Central Europe]].\n\nInternational trains to Romania include EuroCity trains which are of a relatively high standard and night trains. Romania is part of the [[Eurail]] pass offer.\n\nA cheap way of traveling to or from Romania might be the [[Balkan Flexipass]].\n\n===By bus===\n\nEven though Romania has not been traditionally seen as a 'bus country', buses are becoming a more and more popular way to reach the country from abroad, especially from the [[Balkans]] and the former USSR, but also from Western Europe, e.g. Germany and Switzerland. Even though trains are still the most popular way of getting to Romania from Central Europe, due to good service, train services to the Balkans and former USSR are of a considerably poorer quality and are less frequent (mainly because railway infrastructure in these countries is a lot poorer than Romania's infrastructure). For this reason, a slew of private bus operators now provide quicker and arguably more comfortable coach services to and from cities such as [[Chişinău]], [[Kiev]], [[Odessa]], [[Sofia]] and [[Istanbul]]. \n\nA general rule of the thumb on whether you should use bus or train is this: if trains are available just as frequently, and at around the same price, and take around the same amount of time, then definitely use them. Otherwise, consider the buses.\n\nFor all information about buses in Romania and online reservations and tickets (i.e. timetables and prices) you can use www.Autogari.ro [http://www.autogari.ro/] (\"Autogari\" is the romanian word for bus-stations). They accept also payment with credit card.\n\n===By boat===\n\nCruises on Danube are available, very expensive though, starting from [[Passau]] or [[Vienna]] and having a final destination in Danube Delta. These cruises will stop in every major port along the road, in [[Austria]], [[Hungary]], [[Serbia]] and [[Romania]]. There you can travel by rapid boats, fisherman's boats on endless channels to watch huge colonies of pelicans, cranes or small migratory birds. You can enjoy a local dish, fishermen's borsch, prepared using different species of fish, but take care, they use the Danube's river water!\nIt is the only way to travel around the Danube Delta, and the only way to get to the city of Sulina.\n\nThere are ferries across the Danube to/from Bulgaria in several ports: from [[Calafat]] to [[Vidin]] (runs about ten times per day, depending on the volume of traffic), from [[Bechet]] to [[Oryahovo]] (daily) and from [[Zimnicea]] to [[Svishtov]] (only on weekends).\n\nThere are reportedly (but not confirmed) ferry connections over the Black Sea from [[Varna]] in Bulgaria to [[Constanţa]]. The ferry service between [[Odessa]] and [[Constanţa]] is no longer operating at this time. \n\n===By car===\n\nYou can easily drive into Romania coming from countries in the West, but when coming from the East you will have to drive through Moldova and you may experience dificulties there. There is not a direct border crossing between Ukraine and Romania in the south-eastern corner of Romanian Moldavia ([[Reni]]/[[Galati]]), so you must travel via Giurgiulesti, which is in Moldova (a small stretch of about 500 meters). Moldovan border control officers will ask several times for money (ecological tax, road tax ... up to 20 € in July 2007). Coming from the north (Ukraine), can also be time-consuming, times can vary from 1 to more than 5 hours.\n\nAlso be aware if you plan to drive to Romania, the road infrastructure is fairly modest compared to Western and Central Europe.\nThe upside to this is that most European roads which you will mostly be travelling on are well maintained and are denominated with an E followed by a number (e.g. E63), are scenic and cross some spectacular scenery of mountains, valleys and forests. The roads especially in Transylvania are built on top of the old medieval routes and there is always something to stop and visit on your way.\nTake particular care on the roads linking Romania to its western borders, as traffic is heavy and most roads have one or two lanes each way, and for the most part are unlit.\n\nThe situation with motorways is becoming better and better. Nowadays, Romania has 750 kilometers of motorway and it`s working to extend it`s current network. With a maximum speed of 130 km/h, motorways in Romania are the fastest and safest way to travel. You can access Bucharest via 3 motorways coming from different corners of the country. Also, traveling from Hungarian border (Nadlac) to Bucharest can be achieved via motorway in proportion of approximately 70%.The rest of 30% you will need to drive on narrow E roads. Traveling from Bucharest to Constanta via motorway can be achieved 100%.\n\nIf you travel from Bulgaria, prepare for bridge and ferry tolls when crossing Danube (check prices at [https://www.tolls.eu/bulgaria]).\n\n==Get around==\n\nGetting around Romania is relatively hard and inefficient for the great distances that have to be covered in this country (this is after all, the second-largest country in Central Europe, after [[Poland]]). The transport infrastructure has been improving quite significantly recently, even though roads remain a weak point. There are several highways under construction, but as of yet none are fully operational. Train travel, however, has improved dramatically. Several upgrade projects are under way for several railway tracks and that makes rail traffic on those lines a bit slow for the time being.\n\n===By train===\nRomania has a very dense rail network that reaches practically every town and a sizable number of villages. Although some modernization is taking place this network isn't in a very good condition , with low speeds and limited train frequency on many routes. Nonetheless trains remain the best option for long distance travel. \n[[Image:New doubledecker train in Romania.jpg|thumb|right|A modern double decker train in [[Cluj]] station.]]\n\nMost trains are run by the state carrier, Căile Ferate Române, abbreviated as '''(SN)CFR''' [http://www.cfrcalatori.ro]. Many secondary lines are operated exclusively by private companies: '''Regiotrans''' [http://www.regiotrans.ro/], '''Regional''' [http://www.viaterraspedition.ro/en/regional/regional.php], '''Transferoviar''' [http://www.transferoviar.ro/transport.php] and '''Servtrans''' [http://www.servtrans-invest.com/index_en.php].\n\nTrains generally run without major delays, except on lines were there are repair works or during anomalous weather (heavy snow storms in winter, heat waves in summer).\n\n====Train types====\nThree major types of trains are available: ''Regio'', ''InterRegio'' and ''Intercity''. The last two types provide reasonable conditions, but ''Regio'' trains are best avoided.\n\n*'''Regio''' ('''R''')\nThese are very slow trains, stopping at absolutely every station (including some in the middle of nowhere). Prices are dirt cheap, but they provide extremely basic service and are sometimes uncomfortable (no seat reservation, no ventilation to speak of, sometimes crowded, no working toilets in some trains, poor lighting).\n\nThey usually have 1970s single-suburban or double-decker cars, with 4 seats per row. Most will not offer 1st class (but if they do it's highly recommended to get a 1st class ticket, it will be less crowded and miserable than 2nd class). \n\nWestern Desiro and French Z-type DMUs have been introduced on some routes, including Suceava-Cacica, Craiova-Sibiu, Sibiu-Braşov, Cluj-Teiuş-Braşov, Cluj-[[Bistriţa|Bistriţa]], Braşov-[[Sfântu_Gheorghe|Sfântu Gheorghe (Covasna)]]. Z-type cars provide a more comfortable seating arrangement but a bouncier ride, which is diametrically opposed to Desiro's improvement. As these newer trains are designed for short-distance travel expect to be uncomfortable if traveling for a long period of time.\n\nMost of the trains operated by private companies are also ranked as Regio. They are usually cleaner than CFR Regio trains, but rarely run on the same routes.\n\nExample: '' Bucharest-Braşov (166 km) by Regio train costs ~23 lei in 2nd class, takes approx. 4 hours, has up to 31 stops'' \n\n*'''InterRegio''' ('''IR''')\nSemi-slow trains traveling on medium and long distance routes, stopping just in towns. They are cheap (though nearly twice as expensive as Regio) and offer variable conditions. \n\nNewly-renovated cars have been introduced on several routes including Bucuresti- [[Târgu Jiu]] and Bucharest-Brasov. However, many consider these cars as uncomfortable, if not more so, than older cars, with just an improved visual element. There is little baggage room and little leg-room compared to 1980's carriages.\n[[Image:Refurbished_train_Romania.jpg|thumb|right|A refurbished 2nd class train coach.]]\n\nSome InterRegio trains have connection cars to destinations located on secondary lines; after they separate from the InterRegio train they run as '''RegioExpress''' ('''RE''').\n\nEx.:''Bucharest-Braşov (166 km), 47 lei in 2nd class, approx. 2 hours 45 minutes, up to 8 stops''\n\n*'''Intercity''' ('''IC''')\nThe best of CFR's network. They are nearly as comfortable as Western European trains, while remaining cheap by Western standards. All IC trains offer air conditioning, individual reading lights, dining cars, and some will offer power plugs (both in first and second class). WiFi is provided in some dining cars and in business class (where available). They're slightly faster than InterRegio and very clean most of the time. \n\nSome Intercity trains also have '''Business Class''' (Standard and Exclusive) cars, roomier than regular 1st class. '''Standard''' has plush armchairs while Exclusive has leather armchairs and built-in LCD screens for each seat; both have WiFi.\n\nTravelers with large backpacks should note that baggage storage racks on intercity trains are small, hence they are likely to find Intercity trains less convenient than InterRegio. However, experiences seem to vary depending on the particular train, as in some trains this is true only for non-compartmented cars, so it might be worth trying to get a seat in a compartment.\nIf presented with a choice of Intercity trains (classic cars or \"Săgeata Albastră\" - Blue Arrow DMUs) it is advisable to choose classic cars, as these are faster, more comfortable trains. Săgeata Albastră are small 3-car diesel trains with slower service (120 km/h top speed in regards to 160km/h).\n\nEx:''Bucharest-Braşov (166 km), 58 lei in 2nd class, approx 2 hours 30 minutes, three stops''\n\n*'''Night trains'''\nMost InterRegio trains traveling by night also have couchettes cars (with six or four beds) and sleeping cars (with three, two or one bed). Conditions are relatively good.\n\nEx.: ''Bucharest-Satu Mare (782 km), ~142 lei/bed (six beds couchette), 14 hours''\n\n====Getting tickets====\nTickets for CFR operated trains are sold at train stations and CFR booking agencies (''agentie de voiaj CFR''), which exist in any sizable town (usually located in the central area). At these booking agencies and at a few major stations it's possible to buy tickets up to six months in advance for any domestic route and for international trains passing through Romania.\nIt's also possible to get tickets for domestic routes online through CFR's relatively complicated booking site [https://bilete.cfrcalatori.ro/vanzare/loginuser.aspx] with up to one month in advance.\nAll trains types except Regio and RegioExpress require seat reservation (not to be confused with advanced ticket booking).\nSeveral discounts are available:\n*for small groups (10% for 2 people, 15% for 3, 20% for 4 and 25% for 5);\n*for large groups (25% for groups of more than 30 people)\n*for buying return tickets (10%).\n*for advance ticket purchase (13% for over 21 days in advance, 10% for 11-20 days in advance, 5% for 6-10 days);\n\nPeople that board CFR trains without a ticket from stations where there are ticket sellers can (theoretically) get fined and have to buy more expensive tickets directly from the train staff.\n\nOn lines operated by private operators tickets are usually issued on the train.\n\nFor up-to-date timetable information on CFR operated lines see CFR's timetable site [http://infofer.ro/].  For timetables on lines operated by other companies check [http://mersul-trenurilor-sectii-secundare.uv.ro/].\n\nA complete price list by distance and train type is available online[http://www.cfrcalatori.ro/language/2/244]. \n\n\n====Tourist railways====\nSeveral scenic narrow gauge railways exist in mountainous areas, but trips on them are mainly available for small groups and not for individual tourists. One notable exception is the Valea Vaserului railway [http://www.cffviseu.ro/en/index.html] in Maramureş which has tourist runs daily in mid-summer and on weekends in early summer-autumn.\n\n\nGroups can also rent the former Romanian king's personal train or Ceauşescu's private train but these trips are rather expensive.\n\n===By car===\nTraveling by car or coach is the easiest way and a vast majority, over 60 percent of foreign tourists use this way of transportation. The steering wheel is on the left and European driver's licenses are recognized by police. For Americans, a passport and valid US driver's license are sufficient for car rental.\n\nIf you drive your own car, '''a highway vignette''' (called \"Rovinieta\") '''is mandatory not only at motorways but at all national roads too'''. You can purchase it either online (at [https://www.roviniete.ro/en]) or at the border or the nearest gas station. You don't have to stick anything, the vignette is checked automatically through a camera system. It costs €3 for 7 days. Driving without one will incur a severe fine.\n\nRentals can be expensive; avoid the major international rental companies, as well as the \"friendly\" locals who are willing to rent you their own car. In Bucharest and throughout the country rentals start at €20 - €30 per day (without fuel) for a small hatchback, go around 65 - €90 for an average car or lame SUV and may go up to €170 - €200  for a luxury sedan or a luxury SUV. You may be denied renting unless you are 25 or older. Now there are plenty of local car rental companies that have cheap prices.\nSome even offer free delivery to the airport. \n\nWhile Romanians are generally friendly and polite, this doesn't always apply to their driving style. Speeding is common, young (inexperienced) drivers driving performance vehicles are common in cities,  angry drivers are the norm in the capital and the accident rates are amongst the highest in the European Union.\nCity roads tend to be heavily overcrowded, particularly in Bucharest. Beware of hazards, such as double-parked cars, pedestrians, sudden braking to avoid a pothole, or stray animals entering the road(in rural areas) Most intercity routes are 2 lane roads, used by everything from communist era trucks to modern sportscars. So plan for longer driving times than in other areas of Europe. \n\nBucharest has a very dense and crowded city center, with narrow, twisting roads, built mainly in the 19th century, with little traffic in mind. The roads are suffocated by over 1 million cars every day - it is possible to take 2 hours to drive a distance that could be walked in 20-25 minutes. GPS or local guide is a necessity. The best way to travel within Bucharest either by public transit (as it is very cheap and fairly reliable) or taxi.\n\nIf you have a good car and you also like speeding be aware that Romanian police now have high-tech radars to catch speeding motorists. Speed limits are generally 100 km/h outside of a city and 50 km/h or 70 km/h within  built up areas.  Some police units are equipped with performance vehicles, while others are the standard Dacia Logan cars.  Although rare, some highway patrols have BMW bikes.  On major roads, motorists in the opposite direction will sometimes flash their headlights to warn they recently passed a radar trap which may be just ahead of you.  Also, many national roads and  motorways are discreetly watched by Police Puma ( Romanian Helicopters) helicopters. Since December 2006, even small offenses are subject to heavy fines by the traffic police (Poliţia Rutieră).  They may even take one's driver's license for irregular passing. Both hidden and visible speed cameras are becoming common on major roads and highways. Policemen sometimes seem to be more lenient with locals, than with foreigners - however, stricter fining applies for locals than for foreigners (for locals, as few as two or three minor offenses will get their license suspended for six months). Bribing is ill-advised as most patrol cars have recording equipment and as of 2008, bribing is less and less accepted, so for a foreigner it is not recommended to attempt this get-away technique - it can easily land you in jail. \n\nThe Romanian police have a zero tolerance policy on drunk driving - controls are very frequent - and basically any amount of alcohol in your blood counts as drunk driving. \nIf you are involved in a car accident while driving and someone is hurt '''you must stop and wait for the traffic police'''. Driving away from the scene is considered hit-and-run. Accidents with no injuries can be solved between yourself and the parties involved, without having to go to a police station and make a statement, but, if in doubt, better phone 112 (Emergency Services) and ask for directions.\n\nIn most of the cases, after an accident it is mandatory to take a blood test to establish if the drivers had consumed alcohol. Refusal to undergo this test is almost certainly to land you in jail - the punishment is usually more harsh than the one for drunk driving.\n\nMany important roads were once medieval trade routes which go straight through the center of many villages. Passing while driving is the norm rather than the exception as slow moving trucks, horse drawn carts, and non-moving herds of cows often frequent village main streets .\n\n====Types of roads====\n\n'''Motorways''' (''autostrada'')\n\n*'''A1''' - planned to connect Bucharest with cities in southern Transylvania such as Pitesti, Sibiu, Deva, Lugoj, Timisoara and Arad, then proceed to the western border. 60% of it has been completed, namely Bucharest-Pitesti (opened 1977), Sibiu-Deva (Opened 2012-2014) and Nadlac (Hungary Border)-Margina. This motorway is the top priority of CNADNR (the highway company).\n*'''A2''' - Links Bucharest with the Black Sea port of Constanta; this road is open for the full length and the first fully completed highway in Romania.\n*'''A3''' - is supposed to cross Transylvania diagonally from west to east and then head south to Bucharest. The Bors - Brasov segment, also called the '''Transylvania Motorway''' [http://www.autostradatransilvania.ro/www/index.html?&setLanguage=EN], is currently the largest road project in Europe; it will connect the Hungarian / Romanian border with Oradea, Zalau, Cluj-Napoca, Targu Mures, Sighisoara and Brasov. The project was under construction until the contractor, Bechtel, went bankrupt. The works lie unfinished until a new contract is signed. Bucharest-Braşov is also under construction, and the first segment (Bucharest - Ploiești) was completed in late 2012. The Cluj-Napoca - Turda leg opened in December 2009, and in 2010 it was extended to Câmpia Turzii. Its only utility now is as bypass for Cluj and Turda for motorists going from Oradea to Braşov. The temporary Turda interchange is a bit difficult to use.\n*'''A4''' - acts as Constanta's by-pass and the second fully-completed motorway in Romania. There are plans to extend it to south south to the Bulgarian border, but not much has happened so far. It was opened in stages in 2012. \n*'''A6''' - intended to connect Lugoj to the Serbian border at Calafat, but so far only the Lugoj by-pass has been completed. \nThe speed limit on motorways is '''130 km/h'''.\n\n*'''Expressways''' (''drum expres'') - Basically lower-grade motorways, with missing features such as the hard shoulder and a less-secure median. No expressways have been built to date, but a few have been planned, such as Targu Mures - Iasi and Bucharest - Craiova. The speed limit will be '''120 km/h'''.\n\n*'''National roads''' (''drum national''). In the absence of motorways the national roads remain the most important element of the Romanian road system, as they connect the main cities in the country. Thanks to recent investments most of them are in reasonable condition - most of the trunk network being rehabilitated recently. Many have 4 non-separate lanes near cities, some have 3 or 4 non-separate lanes throughout (such as Bucharest-Comarnic and a large part of E85) but many have only two lanes - one per traffic direction (a notable example is DN1 Câmpina-Braşov - the 100 km mountain stretch can take 3-5 hours to cross during weekends and holidays. The speed limit on national roads is '''100 km/h'''.\n\n*'''Other roads''' - county (''drum judetean'') and rural (''drum comunal'') roads are owned and maintained by either regional or local authorities. These roads mainly link trunk roads with very small towns or villages - few running for more than 30-40 km. The situation of county roads is highly dependent on each of the counties involved - while in Ilfov or Constanta, these roads are of decent-to-high quality, in other regions such roads are in a poor to very poor condition compared with national roads. Rural roads are of even shorter nature (under 10 km), some of them being one lane of traffic only, others being covered in gravel only. The speed limit on these roads is '''90 km/h'''.\n\nNote that for ALL roads, when in a city, town or village, the speed limit is 50 km/h (unless clearly otherwise posted). As such, driving a National Road becomes a constant accelerate-and-brake adventure, one having to be constantly spotting speed limit signs, city limit markers andthe behavior of other drivers.\nThe use of radar-detection systems is allowed but unless you are experienced their usage and police strategy they will not help you much.\n\n===By bus===\n\nBus can be the least expensive method to travel between towns.  In the Romanian towns and cities, you can usually find one or several bus terminals (''autogara''). From there, buses and minibuses depart for the the towns and villages in the nearby area as well as to other cities in the country. You can find timetables on autogari website [http://www.autogari.ro/?&lang=uk].\n\nMinibuses are usually very uncomfortable; some buses are old and slow. Schedules are not tightly followed, and delays of over an hour are not uncommon, especially for inter-city buses. Romanian roads are in a rather bad shape, with most of the trunk network being made of one lane per way roads (fairly similar with British rural roads), and only about 250 km of expressway. Most minibuses employed are small, crowded, 14-seat vans (some converted from freight vans), with some longer routes employing 20-seat mini-buses. For commuter and suburban routes, expect an overcrowded van (25 passengers riding a 14 seat van is quite common, with 40 passenger loads not being unheard of), with no air-conditioning, which stops several times in every village. Inter-city bus travel is only slightly better - most vehicles used are also converted vans, or, at best purpose-build minibuses, with only some being air-conditioned. Seating is generally crowded, and in most cases, there is no separate compartment for luggage. Most have no toilets on-board, calling for 30 minutes stops every 2-3h. All in all, the experience of traveling by minibus is quite similar to that of traveling in a Russian or Ukrainian marshrutka.\n\nHowever, buses are the best solution for a number of routes badly served by the railway network, namely Bucharest - Piteşti - Râmnicu Vâlcea, Bucharest - Alexandria, Bucharest - Giurgiu and Piteşti - Slatina.\n\nThe comfort of vehicles is steadily improving, at least in Transylvania along the longer routes serving larger cities. You will find buses from respected companies (such as Normandia, FANY [http://www.fany.ro/] or Dacos [http://www.dacos.com.ro/]) which offer punctual and reasonable, though not always sparkling, conditions, and on which a luggage compartment will always be available. Toilet stops still need to be made, but they happen usually in places where you can also buy food or drinks. Be aware though that on Fridays, Sundays, and close to national holidays such buses tend to be overcrowded, so a reservation by phone might be necessary.\n\nBuses inside the cities are often crowded. This gives pickpockets good opportunities. The pickpocket problem seems to be not essentially worse than in any other European city. Please, pay attention.\n\n===By taxi===\n\nTaxis are relatively inexpensive in Romania. It costs about €40-Cent (1.4 - 2 leu/RON) per km or slightly more, with the same price for starting. The very low prices make taxis a popular way to travel with both locals and travelers (it can be cheaper than driving your own car) - so during rush hours it may be hard to find a cab (despite Bucharest having almost 10000 cabs).\n\nA notable exception is the Fly Taxi company that operates from the Henri Coanda (Otopeni) Airport. The price for a ride from the airport to the city center can be about €18 (70RON). Either call a taxi by phone to pick you up near the airport or chose the 783 bus line to get into the city.  Alternately, you can go to the departure terminal to avoid expensive airport taxis.  To do this, after you exit baggage claim, immediately turn right.  Literally dozens of taxi operators will approach you and ask if you need a taxi, having marked you as a foreigner (it's their job to do so, after all).  Be polite, shake your head no and keep walking.  You will pass though about 200 meters of shopping and service areas in a little mini-mall connecting the two terminals, and will then arrive at level two of the departures terminal.  Walk out the door and you will see plenty of taxis dropping off passengers.  Flag one down and make sure the fare posted on the side is less than 2 RON/km.  Technically, they are not supposed to pick up there, but you aren't doing anything wrong by trying, and not many drivers can say no to 30 RON for a trip back to the city center that they were going to make anyway.  Just make sure they use the meter. Beware that recently some mal intended taxi drivers have begun using remote controls in their pockets that raise the tariff price suddenly by small increments that are otherwise unnoticable until the end of the fare. It's easier to negotiate the tariff price upfront based on your destination and pay that amount at the end.\n\nBe careful to look at the cost posted on the outside of the taxi, and then to look at the meter to see that you are being charged the same fare.  Be especially careful in Bucharest, where some taxis post 7.4 instead of 1.4, but the 7 looks very like a 1.  Ask if you're not certain - they are obliged to post and clearly state the tariff out front. All taxis MUST have a license - a large, oval metal sign bolted on the sides of the car, featuring the city markings, and a serial number inscribed, usually using large numbers. Do not use any taxi without those markings. Also, do not use a taxi with a license from another city (for example, never use a Ilfov taxi in Bucharest or a Turda taxi in Cluj-Napoca).\n\nThe driver may try to cheat you if he sees you are a foreigner. Insist that he will use the meter, or have a Romanian guide with you. Don't negotiate the ride fee in advance, as it may be 2-4 times higher (even more) than the real fee (even if it would seem cheap to you). Check whether it is going in the right direction, follow the way on a map (if you have any!). Do NOT take cabs from the cab stand in railway stations, unless they are from a reputable company and DO NOT take any of the services of those offering you a cab ride in the train station. They may end up being amazingly expensive (up to 50 € for a cab ride that would normally be around 3 €). If you need a taxi from the train station (or airport), order it by phone from a reputable company (see the city pages for the cities you want to visit) - most dispatchers speak some English as do many taxi drivers.\n\n===By plane===\n\nAir travel as a means for domestic transport is becoming more and more popular as increased competition resulted in lower prices (sometimes less than the cheapest train or bus ticket). This, coupled with an improved airport infrastructure leads to increases in the number of passengers compared to past decades.\n\nThree airlines offer domestic flights in Romania currently - Tarom ([http://www.tarom.ro]), with a hub in Bucharest, Carpatair ([http://www.carpatair.ro]), with a hub in Timisoara and \"no-frills\" Blue Air ([http://www.blueairweb.com]) with its domestic hub in Bucharest.\n\nCurrently (2010), Bucharest and Timisoara are linked by up to 12 daily frequencies (operated by Blue Air, Carpatair and Tarom - Tarom operates some of the flights on the routes with A310 wide-bodies), Bucharest and Cluj by up to 10 daily frequencies (operated by Tarom and Blue Air), Bucharest and Iasi by up to 4 daily frequencies (operated by Tarom), Bucharest and Oradea, Bucharest and Sibiu and Bucuresti and Satu Mare by 2-3 daily frequencies (operated by Tarom), Bucharest and Suceava and Bucharest and Baia Mare by 1 daily frequency (operated by Tarom). Bucharest and Arad are also connected through a daily frequency (by Blue Air). Constanta and Bacau, owing to the short distance from Bucharest, only see flights a couple of times weekly. Note that frequencies on Saturdays may be reduced, especially to smaller cities.\nTimisoara is also directly connected to most Romanian cities - non-stop daily (except Sunday) flights exist, besides Bucharest, to Cluj, Iasi, Sibiu, Bacau and Craiova operated by Carpatair. Flights to Constanta from Timisoara operate 4 times weekly (also operated by Carpatair).\n\nPrices can begin from as low as 40 RON (around €10) one way if booked in advance with either Blue Air and Carpatair, or through a Tarom 'Superspecial' fare. Even 2-3 days before the flight, it is not uncommon to find tickets for under €35-€50 with a little shopping around. Note that while Tarom and Carpatair self-style themselves as full-fare full-frill airlines, Blue Air considers itself a low fare carrier, and subsequently, has followed the model of not allowing price aggregation through reservation systems (a la Ryanair, Easyjet or Southwest), and as such, tickets for their flights will not be available through booking engines such as Orbitz or Kayak, but only directly through their website. \n\nSome airports may be fairly distant from city centers, and, while some larger ones have adequate public transport (Bucharest, Cluj, Timisoara, Oradea), in some (such as Craiova or Iasi) you have to rely on taxis. Even so, a taxi fare from any airport downtown should not cost more than 5-10 Euros outside of Bucharest.\n\n===Hitchhike===\nHitchhiking is very common in Romania, and some experienced hitchhikers say it's the easiest country in eastern Europe. Usually, if you are in the right spot, you don't have to wait longer than 5 minutes. During weekends you may need a bit more patience, as roads are a little emptier. Locals also use this method on a regular basis, especially for shorter distances (up to 50km). It is not uncommon for people (especially students) to hitchhike intercity (Bucharest-Sibiu, Timisoara-Arad and Bucharest-Ploiesti are particularity common hitchhiking destinations). Increase your chance to be picked up by using a paper with the city where you want to get to - it may save you some time especially if traveling intercity. A good spot is a bus station, road-split, or close to the city limits (see [[Hitchhiking Spots Romania]]). Nevertheless, many if not most people will stop (provided they drive alone) - you may end up getting a ride in a 1970s rusty old Dacia or in a brand new Mercedes, in a semi-articulated truck or in a company car belonging to a big corporation. Hitchhiking is typically not dangerous (the highly aggressive, fast and disorderly driving style of Romanians may be more of a danger), but take usual precautions when using this conveyance. Inside city limits, it is not advisable to hitchhike using the traditional thumb-up hand signal, as many drivers may believe you are flagging a taxi or a route-taxi (mini-bus), and not stop. Use a destination paper instead.\nIt is customary to leave some money for the ride (so called 'gas money', about 1-2 RON/10km), but if you are a foreigner you will not be expected to leave money and nobody will get upset. Further, most truck drivers and company car drivers will refuse payment altogether. Further, if you tell the driver where you want to get in a city, he or she will make a detour just to drop you off where it best suits you. Say \"Mulţumesc\"(|Mooltsoomesck|) (thank you) at the end. See [[Hitchhiking Spots Romania]].\nNote that most Romanians are very talkative, and even if their English / French / German / whatever is extremely rusty, many will more likely than not tell you their entire life story, discuss the entire football season and/or talk politics (usually starting from discussing the poor state of roads even while on a freshly repaired road). In the end, however, hitchhiking is a mostly enjoyable experience, and, if lucky, you may even get yourself invited for lunch or dinner, offered a room for a night, or just meet some very interesting people along the way.\n\n==Talk==\n\nThe official language of Romania is [[Romanian phrasebook|Romanian]], ''limba română'', which is a Romance language. It was formalized in the late 19th and early 20th centuries, with a significant input from French.\n\nAromanian is the closest living relative (and only other member of the Italo-Eastern subdivision of Italic languages) to Romanian. Aromanian is a minority language spoken in [[Macedonia]], [[Greece]] and parts of Romania. In contrast to Romanian's heavy Slavic, German and Hungarian influences, Aromanian takes many words from Greek. Some 10% of the Romanian vocabulary is of Slavonic origin and less than 5% is from Turkish, Hungarian or German. Minority languages spoken in Romania are Hungarian, German, Turkish, Tatar and Romany (the language of the Roma, or Gypsies), albeit most of these words have fallen out of use for a long time. Russian and Ukrainian can be heard in the Danube Delta as well. French used to be the second well-known language in Romania, since it used to be compulsory in every school; however, it has been mostly replaced by English. A well-educated Romanian who graduated from an average university can usually speak English fairly well, and have basic knowledge of another European language, such as French, German, Italian, Spanish (about 8%) or Russian. If you leave the common touristic routes, Romanian is the only way to ask for information. That won't be such a problem; learn some basic words and ask them to write the answers. \n\nIn [[Transylvania]] there is a large Hungarian minority (6.5% of the population according to the 2011 census), people speak Hungarian in their daily life. Counties where Hungarian is widely spoken includes [[Harghita]], [[Covasna County|Covasna]], [[Mures]]. In certain parts of [[Cluj]], [[Bihor]], [[Satu Mare County|Satu Mare]], [[Brasov County|Brasov]], [[Sibiu County|Sibiu]] and other Transylvanian counties there are villages or towns with a notable number of Hungarian speakers. \n\nAlthough some might speak Russian due to Romania's past as a part of the Eastern Bloc, you should not count on it. About 7% of Romanians understand Russian but only about 4% are fluent in it. The chance of one doing so is very small, as the Ceauşescu administration and subsequent leaders made learning the language optional, rather than compulsory; and other languages (especially French, Italian or other Romance languages) took the place of Russian in schools.\n\nMost educated Romanians may be able to make some sense of other spoken Romance languages, such as French, Spanish, Portuguese and Italian. Other Romanians may understand some Spanish and Italian because of popular TV soap operas from Italy and Latin America.\n\nIf you want to find out some common phrases/words in Romanian, see the [[Romanian phrasebook]].\n\n==See==\n\nPeles Castle [http://visit.peles.ro/]\n\nBran Castle [http://www.bran-castle.com/]\n\nAlba Carolina Citadel in Alba Iulia [http://turism.apulum.ro/]\n\nCity of Sibiu [http://romaniatourism.com/sibiu.html]\n\nCity of Iasi [http://iasi.travel]\n\nPainted Monasteries of Bucovina [http://romaniatourism.com/painted-monasteries.html]\n\nRasnov Fortress [http://www.tripadvisor.com/Attraction_Review-g946544-d1750642-Reviews-Rasnov_Castle-Rasnov_Brasov_County_Central_Romania_Transylvania.html]\n\nThe Danube Delta [http://whc.unesco.org/en/list/588]\n\nThe Casino in Constanţa, an amazing piece of Art Nouveau Architecture [http://www.nomadtravellers.com/content-menu-hidden/77-travel/108-casino-constanta-an-unfinished-story]\n\nThe salt mine in Turda [http://salinaturda.eu/?lang=en]\n\nPalace of Parliament in Bucharest\n\nMerry Cementery in Maramures County [http://romaniatourism.com/press-the-merry-cemetery.html]\n\nEpic roads: \n- Transfagarasan (DN7C)[http://en.wikipedia.org/wiki/Transf%C4%83g%C4%83r%C4%83%C8%99an]\n- Transalpina (DN67C)[http://en.wikipedia.org/wiki/Transalpina_(DN67C)] \n\nBeautyful Cities: \n- Iasi\n- Brasov \n- Sibiu\n- Sighisoara \n- Oradea\n- Timisoara \n- Cluj-Napoca\n- Bucharest ( the old city center )\n\n===Itineraries===\nThe following are some possible itineraries for traveling Romania :\n\n*[[Transylvania Triangle Train Tour]]\n\n==Do==\n*'''Go to church'''\nRomania is one of the most religious countries in Europe, and the Orthodox church is omnipresent. You will certainly want to visit some churches and monasteries for their beauty and history, but why not take the chance to experience an Orthodox mass? The congregation is usually standing and it is perfectly normal to show up only briefly during the mass so you can come and go at your leisure without disturbing anyone. Show up at any church on Sunday morning, stand quietly in the back and observe. Be suitably dressed, see the section \"Respect\". Please note that while mass is open to all and visitors are most certainly welcomed, communion (the Eucharist) is normally reserved to those baptized Orthodox (regardless of the denomination). Most often the priest will ask those that are visiting if he or she has been baptized Orthodox before administering the Eucharist.\n\nYou will experience bible readings, prayers and other rituals accompanied by a short sermon explaining the text. You are not likely to understand much, but you can notice the varying levels of involvement among church-goers, visible in how long and where people stay at the mass, and how often they sign themselves with the cross, or even genuflect. Organized congregation singing is not common but is conducted by a choir with each church-goer joining when he feels like. The choir singing can be captivating, the quality usually reflects the importance of the church.\n\nThe altar has sections with doors that open and close depending on the church season. You will also see candles sold, they are lit in or by the church in separate trays for the souls of either dead or living people. Try to find out about special holidays and rituals, perhaps the distribution of holy water by the truckload at the baptism of Christ (Boboteaza) or midnight masses at Christmas or Easter (the Orthodox Easter may be off by one week compared to the Western). Weddings are often held on Saturdays, the ritual is very colorful and interesting.\n\n==Buy==\n\n=== Currency ===\nThe national currency of Romania is the ''leu'' (plural ''lei''), which, literally translated, also means ''lion'' in Romanian.  The leu is divided into 100 ''bani'' (singular ''ban'').  On July 1st 2005, the '''new leu''' (code '''RON''') replaced the old leu (code '''ROL''') at a rate of 10000 old lei for one new leu.  As of the beginning of 2007, old ROL banknotes and coins are no longer legal tender but can still be exchanged at the National Bank and their affiliated offices.\n\nCoins are issued in 1 (gold), 5 (copper), 10 (silver), and 50 (gold) bani denominations, but 1 ban coins are rare. Banknotes come in denominations of 1 (green), 5 (purple), 10 (red), 50 (yellow), 100 (blue), 200 (brown), and 500 (blue and purple) lei denominations, are made of polymer plastic, and, except for the 200 lei, correspond to a euro banknote in size. However, 200 and 500 lei banknotes are not common. \n\nRomania is relatively cheap by Western standards. As of 13 May 2016, 1 US dollar buys about 3.96 lei and €1 buys about 4.49 lei. With this, you can buy more in Romania than you can in [[Europe|Western Europe]] and [[North America]], especially local products. However, be advised that although you can expect food and transport to be inexpensive in Romania, buying import products such as a French perfume, an American brand of trainers or a Japanese computer is as expensive as in other parts of the EU. Clothing, wool suits produced in Romania, shirts, cotton socks, white and red wine bottles, chocolates, salami, a wide range of local cheese, inexpensive leather jackets or expensive and fancy fur coats are possible good buys for foreigners.\n\nWhen exchanging money, it is extremely advisable to use exchange bureaus or to use cash machines (which will provide ready access to most foreign bank accounts). Avoid black market transactions with strangers at all costs: in the best case scenario, you might come out ahead by a few percentage points, but that rarely happens. Most apparent black marketeers are actually conmen of one sort or another, who will either leave you with a bankroll that turns out to be full of worthless Polish zlotys or will simply engage you in conversation for a few minutes, awaiting the arrival of their partners who will pretend to be the police and try to con you into handing over your wallet and papers. (This con game is known as a ''maradonist''.). Exchanging money in the street is also illegal and in the worst case scenario, you might spend a night in jail as well. It is not recommended to exchange money in the airport either - they tend to overcharge on transactions and have very disadvantageous rates - you should use a card and the ATM machine for immediate needs (taxi/bus) and exchange money whilst in the city.\n\nYou should shop around a bit for good exchange rates. Some exchange offices in obvious places (such as the airport) may try to take advantage of the average tourist's lack of information when setting the exchange rate, and it is not advisable to use e.g. airport exchange offices, as the exchange rates may well be quite unrealistic. Prior to travelling to Romania, consult the Bank of Romania [http://www.bnro.ro/] for a rough estimate of what exchange rates you should expect. Typical exchange offices should not list differences larger than 2-3% from the official exchange rate. Also, when picking an exchange office, make sure it has a visible sign saying \"COMMISSION 0%\"; Romanian exchange offices typically don't charge an extra commission apart from the difference between the buy and sell rates, and they are also required by law to display a large visible sign stating their commission, so if you don't see such a sign or if they charge something extra, keep going. Choosing a reasonable exchange office, which is not hard to do with the data in this paragraph, can save you as much as 10%, so this is worth observing. Changing money at a bank's exchange office is also a good idea.\n\n=== Transactions ===\n\nRomanian transactions generally take place in cash.  Although some places will accept Euro or USD you will generally be charged an additional 20% paying by this method and it is not advisable, although this is changing. The best method is to pay using local currency - lei (RON).  Most Romanians have either a charge card or a credit card - however, they are generally used at ATMs - on-line payments are still somewhat new, and many companies and people still look at them with suspicion - so much so, that even on-line shops will make you pay on delivery. You can however pay by card in many shops and in most supermarkets. Accepted credit/debit cards are: Mastercard, Visa , American Express (in some places - although this is rapidly expanding because of a very aggressive campaign by American Express) and Diners Club (usually only in hotels, and even then expect stares and incredulity that such a card even exists). Almost all transactions at POS machines (supermarkets, shops etc.) will ask you to enter your PIN code as well.\n\nAlso please note that wherever Visa/Mastercard cards are accepted you can also use V-Pay, but the cashiers generally do not know this. This means that most European issued cards are valid for payment. It is very usual to be asked both for the PIN and the signature on the slip.\n\nMost small towns have at least one or two ATMs and a bank office, with large cities having hundreds of ATMs and bank offices. (It is not uncommon to see three bank agencies one next to another in residential neighborhoods of Bucharest). ATMs are also available in many villages (at the post-office or the local bank-office). Romanian for ATM is ''bancomat''. Credit cards are accepted in large cities, in most hotels, restaurants, hypermarkets, malls. Do not expect to use a credit card at any railway station or at the subway (the subway and RATB of Bucharest and also the Bucharest railway station accept credit cards, the subway also pay-pass/paybyphone, and RATB has a one day travel option that can be paid by SMS).  Gas stations and a great number of other stores accept Visa and Mastercard. It is advisable to always have a small sum of money in cash (about 50 RON or even more), even in large cities.\n\nRomanian businesses are not mandated to provide you with full change for every transaction, and frequently their tills are short of coins in particular. Fortunately many prices are in round multiples of 1 RON, and they are almost always in multiples of 10 bani. Even if a store can change, say a 100 RON note, they will ask you for smaller change first. For very small amounts (say 20 or 50 bani) they will sometimes insist on you buying something of that worth instead of giving you change.\n\n=== Prices ===\n\nDon't expect Romania to be a cheap travel destination!\nInflation has struck Romania in many places, and some prices are as high or higher than those in Western Europe, but this is often reserved to luxuries, accommodation, technology, and, to an extent, restaurants. However, food and transport remain relatively cheap (but more expensive than in other countries in the region), as does general shopping, especially in markets and outside the capital. Bucharest, as with the majority of capital cities in the world, is more expensive than anywhere else in the country, particularly in the city centre. In the past 2-3 years, Bucharest has become increasingly expensive, and it is expected to do so for many years to come. However, travellers from Nordic countries will find all the prices in Romania to be amazingly low, especially transport (short and long distance), dining out at restaurants, and drinks.\n\n===Supermarkets & convenience stores===\nThe best places to shop for food are farmers' markets. Food sold here is brought fresh from the countryside, and by buying it, you are both supporting local farmers and consuming something that is fresh and in the overwhelming majority of the cases natural and organic; in many cases, what you are buying today has been picked freshly yesterday from the countryside. You also get the experience of buying food produced as part of an old and living tradition that has not yet been through the forgetting-and-rediscovery process behind much \"traditional\" and \"natural\" food in other industrialised countries. Recently, the food in the markets is sold by intermediaries, who buy cheaply from farmers and sell products, tripling the price. However, this is illegal, and, in many cases, farmers' markets now require that farmers show a specially designated certificate in order to rent a stall. \n\nHowever, some tourists can't resist Romania's hypermarket temptation, especially in Bucharest. Hypermarkets are relatively popular (and recent) in Romania, but this ensures that nearly all of them are modern and sparkling clean, with brightly lit aisles, neat shelves and smooth-gliding carts, that you may find it hard to look away and head for the markets! Common hypermarkets are Carrefour [http://www.carrefour.ro], Cora [http://www.cora.ro], Kaufland [http://www.kaufland.ro] and Real [http://www.real-hypermarket.ro/]. There are also cash & carry stores like Metro [http://www.metro.ro], Selgros [http://www.selgros.ro], etc. \n\nHowever, shopping in supermarkets can be expensive, and not half as fun, as you don't have the chance to [[haggle]]. Despite this, all Romanian supermarkets sell products of EU standards, and usually make for a very quiet, clean and white shopping experience that can best be likened to duty-free shopping in airports.\n\nRemember, however, to not confuse supermarkets with neighbourhood grocery stores called 'alimentară' - nowadays, 'alimentară' also refers to small supermarkets. The stores are dim, old Communist-era shops that can be cheaper. These shops, which can best be compared to British corner shops, may be convenient if living in the suburbs or in smaller towns. But, despite their seemingly poorer appearance, they sell good quality food, and besides, most of them have been renovated anyway to the point that they are still not as aesthetically-pleasing as supermarkets but just as wide-ranging, modern and functional. In 'alimentara', expect strange systems of payment or selection: you may not be able to take items off of the shelf yourself, or one person may tally up your total before another handles the cash, etc. Many locals however actually prefer these establishments, since they offer a personal touch, with many salespeople remembering the preferences of each buyer, and catering specifically for their needs.\n\nOpening hours are extremely predictable and amazingly long. Many shops will have a \"non-stop\" sign - meaning they are open 24 hours, 7 days a week. Shops that are not open 24 hours are usually open 8 AM - 10/11 PM, with some keeping open in summer until 2 or 3 AM. Supermarkets and Hypermarkets are open 8 AM - 10/11 PM as well, except during some days before Easter and Christmas, when they remain open through the night. Pharmacies and specialised shops are usually open 9 AM - 8/9 PM, sometimes even later while farmers' markets usually open their doors at 7 AM and close at 5 or 6 PM.\n\n===The countryside fair===\n\nA traditional countryside shopping is the weekly fair (târg, bâlci or obor). Usually held on Sunday, everything that can be sold or bought is available - from live animals being traded amongst farmers (they were the original reason why fairs were opened centuries ago) to clothes, vegetables, and sometimes even second-hand cars or tractors. Such fairs are hectic, with haggling going on, with music and dancing events, amusement rides and fast food stalls offering sausages, \"mititei\" and charcoal-grilled steaks amongst the many buyers and sellers. In certain regions, it is tradition to attend after some important religious event (for example after St. Mary's Day in Oltenia), making them huge community events bringing together thousands of people from nearby villages. Such fairs are amazingly colorful - and for many a taste of how life was centuries ago. One such countryside fair (although definitely NOT in the countryside) is the Obor fair in Bucharest - in an empty space right in the middle of the city, this fair has been going on daily for more than three centuries.\n\n==Eat==\n\nRomanian food is distinct yet familiar to most people, being a mixture of Oriental, Austrian and French flavours, but it has some unique elements. The local dishes are the delicious '''sarmale''', '''mamaliga''' (polenta), '''bulz''' (traditional roasted polenta, filled with at least two kinds of cheeses, bacon and sour cream), '''friptura''' (steak), '''salata boef''' (finely chopped cooked veggies and meat salad, usually topped with mayo and decorated with tomatoes and parsley), '''zacusca''' (a yummy, rich salsa-like dip produced in the fall) as well as '''tocana''' (a kind of stew), '''tochitura''' (an assortment of fried meats, and traditional sausages, in a special sauce, served with polenta and fried eggs), '''mici''' (a kind of spicy sausage, but only the meat, without the casings, always cooked on a barbecue). \nOther dishes include a burger bun with a slice of ham, a slice of cheese and a layer of French fries,  '''ciorba de burta''' (white sour tripe soup), '''ciorba taraneasca''' (a red sour soup, akin to bors without the beet root and using instead fermented wheat bran, with lots of vegetables), Dobrogean or Bulgarian salads (a mix of onions, lettuce, tomatoes, cheese, white sauce and ham), onion salad - diced onion served in a dish, tomato salad - diced tomato with cheese, pig skin - boiled and sometimes in stew, and '''drob''' (haggies) - a casserole made from lamb or pork liver and kidneys. Local eclectic dishes include cow tongue, sheep brain (Easter), caviar, chicken and pork liver, pickled green tomatoes and pickled watermelon. \n\nTraditional desserts include '''pasca''' (a chocolate or cheese pie produced only after Easter), '''saratele''' (salty sticks), '''pandispan''' (literally means spanish bread; a cake filled with sour cherries), and '''cozonac''' (a special cake bread baked for Christmas or Easter).   Bread (without butter) comes with almost every meal and dill is quite common as a flavoring. Garlic is omnipresent, both raw, and in special sauces ('''mujdei''' is the traditional sauce, made of garlic, olive oil and spices), as are onions. \n\nGenerally, there is good street food, including '''covrigi''' (hot pretzels), '''langoşi''' (hot dough filled with cheese), '''gogoşi''' (donut-like dough, coated with fine sugar), '''mici''' (spicy meat patties in the shape of sausages), and excellent pastries (many with names such as '''merdenele''', '''dobrogene''', '''poale-n brau''', '''ardelenesti'''), thin pancakes filled with anything from chocolate and jam to bananas and ice cream. Very popular are kebab and shawarma ('''şaorma'''), served in many small shops.\n\nMost restaurants in Romania, especially in more regional areas, only serve Romanian food, even though it is similar to Western European food. Especially in Bucharest, there is a wide variety of international food, especially mediterranean, Chinese or French. There are also fairly plentiful international fast food chains. The interesting truth about these is that they are just nominally cheaper than restaurants, with the quality of the food being of an international standard but quite much lower than that served in restaurants. Therefore, go for the restaurants when you can - they provide a much more authentic and quality experience at prices that aren't too much higher.\n\nVegetarian and vegan travelers can easily find a tasty dish suitable for them if they ask for '''mancare de post''' (food suitable for religious fasting). Because Romanians are in their large majority Eastern Orthodox Christians, fasting involves removing of all the animal products from their meals (meat, dairy products or eggs). Even though Lent seasons only cover a small part of the year, you can find fasting food throughout the year. However, note that most of the Romanians are unaccustomed with vegetarianism or veganism; still, you can find fasting food \"mancare de post\" all year round since most of the Romanians fast also outside Lent, on Wednesdays and Fridays, as part of their orthodox faith.\n\n==Drink==\n\n===Wine===\nRomania has a long tradition of making wine (more than 2000 years of wine-making are recorded), in fact Romania is the 12th (2005) world producer of wine, the best wineries being Murfatlar, Cotnari, Dragasani, Bohotin, Bucium, etc. Its quality is very good and the price is reasonably cheap: expect to pay 10-30 RON for a bottle of Romanian wine (about €3 - €8.5). Several people in touristic areas make their own wine and sell it directly. Anywhere you want to buy it, it is sold only in bottles of about 75 cl. Some wineries sell bulk wine in proper recipients according to the amount you want to buy and the price is lower calculated per liter. Many of the monasteries produce and sell their own wine. Most of the individuals wine makers, and monasteries will allow you to taste it first, but some may not.\n\n===Beer===\n\nLike all the countries with a strong Latin background, Romania has a long and diffused tradition of brewing beer, but nowadays beer is very widespread (even more so than wine) and rather cheap compared to other countries. Avoid beers in plastic PET containers, and go for beers in glass bottles or cans. Most of the international brands are brewed in Romania under a license, so they taste quite different than in Western Europe. Some beers made under licence are still good - Heineken, Tuborg, Peroni.  You can easily realize whether a beer has been brewed in Romania or abroad and then imported simply looking at the price: imported beers are much more expensive than the Romanian ones (A Corona, for example, may be 12 RON while a Timisoreana, Ursus or Bergenbier of a full 1/2 litre size will be 2-3 RON. Some of the common lagers you may find around are quite tasteless, but there are some good brewers. ''Ursus'' produces two tasteful beers, its lager is quite good and its dark beer  ('''bere neagra'''), Ursus Black, is a strong fruity sweet beer, similar to a dark Czech beer. ''Silva'' produces bitter beers, both its ''Silva original pils'' and its ''Silva dark'' leave a bitter aftertaste in your mouth. Bergenbier and Timisoreana are quite good. All the other lager beers you may find, such as Gambrinus, Bucegi or Postavaru are tasteless (in some consumer's opinion). Ciuc is a very decent and affordable pilsner, now owned by Heineken. \nExpect to pay around 2-3 RON (€0.6-€0.8) for a bottle of beer in the supermarket and double in a pub.\n\n===Spirits===\nThe strongest alcohol is '''palinca''', with roughly 60 percent pure alcohol and is traditional to Transylvania, the next is '''ţuica''' (a type of brandy made from plums - the more quality, traditional version - but also apricots, wine-making leftovers, or basically anything else - an urban legend even claims you can brew a certain kind of winter jackets (pufoaică) to ţuică), but this is sooner a proof of Romanian humour. Strength of tuica is approximately 40-50 percent. The best ţuică is made from plums, and is traditional to the [[Pitesti]] area. Strong alcohol is quite cheap, with a bottle of vodka starting off between 10 RON and 50 RON. A Transylvanian speciality is the 75 percent sour cherry  palinca (palincă întoarsă de cireşe negre better known as '''vişinată''') - but is usually kept by locals for celebrations, and may be hard to find.\n\n==Sleep==\n\nFinding an accommodation in Romania is very easy, for any price. In all the touristic places, as soon as you get to the train station several people will come to you asking whether you need an accommodation, or you can book it in advance. Those people welcoming you at the station often speak English, French and Italian. Moreover, while walking on the street, you will often find ''cazare'' on the houses, that means they will rent you a room in their own house. You'd better book an accommodation in the big cities (Bucharest, Cluj-Napoca, Brasov and Iasi), since it'll be quite hard to wander around looking for a place to sleep, but anywhere else you won't find any problem at all.\n\nAs with most countries it is often much cheaper to obtain accomodation directly with the hotel (either in person or in advance via the internet) rather than through booking agencies. An increasing number of even small hotels will accept reservations via the Internet. Search for the local official tourist guide websites which will have a list of hotels/bead and breakfasts, then enquire at that site: most have information in English, many have formal reservation webpages. Prices for Fourstar hotels are much the same as the rest of Europe,certainly in Bucuresti, whilst three star hotels and below ''can'' be a little cheaper. A  feature of Romanian accomodation prices is that many bed and breakfast establishments (without any hotel star rating) are in fact as or even more expensive than two or three star hotels. Most appear to be more modern than rated hotels.\n\nRural tourism is relatively well developed in Romania. There is a national  association of rural guesthouses owners, '''ANTREC''' [http://antrec.ro/index.php?lang=en] who offer accommodations in over 900 localities throughout the country.\n\n==Education==\n\nThe oldest Romanian university is the University of Iasi, founded in 1860 (the medieval schools in Bucharest and Iasi are not considered universities). Bucharest, Iasi and Cluj are considered to be the largest and most prestigious university centres, with newer centres of education like Timisoara, Craiova and Galati emerging as cities with an increasingly larger student population. If coming with a mobility grant (Erasmus/Socrates or similar), it is very important to go to the International Office of the Romanian University as soon as possible, as Romanian paperwork tends to be quite impressive and may take some time to be processed. Also, if planning to study in Romania, it is highly recommended to find your own accommodation - most universities do not provide any accommodation, and if they do provide accommodation, the conditions offered are downright terrible (3-4 persons sharing a room, with a corridor of 50 or more sharing the showers and toilets is not unheard of - this happens since university-offered accommodation is typically next to free (15-20 € per month) for Romanians, and you usually get what you pay for).\n\nThe education system is mediocre at best since 1990 (Romania did not do good in either of the PISA evaluations, being in the bottom third of European countries), however reform attempts have been done in the past decade. Attendance is compulsory for 10 years. Universities have started to reduce the number of subsidies so students will, increasingly, have to pay the tuition (tuition is however very low - 500 € per year is the norm). With some exceptions teaching methods in universities are antiquated, with formalism, dictation and memorization as the main tools employed - leading to low quality of many establishments (no Romanian university made it in the Shanghai Index). However, there were very serious reform attempts, with some universities (notably the University of Bucharest, University of Iasi, the Babeş-Bolyai University in Cluj and the University of Timişoara) imposing better teaching standards and interactivity between students and teachers - however much progress is to be done even there. For most subjects, programs are available in Romanian and Hungarian, depending on the university. Some programs are available in English, French and German. Elementary and middle schools are supported by local authorities budget. As with most nations, teachers complain about small salaries. Literacy is nearly universal. According to an EU commission study, about 30% of Romanians speak English (50% in urban environments) and 25% French (40% in urban environments). German is also spoken by about 3-5% of the population (1% having it as their mother tongue).\n\n==Stay safe==\nWhile violence against foreign tourists is rare, this does not mean you should leave your common sense at home, if you decide to vacation in Romania. Generally crime is limited to petty thefts and common scams, but not much else that would concern the tourist. Avoid dimly lit city neighborhoods and you should not encounter any problems. Wherever you may be in the country ask trusted locals about the surroundings, they will gladly give you a few pointers.\n\nAlthough racial prejudice exists in Romania, especially toward those who look like Roma (“gypsies” or tigani), hate crimes are rare. An annual gay pride parade in Bucharest has been the scene of violent protests in past years. \n \nProstitution is illegal as is soliciting,despite the street walkers that you might encounter on the outskirts of town or in and around Bucharest and other big cities. Please be aware of this and '''do not''' accept any offers from them or other intermediaries such as pimps or taxi drivers that \"know a place\". If you are caught and the prostitute is underage or has been trafficked or coerced (and like Western Europe, many of them are) you will be charged with a crime related to human trafficking and sexual assault. Chances that you might get caught increase if you are foreign since rival pimps will inform on their competition and a foreigner is an ideal \"patsy.\"  The same rules apply to the many erotic massage parlours that have opened up in recent years and currently reside in a legal grey-zone.\n\nTake note that since Romania has one of the lowest rates of immigration in Europe, Romanians, especially outside major cities, are unaccustomed to seeing people of different races. Your experience may differ, for better or worse, but you can at least expect some odd stares.\n\n===Emergency phone numbers===\n\nRomania uses the pan-European standard number '''112''' for all emergency calls since December 2004. Therefore, this is the only number you will need to remember for police, ambulance and the fire department.\n\n===Petty Crime===\n\nRomania is quite safe, with little violent crime. Pick-pocketing and scams (such as taxi scams or confidence tricks) are present on a wider scale, so exercise care, especially in crowded places such as railway stations, markets, and on urban public transport. Keep your money or valuables in inner pockets of your backpack and always watch your handbag in said crowded areas. \n\nAt Henri-Coanda Airport, the safest way to get a taxi is to order one at one of the recently-installed touchscreen terminals, on which you can order taxis in multiple languages. Basically, just press the \"order taxi\" (comanda taxi) button, and choose the price you want to pay per km (1.39, 1.77, 3.50, 7.00 lei/km). No reason to choose anything more expensive than 3.50 lei/km. There have been reports of taxi drivers moving the meter so that you can't easily see it from the back, so be careful, to see what they're doing. A typical fare to the center is ~30 lei for the 1.39 lei/km taxis or ~70 lei for 3.50 lei/km taxis. Usually the cheaper taxis will be Dacia Logan cars.\n\nMake sure to only get in the taxi written on your receipt obtained from the terminal--this way if they overcharge you you have a way of complaining. However, this is Romania, so even if you are right, you might not get the money back, or, if you do, it will be a lengthy process... \n\nRemember, buses to central Bucharest now run all night, and a ticket is roughly 4.3 lei (price of ticket+price of the card you need to buy) but you need to buy 2.\n\n===Animals===\n\nRomania has a very large population of wild animals, including one of the largest population of wild bears in the world. It is commonplace for bears to visit city neighborhoods situated near mountain forests in search for food (such as in Braşov). As such, spotting a bear or wolf is fairly easy. Although usually not dangerous, such animals may become aggressive if care is not taken. If you spot a bear or wolf when hiking, it is advisable to slowly turn around and slowly walk the other way. Local shepherds advise people who are wild camping to camp out in the open rather than under trees where possible to avoid the bears. Under any circumstances, do not attempt to run or try to feed the animal, as it may become disoriented and attack. In 2006, 6 people were killed by wild animals in Romania. There have also been cases in which tourists encountered bear cubs and attempted to feed or play with them. In some cases this has turned out to be a fatal mistake. If you happen to encounter any sort of young animals be aware their parents are somewhere close. The best thing you can do is leave the area as soon as possible, as cuddly and cute as bear cubs may be, their parents are not. Bears are extremely aggressive when they have cubs and will attack at the slightest hint of a threat to their cubs. Please be aware. This is one of the leading causes of attacks by animals on people. \n\nWhen camping also try to stay away from animal paths or you might find a herd of cows all over your tent in the morning. Study the footprints and avoid watering places. Farmers generally let their herds stray so don't expect any damage to be noticed by them.\n\nFeral animals such as stray dogs may additionally pose a problem in Bucharest and other major cities, where they are widespread. Most will not be aggressive,but careful about animals in packs and at night. Some are taken care of by people from nearby housing blocks and these can be especially territorial and can sometimes attack without warning. The number of stray dogs is declining but is still extremely high and overall they are the biggest physical danger especially in remote areas.\n\n\nRomanian farmers also use dogs for herding and protecting sheep. You'll most likely see this if you're walking near any farms, on dirt roads, or rural areas. You can tell they are sheep dogs as farmers usually attach horizontally-hanging sticks under their necks. If you encounter one of these dogs, it might appear scared at first, and might be looking backwards. It is indeed scared, but it is not looking for retreat: it's looking for its other doggy friends! If you continue walking towards their territory or whatever herd of sheep they are protecting, they will most certainly become more and more defensive, and have no doubt that more and more will appear as you get closer to the herd. In situations like this, you simply need to back off. It's not worth attempting to defend yourself either, as Romanian farmers will get very angry. If you are in a rural area, consider waiting for a horse and buggy or car for hitchhiking: this is the best way to cross such territories.\n\n===Corruption===\nSome visitors may encounter corrupt policemen (''Poliţisti'') and customs officials (''Ofiţeri de vamă'') first hand, even though this seems to be a declining problem.  While it may be tempting to pay a bribe (''mită'' or ''şpagă'') to smooth things along on your visit, you should avoid doing so as it only contributes to this problem. It is also illegal to give bribe as well as it is to receive it. Foreigners might receive tougher sentences in Romania and perhaps a free portrayal on all national televisions. Fines are low for driving offences and most other misdemeanours so it's not worth the risk.\n\nA piece of good advice for when you find yourself in the situation to be asked to pay a bribe (or just suggested) is to politely reject the proposal, stating clearly that you would not do that. If you are being harassed adopt a swift and determined attitude, and threaten that you will immediately call the police. This will almost surely make whoever is asking for the bribe stop and leave you alone.\n\n==Stay healthy==\n\n===Healthcare===\n\nConditions in Romanian hospitals may vary from the very clean and sparkling, with all the latest technological utilities, to the downright drab, dark and cold. Some hospitals, however, may be, as aforementioned, uncomfortable, with dimness, temperature problems (hot in summer, cold in winter) and outdated equipment, although medical staff are usually experienced. You won't usually face problems such as significant lack of cleanliness.\n\nRemember that your travel health insurance might prove to be insufficient if the medical condition is severe. In this case, you will be asked to pay for the medical services, and prices are not very low compared to Western Europe.\nUpdate: As of January 1st 2007, and Romania's accession to the European Union, citizens of the European Union are covered by Romania's National Healthcare System as long as they carry a Eurocard (or European Health Insurance Card), obtainable from their own national healthcare authority. (Valid for all EU countries)\n\nDental procedures in Romania, especially those in private clinics, are of an excellent quality. In fact, many Western Europeans come to Romania to have their teeth done for the quarter of the price they pay in their home country.\n\n==Respect==\n\nRomanians are quite hospitable. In the countryside and small towns, they welcome foreign tourists and, occasionally, they might even invite you for a lunch. As is common with Romania's Balkan neighbors, Romanians will insist when offering something, as \"no\" sometimes does not mean \"no,\" and they just consider it polite for you to refuse and polite for them to insist.\n\nYou should take some normal precautions to study your host first. It is common for friends and family to kiss both cheeks upon greeting or parting. Respect towards elderly is highly appreciated and is a good representation of your character. The phrases used to greet friends and strangers alike is \"Bună ziua\" (Boo-nah Zee-wah) which means \"Good afternoon\" or \"Good day.\"\n\nKeep in mind that most Roma identify by the name țigan or Sinti and referring to someone as such is not considered a slur (although it can be done in a derogatory manner), despite some NGOs trying to promote it as such. There are many products (such as cookware) and recipes that have the name \"țiganesc\" affixed to it. (ex:muschi țiganesc- țigani pastrami ). \nAlso, if you live in the West you might be surprised to find that the local Roma minority has been painted in a very broad brush.\n\nAt beaches, men wear either speedos or shorts, with the former more common among the over 40s, and the latter more popular with the younger crowd. Women tend to wear thong bikinis, topless sunbathing is becoming more and more popular but not all beaches welcome the practice so it's best to look around first for other women doing it. \n\nConservative dress must be worn at religious sites. Shorts are forbidden and women must often cover their heads inside the monasteries and churches. \n\nRefrain from observations, whether by ignorance or indifference, that Romanian is a Slavic language or even related to Hungarian, Turkish or Albanian. It is a Romance language (rooted in Latin) and is related to Italian, Spanish, French and Portuguese. If your native tongue is one of the aforementioned languages you will find it very easy to pick up a few words along the way. \nRomanians also appreciate foreigners who do not assume that Romania was part of either the Russian Empire or the Soviet Union (false although it was a member of the Eastern Bloc).\n\nAlso, while the principalities of Wallachia and Moldova did indeed pay tributary sums to the Turks for several centuries, they were never part of the Ottoman Empire, unlike all of their neighbors. Knowing even these basic facts about Romanian history will go a long way should any conversation on the subject arise. \n\nAvoid discussing the ethnic animosities between the Romanians and ethnic Hungarians. Hungarians dominate in some areas, such as some areas in Transylvania (Szekely's land, although Romanians form a vast majority in Transylvania as a whole), and in recent years occasionally inter-ethnic violence has broken out. \n\nOther minority-rich regions include Dobrogea, where Tatars, Turks and Ukrainians still live today, and also in the west of the country there are small numbers of Serbs, Slovaks, and Germans. \n\nRomanians dislike Romania to be labelled as a Balkan country because of the negative image of the region.\n\nIt is not entirely geographically correct either as most of Romania (if restricted to Dobrogea, Moldavia, Muntenia and Oltenia, or the vast majority of Romania) lies outside the Balkans.\n\n==Contact==\n===Mobile Phones===\nMobile phones are ubiquitous in Romania. There are four 2G GSM/3G WCDMA/4G networks(Orange, Vodafone, Telekom and Digi.Mobil). Orange, Vodafone and Telekom have full national coverage (98-99% of the population of the country), while Digi.Mobil is expanding quickly. Fares are average for the European Union (1-20 Eurocent per minute, 4-5 Eurocent/SMS). Both pre-paid cards and subscriptions are available, and special options for discounted international calls exist with some pricing plans. Roaming is available, but is, like in most of the EU, rather expensive. Pre-paid cards can be bought in almost every shop, either rural or urban, but you will get stuck if you try to charge by credit card or online. You can buy additional credit in most ATMs. If you want to buy mobile credit online, you can do it with <buy name=\"fonmoney\" alt=\"fonmoney.com\" url=\"http://www.fonmoney.com/\"></buy> or ezetop. Be careful with giving away credit card information to Romanian pages.\nMobile prepay data package is about 8euro for 1GB, 15euro for 3GB.\n\n===Internet Access===\nInternet access is fast, widely available in urban environments and growing in rural environments. In December 2006 there were about 3.500.000 internet connections, with around 7.000.000-9.000.000 people having internet access as of 2008. Broadband internet is widely available in cities and towns, through cable, DSL and home-grown, grass-roots small or medium size ISPs offering UTP connections. Speeds are mostly like  Western Europe or the US, with 1-4 Mbps  downstream for non-metropolitan access being the norm - with prices being around 9-25 € for 1-4 Mbps, with local access significantly faster (10-50 or even 100 Mbps). The speeds are increasing, home access for 4 Mbps being available at around €10 per month.\n\nInternet cafes are available in most towns and cities and villages - but in big cities, their numbers are dropping because of the cheap availability of home access. In rural areas, public Internet access is currently available in 150  remote villages (in so-called \"telecenters\"), and it is supposed to increase to at least 500 villages by the end of 2008. In these \"telecenters\", access is subsidized by the state, and therefore limited. Computers are usually not available in libraries, or in public places such as train stations.\n\nWireless access is growing, especially in Bucharest, Brasov, Sibiu, Bistriţa, Timişoara and Cluj with Wi-Fi widely available in University areas, airports, public squares, parks, cafes, hotels and restaurants. Payed-for Wi-Fi is also available in many venues. If uncertain, look for squares near the Town Hall, large parks or other important buildings. Most (if not all) McDonald's restaurants in Romania have wi-fi access and so do most 3-star (and higher) hotels.\n\nMobile internet is available cheaply by all the mobile phone companies (using Romanian simcards. Combined 3G/GPRS/EDGE access is priced at 40-80 RON per month (10-20 Euro)with a cap of 5-10 GB, whereas simple WAP traffic (without a 3G plan) is priced at 10-20 Eurocents/MB.\n\nTake note that Romania is ranked 5th in the world in terms of internet speed.\n\n===Cable TV===\nCable TV is also very widely available, with about 85% of all households being connected. All hotels providing you with a TV set will provide you with cable TV or digital TV.\n\n{{isPartOf|Balkans}}\n\n[[ca:Romania]]\n[[de:Rumänien]]\n[[eo:Rumanio]]\n[[es:Rumanía]]\n[[fi:Romania]]\n[[fr:Roumanie]]\n[[hu:Románia]]\n[[it:Romania]]\n[[ja:ルーマニア]]\n[[nl:Roemenië]]\n[[pl:Rumunia]]\n[[pt:Romênia]]\n[[ro:România]]\n[[ru:Румыния]]\n[[sv:Rumänien]]\n\n[[wts:Category:Romania]]\n[[WikiPedia:Romania]]\n[[Dmoz:Europe/Romania/]]\n[[World66:europe/romania]]\n\n{{countryguide}}\n{{outline}}"
        }
    }
}