{
    "parse": {
        "title": "San Marino",
        "pageid": 770,
        "wikitext": {
            "*": "{{pagebanner|San Marino Banner.jpg}}\n\n{{otheruses}}\n{{quickbar\n|caption=San Marino\n|location=San Marino in its region.svg\n|flag=Flag of San Marino.svg\n|capital=San Marino\n|government=Republic\n|currency=euro (€)\n|area=61.2 sq km\n|population=27,730 (July 2002 est.)\n|language=[[Italian]]\n|religion=Roman Catholic\n|electricity=230V/50Hz (European, Italian plug)\n|tld=.sm\n|callingcode=+378 (+0549 From Italy)\n|timezone=UTC+1\n|emergencies=dial '''112'''\n}}\n[http://www.visitsanmarino.com '''San Marino'''] (officially the '''Republic of San Marino''') is the third smallest country in [[Europe]] (after the [[Rome/Vatican|Holy See City]] and [[Monaco]]), and claims to be the world's oldest republic. According to tradition, it was founded by a Christian stonemason named Marinus in 301. San Marino's foreign policy is aligned with that of [[Italy]], which surrounds it. Social and political trends in the republic also track closely with those of its larger neighbour.\n\n==Understand==\n\nSan Marino is the world's oldest republic and Europe's third smallest state. It lies 657&nbsp;m above sea level with spectacular views of the surrounding countryside and Adriatic coast, and is situated only 10km from [[Rimini]]. Legend has it that the founder of San Marino, a stonemason, arrived from the island of Rab in Dalmatia and climbed Mt. Titano to found a small community of Christians, persecuted for their faith by the Emperor Diocletian.\n\nSan Marino is made up of a few towns dotted around the mountain sides. The capital of San Marino is itself called 'San Marino' and is situated high up on a mountain top. The capital is surrounded by a wall and three distinct towers overlook the rest of the country. The site \"San Marino: Historic Centre and Mount Titano\" has become part of the UNESCO World Heritage List in 2008.\n\nThe towns surrounding the capital are more industrial and generally not as attractive as the main city. San Marino is 20 times bigger than Monaco and half the size of Liechtenstein.\n\n==Get in==\n\n[[Image:City_Gate_San_Marino.jpg|thumb|City Gate into walled San Marino]]\n\nSan Marino is '''not''' a member of the European Union or European Economic Area. However, it maintains an open border with [[Italy]]. Foreigners staying more than 10 days in San Marino must have a permit from the government. \n\n===By plane===\n\nSan Marino has no airports. The nearest major airport is at [[Rimini]]. There are other airports at [[Ancona]], [[Bologna]] and [[Forlì]].\n\n===By train===\n\nSan Marino has no railway stations. The nearest major railway station is at [[Rimini]].\n\n===By car===\n\nYou should have no problems driving into San Marino. International agreements with Italy mean that the country is one of 3 associate members of the Schengen Area, so doesn't have border controls.\n\n===By bus===\n\nBonelli Bus 72 runs from [[Rimini]] to San Marino daily at regular intervals with reduced service on Sundays and holidays ([http://www.bonellibus.it/portale/images/download_pdf/rimini_sanmarino_invernale.pdf 2017-2018 schedule]). A return ticket costs €10, one way is €5. The bus can be found opposite the Rimini train station, just past the Burger King. A line forms at the bus stop, so it is advisable to show up a little bit earlier to ensure enough seats remain on the bus. \n\nTickets can either be bought from the bus driver, or in advance at the Tourist Information Centre (outside the train station) where you can also deposit your luggage for a small fee if they still have available space (€3 per item; centre closes c. 18:45 most days). It's best to buy the tickets in advance as it speeds up the boarding process.\n\n==Get around==\n[[Image:San-marino-map.png|upright=1.8|thumb|Map of San Marino]]\n===In the ''Città''===\n[[File:SanMarinoLevels.png|thumb|A map of San Marino showing the different relative levels on which the buildings are built. This map shows how San Marino has a very high vertical population density.]]\nThe ''Città'' (San Marino City) can be roughly grouped into 12 levels:\n# Salita Alla Rocca, Contrade dei Magazzeni, di Borgoloto & del Collegio, Basilica\n# Piazza della Libertà, Contrada Santa Croce\n# Vie Donna Felicissima & Eugippo\n# Via Basilicius, Contrade dei Liburni & Omerelli\n# San Francesco, Contrade della Mura, San Francesco & di Portanova\n# Via Piagge\n# Piazzale Marino Calcigini, Vie Pietro Tonnini, della Capannaccia & della Rata\n# Via Gino Giacomini\n# Vie Jan Henryk Dabrowski, dei Villanoviani, Ca' Giello & Aia Zoli\n# Vie Montalbo, Sant'Antimo, La Riva & Pietro Rossi, Contrada Sant'antonio\n# Piazze Mercatale & Grande\n# Via del Fontanone, Piazzale Campo della Fiera\n\nThere is a short cable car called the \"Funivia\" connecting Piazza della Libertà (on level 2) to Piazzale Campo della Fiera in Borgo Maggiore (on level 12).\n\nOnce inside the walled city, it's small enough to simply walk around. The majority of streets can accommodate only small cars, cycles & mopeds. Some streets can accomodate larger cars & buses while some can only accommodate pedestrians (mostly called ''Contrade'' or neighbourhoods).\n\n====Parking====\nDespite not being particularly car-friendly, parking is abundant in the ''Città''. Here is a list of municipal car parks, which each have their own number:\n# Via Piana, along the city wall on level 6.\n# Piazzale Marino Gangi on level 6.\n# Via J.F. Kennedy, outside the congress centre on level 2. This is more than a ten minute walk from Piazza della Libertà.\n# Viale Antonio Onofri on level 3.\n# Passo della Murata Nuova on level 3.\n# Piazzale Cava Antica on level 1.\n# Cava degli Umbri on level 1.\n# Via Piagge on level 6.\n# Underground multi-storey, entrances on Via Gino Giacomini on level 8 & Via Jan Henryk Dabrowski on level 9. Pedestrian access via a lift to the bus station on level 8, from where there is another lift to the coach park on level 7, from where yet another lift goes to level 6.\n# Via Jan Henryk Dabrowski on level 9. This car park can be used by motorhomes. This is more than a ten minute walk from Piazza della Libertà.\n# Piazzale Campo della Fiera on level 12, outside the lower cable car station. Due to its proximity to the cable car, this car park requires the least walking to reach Piazza della Libertà. However, the cable car fare should be considered.\n# Viale Campo dei Giudei on level 12. This car park has a shuttle bus service to the city centre.\n\nMore information on the car parks, including pricing, can be found at [http://www.sanmarinosite.com/en/how-to-reach/parking/ sanmarinosite.com].\n\n==Talk==\nThe people in San Marino speak a very clear [[Italian phrasebook|Italian]].\nAlso, due to the high density of Russian tourists, in a lot of shops and restaurants people speak [[Russian phrasebook|Russian]]. The English language can help you get around just fine.\n\n==See==\nYou can see two of the three towers (as seen on the flag of San Marino) by purchasing the \"Red Card\" for €4.50. The \"yellow card\" (€3) only allows you to see one of the towers. You cannot enter the third tower (there does not seem to be an entrance!)\n[[Image:Tower_San_Marino.jpg|thumb|One of the three towers in San Marino]]\nSimply walk around the city. The narrow streets are full of surprises. The walkways wind up and down the hillside in an interesting way, inviting exploration.\n\nFish can be caught in '''San Marino lake''' in Faetano.\n\n==Do==\nGet your passports stamped at the tourist information centre. This is an excellent souvenir as they stick a visa tax stamp and then an official ink stamp over the top, €5.\n\nContrary to previous entries, obtaining such a stamp does '''not''' in any way invalidate your passport. San Marino is a fully, internationally recognised sovereign country, and as such is perfectly entitled to issue its own passport stamps to anyone who wishes to have one. Whether they are for official immigration or optional souvenir purposes is not relevant; there is still nothing illegal '''whatsoever''' about getting one and '''absolutely no problems''' will arise from you having a San Marino stamp in your passport. If you want a stamp then get one without hesitation; it's a unique souvenir.\n\n==Buy==\nInternational agreements define the country's currency as the same as Italy's, so {{Euro}}\nLike other states which have the Euro as their currency, San Marino has its own patterns on the back of the Euro coins. You can try to obtain these coins by simply going around buying things and collecting the coins that way, but a quicker solution is to buy the set in a souvenir shop. Unfortunately, these sets seem to lack the € 1 and € 2 coins.\n\nA lot of the souvenir shops sell weapons, from swords to B-B guns.\n\nPrices for items such as disposable cameras and batteries are cheaper in San Marino than they are in Italy. This is partly because in San Marino you don't have to pay the 22% IVA (VAT) that you have to pay in Italy.\n\nPrice of Cigarettes are lower than Italy.\n\nTax Free is available for all the tourist that comes in San Marino with Passport and Valid Credit Card (except italian).\n\n==Eat==\nThe Sammarinese cuisine is a reflection of the surrounding regional Italian cuisine (cucina Romagnola). Hence the Piadina, a thin flatbread, is very popular.\n\nSupermarkets in San Marino are few and far-between, although the following can help in this area:\n\n*'''Conad'''. Azzurro Shopping Centre, V M Moretti 23, Serravalle SM 03508\n*'''Sma Supermercati'''. Via del Passetto 113, Fiorentino SM\n*'''Ristorante Terrazza Titano'''. Contrada del Collegio 31, Repubblica di San Marino\n*'''[http://www.ristorantelafratta.com/ La Fratta]'''. Next to the parking lot n.6, Via Salita alla Rocca, 14, Repubblica di San Marino\n\n==Drink==\nLegally you can buy or drink alcohol when you reach 16.\n\n*The local beer is very tasty. \n*Spirits are also very commonly found, especially Limoncello, a lemon liquor.\n*Try the locally produced wine.\n*The coffee, like in its Italian neighbour, is superb.\n\n==Sleep==\nAlthough San Marino has a few hotels, the seaside resort of [[Rimini]] has a lot more and is probably a cheaper option.\n\n* <sleep name=\"Grand Hotel San Marino\" alt=\"\" address=\"Viale Antonio Onofri, 31 47890 San Marino Città\" directions=\"\" phone=\"+378 0549 992400\" lat=\"\" long=\"\" tollfree=\"\" email=\"info@grandhotel.sm\" fax=\"+378 0549 992951\" url=\"https://www.grandhotel.sm/en/\" checkin=\"\" checkout=\"\" price=\"\">The Grand Hotel San Marino rises on the peak of Monte Titano, close to the Rocche and the Old Town Center. With a few minutes stroll you will find yourself immersed in the rich culture and history of this city.</sleep>\n\n*<sleep name=\"Hotel Titano\" alt=\"\" address=\"Contrada del Collegio, 31 47890 San Marino Città \" directions=\"\" phone=\"+378 0549 991007\" email=\"info@hoteltitano.com\" fax=\"+378 0549 991375\" url=\"https://www.hoteltitano.com/en/\" checkin=\"\" checkout=\"\" price=\"\" lat=\"\" long=\"\">Located right in the center of the town. The rooms are small but cozy, and it is connected to a very nice restaurant. The downside is that unless you are an early riser, the nearby church bells will ring every 15 minutes to remind you of the time starting from early in the morning.</sleep>\n\n==Learn==\n\n==Work==\n\n==Stay safe==\nSan Marino is a safe country. Like in any other place that attracts many tourists, you should watch out for pickpockets.\n\n==Stay healthy==\nThis is a very healthy place. If you become ill, procedures are the same as the European Union, although serious conditions will likely see you transferred to [[Rimini]].\n\n==Respect==\nSan Marino is a very proud country and it should be viewed in this respect. Be respectful when having photos taken with the guards, a smile will do, hand gestures/funny faces are not received well.\n\nIt would be considered very offensive to call them \"Italians\" - not that they don't like Italians, but they are just extremely proud of their independence.\n\n==Connect==\n\n==Cope==\n\n===Health care===\n\n===Diplomatic missions===\n* [[Image:Flag of Austria.svg|20px]] '''Austria'''\n* [[Image:Flag of Bulgaria.svg|20px]] '''Bulgaria'''\n* [[Image:Flag of Croatia.svg|20px]] '''Croatia'''\n* [[Image:Flag of France.svg|20px]] '''France''', , phone: +\n* [[File:Flag of the Vatican City.svg|20px]] <listing name=\"Holy See (The)\" alt=\"Vatican Apostolic Nunciature in San Marino\" directions=\"\" address=\"P.le Domus Plebis\" phone=\"+378 0549 992-448\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\"></listing>\n* [[Image:Flag of Italy.svg|20px]] <listing name=\"Italy\" alt=\"\" directions=\"\" address=\"Viale A. Onofri 117\" phone=\"+378 0549 991-271\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\"></listing>\n* [[Image:Flag of Japan.svg|20px]] '''Japan'''\n* [[File:Flag of Mexico.svg|20px]] '''Mexico'''\n* [[Image:Flag of Monaco.svg|20px]] '''Monaco'''\n* [[Image:Flag of Portugal.svg|20px]] <listing name=\"Portugal\" address=\"Republica di San Marino, Via Battisti, nº 3, 40123\"></listing>\n* [[File:Flag of Romania.svg|20px]] '''Romania''', Via Valle di Marco 4, phone: +378 0549 995-400, Fax: +378 0549 995 576 email: adolfo.morganti@libero.it Honorary Consulate General of Romania in San Marino\n\n\n{{outline}}\n{{isPartOf|Europe}}\n{{countryguide}}\n\n[[ca:San Marino]]\n[[de:San Marino]]\n[[eo:San-Marino]]\n[[es:San Marino]]\n[[fi:San Marino]]\n[[fr:Saint-Marin]]\n[[hu:San Marino]]\n[[it:San Marino]]\n[[ja:サンマリノ]]\n[[nl:San Marino]]\n[[pl:San Marino]]\n[[pt:San Marino]]\n[[ro:San Marino]]\n[[ru:Сан-Марино]]\n[[sv:San Marino]]\n[[wts:Category:San Marino]]\n\n\n[[WikiPedia:San Marino]]\n[[Dmoz:Europe/San Marino/]]\n[[World66:europe/sanmarino]]"
        }
    }
}