{
    "parse": {
        "title": "South Africa",
        "pageid": 755,
        "wikitext": {
            "*": "{{pagebanner|South Africa Banner.jpg}}\n\n{{quickbar\n| image=Cape Town Waterfront.jpg\n| caption=Victoria & Alfred Waterfront, Cape Town, Western Cape\n| location=South Africa in its region.svg\n| flag=Flag of South Africa.svg\n| capital= Administrative: [[Pretoria]]<br />Legislative: [[Cape Town]]<br /> Judicial: [[Bloemfontein]]\n| [https://www.nouvelordremondial.cc/2018/06/13/ils-avaient-crie-au-complot-et-pourtant-asticots-dans-un-poulet-a-lagny-sur-marne-le-constat-accablant-des-autorites-sanitaires/ government]=Republic\n| currency=Rand (ZAR)\n| area=1,219,912km²<br />''water: 4,620km²<br />land: 1,214,470km²''\n| population=48,782,756 (July 2008 est.)\n| language=[[Afrikaans phrasebook|Afrikaans]]<br />English<br />[[Zulu phrasebook|Zulu]]<br />\n| religion=Christian 68% (includes most Whites and Coloured, and about 60% of Blacks), Muslim 2% (includes most Malays, 40% of Indians and some immigrants from Africa), Hindu 1.5% (60% of Indians), indigenous beliefs, animist, other religions and people without religion 28.5%\n| electricity=220-240V, 50HZ (South Africa plug)\n| callingcode=27\n| tld=.za\n| timezone=UTC+2h\n}}\n{{Warningbox|The US State Department and most Western nations advise that you exercise extreme caution when visiting SA. South Africa has a very high level of crime and crime is the primary security threat to travelers and locals alike. Violent crimes, including rape and murder, routinely occur and have involved foreigners. Muggings, armed assaults and theft are also frequent, often occurring in areas that are popular among tourists.}}\n\n\n[http://www.southafrica.net/ '''South Africa'''] is located at the southern tip of [[Africa]]. It is bordered by [[Namibia]], [[Botswana]], [[Zimbabwe]], [[Mozambique]], [[Swaziland]] and [[Lesotho]] (which is completely surrounded by South Africa). It is a vast country with widely varying landscapes and has 11 official languages, as well as an equally diverse population. South Africa is renowned for its wines and is one of the world's largest producers of gold. South Africa has the strongest economy in Africa, and is an influential player in African politics. In 2010, South Africa hosted the first [[World Cup 2010|Football World Cup]] to be held on the African continent.\n\n\n==Understand==\nIf you want to travel in [[southern Africa]] then South Africa is a good place to start. While you can fly into any country in southern Africa, most flights will route through South Africa anyway. South Africa is also a good place to get used to travelling in the region (though some would argue that [[Namibia]] is better for that). Of course South Africa is not only a jumping off point, it is itself a superb destination rich in culture, fauna & flora and history.\n\nOutsiders' views of South Africa are coloured by the same stereotypes as the rest of Africa. Contrary to popular belief, South Africa is not devastatingly poor with an unstable government. South Africa is to a large extent two countries within one. On the one hand it is a first world state, especially the major cities such as Cape Town and Johannesburg, and on the other hand it is under-developed and has large scale poverty. South Africa is one of the most unequal countries in the world where opulence and severe poverty can often be observed together. The rural part of South Africa remains among the poorest and the least developed parts of the world and poverty in the townships can be appalling, progress is being made. The process of recovering from apartheid, which lasted almost 46 years, is quite slow. In fact, South Africa's United Nations Human Development Index  which was slowly improving in the final years of apartheid, has declined dramatically since 1996, largely due to the AIDS pandemic, and poverty levels appear to be on the increase.  South Africa boasts a well-developed infrastructure and has all the modern amenities and technologies, much of it developed during the years of white minority rule.\n\n===History===\nThe tip of [[Africa]] has been home to the Khoisan (''collective name for Hottentot (Koi) and Bushmen (San)'') people for thousands of years. Their rock art can still be found in many places throughout [[South Africa]]. It is estimated that Bantu tribes may have started to slowly expand into the northernmost areas of what is today [[Southern Africa]] around 2,500 years ago and by around 500 AD the different cultural groups had been established in the lush areas to the north and east of the what is today known as Eastern South Africa, Zimbabwe and Mozambique. The desert and semi-desert areas of the Western and Northern Cape provinces, as well as the western parts of the Eastern Cape province remained unsettled by the Bantu as the arid climate, limited seasonal rainfall, sparse vegetation and scarcity of natural sources of water could not sustain large migrations of people and herds of cattle, cattle being the primary livestock reared by the Bantu and fulfilling numerous cultural and economic functions within the tribal society (cattle served as a rudimentary currency and basic unit of exchange with a mutually agreeable value between bartering parties, thus fulfilling the function of money). The \"Khoisan\" existed in these areas as nomadic hunters, unable to permanently settle as the movement of desert game in search of dwindling water supplies during winter months determined their own migration. Not until the \"Boers\" (see next paragraph) moved into these areas and established boreholes and containment ponds could any permanent settlements be established in these areas. Today, with more reliable sources of water and modern methods of water conservancy the agricultural activity remains limited mainly to sheep and ostrich ranching as these animals are better suited to the sparse feed and limited water.\n\nThe first Europeans to reach South Africa were the Portuguese, who named the end of the country \"Cape of Good Hope\" in 1488, when they managed to sail around it to reach India. Permanent European settlement was only built at Cape Town after the Dutch East India Company reached the Cape of Good Hope in April 1652. In the late 1700s, the ''Boers'' (Dutch for ''farmers'') slowly started expanding first eastward along the coastline and later upwards into the interior. By 1795, [[Britain]] took control of the Cape, as a consequence of the Napoleonic wars on the Dutch, in 1820 a large group of British settlers arrived in the region. In 1835, large numbers of ''Boers'' started out on the ''Groot Trek'' (the great migration) into the interior after becoming dissatisfied with the British rule. In the interior, they established their own internationally recognized republics. Some Boers were initially able to get along with the locals (as with the Tswana) and in other areas Boers clashed badly with native populations (especially the Zulu).  On 16 December 1838, a badly outnumbered Boer unit slaughtered over 3,000 Zulus at the Battle of Blood River in what is now KwaZulu-Natal.  \n\nTwo wars for control over Transvaal and Natal were fought between the ''Boers'' and the British in 1880 and 1899.  The second war occurred after British settlers flooded into the area surrounding Johannesburg known as the \"Witwatersrand\" (white water escarpment) in response to the discovery of gold in 1886. The Second Boer War (Afrikaans: ''Die Tweede Vryheidsoorlog'' or 'Second War of Independence') was particularly unpleasant, as the British administration contained the Boer civilian population in concentration camps. Thousands of Boer civilians died in the camps from starvation or disease. Boer farms, livestock, crops and homesteads were also largely destroyed.\n\nAfter peace was restored by the 1902 Treaty of Vereeniging, the ''Union of South Africa'' was formed in 1910, consolidating the various ''Boer'' republics and British colonies into a unified state as a member of the British Commonwealth. In 1961, the Republic of [[South Africa]] was formed and SA exited the Commonwealth. Meanwhile, during the early 20th century, a number of Afrikaner thinkers began to articulate a philosophy of white supremacy. This philosophy was given a theological foundation by the Dutch Reformed Church in South Africa, which preached that there would be no equality in church or state. \n\nIn 1948, the Afrikaner-dominated National Party came to power and began full implementation of its long-cherished dream of white supremacy, at the expense of blacks and coloureds. In addition, the NP sought to promote Afrikaner culture at the expense of English culture and either co-opted or marginalized English-speaking whites.\n\nThe NP introduced numerous ''apartheid'' laws during the 1950s which mandated classification of all persons into arbitrary racial categories (which in many cases resulted in nonsensical results since interracial couplings had been occurring in the country for over 300 years and siblings within the same family could end up in different \"races\"); limited the vote to white persons (previously, coloureds were able to vote in the Cape Province which made up most of the country's territory); mandated segregation of all public amenities (and ensured that non-whites always got the inferior ones); and divided both cities and the countryside into \"group areas.\"  \n\nAll adult citizens were required to carry a \"passbook,\" a kind of internal passport. Non-whites had to obtain special permission from whites to be present in white-only areas.  Police (who were always white) could demand to see non-whites' passbooks at any time, arbitrarily strike out the holder's permission to be in a white-only area, and then promptly arrest, fine, and imprison the holder for being present in a white-only area without permission. Some existing districts (such as Sophiatown in Johannesburg and District Six in Cape Town) were either too prosperous or too racially integrated from the government's perspective; they were summarily re-designated as white-only and all non-white residents were summarily evicted. \n\nAs the Cold War took shape in the early 1950s, the NP attempted to justify apartheid as necessary in the face of an alleged communist conspiracy to take over South Africa. The NP's focus on anti-communist propaganda was particularly ironic, as South Africa under the NP ended up with a much higher level of state control of the economy than the vast majority of anti-communist countries.  Many state-owned enterprises were later spun off into private enterprises after the end of apartheid. \n\nIn order to fight communism, state censorship was omnipresent, and the freedoms of speech, press, and public assembly were all vigorously suppressed. The technology of television was also banned and suppressed. It was reluctantly allowed into the country only after South Africa suffered the embarrassment of being one of the few countries where the November 1969 moon landing could not be watched live, even by its wealthiest citizens. \n\nHowever, apartheid was never one unified program. It existed in a state of constant tension between those Afrikaners who envisioned most of the country completely purged of non-whites and those Afrikaners (particularly businessmen) who recognized that it would take decades, if not centuries, to either create enough white children or import enough white immigrants to provide a sufficiently large labour force which would make up for the eventual long-term expulsion of all non-whites from South Africa's cities.  \n\nAs a result, on the one hand, all non-whites were designated as citizens of one of several quasi-sovereign national \"homelands\" (known as \"bantustans\") which were intended to be like Native American reservations in the United States, but on a much larger scale.  (Like Native American reservations, the homelands were usually allocated to the worst-quality land, while whites were allocated the best-quality land.)  On the other hand, the government forcibly relocated urban non-whites into areas on the edges of South Africa's cities (Cape Flats near Cape Town and Soweto near Johannesburg) where whites could use them as cheap labour. Those non-whites, then, had to put up with lengthy, miserable commutes on overcrowded trains and taxi vans into white-controlled areas (where their permission to remain could be revoked at any time) and work for wages that were a pittance compared to those available to similarly qualified white employees. \n\nThe African National Congress (ANC) initially resisted all these developments with non-violent protests. The ANC managed to score a handful of legal victories during the 1950s, as the South African judiciary still had many fair-minded judges appointed by the previous United Party.  Many of those judges still respected the rule of law and were willing to give a fair hearing to a well-reasoned legal argument even if they personally despised the defendant on account of his race.  \n\nIn 1960, a breakaway group of former ANC members formed the Pan Africanist Congress under the leadership of Robert Sobukwe, who attempted to organize protests against the hated pass laws. An outnumbered police unit panicked and fired into a crowd of unarmed protesters at Sharpeville. As a result, the NP declared a state of emergency and used it as an excuse to tear up the remaining shreds of the rule of law in South Africa. ANC leadership correctly recognized that the ANC would soon be banned (along with all other anti-apartheid political organizations) and would no longer be able to openly operate within South Africa as a political organization.  Therefore, the ANC founded an armed wing called ''Umkhonto we Sizwe'' (\"Spear of the Nation\", known as MK for short) to implement a program of domestic sabotage and terrorism. In 1963, a police raid at a farm in Rivonia enabled the government to seize enough evidence to arrest and convict a large number of ANC and MK leaders (including Nelson Mandela) in 1964, at what was later known as the \"Rivonia Trial.\"  \n\nThe apartheid regime's power peaked during the late 1960s and 1970s, after the anti-apartheid resistance had been brutally crushed. During that era, South Africa's white citizens enjoyed the fruits of strong economic growth and rapid infrastructure development in the form of the highest-quality lifestyle in Africa (that is, nearly equivalent to First World living standards), and were content to keep quiet and not ask too many questions.  \n\nThe ANC and MK quietly rebuilt themselves in exile, trained numerous operatives, and began to launch new domestic uprisings and terrorist attacks. At the same time, the black majority's frustration with their miserable situation continued to build.  It finally boiled over and exploded in the form of the famous Soweto uprising of 1976, followed by the Black Consciousness Movement. South Africa's prisons were soon flooded with a new generation of BCM radicals. Ironically, BCM caused the government to shift to a more lenient approach towards the older generation of ANC-MK activists, because it had its hands full with suppressing BCM activists. \n\nBy the early 1980s, the United States had finally overcome its own historical experiments with white supremacy and racial segregation, and was no longer willing to tolerate the apartheid regime. Thus, the international community belatedly began to turn against South Africa, by implementing strict weapons and trade embargoes. South Africa was banned from the Olympic Games and most other international sporting competitions. Many international celebrities, such as Bruce Springsteen, noisily boycotted South Africa, composed protest songs attacking South Africa, and harshly criticized any performer or athlete who was willing to perform or play in South Africa. \n\nSimultaneously, by the late 1980s, many white moderates began to recognize that change was inevitable. International sanctions and internal strife were beginning to take a severe toll on South Africa.  White moderates recognized that white supremacy could not be indefinitely maintained through the naked use of force, and allowing black rage to keep building would only result in an even more explosive endgame similar to what had happened in many other African countries (e.g., Algeria). On the ANC side, black moderates had already long recognized that taking revenge by expelling all whites from South Africa was neither just nor wise.  (In his famous speech at his 1964 trial, Nelson Mandela noted that he had fought both \"white domination\" ''and'' \"black domination.\") They recognized that for better or worse, South Africa was the only home which most white South Africans had ever known, and any peaceful resolution would have to accommodate that fact.  From a purely pragmatic perspective, the white monopolization of the best educational resources had resulted in a situation where the vast majority of qualified executives and professionals capable of operating a modern industrialized economy were white.  Summarily expelling those professionals and executives risked creating a huge economic disaster (as had occurred in many other African countries during the decolonization process), and would do nothing to improve the long-term prospects of the black majority.  \n\nAccordingly, white moderates within the security service and the National Party itself began to quietly reach out to ANC leaders to find common ground and negotiate how to dismantle apartheid. The actual process began with the freeing of political prisoners in 1990. The freeing of Nelson Mandela from Victor Verster Prison near Cape Town on 11 February 1990 was covered live on television around the world. \n\nPolitical violence worsened badly during the early 1990s as extremists of all kinds and races attempted to derail the peace talks at the Convention for a Democratic South Africa (CODESA) in favour of their own deranged visions of the future of South Africa. Thousands of people were murdered in riots or terrorist attacks.  Regardless, in 1992, 73% of the voting white population voted in a referendum in support of the abolishment of apartheid. \n\nDuring this terrible and dangerous period, the CODESA negotiations became gridlocked and stalled numerous times; then the parties backed off and tried a new process on 1 April 1993 called the Multi-Party Negotiating Process (MPNP). A few days later, the assassination of popular political activist Chris Hani on 10 April 1993 threatened to push South Africa to the brink of civil war.  That night, Mandela gave a televised speech which was later seen in retrospect as \"presidential\" in terms of his ability to calm the country's severe racial tensions.  In turn, Hani's death became a catalyst for pushing all sides back to the bargaining table.  \n\nThe MPNP ultimately led to the enactment of a new interim constitution at the end of 1993 and then the nation's first truly democratic election in April 1994, in which all SA adult citizens were allowed to vote regardless of their ethnic and cultural background. Former political prisoner Nelson Mandela was selected as the country's first democratically elected president. The ANC won a 63% majority and proceeded to form a Government of National Unity with the NP. \n\nAs part of the peace talks, it was recognized that once apartheid was abolished, it made no sense to allow its opponents to continue to maintain their own paramilitary resistance forces.  Accordingly, a process was set up in 1994 by which the various guerilla units (including MK units), as well as bantustan defence units, were all integrated into the South African Defence Force, which subsequently became the South African National Defence Force.\n\nIn 1996, the interim constitution was replaced with South Africa's current constitution. The ANC solidified its control over the electorate in subsequent years, with the exception of some opposition strongholds. The National Party subsequently withered away. After a failed re-branding and a collapsed deal with the opposition Democratic Party, now the Democratic Alliance, they merged with the ANC.\n\n===Place names===\nMany region, city, street and building names in [[South Africa]] have been changed several times after the end of apartheid. Some of them are still being changed today. These changes can sometimes lead to confusion as many of the new names are not yet well known. \n\nThe underlying problem is that the 1994 Government of National Unity immediately began changing names so that they would be neutral and non-offensive.  This included the principle that if at all possible, places should not be named for particular persons so as to avoid offending any particular racial group.  For example, Jan Smuts International Airport became Johannesburg International Airport.  \n\nAfter the ANC assumed full control of the government in 2004, the ANC reversed course and moved towards a policy of changing European names to African names, and to name places after leaders of the apartheid resistance. For example, under the new policy, ''Johannesburg International Airport'' became ''O. R. Tambo International Airport'' in October 2006, after the ANC leader who was dispatched overseas to keep the organization alive in exile. \n\nThis travel guide will use the official new names, but also mention the previous names where possible.\n\n===Climate===\n{{Climate\n|units=Metric|\njanlow=23|feblow=23|marlow=21|aprlow=17|maylow=12|junlow=8|jullow=8|auglow=11|seplow=16|octlow=18|novlow=21|declow=22|\njanhigh=30|febhigh=30|marhigh=30|aprhigh=27|mayhigh=25|junhigh=24|julhigh=23|aughigh=26|sephigh=29|octhigh=29|novhigh=32|dechigh=30\n|janprecip=166|febprecip=100|marprecip=39|aprprecip=35|mayprecip=9|junprecip=3|julprecip=16|augprecip=16|sepprecip=24|octprecip=49|novprecip=114|decprecip=112\n\n}}\n\nThe climate in South Africa ranges from desert and semi-desert in the north west of the country to sub-tropical on the eastern coastline. The rainy season for most of the country is in the summer, except in the [[Western Cape]] where the rains come in the winter. Rainfall in the [[Eastern Cape]] is distributed evenly throughout the year. Winter temperatures hover around zero, summers can be very hot, in excess of 35° Celsius (95°F)  in some places.\n\nThe [http://www.weathersa.co.za/ South African Weather Service] provides up-to-date weather information, forecasts and satellite imaging. SAWS has also implemented a network of high-resolution Doppler radars to improve the quality of its forecasts.  Unfortunately, SAWS radar imaging is not syndicated to commercial news services and is thus difficult to find online.\n\n===Public Holidays===\nThe public holidays in South Africa are:\n* '''New Year's Day''' (1 January)\n* '''Human Rights Day''' (21 March)\n* '''Easter weekend''' (4-day long weekend in March/April) - Consisting of \"Good Friday\", \"Easter Saturday\", \"Easter Sunday\", and \"Easter Monday\", the dates are set according to the Western Christian tradition.\n* '''Freedom Day''' (27 April)\n* '''Workers Day''' (1 May)\n* '''Youth Day''' (16 June)\n* '''Woman's Day''' (9 August)\n* '''Heritage Day''' (24 September)\n* '''Day of Reconciliation''' (16 December) - ''see [[Battlefields (KwaZulu-Natal)#See|Bloodriver]]''.\n* '''Christmas Day''' (25 December)\n* '''Day of Goodwill''' (26 December) - Often referred to as 'Boxing Day'.\n''If a public holiday falls on a Sunday, then the Monday following will be a holiday''\n\n[http://www.gov.za/aboutsa/schoolcal.htm School holidays] occur early December to middle January, early in April, middle June to middle July and late September. Most South Africans go on leave during these times and accommodation will be harder to find.\n\n[[image:Flower-Protea01.jpg|thumb|upright=1.3|The Protea is the national flower of South Africa]]\n\n===Tourism Offices===\nSouth African Tourism operates a number of offices in other countries. You might wish to contact the office in your country for any additional information or assistance\n* <listing name=\"Australia\" alt=\"\" address=\"Level 1, 117 York St, Sydney\" directions=\"\" phone=\"+61 2 9261-5000\" email=\"info.au@southafrica.net\" hours=\"\" price=\"\" lat=\"\" long=\"\" fax=\"+61 2 9261-2000\" email=\"info.au@southafrica.net\"></listing>\n* <listing name=\"France\" address=\"61 Rue La Boetie, Paris\" phone=\"+33 1 456-10197\" fax=\"+33 1 456-10196\" email=\"info.fr@southafrica.net\"></listing>\n* <listing name=\"Germany\" address=\"Friedensstrasse 6-10, Frankfurt\" phone=\"+49 69 929-1290\" fax=\"+49 69 28-0950\" email=\"info.de@southafrica.net\"></listing>\n* <listing name=\"Italy\" alt=\"\" address=\"Via XX Settembre 24, 3F, Milano\" directions=\"\" phone=\"+ 02 4391-1765\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\" fax=\"+39 02 4391-1158\" email=\"info.it@southafrica.net\"></listing>\n* <listing name=\"Japan\" address=\"Akasaka Lions Bldg, 1-1-2 Moto Akasaka, Minato-Ku, Tokyo\" phone=\"+81 33 478-7601\" fax=\"+81 33 478-7605\" email=\"info@southafricantourism.or.jp\"></listing>\n* <listing name=\"Netherlands\" address=\" Jozef Israëlskade 48 A, Amsterdam\" phone=\"+31 20 471-3181 \" fax=\"+31 20 662-9761\" email=\"info.nl@southafrica.net\"></listing>\n* <listing name=\"United Kingdom\" address=\" No 5 & 6 Alt Grove, Wimbledon, London\" phone=\"+44 20 8971-9350\" fax=\"+44 20 8944-6705\" email=\"info.uk@southafrica.net\"></listing>\n* <listing name=\"United States\" alt=\"\" address=\"500 Fifth Ave, 20F, Ste 2040, New York\" directions=\"\" phone=\"+1 212 730-0000\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\" fax=\"+1 212 764-1980\" email=\"info.us@southafrica.net\"></listing>\n\n==Regions==\nSouth Africa is divided into 9 provinces, they are:\n\n{{Regionlist\n| regionmap=South_Africa-Regions_map.png\n| regionmaptext=Regions of South Africa\n| regionmapsize=400px\n\n| region1name=[[Gauteng]]\n| region1color=#d5a90b\n| region1items=\n| region1description='''Pretoria''' the administrative capital of the country. [[Johannesburg]] is the seat the provincial government, also the economic heart of [[Africa]] and the most common entry point into [[Southern Africa]].\n\n| region2name=[[Western Cape]]\n| region2color=#6ca26c\n| region2items=\n| region2description='''Cape Town''', the mother city, the legislative capital and seat of Parliament, with famous landmarks as [[Table Mountain]] and the [[Cape of Good Hope]]. The [[Cape Winelands|winelands]] near [[Stellenbosch]], the Whale Coast along the [[Overberg]], [[Cape Agulhas|Agulhas]] where the Atlantic and Indian Ocean meet and the Cape Floral Region. The [[Garden Route]], one of the top destinations, running along the Southern Coast from [[Mossel Bay]] to [[Port Elizabeth]], with cities like [[Knysna]] and ostrich capital [[Oudtshoorn]].\n\n| region3name=[[Eastern Cape]]\n| region3color=#e6c997\n| region3items=\n| region3description=The remainder of the [[Garden Route]], known as the [[Tsitsikamma]]. The former homelands, the [[Wild Coast]], spectacular coastlines without the tourist crowd. Superb beaches in [[Port Elizabeth]], [[East London]] and [[Jeffreys Bay]], the surfing mecca of [[South Africa]]. Great parks like [[Addo Elephant National Park]] and [[Tsitsikamma National Park]].\n\n| region4name=[[Northern Cape]]\n| region4color=#8e6c96\n| region4items=\n| region4description=Capital '''[[Kimberley (South Africa)|Kimberley]]''', famous for its diamonds and the \"Big Hole\". Biggest province with fewest people, [[Upington]] is the second big city, a good base when exploring the Kalahari desert, [[Kgalagadi Transfrontier Park]] and the [[Augrabies|Augrabies Falls]] on the Orange River. Also [[Ai-Ais Richtersveld Transfrontier Park|Ai-Ais/Richtersveld Transfrontier Park]] and the semi-desert [[Karoo]].\n\n| region5name=[[Free State]]\n| region5color=#c375a0\n| region5items=\n| region5description=Capital '''Bloemfontein''' which also hosts the Supreme Court of Appeal, the highest court in non-constitutional matters (the Constitutional Court is in Johannesburg since 1994). The world heritage site [[Vredefort|Vredefort Dome]], remnants of the largest and oldest meteorite impact crater. \n\n| region6name=[[KwaZulu-Natal]]\n| region6color=#da8451\n| region6items=\n| region6description='''Durban''', the largest city in the province and third largest in South Africa and popular coastal holiday destination for South Africans. The [[Ukhahlamba Drakensberg Park|Drakensberg mountain range]], if you like hiking and also the [[Royal Natal National Park | Tugela Falls]], the world's second highest waterfall. \n\n| region7name=[[North West Province|North West]]\n| region7color=#5fb388\n| region7items=\n| region7description='''Rustenburg''', famous for [[Sun City (South Africa)|Sun City ]] and [[Pilanesberg National Park|Pilanesberg Game Reserve]].\n\n| region8name=[[Mpumalanga]]\n| region8color=#d06666\n| region8items=\n| region8description=Capital '''Nelspruit''', gateway to [[Mozambique]] and southern section of the [[Kruger National Park]]. The Drakensberg Escarpment with the [[Blyde River Canyon]] is the third largest Canyon in the world.\n\n| region9name=[[Limpopo]]\n| region9color=#80afdc\n| region9items=\n| region9description=Capital '''Polokwane''' (formally known as Pietersburg) a good jump off point for visits to the northern parts of the [[Kruger National Park]] and [[Zimbabwe]]. \n}}\n\n===Territories===\n* [[Marion Island]]\n* [[Marion Island |Prince Edward Islands]]\n\n==Cities==\n*[[Pretoria]]  &ndash; The administrative capital of South Africa\n \n*[[Bloemfontein]] &ndash; Location of the Supreme Court of Appeal, the highest court in non-constitutional matters. The Constitutional Court in Johannesburg became the highest court in constitutional matters in 1994.\n\n*[[Cape Town]] &ndash; The legislative capital and seat of Parliament. A world-class city named for its proximity to the Cape of Good Hope. Also within a stone's throw of South Africa's [[Cape Winelands|winelands]]. One of the most beautiful cities in the world, nestled between the sea and Table Mountain, it is a popular summer destination by both domestic tourists and those from abroad.\n \t\n*[[Durban]] &ndash; Largest city in [[KwaZulu-Natal]], third largest in South Africa and popular coastal holiday destination for South Africans.\n \n*[[Newcastle (KwaZulu-Natal)| Newcastle]] &ndash; 3rd largest city in [[KwaZulu-Natal]], one of the large regional cities in South Africa and Capital of Northern KZN. Famous for Steel Production, Coal Mining, Heavy Industry and is South Africa's Textile Industry Capital.\n\n*[[Johannesburg]] &ndash; The economic heart of [[Africa]] and the most common entry point into [[Southern Africa]].\n\n*[[Kimberley (South Africa)|Kimberley]] -- Capital of the [[Northern Cape]] Province. Famous for its diamonds and \"Big Hole\".\n \n*[[Polokwane]] &ndash; Capital of [[Limpopo]] (''formerly known as Pietersburg'') and a good jump off point for visits to the northern parts of the [[Kruger National Park]] and [[Zimbabwe]].\n \n*[[Port Elizabeth]] &ndash; Coastal city in the [[Eastern Cape]] with [[Addo Elephant National Park]] located close by.\n\n*[[Upington]] &ndash; Located in the arid [[Northern Cape]] province, this city is a good base when exploring the Kalahari desert and the many national parks located in the [[Northern Cape]].\n\n==Other destinations==\n\n===National Parks===\n[[Image:South_Africa-Mpumalanga-Rhino02.jpg|thumb|Rhino on a private reserve in Mpumalanga]]\nSouth Africa is a paradise for anyone interested in natural history. A wide range of species (some potentially dangerous) may be encountered in parks, farms, private reserves and even on the roads. \n* The [[Kruger National Park]] is exceptionally well managed and a favourite tourist destination.\n* [[Kgalagadi Transfrontier Park]] in the heart of the Kalahari desert with wide open spaces and hordes of games including the majestic 'Gemsbok'. This is the first park in [[Africa]] to cross political borders.\n* There are also a large number of smaller parks, like the [[Hluhluwe-Umfolozi Park]], [[Addo Elephant National Park]], [[Pilanesberg National Park]] or the [[iSimangaliso Wetland Park]].\n\nSee [[African_flora_and_fauna | African Flora and Fauna]] and [[African_National_Parks#South_Africa|South African National Parks]] for additional information. There are hiking trails available in almost all the parks and around geographical places of interest, [[Hiking in South Africa]] contains information on those.\n\n===[[UNESCO_World_Heritage_List#South_Africa|UNESCO World Heritage Sites]]===\n* The [[Cradle of Humankind]], [http://www.cradleofhumankind.co.za/], near [[Johannesburg]] is a must see for anyone interested in where it all started.A large collection of caves rich in hominid and advanced ape fossils.\n* [[Robben Island]] just off the coast from [[Cape Town]] where Nelson Mandela was imprisoned for many years.\n* The Cape Floral Region in the [[Western Cape]] \n* [[iSimangaliso Wetland Park]], [http://www.kznwildlife.com/lakes_dest.htm]\n* Mapungubwe Kingdom, [http://www.mapungubwe.com/] in [[Limpopo (South Africa)|Limpopo]]\n* [[Ukhahlamba Drakensberg Park]], [http://www.kznwildlife.com/mountains_dest.htm], for its landscape, biodiversity and rock art.\n* [[Vredefort]] Dome, remnants of the largest and oldest meteorite impact crater.\n\n==Get in==\n{{VisaRestriction|Due to the current ebola virus outbreak, entry will be refused to citizens of [[Guinea]], [[Liberia]], and [[Sierra Leone]].   Nationals of those countries who arrived via [[Botswana]], [[Ethiopia]], [[Kenya]], [[Mozambique]], [[Namibia]], [[Nigeria]], [[Zambia]], and [[Zimbabwe]] will also be refused entry.  As well as those who recently visited the West African countries mentioned (except Nigeria).}}\n\n===Visas===\nThe following nationalities do '''not''' need a visa for a stay of '''90 days or less''':(The new [https://www.southafricavisa.com/ South Africa eVisa] will soon be available):\n\n[[Andorra]], [[Argentina]], [[Australia]], [[Austria]], [[Belgium]], [[Botswana]], [[Brazil]], [[Canada]], [[Chile]], [[Czech Republic]], [[Denmark]], [[Ecuador]], [[Finland]], [[France]], [[Germany]], [[Greece]], [[Iceland]], [[Ireland]], [[Israel]], [[Italy]], [[Jamaica]], [[Japan]], [[Liechtenstein]], [[Luxembourg]], [[Malta]], [[Monaco]], [[Mozambique]], [[Namibia]], the [[Netherlands]], [[Norway]], [[Panama]], [[Paraguay]], [[Portugal]], [[Russia]], [[Saint Vincent and the Grenadines]], [[San Marino]], [[Singapore]], [[Spain]], [[Sweden]], [[Switzerland]], [[Tanzania]] (90 days per 1 year), [[Trinidad and Tobago]], [[United Kingdom]] (British Citizens, British Overseas Territories citizens and British Nationals (Overseas) only), [[United States]], [[Uruguay]], [[Venezuela]], [[Zambia]] (90 days per 1 year) and [[Zimbabwe]].\n\nThe following nationalities do '''not''' need a visa for a stay of '''30 days or less''':\n[[Angola]], [[Antigua and Barbuda]], [[Bahamas]], [[Barbados]], [[Belize]], [[Benin]], [[Bolivia]], [[Cape Verde]], [[Costa Rica]], [[Cyprus]], [[Gabon]], [[Guyana]], [[Hong Kong]] (BNO passports ''or'' SAR passports), [[Hungary]], [[Jordan]], [[Lesotho]], [[Macau]], [[Malawi]], [[Malaysia]], [[Maldives]], [[Mauritius]], [[Peru]], [[Poland]], [[Seychelles]], [[South Korea]], [[Swaziland]], [[Thailand]] and [[Turkey]].\n\nImportant note for travelers to surrounding countries and people intending to do visa runs:\n\nSection 11(5) of the Immigration Act states that if you leave South Africa and come back without first going back to your country of residence, then you will not be reissued the above number of days, but simply the remainder given at your first entry.  So if you enter on 7 March, and your passport is stamped to be valid for staying in South Africa until 6 June, then any re-entries to South Africa before 6 June (in theory even if you enter on 5 June), will only be stamped valid for stay until 6 June.  If you enter after 6 June, you get only 7 days in the country.  It is not clear whether you can do multiple visa runs to neighbouring countries for an additional 7 days each after this, and a number of border posts contacted give conflicting answers in this regard and even Home Affairs Head Office cannot give conclusive answers in this regard.  So if you do want to try this, speak to a supervisor at the border post first before attempting this and see if this will work, and then re-enter through that same border at a time when that same supervisor is on duty.\n\nIt would appear that this rule was created to discourage people working in South Africa after admission as a tourist (or wanting to do tourism for extended periods of time), in which case it makes sense, but the unfortunate (and likely unintended) consequence of this, is if you for example fly into Johannesburg, spend one night there, fly to Zambia to visit Victoria Falls and then travel on in Botswana and Namibia, etc. for three months (or one month in the case of nationals entitled to 30 days stay only), come back to South Africa (especially over a land border where this is more likely to be noticed), you will only be given 7 days stay in South Africa, as \"the 90 (or 30) days have expired\", despite you having only been in South Africa for 1 day.  This should not impact most short-term visitors from for example Europe coming for a month holiday, but it is important to note for overlanders and long-term travellers who do not return to their country of residence regularly.\n\nThe above rule is not applicable to nationals of countries sharing a border with South Africa or to nationals requiring visas to visit South Africa (in which case the rules of the visa apply).\n\nIf you overstay the seven days before exit (or for that matter overstay any period of stay granted), you will be banned from re-entry to South Africa (for 1 year if overstay is less than 30 days, or up to 5 years if more).  If banned, you can/should petition Home Affairs to waive the ban, which may be done via E-mail - details on their website.\n\nCitizens of India have to apply for tourist visas but the visa is issued gratis. The same applies to South Africans visiting India. This is because of the reciprocity that India shares with a lot of countries like Argentina, Uruguay and Mongolia.\n\nDo not show up without a visa if you are required to have one.  Visas cannot and will not be issued at ports of entry. If needed, you can extend your visa in South Africa. With an extension the total amount of time you are allowed to stay is 6 months. Additional information as well as Visa application forms can be found at the [http://www.home-affairs.gov.za/ Department of Home Affairs] ☎ +27 12 810 8911.\n\nThe Department of Home Affairs is notoriously inefficient and may not always apply rules uniformly or know how to apply rules for situations that are out of the ordinary, so make sure to apply for visas and visa extensions as early as possible.\n\nMake sure you have one blank page (two if you require a visa) and that your passport is valid for at least 30 days after your intended date of departure, or you will be sent back!  Most international airlines that serve South Africa now check for these specific issues at check-in.  They will not let you check-in or board your flight if your passport does not meet both of these strict requirements, because they know from painful experience that you will be summarily denied entry. \n\nIn addition, if you do not have a return ticket (knowing the reservation number is enough), you will need to pay a refundable deposit. Be wary of arriving with a damaged passport as new security measures might trip up your entry.\n\n===By plane===\nSouth Africa has 10 international airports, the two major ones being [[Air_travel_in_South_Africa#Cape_Town_International|Cape Town International]] and [[Air_travel_in_South_Africa#OR_Tambo_International|OR Tambo International Airport]] in [[Johannesburg]].Durban International Airport is the third biggest airport. Regular Flights from and to: [[Blantyre]], [[Cairo]], [[Gaborone]], [[Dar es Salaam]], [[Harare]], [[Lilongwe]], [[Livingstone]], [[Luanda]], [[Lusaka]], [[Kinshasa]], [[Maputo]], [[Manzini]], [[Maun]], [[Mauritius]], [[Nairobi]], [[Victoria Falls]] and [[Windhoek]]. \n\nDirect flights also arrive from major [[Europe|European]] centres, including: [[Amsterdam]], [[Athens]], [[Madrid]], [[London]], [[Paris]], [[Istanbul]], [[Frankfurt]], [[Munich]], [[Zurich]] and [[Lisbon]]. There are also direct flights from [[Abu Dhabi]], [[Dubai]], [[Doha]], [[New York City|New York]], [[Atlanta]], [[Washington, D.C.]], [[Buenos Aires]], [[Mumbai]], [[Hong Kong]], [[Kuala Lumpur]], [[Sao Paulo]], [[Singapore]], [[Sydney]]  and [[Perth (Western Australia)|Perth]]. \nYou may also want to have a look at [[Discount airlines in Africa]].\n\nSee [[Air travel in South Africa]] for detailed information.\nNote: Baggage theft at airports is common especially at OR Tambo International Airport in Johannesburg so avoid putting valuables such as jewellery and expensive devices in your main luggage if you can and place them in your hand luggage.\n\n===By car===\nShould you be entering from one of the other countries in [[Southern Africa]] you might want to do so by car. South Africa operates a number of land border posts between itself and immediately neighbouring countries. The more commonly used ones are:\n\n'''[[Botswana]] border'''\n* <listing name=\"Skilpadsnek\" phone=\"+27 18 366 1469\" directions=\"On the N4, 54km (34&nbsp;mi) from Zeerust\" hours=\"06:00-22:00\"></listing>\n\n'''[[Lesotho]] border'''\n* <listing name=\"Maseru Bridge\" phone=\"+27 51 924 4004\" directions=\"15km (9 mi) from Ladybrand on the N8 towards Maseru\" hours=\"Open 24 hours\"></listing>\n* <listing name=\"Ficksburg Bridge\" phone=\"+27 51 933 2760\" directions=\"Just outside Ficksburg\" hours=\"Open 24 hours\"></listing>\n* <listing name=\"Sani Pass\" phone=\"+27 51 430 3664\" directions=\"In the KwaZulu-Natal Drakensberg park\" hours=\"08:00-16:00\"></listing>\n\n'''[[Mozambique]] border'''\n* <listing name=\"Lebombo\" phone=\"+27 13 790 7203\" directions=\"On the N4 btwn Nelspruit and Maputo\" hours=\"06:00-22:00\"></listing>\n* <listing name=\"Kosi Bay\" phone=\"+27 35 592 0251\" directions=\"R22 btwn Hluhluwe and Ponta do Ouro\" hours=\"08:00-16:00\"></listing>\n\n'''[[Namibia]] border'''\n* <listing name=\"Nakop\" phone=\"+27 054 571 0008\" directions=\"132km (82 mi) from Upington on the N10 towards Ariamsvlei\" hours=\"Open 24 hours\"></listing>\n* <listing name=\"Vioolsdrift\" phone=\"+27 27 761-8760\" directions=\"On the N7 N of Springbok\" hours=\"Open 24 hours\"></listing>\n\n'''[[Swaziland]] border'''\n* <listing name=\"Oshoek\" alt=\"\" address=\"\" directions=\"120km (75 mi) from Ermelo on the N17 towards Mbabane\" phone=\"+27 17 882 0138\" url=\"\" hours=\"07:00-12:00\" price=\"\" lat=\"\" long=\"\"></listing>\n\n'''[[Zimbabwe]] border'''\n* <listing name=\"Beit Bridge\"  phone=\"+27 15 530-0070\" directions=\"On N1 approximately 16km (10 mi) N of Messina\" hours=\"Open 24 hours\"></listing>\n\nOpen times are often extended during South African holidays..\nFor a full list of entry ports or any additional information see the [http://www.rsaborders.co.za/ South African Border Information Service]  or contact them on +27 86 026 7337.\n\n===By boat===\nMost of the larger cruise lines, such as Princess Cruises [http://www.princess.com/ports/CPT_X.html]  offer [[Cape Town]] as one of their destinations, but you can also try something different\n* <listing name=\"RMS St Helena\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"http://www.rms-st-helena.com/\" hours=\"\" price=\"\" lat=\"\" long=\"\" phone=\"+44 20 7575 6480\">This passenger/cargo ship is the last working Royal Mail Ship and stops at Cape Town on its way to [[Saint Helena (island)|St Helena]].</listing>\n\n==Get around==\n\n===By plane===\nSouth Africa has a well established domestic air travel infrastructure with links between all major centres. There are numerous local airlines you can use to get around the country. Use a flight comparison tool [http://cheapflights4u.co.za] to compare rates and find a good deal for you.\n\nSee [[Air travel in South Africa]] for detailed information.\n\n===By road===\nHail taxis are generally not available in South Africa and to get a meter taxi you need to walk to a public rank or pre-book a private taxi service through a call centre which usually gives the price of your trip. \n\n[[image:RSA_Tortoise_Sign.jpg|thumb|You might be unfamiliar with road signs.]]\n[[Image:South Africa-Tollroad SOS Phone01.jpg|thumb|Toll roads have SOS phones at regular intervals]]\n\nAll measurements use the metric system; distances on road signs are in kilometres (1.6 km is about 1 mile) and fuel is sold by the litre (3.8 litres=1 US gallon).\n\nTo acquire a car in South Africa, there are basically three options: you can '''hire''' a car (\"car rental\" in North American English), '''buy''' one or use the so-called '''buy-back''' option. Hiring a car is fairly easy and bookings can be made online and in all major cities, although you can get better rates by calling some of the smaller operators. Buying a car takes a bit more work (''Roadworthy license, registering the car, insurance''), but there is a lively used car market in South Africa. The third option is a combination of both, as you buy a car with a guarantee that the rental company will buy-back your car at the end of the contract.\n\nMost cars in South Africa have manual transmissions and the selection of second-hand automatics may be limited and definitely pricier than a manual. Gear shift is operated using the left hand while the foot pedals are, from left to right: clutch, brake, accelerator. \n\nRenting a car in South Africa can range anywhere from USD15 per day and upwards of USD200 per day depending on the car group, location and availability. The major rental agencies are Avis, Bidvest, Budget Car Hire, Europcar, Hertz, Tempest Car Hire, Thrifty, Dollar, [http://www.exequecarrental.co.za/ Long Term Car Rental] and [http://www.vineyardcarhire.co.za/ Luxury Car Rental]. The car rental agencies maintain branches around South Africa including smaller towns and game reserves and national parks and perhaps most popularly found at airport terminals.  \n\nMost rental fleets in South Africa largely have manual transmissions and vehicles with automatic transmission are limited and tend to be much more expensive.  Renting a vehicle with complete loss damage waiver (as is available in the United States) is expensive and hard to find; most agencies will provide only reduced waiver ceilings or waivers for certain types of damage such as to the glass and tires.  If you plan to drive on dirt roads in South Africa, check with the rental agency about (1) whether that is authorized for the vehicle you intend to rent and (2) do your own research into whether the vehicle(s) offered are adequate for expected driving conditions.\n\nIf however you don't have a driving licence or are uncomfortable with driving yourself around then you can hire a pre-booked taxi service or a chauffeur driver from the various service providers in this industry.\n\n====Rules of the road====\nRoad traffic in South Africa (and its neighbouring countries) drives on the left.  \n\nSouth African vehicles are right hand drive, but the levers on the steering column are not reversed (as is sometimes the case in Australia and New Zealand). Just like with most U.S. and UK vehicles, Americans, Canadians, and visitors from the majority of countries that drive on the right can almost always safely assume that the left lever is the indicator lever (headlights and turn signals) and the right lever controls windscreen wipers. However, many other controls will be necessarily reversed and must be operated with the opposite hand, especially the gearshift and console controls (such as radio). \n\nMake sure you familiarize yourself with and understand [http://www.transport.gov.za/library/legislation/roadtraffic/index.html South African road signs]. South Africa previously used an unusual system of road signs which combined American typefaces with English and German design elements. This was problematic as American typefaces were not designed to accommodate the long place names typical of Afrikaans. The result was that place names were often abbreviated or hyphenated and broken across two lines to fit them on signs. Since 1994, South Africa has been implementing a system of road signs almost identical to Germany's system, with suitable modifications for local conditions (German, like Afrikaans, also has long place names). However, older signs may still be in use.  \n\nA special kind of intersection very commonly found in both city and highway driving is the roundabout (referred to by locals as a 'four way stop' when talking with foreigners who have roundabouts that follow different traffic habits) where the car that stops first has right of way. Outside of the country the rule may be the car on the left or right may have the right-of-way, but in South Africa, which car gets to proceeds first is based upon timing -- not spatial arrangement. \n\nSections of the nation's major roadways, such as the N1, are two-lane at times. With some vehicles having a max speed of 80 kmh, some drivers may display signs of aggressive behavior and attempt to pass even when it may be prohibited during that section. Thus it is always good to remain alert, especially when driving at high speeds. Yellow lane driving is common, whereas a vehicle in front may use the shoulder to let a speedier vehicle pass. Once passed, it is customary in South Africa to turn one's hazard lights on for a few seconds to thank the passed vehicle, while that driver will reciprocate with a quick flashing of their headlights. Some vehicles, such as fuel trucks, are prohibited from yellow line driving and will be designated with a sign on the rear of the vehicle. Yellow line driving is not always practiced by drivers, so if wanting to pass, a speedier driver may need to wait until multiple lanes are available or a dotted line (passing zone) is legal. Slower moving vehicles may have a speed limit posted on the tail of the vehicle, designated with a yellow circle and number in the middle. For example, trucks may notify fellow drivers they are prohibited from driving over 80 kmh, or a commuter van may have a self-imposed limit of 100 kmh. \n\n'''Left (or right) turns on red''' at traffic lights are illegal. You will, however, find traffic lights and 'four way stops' that have an accompanying yield sign explicitly permitting a left turn.\n\nThe '''wearing of seat belts is compulsory'''. The front seat occupants of a car are required to wear seat belts while travelling, and for your own safety, it is recommended that those in the rear seats do so as well. If you are caught without that, you will be subjected to a fine. \n\nThe '''use of hand-held cell (mobile) phones whilst in control of a vehicle is illegal'''. If you need to speak on your cell phone, use either a vehicle phone attachment or a hands-free kit. Or even better (and safer), pull off the road and stop. NOTE: only pull off the road at safe places, such as a rest area (denoted with a sign with a tree on it) with picnic tables or a petrol station. Pulling over and stopping along roads can be dangerous. The majority of petrol stations are open 24/7.\n\n====Safety====\nSouth Africa has a high rate of traffic accidents.  It regularly ranks somewhere between 8 to 11 among the countries with the highest per-capita traffic-related death rates in the world (31.9 killed per 100,000 per year as of 2011). You should at all times exercise extreme caution when driving, especially at night in urban areas. Watch out for unsafe drivers (minibus taxis), poor lighting, cyclists (many of whom seem not to know about the \"drive on the left\" rule) and pedestrians (who are the cause of many accidents, especially at night). South Africans pedestrians in general tend to be rather aggressive, like pedestrians from some Southern European countries, and you must be alert for pedestrians who will step into traffic and expect you to stop or swerve for them.  \n\nYou will also encounter a very large number of people walking along the freeways or running across them simply because that is the fastest route on foot to where they want to go and they cannot afford a car, taxi, or minibus to take them there. Look out for South Africa's notorious taxi and minibus drivers, who will sometimes even stop on freeways to pick up or drop off fares.  \n\nWhen driving outside of the major cities, you will often encounter animals, wild and domestic, in or near the roadway. The locals tend to herd their cattle and goats near the road. If you see an animal on or by the road, slow down, as they are unpredictable. '''Do not stop to feed wild animals!'''\n\nShould you find yourself waiting at a red traffic light late at night in an area where you do not feel safe, you could (illegally) cross over the red light after first carefully checking that there is no other traffic. If you receive a fine due to a camera on the traffic light, you can sometimes have it waived by writing a letter to the traffic department or court explaining that you crossed safely and on purpose, due to security reasons. The fact remains that, for whatever reason, you have broken the law. Do not make a habit of this.\n\nWhen stopped at a traffic light at night, always leave enough room between your car and the car in front of you so you can get around them. It is a common hijacking maneuver to box your car in. This is especially prevalent in the suburbs of Johannesburg.\n\nSo far as possible, and especially when driving in urban areas, try not to have any belongings visible inside the car - keep them out of sight in the glove boxes or in the boot (trunk). The same applies, but even more so, when parking your car. It is also considered safe practice to drive in urban areas with the car windows closed and the doors locked. These simple precautions will make things less attractive for potential thieves and criminals.\n\nAs you would do in any other country, always be alert when driving. The safest way is to drive defensively and assume that the other driver is about to do something stupid / dangerous / illegal.\n\n====Road system====\nSpeed limits are usually clearly indicated. Generally, speed limits on highways are 120km/h, those on major roads outside built-up areas are 100km/h, those on major roads within built-up areas are 80km/h and those on normal city/town roads are 60km/h. But beware - in some areas, the posted speed limits may change suddenly and unexpectedly. \n\nThe roads within South Africa, connecting most major cities, and between its immediate neighbours are very good. There are many national and regional roads connecting the cities and larger centres, including the N1 running from Cape Town through Johannesburg and [[Pretoria]] up to Harare, Zimbabwe, the N2 running from Cape Town to Durban, which passes through the world-famous [[Garden Route]] near [[Knysna]], and the N3 between [[Durban]] and Johannesburg.\n\nSome portions of the national roads are limited access, dual carriage freeways (''the N3 between Johannesburg and Durban is freeway almost all the way'') and some sections are also toll roads with emergency assist telephones every couple of kilometres. Toll roads generally have two or more lanes in each direction. \n\nThe large fuel companies have rest stops every 200-300km along these highways where you can fill up, eat at a restaurant, buy takeaways, do some shopping or just stretch your legs. Restrooms at these facilities are well maintained and clean. Most (but not all) of these rest stops also have ATMs.\n\nSome of the main roads have only one lane in each direction, especially where they are far from urban centres. When driving on such a road, it is common that a truck or other slow-moving vehicle will politely move onto the hard shoulder (often marked by a yellow line) to let you pass. Once you have passed it is customary to flash your hazard lights once or twice. This is considered a ''thank you'' and you will very likely receive a ''my pleasure'' response in the the form of the slow vehicle flashing its headlights once. Bear in mind that it is both illegal and dangerous to drive on the hard shoulder - although many people do.\n\nIn many rural areas, you will find unpaved \"dirt\" roads. Most of these are perfectly suitable for a normal car, although a reduced speed might often be advisable. Extra caution is required when driving on these roads, especially when encountering other traffic - windscreens and lights broken by flying stones are not uncommon.\n\nWhilst it is not compulsory, more and more drivers are adopting the practice of driving with their headlights on at all times. This greatly increases their visibility to other road users.\n\nThe '''N1''' between [[Gauteng]] and Cape Town and the '''N3''' between Gauteng and [[KwaZulu Natal]] can become very busy at the start and end of Gauteng school holidays, due to many people from Gauteng spending their holidays at the coast. If you are planning on using these two highways, it is wise to try and avoid the two days after schools break up and the two days before they open again. School holiday calendars for South Africa can be found here. [http://www.info.gov.za/aboutsa/schoolcal.htm] \n\nThe '''N3''' normally has a Highway Customer Care line during busy periods, ☎ 0800 203 950, it can be used to request assistance for breakdowns, accidents or general route information. Current toll fees, road and traffic condition can also be found on the N3 website [http://www.n3tc.co.za/].\n\n====Fuel stations====\n{{infobox|Fuel|As of March 2010, fuel can now be bought on a normal credit card; most garages have ATMs on the premises. Visa Electron and other debit cards are accepted at most fuel stations.}}\nFuel stations are full service with lead free petrol, lead replacement petrol and diesel available. Pump attendants will offer to wash your windscreen and check oil and water in addition to just filling up the car. It is usual to tip the attendant approximately R5 - if you don't have change filling up R195, for example, and let the attendant keep the change, it is a courteous idea. Most fuel stations are open 24 hours a day. \n\nMajor chains include international chains Shell, Total, and Caltex (the last one is part of US oil giant Chevron), as well as domestic chains Engen and Sasol.  \n\nHistorically, South African fuel stations were cash only, which was and still is indicated by many guidebooks. However, after a period in which fuel stations accepted only their own proprietary credit cards, in 2009, the government authorized them to begin accepting major credit cards like Visa and MasterCard.  As of 2013, only the most remote or rural fuel stations are still cash only.  If a fuel station is in a reasonably sized town (at least a few thousand people), you can safely assume that it will accept major credit cards.  Thus, you do not need to carry large amounts of cash to pay for fuel, unless you are absolutely certain you will need to purchase fuel in a very remote area that does not yet support credit cards.\n\n====The law====\nLaw enforcement (speed and other violations) is usually done by portable or stationary, radar or laser cameras. \n\nUnlike other countries like Australia, South Africa ''does not'' post signs expressly warning you that you are approaching a speed camera. In fact, many speed cameras in South Africa are classic speed traps: positioned just around curves or crests or behind columns so that you will ''not'' see them until it is too late to brake.  In major cities, one clue that you are approaching a known speed camera is when traffic in all lanes on an otherwise busy freeway suddenly slows to the speed limit.  On less busy freeways and highways, there may not be enough traffic from which that pattern can be discerned until it is too late. \n\nLocal police forces, especially in rural areas, direct a lot of their efforts in to fining motorists (so to raise revenue rather than to improve road safety). If you see an oncoming car flashing his headlights at you then he or she is probably warning you of an upcoming speed camera he has just passed.  Non camera portable radar and laser systems are also used and you may be pulled over for speeding (or other violations) and given a written fine. Fines can be sent to the registered address of the vehicle you are driving, but paying on-the-spot fines is also common, usually the policeman will hold your license whilst you go to the local police station to pay the fine, you get a receipt, and drive back to where you were stopped hand the receipt over to to the policeman get your license back - this can take a good hour or more, which can be more of an annoyance than the R400 fine.\n\nIn general, the police are pretty honest, but they do respond to politeness and deference to their authority. Sometimes when a traffic police officer stops you, they will ask for some ludicrous piece of paperwork which a tourist would neither need nor have on them (a letter from some government ministry, the car's roadworthiness certificate, etc.) and warn that you will be in a lot of trouble if you don't have it. This is not true. The only paperwork a South African registered car is required to carry is a round licence disc in the front left of the windscreen. You need to produce only your valid driver's licence and passport. Be firm, stay cool and friendly and be patient. In general, the police want an easy life and can't be bothered to argue for ages if they think you aren't going to offer a \"tip.\"\n\nSouth Africa currently does not have a merits system and does not share traffic violation information with other nations.\n\n====Licence requirements====\nIf your driver's licence is in any of South Africa's 11 official languages (''e.g. English'') and it contains a photo and your signature integrated into the licence document, then it is legally acceptable as a valid driver's licence in South Africa. However, some car rental and insurance companies may still insist that you provide an International Driver's Permit.\n\nIt is generally best practice to acquire an International Driver's Permit in your country of origin, prior to starting your journey, regardless of whether your licence is legally acceptable or not.\n\nNote that police may ask for a bribe (between R200 to R600) if you produce a foreign driver's licence (see also Stay safe section). Don't pay it, ask for their name and ID number and report them.\n\n'''Useful links'''\n* '''National Roads Agency''', [http://www.nra.co.za/roadtoll.html], has latest toll tariffs and road condition reports.\n* '''South African Automobile Association''', ph: ''+27'' 083 843 22, [http://www.aasa.co.za/]\n\n====Motorhomes====\nWith the abundance of caravan parks available in South Africa, motor homes are becoming ever more popular with international visitors. It gives you the freedom to move around as well as a place to stay wherever you are. \n\nA number of companies offer motor home rentals\n* <listing name=\"Helderberg Camper Hire\" url=\"http://www.helderbergcamperhire.co.za/\" phone=\"+27 021 855-3818\" fax=\"+27 021 855-1184\" email=\"reservations@helderbergcamperhire.co.za\" price=\"Prices depend on camper size and which options are selected. Definitely the cheapest of them all.\">Based in Cape Town with branches nationwide</listing>\n\n* <listing name=\"Bobo Campers\" url=\"http://www.bobocampers.com/\" phone=\"+27 011 395-4621\" fax=\"+27 011 973-4555\" email=\"info@bobocampers.com\" price=\"From R900 to R1500 per day depending on camper size\">Branches in Johannesburg, Cape Town and [[Windhoek]], Namibia</listing>\n* <listing name=\"Kea Campers\" url=\"http://sa.keacampers.com/\" phone=\"+27 011 230-5200\" phoneextra=\"+49 211 2297 5440 (European contact number)\" email=\"reservationssa@keacampers.co.za\">Branches in Johannesburg, Cape Town and Windhoek, Namibia</listing>\n* <listing name=\"Auto International\" url=\"http://www.autointernational.co.za/\" email=\"reservations@autointernational.co.za\" phone=\"+27 011 883 2787\" fax=\"+27 086 657 7161\" Cell=\"+27 082 903 6569\"></listing>\n* <listing name=\"Maui\" url=\"http://www.maui.co.za/\" phone=\"+27 011 396-1445\" fax=\"+27 011 396-1757\" email=\"maui@iafrica.com\" address=\"173 Tulbagh Rd, Pomona, Kempton Park, Johannesburg\"></listing>\n\n====Offroad vehicles====\nShould you want to wander off the beaten path, a 4x4 or other high clearance vehicle might be required. Often it is possible to have camping gear included with the vehicle rental allowing you to combine your transport and accommodation requirements in one.\n* <listing name=\"Bushlore\" url=\"http://www.bushlore.com/\" email=\"info@bushlore.com\" phone=\"+27 011 792-5300\" fax=\"+27 011 792-3947\" address=\"Unit A5,\nSanlam Industrial Park, Masjien Road, Randburg, Johannesburg\">Branches in Johannesburg, Cape Town, Kasane, Victoria Falls and Windhoek.</listing>\n* <listing name=\"Bush Trackers\" url=\"http://www.bushtrackers.co.za/fourbyfour.asp\" email=\"bushtrackers@iafrica.com\" phone=\"+27 011 465-5700\" fax=\"+27 011 465-5700\"></listing>\n* <listing name=\"Kea Campers\" url=\"http://sa.keacampers.com/\" phone=\"+27 011 230-5200\" phoneextra=\"+49 211 2297 5440 (European contact number)\" email=\"reservationssa@keacampers.co.za\">Branches in Johannesburg, Cape Town and Windhoek, Namibia</listing>\n* <listing name=\"Around About Cars\" url=\"http://www.aroundaboutcars.com/\" email=\"info@aroundaboutcars.com\" phone=\"+27 021 422 4022\" fax=\"+27 021 422 4083\"></listing>\n* <listing name=\"CABS Car hire\" url=\"http://www.cabscarhire.com/\" email=\"info@cabs.co.za\" phone=\"+27 021 386 5500\" fax=\"+27 021 385 1110></listing>\n* <listing name=\"Exeque Car Rental\" alt=\"\" address=\"\" directions=\"\" phone=\"+27 010 235 0898\" url=\"[[Media:http://www.exequecarrental.co.za]]/\" hours=\"\" price=\"\">[http://www.exequecarrental.co.za/ Long Term Car Rental]  lat=\"\" long=\"\" email=\"info@exequecarrental.co.za\" fax=\"+27 086 720 1311\">Cheap Cash Car Rental and long term car rental (Cheapest Rates)</listing>\n\n===By bus===\nThere are scheduled bus services between Cape Town, Johannesburg, [[Durban]] and other cities (with stops in between), as well as connections to neighbouring countries.  The main bus companies are:\n*  <listing name=\"Greyhound\" phone=\"+27 083 915-9000\" url=\"http://www.greyhound.co.za/\"></listing>\n*  <listing name=\"Intercape Mainliner\" phone=\"+27 021 380-4400\" url=\"http://www.intercape.co.za/\"></listing>\n*  <listing name=\"Translux\" url=\"http://www.translux.co.za/\"></listing>\n*  <listing name=\"SA Roadlink\" phone=\"+27 011 333-2223\" url=\"http://www.saroadlink.co.za\"></listing>\nBooking for the above can also be done via Computicket [http://www.computicket.co.za] .\n\nSmaller services include '''City Bug''' [http://www.citybug.co.za/]  and '''Lowveld Link''' [http://www.lowveldlink.co.za/] .\n\nAn alternative is the '''Baz Bus''' [http://www.bazbus.com/] . It offers a regular hop-on-hop-off service on some of the most interesting routes for the tourist (Cape Town to Durban via the Garden Route;Durban to Johannesburg via the Drakensberg). Baz Bus picks you up and drops you off at many hostels along the route, so you don't have to hang around at a downtown bus stop at night.\n\nIf you're really in a pinch, you can use minibus ''taxis''. They are poorly maintained and rarely comply with safety standards. They also require patience as they make many detours and changeovers at the ''taxi rank'' (hub) where the driver will wait for passengers to fill up the bus. But they cover many routes not covered by the main bus service and are quite cheap (25 cents per kilometre per person on the main routes).\n\nWarning: Many buses are removed from service by the police, due to lack of legal road-worthiness. Seek up-to-date advice on which companies are more reputable. Occasionally, the driving can be rather wild, and if you're prone to motion sickness, be prepared.\n\n===By train===\n[[Image:SA_Rail_Routes.png|thumb|350px|Passenger Trains in South Africa]]\nThe '''Passenger Rail Agency of South Africa''' (PRASA) [http://www.prasa.com] is the national rail operator. There are budget passenger services between major South African cities.Shosholoza Meyl has three classes.Including tourist class,economy class(known as '''Shosholoza Meyl''' [http://www.shosholozameyl.co.za]) as well as Premier Classe[http://www.premierclasse.co.za] between Johannesburg, Cape Town and Durban.\n\nThe gautrain that operates in the Gauteng province is a  modern day high speed train. This can be very efficient from OR tambo air port in Johannesburg.\nCentral Reservations (for both Shosholoza Meyl and Premier Classe) can be contacted as follows :\n\n* From within South Africa, phone 086 000 8888 (share-call)\n* From outside South Africa, phone ''+27'' 11 774 4555\n* Email [mailto:mmabathop@spoornet.co.za mmabathop@spoornet.co.za] or [mailto:info@premierclasse.co.za info@premierclasse.co.za]\n\nTo book tickets, phone Central Reservations on one of the numbers given above and make your booking. You can pick up and pay for the tickets later at any train station.\n\nThere are also commuter trains in larger cities (Johannesburg, Pretoria, Cape Town, Durban, Port Elizabeth and [[East London]]) ; these are run by MetroRail [http://www.metrorail.co.za] . Most services are perfectly safe, but certain routes are overcrowded and not always safe. \n\n====Mid-range====\n* <listing name=\"Bushveld Train Safaris\" phone=\"+27 014 736-3025\" email=\"info@boon.co.za\" url=\"http://www.boon.co.za\">Offers rail Safaris across South Africa</listing>\n\n* <listing name=\"Shongololo Express\" phone=\"+27 011 781-4616\" email=\"info@shongololo.com\" url=\"http://www.shongololo.com\">Rail Safaris across South Africa</listing>\n\n====Splurge====\n* <listing name=\"Blue Train\" phone=\"+27 012 334-8459\" phoneextra=\"Cape Town +27 021 449 2672, UK +44 1403 24 3619, central Europe +44 2089 245126, U.S. +1 305 864 4569\" email=\"BlueTrain@Spoornet.co.za\" url=\"http://www.bluetrain.co.za\">This world famous luxury train operates between Pretoria and Cape Town, with a stopover in [[Kimberley (South Africa)|Kimberley]].  They advertise as a \"five-star hotel on wheels\" and charge accordingly: 2009 prices ''start'' from R9,215 one-way per person (low-season \"Deluxe\" twin-sharing) and climb to a whopping R18,405 (high-season \"Luxury\" single).  The trip takes 27 hours, and your fares includes a private suite with attached bathroom as well as all meals and drinks (except champagne and caviar).</listing>\n* <listing name=\"Rovos Rail\" alt=\"\" address=\"\" directions=\"\" phone=\"+27 012 315-8242\" url=\"http://www.rovos.co.za/\" hours=\"\" price=\"\" lat=\"\" long=\"\">Offers luxury rail travel throughout Southern Africa. Destinations include Cape Town, Pretoria, Durban, [[George]], [[Swakopmund]] in Namibia, [[Victoria Falls|Vic Falls]] in Zimbabwe and [[Dar es Salaam]] in [[Tanzania]].</listing>\n\n===By thumb===\n[[Hitchhiking]] in South Africa is not so hard, but most people will think you are catching a ride with the local taxis and thus expect you to pay. You may want to tell them you are looking for a free ride before climbing aboard.  The main issue is '''crime''': some drivers may hijack you and your belongings. Hitchhiking is generally frowned upon and considered unsafe. Drivers are also wary of potentially criminal hitchhikers. Never hitchhike at night.\n\n===By bicycle===\nCycling can be a good way to experience the country, as you really get to admire the views and get the opportunity to mingle with the locals. While it could be considered unsafe to cycle through the cities, because of crime and reckless drivers, there are many farm/dirt roads throughout South Africa. Locals and Farmers are generally willing to provide you with food and a place to sleep, as long as you are willing to talk.\n\n* <listing name=\"The Freedom Trail\" phone=\"+27 845674152\" email=\"info@freedomchallenge.org.za\" url=\"http://www.freedomchallenge.org.za\">The Freedom Trail</listing>\n\n* '''Heritage Tours Private Travel''': U.S. based company focusing on private travel experiences in Southern Africa, including luxury accommodations, transportation, expert guides, safari and more.  Contact us at 800-378-4555 or www.HTprivatetravel.com\n\n* <listing name=\"GoTravel24.com\" phone=\"+27 011 925 0225\" url=\"http://holidays.gotravel24.com\">great package holidays geared to your requirements - book and pay online! Destinations include Cape Town, Johannesburg, [[Kruger Park]], [[Cape_Winelands|Winelands]], Garden Route, Victoria Falls and [[Mauritius]].</listing>\n\n==Talk==\nSouth Africa has 11 official languages, namely [[Afrikaans phrasebook|Afrikaans]], [[Southern Ndebele phrasebook|Southern Ndebele]], [[Xhosa phrasebook|Xhosa]], [[Zulu phrasebook|Zulu]], [[Swazi phrasebook|Swazi]], [[Northern Sotho phrasebook|Northern Sotho (Sepedi)]], [[Southern Sotho phrasebook|Southern Sotho (Sesotho)]], [[Tswana phrasebook|Tswana]], [[Tsonga phrasebook|Tsonga]], [[Venda phrasebook|Venda]] and English. Most people other than rural black Africans speak English as a second language. Only about 8% of the population speak English as a first language, almost exclusively in the white population which is ironically declining as a first language, while it is already a lingua franca among South Africans, and about 60% of the population can understand English. South African English is heavily influenced by Afrikaans. [[Afrikaans phrasebook|Afrikaans]] is also widely spoken, especially by the majority of the white and coloured population. Often Afrikaans is incorrectly called 'afrikan' or 'african' by foreigners. Note this is very incorrect as 'African' for a South African corresponds with the native-African languages: [[Zulu phrasebook|Zulu]], [[Xhosa phrasebook|Xhosa]], Pedi etc. (and, of course, there are thousands of languages in Africa so no single language can be called 'African') Afrikaans has roots in 17th century Dutch dialects, so it can be understood by Dutch speakers and sometimes deciphered by German speakers. Other widely spoken languages are [[Zulu phrasebook|Zulu]] (mainly in [[KwaZulu-Natal]] - South Africa's largest single linguistic group) and [[Xhosa phrasebook|Xhosa]] (mainly in the [[Western Cape]] and [[Eastern Cape]]), as well as Sotho and Venda.  This changes, according to the region you are in. \n\nA few words you may encounter are:\n* ''eish'' - as in, \"eish, it's hot today\", \"eish, that's expensive\" or \"eish, that's too far to drive\"\n* ''lekker'' - nice, enjoyable\n* ''howzit'' - how is it? (generally a rhetorical question)\n* ''yebo'' - yes\n* ''boet'', ''bru'', ''china'' or ''ou'' - brother or man (equivalent to ''dude'' or ''bro'')\n* ''koppie'' - a small hill (can also mean a cup)\n* ''Madiba'' - Nelson Mandela\n* ''Molo'' - Hello (in Xhosa)\n* ''robot'' - traffic light\n* ''tannie'' - (auntie) respectful term for an older woman\n* ''oom'' - (uncle) respectful term for an older man\n* ''tinkle'' - phone call\n* ''just now'' - sometime soon (from Afrikaans \"net-nou\")\n* ''now now'' - sooner than just now! (from Afrikaans \"nou-nou\", pronounced no-no)\n* ''braai'' - barbecue.\n* ''cheers'' - we use this for saying good-bye, as well as saying thank you and for the occasional toast.\n* ''heita'' - hello\n* ''sharp'' - (usually pronounced quickly) OK or good\n* ''sure-sure'' more pronounced like sho-sho - Correct, Agreement, Thank you\n* ''ayoba'' - something cool\n* ''zebra crossing'' - a crosswalk. named for the white & black stripes that are generally painted on crosswalks.\n\n===Spelling===\nIn general, English spelling follows English rules rather than American; ''litre'' rather than ''liter'', ''centre'' rather than ''center'', etc.\n\n==See==\n\n\n===Wild animals in their natural habitat===\n* '''[https://xplorio.com/hermanus/en/things-to-do/whale-watching/ Whale watching in Hermanus (Walker Bay)]''' \n*[[Kruger National Park]] in Mpumalanga and Limpopo and the private reserves bordering.\n*The annual [[Diving in South Africa/Sardine run|Sardine run]] off the Wild coast and KZN south coast\n*[https://xplorio.com/gansbaai/en/things-to-do/shark-cage-diving/ Great White Sharks of Gansbaai]\n*[[Addo Elephant National Park]] in the Eastern Cape\n*[[Kgalagadi Transfrontier Park]] between South Africa and Botswana\n*[[ISimangaliso Wetland Park|iSimangaliso Wetland Park]] (World Heritage Site) and [[Diving Sodwana Bay|Sodwana Bay]] in northern KwaZulu-Natal\n*The Whale Route in [[Hermanus]]\n* Zilkaatsnek Nature Reserve in Hartbeespoort\n\n===Areas of natural beauty and botanical interest===\n*Table Mountain and Cape Point in the Table Mountain National Park in [[Cape Town]]\n*The [[Garden Route]] in the Western Cape Province \n* [http://www.grootbos.com/en/blog/experiences/botanical-tour-secrets-of-nature-gifts-from-the-earth/ Botanical Paradise Grootbos Nature Reserve]\n*[[Tsitsikamma]] in the Eastern Cape\n*[[Augrabies]] Falls in the Northern Cape\n*[[Ai-Ais/Richtersveld Transfrontier Park]] between South Africa and Namibia\n*[[Ukhahlamba Drakensberg Park]] (World Heritage Site) in KwaZulu-Natal\n*Drakensberg (KZN)\n*[[Blyde River Canyon]] in Mpumalanga\n\n===Cultural heritage===\n*[[Robben Island]] (World heritage site) off Cape Town\n\n===Other===\n*[[Cape Winelands]] around Stellenbosch\n\n==Do==\n* '''Dive''', see [[Diving in South Africa]] for details.\n\n* '''River Rafting:''' The Orange River on the border to Namibia is a popular destination for rafting tours. Several tour operators launch 4-6 day trips in blow-up boats from Vioolsdrif with camping under the stars.\n\n* '''Volunteering:''' The Rainbow Nation offers many different opportunities for volunteering and giving back, such as wildlife conservation with the Big 5, construction or social work. There are many ways to get in contact with the desired volunteer project, one of which is a comparison platform. On <listing name=\"Volunteer World\" alt=\"\" directions=\"\" lat=\"\" long=\"\" address=\"a social startup from Germany\" phone=\"\" tollfree=\"\" email=\"\" fax=\"\" url=\"https://www.volunteerworld.com/volunteer-in-south-africa/\" hours=\"\" price=\"\">, for example, you can search and compare all volunteering options in South Africa.</listing>\n\n==Buy==\n\n===Money===\n[[Image:South_African-Money01.jpg|thumb|South African notes and coins]]\nThe currency of South Africa is the '''Rand''' for which the symbol, '''R''', is conventionally placed immediately before the amount. On Forex display boards, the three letter code is usually ''ZAR''. The Rand is divided into 100 cents (c). Notes are in denominations of R200, R100, R50, R20 and R10. Higher value notes are slightly larger in physical size than small value notes. All notes have a metallic security strip and a watermark. Note that there are two types of R5 coins in circulation. One is a silver-coloured coin while the other is silver-coloured with a copper insert. Both are legal currency. \n\nCoins are in denominations of R5, R2, R1, 50c, 20c, 10c and 5c. Production of 2c and 1c coins was suspended in April 2002, but those still in circulation remain legal tender. All transactions are rounded down to the nearest lower 5c, so as not to require the use of 2c and 1c coins. \n\n[http://www.xe.com/ict/table.cgi?currency=ZAR&historical=false&template=ict-en Conversion rates] vary wildly depending on politics. It's best to import or carry US$, € or GB£, as conversion between any of them and the Rand can be done at any bank without trouble. South Africa is part of the ''Southern African Common Monetary Area'' and the Rand can be used in Namibia (''where it is an official currency along with the Namibian Dollar'') as well as [[Lesotho]],[[Swaziland]], [[Mozambique]] and the southern half of [[Zimbabwe]] (''where it is widely accepted, but not an official currency'')\n\n'''Traveller's Cheques''' are a safe way of carrying money around. You can exchange them at all banks (which are found throughout the country even in rural areas) and you will get a refund if they are stolen. The disadvantage is that you cannot pay with them and you will need change when exchanging them into Rand. Use ATMs instead if possible.\n\n'''Automated Teller Machines (ATMs)''', linked to all major international networks, are available throughout the country and will generally dispense money in a mixture of denominations between R200 and and R10, with about 80% of the value requested being high value notes and the rest in smaller denominations. You can use any Cirrus or Maestro card as well as all major credit and debit cards at the ATMs.  South African bank ATMs do not charge any fees above those levied by your own financial institution.\n\nIt is best to use only ATMs that are inside a mall or other building. Always be careful to make sure no one is watching you enter your PIN, and be vigilant about scams (e.g. machines that seem to eat your card and won't give it back after you enter the PIN). Do not accept help from strangers when withdrawing money at an ATM. If you are approached and offered unwanted help, rather cancel the transaction immediately and go to a different ATM.\nThe till points at some major retail stores (''such as Pick 'n Pay'') also act as ATMs; simply tell the checkout clerk that you would like to withdraw money. \n\nVISA and MasterCard are accepted almost everywhere.  American Express and Diners Club are also accepted, but not as widely.\n\nMost retail stores accept credit cards and pin based debit cards as payment.  While South Africa largely uses a chip-and-PIN credit card system like Europe, most stores can still operate on the traditional credit card system in which the user merely signs the receipt after the transaction is approved.  Thus credit card users from countries also still on that system (like the United States) will have no problem using their credit cards in South Africa, provided that they have notified their bank in advance of their travel plans.\n\n'''VAT''' (Value Added Tax) is levied at 14% on almost all products in South Africa. By law, advertised prices should be inclusive of VAT except when explicitly stated otherwise. Foreign passport holders may claim back the VAT on products that were bought in South Africa and are being taken out of the country, provided that the total value of the goods exceeds R250. Full details of the procedure to follow are available from the [http://www.dfa.gov.za/consular/vat.htm  Department of Foreign Affairs] and their new [http://www.taxrefunds.co.za/ TAX Refund for tourists website]. '''VAT Refund''' Administrator's offices are available at both Johannesburg (O.R. Tambo) and Cape Town International Airports. Refunds will be credited to a Travelex Visa card that you will be given, denominated in US dollars or Euro, the fees in conversion associated with this card can leave you with up to 10% less than you thought you were getting.  The cards can only be used outside of South Africa.\n\n===Costs===\n\n====Petrol and diesel====\nLiquid fuel prices in South Africa are regulated and are fixed by region monthly. In general petrol is cheaper near the ports (Durban, Cape Town, Port Elizabeth).  In January 2014 a litre of petrol cost around R13.50. See the current prices [http://www.dme.gov.za/energy/liquid_prices.stm] .\n\n====Toll roads====\nToll roads are becoming increasingly popular.  Most tolls are under R30 and are spaced at about every 100km. The most expensive toll gate in South Africa is the [[Swartruggens]] toll plaza on the ''N4'' between Swartruggens and [[Zeerust]], cost is R75 for a normal car. In total, road tolls between Pretoria and Nelspruit or between Johannesburg and Cape Town will cost you just under R100. Sometimes there will be signposted 'alternative routes' to avoid the toll road - generally these are slower back roads. Traveling on highways around central Gauteng will also incur charges from the E-Tag system implemented late in 2013, although payment is rarely enforced.\n\n====Food====\nSouth Africa is famous for delicious, high-quality food at relatively low prices. \n\n* You can buy three McDonald's burgers (''a hamburger, cheese burger or chicken burger'') for around R40 each\n* A sit down lunch in an average establishment will cost you between R60 and R130 per person.\n* A decent 30cm pizza will cost you between R65 and R95\n\n===Pricing===\nPrices in shops are fixed, but prices in open markets or from street vendors are open to barter.  \n\nSouth Africa is not a place to find bargains for most goods.  For example, most ordinary consumer goods, electronics, and appliances are all manufactured in China nowadays, while most luxury goods are manufactured in Europe. This means the prices in South Africa will have the cost of transporting them there built-in. However, South Africa is a superior destination for buying African art, curios, and souvenirs which are far more difficult to obtain outside of Africa.\n\n===Retail===\nMajor supermarket chains include Checkers, Pick n Pay, Shoprite, Spar, and Woolworths Food. Major department store chains include Stuttafords, Woolworths, Edgars, and Truworths.  \n\nAt first glance, South African supermarkets and department stores look like their counterparts elsewhere, but a close examination soon reveals major differences. \n\nBoth supermarkets and department stores tend to feature primarily South African, African, or European brands, as well as a small number of American and Asian brands. Thus, tourists from the Americas will have the greatest cultural shock.  Apart from a few familiar brands of soft drinks, candy, electronics, batteries, cosmetics, accessories, magazines, and personal healthcare products, everything else is completely different. \n\nAmericans in particular will notice that many items taken for granted in the United States simply have no equivalent on South African shelves, such as lactose-free milk for the lactose intolerant.  \n\nWhile South African supermarkets are able to operate at the same level as their contemporary First World counterparts in terms of store décor and organization, South African department stores are lagging behind. This is especially evident in details like mannequins, some of which may look obsolete or old-fashioned to First World tourists. \n\nSouth African malls tend to feature primarily local boutiques and local chains, with some European, Asian, and American boutiques at the most prestigious malls (V&A Waterfront and Sandton City).  \n\nSince Amazon.com has not yet entered the South African market, South Africa's domestic book retailers are still thriving. They haven't yet experienced the collapse of the book retail industry that occurred in the United States and elsewhere.  Thus, South African malls still feature bookstores like Exclusive Books, where one can find postcards, South African calendars, and South African literature.\n\n===Tipping===\nTipping is the norm in restaurants and at gas stations (which are all full-service).  Indeed, most of these businesses pay their staff the legal minimum-wage, relying on customer-tips to bring staff incomes up to liveable levels. Tips of around '''10%''' of the bill are considered the norm.\n\n==Eat==\n[[Image:South_Africa-Braaivleis01.jpg|thumb|200px|Braaivleis]]\nSouth African cuisine is just as diverse as its cultures, with influences from [[UK|English]], [[Netherlands|Dutch]], [[germany|German]], [[india|Indian]], [[malaysia|Malay]], [[portugal|Portuguese ]] and of course the native African influences.\n\n* '''Braaivleis''', meat roasted over an open wood or charcoal fire, is very popular and generally done at weekend social events. The act of roasting the meat as well as the social event is referred to as a ''braai''. \n\n* '''Pap''', a porridge made with corn meal. ''Slappap'' (runny porridge), is smooth and often eaten as a breakfast porridge, ''Stywepap'' (stiff porridge) has a doughy and more lumpy consistency and is often used as a replacement for rice or other starches. \"Krummel\" pap also called umphokoqo (crumby porridge) is drier, resembles couscous and is often served at a ''braai'' covered in a saucy tomato relish.\n\n* '''Potjiekos''', a meat and vegetable stew made in a cast iron pot over an open fire. A favorite at ''braais''.\n\n* '''Boerewors''', a spicy sausage. ''Boerewors Rolls'' are hotdog buns with ''boerewors'' rather than hotdogs, traditionally garnished with an onion and tomato relish.\n\n* '''Biltong and Droëwors''', seasoned meat or sausage that has been dried. Beef, game and ostrich meat is often used. A favourite at sports events and while travelling. \n\n* '''Bunny chows''', half a loaf of bread with the inside replaced by lamb or beef curry is a dish not to be missed when traveling to [[KwaZulu Natal]].\n\n* '''Bobotie''', meatloaf with a Cape Malay influence, seasoned with curry and spices, topped with a savoury custard. \n\n* '''Morogo''', a wild spinach on its own or with potato. Sometimes served with ''pap''.\n\n* '''Waterblommetjiebredie''', mutton and indigenous water lily stew.\n\n* '''Masonja''', for the culinary adventurer, fried Mopanie worms.\n\n* '''Melktert''', \"milk tart\", a milk-based dessert.\n\n* '''Koeksisters''', a deep-fried sticky dessert.\n\n===Fast food===\nYou will find the usual array of international fast food outlets. '''McDonald's''', '''KFC''', '''Subway''', '''Wimpy''', and '''Cinnabon''' are well represented throughout the country.  McDonald's archrival '''Burger King''' recently entered the South African market. \n\nLocal franchises worth mentioning are '''Black Steer''' and '''Steers''' for the best burgers and '''Nando's''' [http://www.nandos.co.za/] for peri-peri chicken.\n\nPizza delivery is available in most urban areas; the dominant national chain is '''Debonairs'''.\n\n==Drink==\nMunicipal tap water is usually safe to drink. In some area such as Hartebeespoort Dam, it is advisable to boil your water before drinking.  \n\nMilk is widely available at most supermarkets, but bottled orange juice not-from-concentrate is much harder to find than in North America.  Most South African retailers carry only orange juice reconstituted from concentrate or orange juice blended with other juices or milk.  \n\nSoft drinks like Coca-Cola and Pepsi are widely available.  Consider trying popular domestic soft drinks like Appletiser (carbonated apple juice), as well as the unique Creme Soda and Iron Brew produced by Sparletta. \n\nThe legal age to purchase and drink alcohol in South Africa is 18.  Almost all restaurants are licensed to serve liquor.   \n\nIf offered Witblits or Mampoer; those are locally distilled under the auspices of the Department of Agriculture, and allocated a manufacturers' license. They are safe and enjoyable to consume and does not resemble the names for ''moonshine'' or ''firewater''. The alcohol content is controlled by the Department, so is the quality. \n\n===Beer===\n\t\nLocal beer production is dominated by '''SABMiller''' [http://www.sabmiller.com] with Castle Lager, Castle Lite, Hansa Pilsner, Carling Black Label and Castle Milk Stout being most popular brands. There are also Micro Breweries all over South Africa. Imported beers such as Stella Artois, Peroni, Heineken, and Grolsch are also widely available. Namibia Breweries Limited brands such as Windhoek Lager are also popular and generally available.\n\nPrices can vary widely depending on the establishment. Expect to pay anything from R7 to R18 for a beer.\n\n===Wine===\nSouth Africa has a well established wine industry with most of the wine produced concentrated in the Cape Winelands in the [[Western Cape]] and along the Orange River in the [[Northern Cape]]. Wine is plentiful throughout the country and very inexpensive.\n\n===Liquors===\n'''Amarula Cream''' [http://www.amarula.co.za/]  is made from the marula fruit.  The marula fruit is a favorite treat for African elephants, baboons and monkeys and in the liqueur form definitely not something to be passed over by humans.  Pour over crushed ice and enjoy.  The taste, color and texture is very similar to the world famous Baileys Irish Cream.\n''Cape Velvet'' is a favorite in and around Cape Town.\n\n===Tea and Coffee===\nThe local '''Rooibos''' tea, made from a herb from the Cederberg Mountains is a favorite for many South Africans.\nYou will find coffee shops in most shopping malls, such as Mugg&Bean [http://www.muggandbean.co.za]  and House of Coffees [http://www.houseofcoffees.com/] . \nCoffee shops similar in concept to Starbucks, like Seattle Coffee Company and Vida e Caffe [http://www.vidaecaffe.co.za]  (Portuguese themed), are becoming commonplace.\n\n==Sleep==\nEstablishments in South Africa can have themselves [[rating systems|graded]] by the ''Tourism Grading Council of South Africa [http://www.tourismgrading.co.za/] '' on a 5 star basis. Many establishments make use of this service and you will see the star grading displayed on most advertising material.\n\n* 1 star - Clean, comfortable and functional.\n* 2 star - Good:  Quality furnishings, service and guest care.\n* 3 star - Very good: Better furnishings, service and guest care.\n* 4 star - Superior:  Excellent comfort and very high standard furnishings, service and guest care.\n* 5 star - Exceptional:  Top of the line quality and luxurious accommodation to match the best international standards. Flawless service and guest care.\n\n===Hotels===\nSouth Africa offers a wide range of international and domestic hotel chains.  International hotel chains Accor, Best Western, Hilton, Hyatt, IHG, Marriott, and Starwood all operate hotels in South Africa. \n\nOlder hotels tend to resemble traditional European or Asian hotels in that everything (rooms, bathrooms, lobbies, parking) is small and cramped.  Hotels built after the end of apartheid (and the end of international trade sanctions) tend to be larger and have larger rooms resembling those in North American hotels.  \n\nMost hotels have a parking lot which is gated and guarded 24 hours.  However, they don't use a keycard or ticket system as in North America.  Rather, if you are well-dressed and appear respectable, the guard on duty will often take your word that you are a guest (and if your appearance does arouse suspicion, showing your room keycard or your reservation should be sufficient).  \n\nAfrica-specific hotel chains include: \n\n* <sleep name=\"Tsogo Sun\" url=\"http://www.tsogosunhotels.com/\" phone=\"+27 11 461 9744\">South Africa's largest hotel group, with a large portfolio of hotel brands like Southern Sun, StayEasy, Garden Court, and Sun1. Also operates InterContinental hotels in South Africa.</sleep>\n* <sleep name=\"City Lodge\" url=\"https://www.citylodge.co.za\" phone=\"+27 011 557-2600\" email=\"info@citylodge.co.za\" price=\"From around R400 sharing\"></sleep>\n* <sleep name=\"Protea Hotels\" url=\"http://www.proteahotels.com/\" phone=\"+27 021 430-5000\" email=\"info@proteahotels.com\" price=\"From R200 per person sharing\">Another large South African hotel group.  Acquired by U.S. hotel giant Marriott in November 2013.</sleep>\n\n===Game reserves===\n\nMost international tourists coming to South Africa on vacation are there because they want to go on safari but it's their first time in Africa and they find [[Kenya]] or [[Tanzania]] dangerous.  Apart from the national parks, there are many private game reserves which stock the Big Five game (lion, rhino, buffalo, leopard and elephant) as well as most other wildlife native to Southern Africa.  \n\nGenerally, your first choice in going on safari is (1) game reserve or (2) national park.  The problem with national parks is that you can't really go off-road very much, any animal near a road will rapidly draw a crowd, and many of the hospitality options are rather basic.  On the one hand, national parks are big, game reserves tend to be a bit small, and many game reserves are on reclaimed farmland (and often show evidence of civilization) while some national parks (like Kruger) have always been relatively wild. On the other hand, game reserves are less crowded than national parks (in that only overnight guests are allowed to come in), they are staffed by professional guides or trackers who can find wildlife a lot faster than you (especially since they share sightings over a local radio network), and certain game reserves still allow guides to go off-road in order to follow up on a sighting.  That kind of flexibility can often mean the difference between getting only a tiny glimpse of a Big Five animal fleeing into the bush, versus a memorable \"up close and personal\" encounter that will make for amazing photos and stories to share when you get back home. \n\nIf you decide you want a game reserve, the next choice is which reserve. The reserves in eastern Limpopo and northern Mpumalanga near Kruger National Park are universally agreed to offer the finest scenery and wildlife.  Unfortunately, like Kruger itself, they sit northeast of the malaria line, meaning that you will have to take malaria prophylaxis (which requires intensive medical monitoring and can be dangerous in itself for a small minority of people).  The unique contours of the high-altitude South African highveld create an oddly-shaped \"hump\" where the malaria line curves north around Limpopo and North West Provinces.  Thus, there are several reserves in those provinces with terrain almost like Kruger, but are proudly malaria-free.  Finally, there are many other excellent game reserves well south of the malaria line, but most of them (especially in the Western and Eastern Cape) tend to feature less dramatic fynbos flora, rather than the classic veld experience (with a savanna horizon punctuated with marula and acacia trees) which most people think of when they imagine going on safari. \n\nMost reserves are host to multiple lodges.  You must determine which lodge matches your budget and needs---that is, what you want out of your African vacation and how much you can afford.  Nearly all lodges now have a Web site.  Researching and choosing a lodge can be enjoyable, but is rather time-consuming; if you are short for time, consider using a travel agent.  Next, you (or your agent) books directly with the lodge, which arranges for your access to the reserve.  \n\nAll lodges typically include twice-daily game drives (dawn and dusk) in an open-air safari vehicle driven by a professional game guide/tracker.  Beyond that, lodges vary from a basic tented camp with outdoor showers and self-catering (where you must bring and cook your own food) all the way to ultra-luxurious high-end lodges which feature lavishly decorated private villas separate from the main lodge with individual \"plunge pools,\" a huge central pool at the lodge, a \"full board\" meal program consisting of three multi-course meals per day prepared by a professionally trained chef, and a lodge manager similar to a hotel manager at a very high-end hotel who anticipates your every need and gets the staff moving before you even need to ask.  Some high-end lodges also offer amenities like a full-service spa, beauty salon, chapel, wine cellar, reading library, conference center, full-service restaurant/bar, business center, day care center (for children too young to enjoy game drives), or fitness center.  Some lodges do not need rigorous security (because they have no lions walking around); others have a security perimeter formed by electrified fences to keep lions away from the lodge area; and still others have strict security procedures in place which are explained to you either at time of booking or at check-in (usually involving an armed escort when outdoors at all times).  Finally, when budgeting for your game reserve and lodge, don't forget that it is customary to leave separate gratuities for both your guide/tracker and the lodge staff. Some lodges provide envelopes expressly marked for that purpose.\n\n===Game ranches===\n\nSouth Africa also features many game ranches where one may actually hunt game (that is, shoot with gun or bow and arrow, rather than a mere camera). Most game ranches are focused on the hunting of relatively abundant species like Cape buffalo, plus all the various types of African antelope, so only the most fervent animal rights activists object to them.  A few ranches do specialize in breeding lions to be hunted and are hence more widely controversial. \n\n===Backpacker lodges===\nBackpacking lodges or [[hostels]] are widespread all over the country. Most establishments offer great value tours and activities in the areas. There is a great network of transport around the country making it suitable for single and younger travelers. Some lodges provide meals especially in the more remote areas. Most have self catering facilities and shared bathrooms although en-suite bathrooms are also common.\nFor more info check Backpacking South Africa [http://www.backpackingsouthafrica.co.za]\n\n===B&Bs===\nBed and breakfast establishments are becoming very popular. The accommodation is usually provided in a family (private) home and the owner/manager lives in the house or on the property. Breakfast is usually served. Bathroom facilities may be en-suite. In general, the guest shares the public areas with the host family. \n\n===Self catering===\nA house, cottage, chalet, bungalow, flat, studio, apartment, villa, houseboat, tents or similar accommodation where facilities and equipment are provided for guests to cater for themselves. (This can include a fridge, oven, stove, microwave etc...) The facilities should be adequate to cater for the maximum advertised number of residents the facility can accommodate.\n\n===Guest house===\nA guest house is either a converted house, manor, etc adapted to accommodate overnight guests or it may be a purpose built facility. A guest house is run as a commercial operation and is often owner-managed. A guest house has areas which are for the exclusive use of the guest. The owner/manager either lives off-site, or in a separate area within the property.\n\n===Camping and caravaning===\n\n[[Image:South Africa-Gamtoos River-Caravan Park.jpg|thumb|A small caravan park on the Gamtoos River]]\nSouth Africans are an outdoors people, and thus there exists a culture of caravaning/camping throughout the country.Caravan parks can be found in most towns that are holiday destinations. Most caravan parks also offer [[camping]] sites where you can pitch a tent (double check because sometime tents are excluded).\nThe parks generally have central ablution facilities. \n\nMost of South Africa's National parks have excellent camping facilities at very reasonable prices\n\nAlso see the [[South_Africa#By_motorhome | By motorhome]] and [[South_Africa#By_offroad_vehicle | By offroad vehicle]] sections for additional camping options.\n\n===Timeshare===\nThere are many timeshare resorts in South Africa, most participate in international exchange agreements.\nMany timeshare owners also rent their time when they can not make use of it.\n\n===Long-term===\nMany real estate agents in South Africa also offer rental services. The rental properties are mostly available on unfurnished long term lease, but you will also find furnished properties on offer with 1 to 12 month lease agreements\n\nYour local branch of an international estate agent with a presence in [[South Africa]] might also be able to assist you.\n\n==Learn==\n[[Image:South_Africa-UNISA01.jpg|thumb|University of South Africa.]]\nNon-South African citizens need to be in possession of a ''study permit'' to study inside the country. You should apply for one at a South African High Commission, Embassy, Consulate or Trade Mission in your country of origin, or in the nearest country, should there be no South African representation is available in your country. Government form BI-1738 [http://www.home-affairs.gov.za/documents/bi1738.pdf]  needs to be completed for the application.\n\nYou will need to do some preparation to gain a ''study permit''. At a minimum you will need acceptance by a South African University, repatriation guarantees, return air ticket and proof that you can cover living expenses while in South Africa before a permit will be issued. The cost for obtaining a study permit is R425 and applications take about 6 weeks to process.\n\nExpect to spend about R5000 per month on general living expenses (''accommodation, food, travel, etc'') in addition to tuition fees. \n\nThere are many secondary and tertiary education centres in South Africa. The University of Cape Town is the top-ranked university in Africa, placing 198th in the world, according to the 2007 Times Higher Education ranking. The Universities of the Witwatersrand, Stellenbosch, Pretoria and KwaZulu-Natal also routinely appear in the Shanghai Jiao Tong University Top 500 rankings.\n\n* <listing name=\"University of Pretoria\" url=\"http://www.up.ac.za/\" phone=\"+27 012 420-3111\" fax=\"+27 012 420-4555\" email=\"csc@up.ac.za\" address=\"C/o Lynnwood Rd and Roper St Lynnwood, Pretoria\"></listing>\n* <listing name=\"University of South Africa (UNISA)\" url=\"http://www.unisa.ac.za/\" phone=\"+27 011 670-9000\" fax=\"+27 011 471-2987\" email=\"study-info@unisa.ac.za\" address=\"Preller St, Muckleneuk, Pretoria\">This university offers full-time classroom as well as distance learning courses. </listing>\n* <listing name=\"University of the Witwatersrand (WITS)\" url=\"http://www.wits.ac.za\" phone=\"+27 011 717-1000\" fax=\"+27 011 717-1065\" email=\"studysa@international.wits.ac.za\" address=\"Braamfontein, Johannesburg\"></listing>\n* <listing name=\"University of Johannesburg\"  url=\"http://www.uj.ac.za/\" phone=\"+27 011 489-3129\" fax=\"+27 011 489-2191\" address=\"Bunting Rd, Auckland Park, Johannesburg\" email=\"international@uj.ac.za\"></listing>\n* <listing name=\"University of Cape Town\" url=\"http://www.uct.ac.za\" phone=\"+27 021 650-2128\" fax=\"+27 021 650-5189\" email=\"admissions@bremner.uct.ac.za\" address=\"Cape Town\"></listing>\n* <listing name=\"University of KwaZulu-Natal\" url=\"http://www.nu.ac.za/\" phone=\"+27 031 260-3414\" email=\"education@ukzn.ac.za\" address=\"Durban, Pietermaritzburg, Pinetown and Westville\"></listing>\n* <listing name=\"Rhodes University\" url=\"http://www.ru.ac.za/\" phone=\"+27 (0)46 603-8111\" fax=\"+27 (0)46 622-5049\" email=\"registrar@ru.ac.za\" address=\"Grahamstown\"></listing>\n* <listing name=\"South African Film School (AFDA)\" url=\"http://www.afda.co.za\" phone=\"+27 011 482 8345\" address=\"Johannesburg and Cape Town\"></listing>\n* <listing name=\"Stellenbosch University (Maties)\" url=\"http://www.sun.ac.za\" phone=\"+27 021 808-4514\" fax=\"+27 021 808-3822\" email=\"beo1@sun.ac.za\" address=\"Stellenbosch\"></listing>\n* <listing name=\"University of the Free State\" url=\"http://www.uovs.ac.za\" phone=\"+27 051 401-3219\" fax=\"+27 051 401-9185\" email=\"niemannaja.rd@mail.uovs.ac.za\" address=\"Bloemfontein\"></listing>\n* <listing name=\"University of Fort Hare\" url=\"http://www.ufh.ac.za/\" phone=\"+27 040 602-2011\" fax=\"+27 040 653-1554\" email=\"dmc@ufh.ac.za\" address=\"Alice\"></listing>\n* <listing name=\"University of Limpopo\" url=\"http://www.ul.ac.za/\" phone=\"+27 015 268-9111\" fax=\"+27 015 267-0152\" email=\"\" address=\"\"></listing>\n* <listing name=\"North-West University\" url=\"http://www.nwu.ac.za/\" phone=\"+27 018 299-1111\" fax=\"+27 018 299-2799\" email=\"regcfvdw@puk.ac.za\" address=\"11 Hoffman St, Potchefstroom\"></listing>\n* <listing name=\"University of the Western Cape\" url=\"http://www.uwc.ac.za\" phone=\"+27 021 959-3900\" address=\"Cape Town\"></listing>\n\n[[South Africa]] is also an excellent venue to learn new skills such as flying, sailing and scuba diving since costs are generally far lower than in more developed countries while quality of training will be equal or better.\nExamples of companies that offer these kind of courses include:\n* <listing name=\"Blue Chip Aviation\" url=\"http://www.bluechip-avia.co.za\" phone=\"+27 012 543-3050\" email=\"bluechip@bluechip-avia.co.za\" address=\"Main Terminal, Wonderboom Airport, Pretoria\"></listing>\n* <listing name=\"Divetek\" url=\"http://www.divetek.co.za/\" phone=\"+27 011 791-1095\">For PADI dive courses</listing>\n* <listing name=\"Flight Schools South Africa\" url=\"http://www.flight-schools.net\" phone=\"+27 031 208-7960\" >Obtain a Private Pilots License</listing>\n* <listing name=\"Ocean Sailing Academy\" url=\"http://www.oceansailing.co.za/\" phone=\"+27 021 425-7837\" email=\"academy@oceansailing.co.za\">Offers Royal Yachting Association courses.</listing>\n* <listing name=\"Scubadviser\" url=\"http://www.scubadviser.com/destinations_1.aspx?id2=0:36412&id2=0:36233&id=1:35219\">Scuba diving guide to dive centres and liveaboard boats in South Africa</listing>\n'''Commercial diving''': South Africa is quite popular for commercial diver training as the qualification is internationally recognised by the International Diver Recognition Forum, and the Department of Labout is a member of the International Marine Contractors Association (IMCA). A South African Department of Labour certification as a Class I or Class II diver is acceptable for offshore work in many other parts of the world, including the North Sea and Nigerian offshore oilfields.\n\n==Work==\nDue to incredibly high levels of unemployment in South Africa, there are limited work opportunities for foreigners in the country. \n\nNon-South African citizens are only allowed to work in South Africa if they are in possession of a ''work permit''. Students in Canada can apply for a work visa through SWAP [http://www.swap.ca/], although costs are high the service is helpful and well organized. \n\nThe process of applying for a work permit is similar to applying for a study permit, contact a South African High Commission, Embassy, Consulate or Trade Mission in your country of origin, or in the nearest country, should there be no South African representation is available in your country. Government form B1-159 (A&C) needs to be completed for the application. Processing of the application will take 8 to 12 weeks.\n\n====Scarce Skills and Work Permit Quotas====\nThere are some skills that are in short supply in the country and the Department of Home Affairs has a ''Quota Work Permit'' program aimed at sourcing these skills from abroad. A list of skills in demand and set quotas for each of those skills are published yearly. Applicants with formal qualification and work experience in the required fields may apply for a quota work permit. This permit costs around R1600 and applications will take between 6 to 8 weeks to process. If the application is approved one will have a 90 day period (''from the time of entering the country'') to find employment in the field that the permit was issued for. Once employed, the permit will stay valid as long as one is employed within the same field of work (''changing employers is allowed''). More information, as well as the skills and quotas list for the current year, can be found on the Department of Home Affairs homepage [http://home-affairs.pwv.gov.za/skills.asp]\n\n==Stay safe==\nSouth Africa is notorious for an extraordinarily high violent crime rate (although part of this may be due to better crime reporting than most developing countries). It's not unheard of for the police to refuse to leave their air-conditioned offices to investigate crime on the basis that \"it's too dangerous out there!.\" South Africa is consistently ranked in the top 5 countries with the highest murder rates in the world (34 per 100,000 per year as of 2016). Muggings, car theft and rates of physical violence are among the highest in the world.  Cape Town is listed as one of top 10 most dangerous cities in the world and recent statistics show that the country is comparable to a \"war zone\" with around 60 people being murdered daily. South Africa is four times as dangerous as any other African country with over 220,000 recorded murders over the last 10 years. Rates of AIDs are in absolute numbers, the highest in the world, with 18.9% of the population affected. This has largely contributed to the country having one of lowest life expectancies in the world, at 48.2 for Black South Africans.\n\nHowever, by being vigilant and using common sense, you might have a safe and uneventful trip. The key is to know and stick to general safety precautions.  Never walk around in deserted areas at night or advertise possession of money and expensive accessories. Johannesburg can be very dangerous at any time of the day so it is best to stay alert, especially for White South Africans or Europeans alike. It is not unknown for people of White complexion being grabbed and kidnapped in broad daylight even in tourist areas of Cape Town and Johannesburg. It is estimated that Whites form between 10-15% of South Africa's population, however they hold up to 85% of the countries wealth. This consideration and the fact that the majority of Black South African's earn less than $1.25 a day instantly puts the White race at an elevated risk of attacks. Do not under any circumstances stop for any pedestrians laying in the road at night in poorly lit areas. They are attempting to rob and hijack your car. The majority of local middle/upper class South African's live in gated communities. Tall fences, electrical wires and lockable gates between bedroom doors and the rest of the house are a common theme. There are nearly 500,000 private security officers in the country, more than the police and army combined.\n\nDo not accept offers from friendly strangers. Do not wear jewellery or expensive watches. Do not wear a tummy bag with all your valuables, consider a concealed money belt worn under your shirt instead. Distribute your valuables in inside pockets and other pockets. A decoy wallet may also be worth considering. Leave passports and other valuables in a safe or other secure location. Do not carry large sums of money. Do not walk by night in deserted places. Hide that you are a tourist: conceal your camera and binoculars. Please also note that 18.9% of the adult population are HIV+ or have AIDS and deaths from complications amount to 130,000+ a year so if you have any sexual encounters practice safe sex.\n\nLike many developing countries, South Africa is not a good place for solo travellers to use local urban mass transport systems. Rent a car, take a taxi, or take an escorted tour. \n\nDo not leave your valuables in plain sight when driving in your car, as \"smash and grab\" attacks do sometimes occur at intersections, and keep your car doors locked, and windows closed. Know where to go so that you avoid getting lost or having to read a map in public: that will minimize the risk of inadvertently signalling to strangers that you are a tourist.\n\nIf you are carrying bags, try and hook them under a table or chair leg when sitting down, this will prevent them from being snatched.\n\nVisiting the townships is possible, but do not do it alone unless you really know where you're going. Some townships are safe while others can be '''extremely dangerous'''. Go with an experienced guide. Some tour companies offer perfectly safe guided visits to the townships.\n\nSouth Africa has very few earthquakes, cyclones, tornadoes, floods, terrorist incidents or contagious diseases (with the notable exception of HIV).\n\nNote that taking an evening stroll or walking to venues after dark can be very risky. It simply is ''not'' part of the culture there, as it is in Europe, North America or Australia. It is best to take a taxi (a metered cab, not a minibus taxi) or private vehicle for an \"evening out\".  The same applies to picking up hitchhikers or offering assistance at broken-down car scenes. It is best to ignore anyone who appears to be in distress at the side of the road as it could be part of a scam. Keep going until you see a Police station and tell them about what you have seen. \n\nBeware that if you are driving in South Africa, when police officers stop you to check your licence, and you show them an overseas driver's licence, they may come out with some variant of \"have you got written permission from [random government department] to drive in our country?' - if your license is written in English or you have a International Driving Permit then they can't do anything - stand your ground and state this fact - be polite, courteous and don't pay any money.\n\nTake extra care when driving at night. Unlike in Europe and North America, vast stretches of South African roads, especially in rural areas, are poorly lit up or often not lit up at all. This includes Highways. Be extra careful as wildlife and people often walk in the middle of the road. You must also take extra care when driving in South Africa due to the small risk of vehicle hijackings, which sometimes prove to be very violent in nature.\n\n===Security warning for O. R. Tambo International Airport===\nSimilar to other airports around the world, baggage operators may be tempted to steal valuables from checked baggage so it is best to pack accordingly. Pack valuables in carry-on luggage, use the airport's baggage wrapping service (R70 per bag) or consider shipping valuables separately. Remember that more than 100 mL of liquids are not allowed to be taken in carry-on luggage. If you cannot fit ''both'' your laptop and your digital camera in your carry-on bag, then one or the other is too big. Unless you are a professional photographer, or you're so old you don't care anyway (i.e. this is a \"bucket list\" trip), this is ''not'' the country to bring your desktop replacement laptop with 17-inch screen and digital SLR camera with telephoto lens. If you can afford to come to South Africa, then you can probably afford to buy a cheap used laptop and a smaller \"prosumer\" camera for which you won't feel quite as traumatized when you lose them to theft or robbery.\n\n===Important telephone numbers===\n[[Image:South Africa-Emergency Numbers01.jpg|thumb|Road signs will remind about emergency numbers]]\n\n* <listing name=\"The National Tourism Information and Safety Line\" phone=\"+27 (0)83 123-2345\">Operated by South African Tourism</listing> \n\n====From a fixed line====\n* '''107''' - Emergency (in Cape Town only from fixed lines)\n* '''10111''' - Police [http://www.saps.gov.za/]\n* '''10177''' - Ambulance\n* '''082911''' - Netcare911 [http://www.netcare911.co.za]  and The National Sea Rescue Institute [http://www.nsri.org.za]\n\n====From a mobile phone====\n* '''112''' - All Emergencies\n* '''082911''' - Netcare911 [http://www.netcare911.co.za]  and The National Sea Rescue Institute [http://www.nsri.org.za] ''(You only need to dial '''911''' from Vodacom mobile phones)''\n\n====International calls at local rates====\n* Step 1: Dial: '''087 150 0823''' from any mobile or landline [http://www.freecall087.co.za]\n* Step 2: Dial destination number and press #\n** e.g. 00 44 11 123 4567 # \n* Countries: USA, UK(Landline), India, Bangladesh, China, Hong Kong and many more.\n* Supported On: Vodacom, MTN, Cell C, Telkom and Neotel\n\n===Wildlife===\nOne of the main reasons travelers visit South Africa is to experience the outdoors and see the wide range of wildlife.\n\nWhen driving in a wildlife reserve, always keep to the speed limits and stay inside your car at all times.  \n\nDo not drive too close to elephants.  Be prepared to back up very quickly if they charge at you.  Elephants are strong enough to roll many small cars. They can total small cars by sitting on them (which means they blow out all tires and windows and bend the frame beyond repair) while you scream for your life inside. \n \nOn game drives or walks, always follow the instructions of your guide.  Many tourists have lost their lives after they disregarded instructions, or their guide carelessly allowed them to walk too close to wildlife.  You do not want \"trampled by elephant\" on your obituary! \n\nEnsure that you wear socks and boots whenever you are walking in the bush; do not wear open sandals. A good pair of boots can stop snake and insect bites and avoid any possible cuts that may lead to infections.\n\nIn many areas you may encounter wildlife while driving on public roads.  Monkeys and baboons are especially common. Do not get out of the vehicle to take photos or otherwise try to interact with the animals. These are wild animals and their actions can be unpredictable.\n\nSometimes you might find yourself in the open with wild animals (''often happens with baboons at Cape Point''). Keep your distance and always ensure that the animals are only to one side of you, do not walk between two groups or individuals. A female baboon may get aggressive if you separate her from her child.  \n\nAlways check with locals before swimming in a river or lake as there may be crocodiles or hippos.\nMost major beaches in [[KwaZulu-Natal]] have shark nets installed. If you intend to swim anywhere other that the main beaches, check with a local first.\n\nNote that shark nets may be removed for a couple of days during the annual sardine run (''normally along the KwaZulu-Natal coast  between early May and late July''). This is done to avoid excessive shark and other marine life fatalities. Notices are posted on beaches during these times.\n\n==Stay healthy==\n\n===Emergency and Medical Assistance===\nThere are a number of independent emergency assist companies in South Africa\n\n* <listing name=\"Netcare 911\" url=\"http://www.netcare911.co.za/inboundins.htm\" address=\"49 New Rd, Midrand\" phone=\"+27 011 254-1927\"> Some travel agents offer Netcare911 cover as an option, but you can also deal with them via Travel Insurance (''see below'') or find out if your existing cover has an association with them.</listing>\n* <listing name=\"Travel Insurance\" phone=\"+27 011 780-3300\">Contracted to Netcare and offers ''comprehensive EMS cover for the inbound traveler to South Africa''.</listing>\n* <listing name=\"ER24\" url=\"http://www.er24.co.za\" phone=\"+27 084 124\" address=\"Manor 1, Cambridge Manor Office Park, corner Witkoppen and Stonehaven, Paulshof, Sandton\">\nA large and well represented emergency assist company incorporating the Medi-Clinic chain of hospitals.</listing>\n\n===Hospitals===\nIt is best to avoid public hospitals where possible. Private hospitals (''such as the Netcare Group [http://www.netcare.co.za/] '') are of world class standard.\n\n===Pharmacies===\n\nThe major pharmacy chain found at shopping centers catering to tourists (e.g., Sandton City, V&A Waterfront) is Clicks.  Some supermarket chains like Checkers have in-store pharmacies.  \n\nSouth African pharmacies are generally comparable to their counterparts in Europe and North America.  However, note that the retail shelves of South African pharmacies tend to have a smaller selection of drugs than their North American counterparts, and a higher amount of dietary supplements.  South African pharmacies do carry many OTC drugs, but if you don't see them on the shelf, you'll have to ask for them at the counter when the pharmacist is in. \n\nFor example, the antidiarrheal drug Imodium (loperamide) is sold in South Africa under that name in slightly different packaging, but unlike in North America, it is not placed out on the retail shelves and must be asked for by name at the pharmacist's counter.\n\n===Water===\nMunicipal tap water is usually safe to drink throughout the country. In the Western Cape mountain water is safe, even if it has been stained brown due to vegetation. A strong risk of [[Tropical diseases|bilharzia]] exists for still-standing water.  \n\n===Sunburn===\nMany activities in South Africa are outdoors, see the [[Sunburn_and_sun_protection|sunburn and sun protection]] travel topic for tips on how to protect yourself.\n\n===HIV and AIDS===\nSouth Africa has one of the highest [[HIV]] infection rates world-wide. 5.4 million people out of a population of 48 million are HIV-positive ([http://www.mrc.ac.za/ ''South African Medical Research Council'']).\n\nThe HIV infection rate in the total population older than 2 years varies from around 2% in the Western Cape to over 17% in KwaZulu-Natal (''Avert'' and all together 18.8% of South Africans over 15 years of age are HIV-Positive (''UNICEF'' [http://www.unicef.org/infobycountry/southafrica_statistics.html#25]). One in four females and one in five males aged 20 to 40 is estimated to be infected (''Avert'' [http://www.avert.org/safricastats.htm]).\n\n===Malaria===\nThe north-eastern areas of the country (including the [[Kruger National Park]] and [[iSimangaliso Wetland Park|St. Lucia]] and surrounds) are seasonal malaria zones, from about November to May.  The peak danger time is just after the wet season from March to May.  Consult a physician regarding appropriate precautions, depending on the time of year you will be travelling.  The most important defences against malaria are:\n* using a [[Mosquitoes|DEET-based mosquito repellent]]\n* covering your skin with long-sleeved clothing, especially around dusk; and\n* using mosquito nets while sleeping.\n\n''Tabbard'' and ''Peacefull Sleep'' are commonly used mosquito repellents and can be bought almost anywhere.\n\nAlso read the [[Malaria]] and [[Mosquitoes]] travel topics.\n\n[http://wwwnc.cdc.gov/travel/destinations/traveler/none/south-africa '''The CDC also has these tips for staying healthy when traveling to South Africa.''']\n\n===Smoking===\nSmoking is banned in all enclosed public spaces, these include airports, pubs, shopping malls and theaters. OR Tambo airport has a smoking lounge. \n\nMost restaurants do have smoking sections, either ventilated indoor areas or outdoor open areas.\n\n==Respect==\nSouth Africans are generally polite, friendly and accommodating to tourists.\n\nPublic behaviour is very similar to what you might find in Europe. Heterosexual displays of affection in public are not frowned upon unless you overdo it. Homosexual displays of affection may generate unwelcome attention although they will be tolerated and respected in the more gay-friendly and cosmopolitan areas of Johannesburg (Sandton, Rosebank and Parkhurst), Cape Town (Greenpoint, Clifton and De Waterkant) and Durban. South Africa is '''the first and only African nation where the government recognizes same-sex relationships and homosexual marriages are recognized by law.'''\n\nMen generally greet with a handshake, which may be firm or gentle depending on culture, while women will do the continental kiss on the cheek.\n\nExcept for the few designated beaches, nude sunbathing is illegal, although topless sunbathing for women is sometimes acceptable along Cape Town's [[Clifton]] and [[Camps Bay]] beaches. Thong bikinis for ladies and swimming trunks for men (speedos if you really must) are acceptable. Eating places are casual except when otherwise indicated.\n\nEating is generally done the British way with the fork in their left hand and the tines pointed downward. Burgers, pizzas, bunny chows and any other fast foods are eaten by hand. It is generally also acceptable to steal a piece of ''boerewors'' from the ''braai'' with your hands. Depending on which cultural group you find yourself with, these rules might change. Indians often eat biryani dishes with their hands, a white person from British descent might insist on eating his pizza with a knife and fork or a black person might eat ''pap-and-stew'' with a spoon. Be adaptable, but don't be afraid to also do your own thing; South Africans are used to diversity. If your table manners are really unacceptable, people will generally tell you so rather than take offence.\n\nSouth Africans are proud of their country and what they have achieved. Although they themselves are quick to point out and complain to each other about the problems and shortcomings that still exist, they will harshly defend against any outsider doing so. \n\nOne thing you need to understand is that South African people are very straight-forward. If you do or say something that offends a South African, they will tell you so, in a very straight-forward manner. So, you must not be offended if this happens, but just apologise and change the manner in which you do things so that you don't offend any other people.\n\n===Race===\nThose who are practised in North American racial terminology should understand that familiar words have different meanings in South Africa, and the rules for what terms are polite or not are different. Also note that there are many South Africans that think classification according to skin colour or appearance in general, whether for political or social reasons, is inappropriate and would prefer to be referred to as simply South African irrespective of what you think they look like.\n  \n*If you wish to refer to South Africans of solely African ancestry, \"'''black'''\" is appropriate and will not cause offence. Terms such as \"person of colour\" that are considered politically correct abroad are not impolite, but are not generally used and may cause confusion.\n*The term \"'''coloured'''\" refers only to people of mixed European and African or Malay descent. Coloured people dwell chiefly in the Western Cape and generally speak Afrikaans or English, often both. Unlike in North America, \"coloured\" is not at all a derogatory term, but \"mixed race\" is - a coloured person may be offended if referred to as of mixed race. Some coloured people will also be mildly offended if incorrectly referred to as black.\n*White South Africans can quite simply be called \"'''white'''\" or \"white South African\". The mother-tongue of white South Africans is either Afrikaans (derived from Dutch) or English, so we have Afrikaans and English speaking white South Africans. Almost all white South Africans can speak English, even if their mother-tongue is Afrikaans since commerce is predominantly English and English is a mandatory subject in school.  Typical white South Africans consider themselves as \"African\" just as those born in the [[United States]] consider themselves \"American\"; most have family who have lived in South Africa for centuries, and the only continent they call home is Africa. Do not call an Afrikaans speaking person a \"Dutchman\" and avoid referring to Afrikaans as \"Dutch\" as they are fiercely independent and proud of their language, and do not consider themselves Dutch. In the white Afrikaans speaking community you will sometimes hear people referring to themselves as 'Boere'/'boers', literally meaning farmers.  This term dates back to the days before South Africa became a union and  there were two Boer republics (Transvaal and Orange Free State) who fought two wars against the British. Refrain from calling an Afrikaans speaker a Boer unless you are 100% certain that it is acceptable for this person.   Although some consider it a title of honor, others will feel highly offended if you do. English speaking whites will also most likely be amused by your ignorance if you call them Boers. Also take caution when using the term 'Afrikaner'.  Although it is a term generally used to refer to a white Afrikaans speaker, some prefer thinking of themselves in a broader context, and favour the term Afrikaanse, or Afrikaans speaker.  Safest however, is just to stick with the term South African.  \n\n*The fourth racial category left over from the apartheid system is \"'''Indian'''\" (''from [[India]]''), referring to South Africans whose distant ancestors came from India during the 19th century British colonial period.  The largest Indian populations are in KwaZulu Natal, in particular around Durban. Indians are also concentrated in Johannesburg.\n\nIn summary:\n* Black - the majority of South Africans - of bantu origin. The three most populous groups are Xhosa (Eastern & Western Cape), Zulu (KwaZulu Natal) and Sotho (Free State).\n* White - can be subdivided into Afrikaans speakers (the majority), and English speakers\n* Coloured - of mixed heritage - Afrikaans or English speaking, and concentrated in the Western Cape.\n* Indian - of Indian descent - concentrated around Durban\n\nIt is wise to avoid racial or political remarks while in South Africa if you don't have a good understanding of South African history because the country's very diverse cultural disposition means that \"putting your foot in it\" is easy.  However, you will encounter many South Africans who lived through the apartheid period, and who are willing to talk about their experiences of the time.  It can be very interesting to speak with them about their experiences, and if you have an open mind and willingness to listen, you can avoid offence.\n\nSouth Africa is now in its second decade since the end of ''apartheid'' ('''a very sensitive issue for everyone''') in 1990, but it is always easier to change laws than people. You will occasionally still hear overtly racist remarks, from any race group in South Africa, not only from white South Africans. This is more common from the older generation than the younger ones. The best thing to do is simply ignore it; leave the responsibility for enlightening lectures to other South Africans, who know the subject better than any foreign traveller as they have lived it. South Africans of different races generally treat each other politely at a personal level. Political movements are another matter, and political parties have been aligned along the racial fault lines of the society although there is starting to be a move toward better integration. The majority of black South Africans vote for the African National Congress, and the majority of white and coloured South Africans vote for the liberal centrist Democratic Alliance. Politics in South Africa is a touchy issue, and its best to talk about it with care.\n\nInterracial marriages are becoming quite common, and, except for possibly some of the older generation, people no longer take offense if you and your partner are not the same colour.\n\n==Contact==\n\n===Phone===\nSouth Africa's country code is 27. \n\nPhone numbers within South Africa are of the format 0XX YYY ZZZZ and all the digits must be dialled - there is no abbreviated local dialling\n\nLarge cities have area codes 0XX (Johannesburg is 011, Pretoria 012, Cape Town 021, Durban 031, Port Elizabeth 041, East London 043, Kimberley 053, Bloemfontein 051) while smaller towns may have longer area codes (0XX Y for example) with shorter local numbers.\n\nWhen dialing a South African number from outside the country, one should dial +27 XX YYY ZZZZ.\n\nDialing within the country one should use all 10 digits, 0XX YYY ZZZZ. \n\nTo dial out of South Africa, dial 00 followed by the country code and the rest of the number you are trying to reach. \n\nPay phones are available at airports, shopping malls and some petrol stations. The number of pay phones in open public areas have been reduced over recent years, but you should still be able to find one when you need one. Pay phones use either coins or prepaid cards that are available at most shops and petrol stations ; '''coin''' phones are generally blue while '''card''' phones are usually green.\n\n[[Image:South_Africa-Eastern_Cape-JBay-MTN_Tower01.jpg|thumb|MTN Tower in Jeffrey's Bay]]\n\n===GSM===\n[[South Africa]] has an extensive GSM network, working on the same frequency as the rest of Africa and [[Europe]]. There are five cell phone providers in South Africa: Vodacom [http://www.vodacom.co.za], MTN [http://www.mtn.co.za], Cell-C [http://www.cell-c.co.za], Virgin Mobile [http://www.virginmobile.co.za] and 8ta[http://www.8ta.co.za].\n\nThe networks support GPRS countrywide and 3G, EDGE and HSDPA support is available in larger urban areas.\n\nDo not assume you will not have network coverage just because you can not see a GSM tower. Many of the towers have been built to look like trees (''Vodacom'') or other structure (''MTN'') in order to better blend into the surroundings and not be an eyesore.  In some rural areas, GSM towers still look like towers because of problems with animals damaging them when they look like trees.\n\nObtaining a local SIM card in South Africa requires a bit of effort, as every SIM card must be registered under the Regulation of Interception_ of Communications and_Provision of Communication-related Information Act, 2002 RICA] law in order to access the network. As a foreigner, you will need to present a passport and a proof of residential address within South Africa (which can be provided by your hotel or can be a utility bill for a private home along with a signed letter from the home's owner or tenant). While SIM cards are available in many small shops for as low as R1, these will not work without RICA authorization which you need to obtain in person at the store of one of the big 5 network operators. They can usually do this on the spot in ten minutes or so if you show up with a passport and proof of address. Once you have a registered card, you can buy credit for prepaid phones just about everywhere, remembering you will usually need cash to do so from service stations.\n\n===Internet===\nThere are plenty of Internet Cafes and access rates are cheap.\n\nEven cheaper and more mobile would be to buy a prepaid cell phone starter pack (less than R10) and access the Internet with GPRS or 3G. Generally R2 per MB for out of bundle data from most providers (50c for Virgin Mobile), but it becomes significantly cheaper if you buy a data bundle. Vodacom prices range from 38c per MB on a 500MB bundle to 19c per MB on a 1GB bundle. MTN prices range between R1 per MB on a 10MB to 39c per MB on a 1GB bundle. Mobile data connections are always charged per MB as opposed to per second (as is popular on many European networks).\n\nADSL1 is popular for residential use and is generally available in speeds from 2mbps to 10mbps. Due to the Telkom monopoly on last-mile infrastructure, the total cost of fixed line internet is high. On average, ADSL data is R30/GB and although uncapped internet is becoming standard, it usually is quite slow.\n\n===Wi-Fi===\n[http://www.alwayson.co.za AlwaysOn]  seem to be leading the way in prepaid Wi-Fi access. \nTheir hotspots can now be found at Cape Town, Durban and OR Tambo airports, City Lodge Hotels, Sun International Hotels, some Southern Sun Hotels, Mugg & Bean restaurants and various other places.\n\nSimply connect to the access point and you will be given the opportunity to pay for access by credit card. Pricing starts at around R15 for 10 minutes or R60 for 100MB. \nTheir support desk can be contacted on +27 11 759 7300 \n.\n\n==Cope==\n\n\n===Dealing with beggars===\nAs is the reality with many developing countries, beggars are rife in South Africa. There are also many children and mothers with babies begging on the streets. People are discouraged by social services from giving children and mother-with-baby beggars money, as there are a number of children's homes available and giving them money keeps them on the street and often feeds a drug or drinking habit. However, if you encounter a particular friendly beggar, there's nothing stopping you from giving them a few rands or a burger or bag of apples. Just be aware that muggers and con-artists are also rife in South Africa, so be wary at all times.\n\n===Embassies and consulates===\n* <listing name=\"Australia\" address=\"292 Orient St, Cnr Schoeman St, Arcadia, Pretoria\" phone=\"+27 012 423-6000\" >High Commission</listing>\n* <listing name=\"Austria\" address=\"1109 Duncan St, Brooklyn, Pretoria\" phone=\"+27 012 452-9155\" email=\"pretoria-ob@bmaa.gv.at\">Embassy</listing>\n* <listing name=\"Belgium\" address=\"625 Leyds St, Muckleneuk, 0002 Pretoria\" phone=\"+27 012 440-3201\" email=\"pretoria@diplobel.fed.be\">Embassy</listing>\n* <listing name=\"Brazil\" address=\"Block C, Hatfield Office Park, 1267 Pretorius St, Pretoria\" phone=\"+27 012 426-9400\" email=\"pretoria@brazilianembassy.org.za\">Embassy</listing>\n* <listing name=\"Canada\" address=\"1103 Arcadia St, Hatfield, Pretoria\" phone=\"+27 012 422-3000\" email=\"pret@international.gc.ca\">High Commission</listing>\n* <listing name=\"Germany\" address=\"180 Blackwood St, Arcadia, Pretoria\" phone=\"+27 012 427-8900\" email=\"GermanEmbassyPretoria@gonet.co.za\">Embassy</listing>\n* <listing name=\"Greece\" address=\"1003 Church St, Arcadia, Pretoria\" phone=\"+27 012 430-7351\" email=\"embgrsaf@global.co.za\">Embassy</listing>\n* <listing name=\"India\" address=\"852 Schoeman St, Arcadia, Pretoria\" phone=\"+27 012 342-5392\" email=\"indiahc@hicomind.co.za\">Embassy</listing>\n* <listing name=\"Ireland\" address=\"2nd Floor, Parkdev Building, Brooklyn Bridge Office Park, 570 Fehrsen Street, Brooklyn 0181, Pretoria\" phone=\"+27 012 452 1000\" email=\"pretoria@dfa.ie\">Embassy</listing>\n* <listing name=\"Japan\" address=\"259 Baines St, Groenkloof, Pretoria\" directions=\"Cnr Frans Oerder St\" phone=\"+27 012 452-1500\" email=\"enquiries@embjapan.org.za\">Embassy</listing>\n* <listing name=\"Netherlands\" address=\"210 Queen Wilhelmina Ave, Nieuw Muckleneuk, Pretoria\" phone=\"+27 012 425-4500\" email=\"nlgovpre@cis.co.za\">Embassy</listing>\n* <listing name=\"Portugal\" address=\"599 Leyds St, Muckleneuk, Pretoria\" phone=\"+27 012 341-2340\" email=\"portemb@satis.co.za\">Embassy</listing>\n* <listing name=\"Russia\" address=\"316 Brooks Street, Menlo Park, Pretoria\" phone=\"+27 012 362-1337/8\" email=\"ruspospr@mweb.co.za\">Embassy</listing>\n* <listing name=\"United Kingdom\" address=\"255 Hill St, Arcadia, Pretoria\" phone=\"+27 012 421-7500\" email=\"media.pretoria@fco.gov.uk\">Her Britanic Majesty's High Commission</listing>\n* <listing name=\"United States of America\" address=\"877 Pretorius St, Arcadia, Pretoria\" phone=\"+27 012 431-4000\">Embassy</listing>\n\nIf your country is not listed here, have at look at the list provided by the Department of Foreign Affairs [http://www.dfa.gov.za/foreign/forrep/index.htm] .\n\n===International banks===\nA number of international banks operate branches in South Africa.\n\n* <listing name=\"ABN AMRO \" phone=\"+27 011 685-2000\" address=\"2 Exchange Sq, 85 Maude St, Sandton, Johannesburg\" url=\"http://www.corporates.abnamro.com/corporates/docs/country/southafrica.jsp\"></listing>\n* <listing name=\"Barclays Bank\" phone=\"+27 021 670-2300\" fax=\"+27 021 670-2328\" address=\"Any ABSA branch\" url=\"http://www.barclays.com/africa/south_africa/index.html\">Now part of ABSA</listing>\n* <listing name=\"Citibank\" phone=\"+27 011 944-0417\" address=\"Citibank Plaza, 145 West St, Sandton, Johannesburg\"></listing>\n* <listing name=\"Commerzbank\" phone=\"+27 011 328-7600\" fax=\"+27 011 328-7635\" address=\"5 Keyes Ave, Rosebank, Johannesburg\"></listing>\n* <listing name=\"Deutsche Bank\" phone=\"+27 011 775-7000\" fax=\"+27 11 322 6899\" address=\"3 Exchange Square, 87 Maude St, Sandton, Johannesburg\" url=\"http://www.db.co.za/\"></listing>\n* <listing name=\"HSBC\" phone=\"+27 (0)11 676-4200\" fax=\"+27 (0)11 783-9119\" address=\"2 Exchange Sq, 85 Maude St, Sandton, Johannesburg\" url=\"http://www.hsbc.co.za/\"></listing>\n* <listing name=\"Standard Chartered\" phone=\"+27 011 217-6635\" address=\"\" url=\"http://www.standardchartered.co.za/\" email=\"account.info@za.standardchartered.com\"></listing>\n\n===Stay legal===\nThere are some laws that the average tourist might not be aware of.\n\n* If you intend to do any angling (fishing), either freshwater or at the coast, you will require an ''angling licence'' for the province you are in. These can be obtained at any Post Office and the price depends on the province, but is generally under R50. Fishery and environments officials do from time to time check if anglers are in possession of a licence and you can expect to be fined if you are caught fishing without a licence. Also pick up a booklet from the nearest angling shop that will tell you what the size limits for each species of fish is.\n* Except for specific areas, clearly indicated by notice boards, it is illegal to drive a vehicle onto any beach.\n* Boat skippers need a license to pilot a craft on ALL water courses, fresh or saltwater, within South Africa.\n\n===Tickets===\nYou can get tickets online at Computicket [http://www.computicket.com]  for most major events that occur in South Africa. Every till point at Shoprite/Checkers [http://www.shoprite.co.za/]  is also a Computicket outlet.\n\n===Photography===\nAutomated machines to print (or copy to CD) from digital media (CF, SD, MMC, Memory stick etc.) are becoming quite common and easy to find. Larger shopping malls have dedicated photography shops where you can buy cameras and lenses or have a camera repaired. Most major camera manufacturers are well represented. If you still use film, it is possible to get it developed. Ask about this at larger camera shops.\n\n\n{{outline}}\n{{countryguide}}\n\n{{isPartOf|Southern Africa}}\n\n{{related|African_National_Parks}}\n{{related|African_flora_and_fauna}}\n{{related|Air_travel_in_South_Africa}}\n{{Related|Disabled_travel_in_South_Africa}}\n{{related|Discount_airlines_in_Africa}}\n{{related|Hiking_in_South_Africa}}\n{{related|World_Cup_2010}}\n\n{{related|Afrikaans_phrasebook}}\n{{related|Xhosa_phrasebook}}\n{{related|Zulu_phrasebook}}\n{{related|Sesotho_phrasebook}}\n{{geo|-30|26}}\n\n[[de:Südafrika]]\n[[eo:Sud-Afriko]]\n[[es:Sudáfrica]]\n[[fi:Etelä-Afrikka]]\n[[fr:Afrique du Sud]]\n[[he:דרום אפריקה]]\n[[hu:Dél-afrikai Köztársaság]]\n[[it:Sudafrica]]\n[[ja:南アフリカ]]\n[[nl:Zuid Afrika]]\n[[pl:Republika Południowej Afryki]]\n[[pt:África do Sul]]\n[[ro:Africa de Sud]]\n[[ru:Южно-Африканская Республика]]\n[[sv:Sydafrika]]\n[[zh:南非]]\n[[wts:Category:South Africa]]\n\n[[WikiPedia:South Africa]]"
        }
    }
}