{
    "parse": {
        "title": "Sweden",
        "pageid": 118,
        "wikitext": {
            "*": "{{pagebanner|Sweden Banner.jpg}}{{otheruses}}\n{{quickbar\n|image=SwedenStockholmSergelsTorgNight.jpg\n|caption=Sergels Torg, Stockholm\n|location=Sweden in its region.svg\n|flag=Flag of Sweden.svg\n|capital=[[Stockholm]]\n|government=Constitutional Monarchy and Parliamentary Democracy\n|currency=Swedish Krona (SEK)\n| area=''total:'' 450,295 km<sup>2</sup><br />''water:'' 39,960 km<sup>2</sup><br />''land:'' 410,335 km<sup>2</sup>\n|population=10,215,250 (October 2018 census)\n|language=[[Swedish phrasebook|Swedish]], large [[Finnish]] speaking minority (470 000, RUAB 2005), most people speak apprehensible English \n|religion=23% theist (mainly Lutheran with Muslim and Catholic minorities), 76% non theist (including 23% atheist)\n|electricity=230V/50Hz (European plug)\n|tld=.se\n|timezone=UTC +1\n|callingcode=+46\n|emergencies=dial '''112'''\n}}\n\n[http://www.visitsweden.com/ '''Sweden'''] (''Sverige'') is the largest of the [[Nordic countries]], with a population of about 10 million. It borders [[Norway]] and [[Finland]] and is connected to [[Denmark]] via the bridge of Öresund (''Öresundsbron'').  The Baltic Sea lies to the east of Sweden, as well as the Gulf of Bothnia, which separates Sweden from most of Finland. The northernmost part of Sweden belongs to the [[Arctic]].\n\n==Understand==\nAlthough having been a military power and spanning about three times its current size during the 17th century, Sweden is one of the two European countries that has not been at war since 1815, the other being Switzerland. Having long remained outside military alliances (including the World Wars), the country has a high peace profile, with internationally renowned names such as Raoul Wallenberg, Dag Hammarskjöld, Olof Palme and Hans Blix. Sweden is a monarchy by constitution, but King Carl XVI Gustaf has no executive power. The Swedish people were Pagans until around the year 1000, then Christianised and obedient to the Roman Pope until the 16th century, when the church was reformed to Lutheran-Protestant. Today's Sweden is a secular state with very few church-goers.\n\nSweden is a developed post-industrial society with an advanced welfare state. The standard of living and life expectancy rank among the highest in the world. Sweden joined the European Union in 1995, but decided by a referendum in 2003 not to commit to the European Monetary Union and the Euro currency. Leadership of Sweden has for the larger part of the 20th century been dominated by the Social Democratic Party, which started out at the end of the 19th century as a labor movement. Since the 2014 election, a coalition of left-middle social democratic/green parties hold the power.\n\nSweden has a strong tradition of being an open, yet discreet country. There is a widespread rumor that Swedes sometimes appear to be quite reserved at first, but once they get to know who they are dealing with, they'll be as warm and friendly as you'd wish. This may have been true in the 40's but is not anymore. This myth may have been produced by the large number of Swedes living abroad where, as foreigners, they more often would participate in social activities, as they had no family in the new country. Privacy is regarded as a key item and many visitors, for example mega-stars in various lines of trade, have many times realized that they mostly can walk the streets of the cities virtually undisturbed.\n\nSweden houses the [http://www.nobel.se/ Nobel Prize committee] for all the prizes except the peace prize, which is hosted in Oslo, a memento of the Swedish-Norwegian union that was dissolved in 1905.\n\n==Regions==\n{{Regionlist\n| regionmap=Map-Sweden01.png\n| regionmaptext=Regions of Sweden\n| regionmapsize=200px\n| region1name=[[Norrland]]\n| region1color=red\n| region1items=\n| region1description=the sparsely populated, northern part of the country (It spans more than half of the country's total area), with nine provinces. Lots of wilderness, with forests, lakes, big rivers, enormous marshes and high mountains along the border to Norway. Great for hiking and winter sports. Largest cities are [[Gävle]], [[Sundsvall]], [[Umeå]] and [[Luleå]].\n| region2name= [[Svealand]]\n| region2color=green\n| region2items=\n| region2description=the central part of the country, includes [[Stockholm]], [[Uppsala]] and the provinces of [[Dalarna]], [[Närke]], [[Värmland]], [[Södermanland]], [[Uppland]] and [[Västmanland]].\n| region3name=[[Götaland]]\n| region3color=blue\n| region3items=\n| region3description=the ten southern provinces, including the island-provinces [[Öland]] and [[Gotland]]. The largest cities in Götaland are [[Gothenburg]] in [[Västergötland]] and [[Malmö]] in [[Skåne]]. Also containing [[Dalsland]], [[Halland]], [[Småland]] and [[Blekinge]].\n}}\n\n==Cities==\n;Major cities\n*[[Stockholm]] - The capital and largest city, famous for its beauty and the amazing archipelago. In addition, Stockholm offers a unique nightlife scene and it is home to some of Northern Europe's best restaurants.\n*[[Gothenburg]] ([[Gothenburg|Göteborg]] in Swedish) - A port and industrial city on the west coast, second in size.\n*[[Malmö]] - Connected to the Danish capital of [[Copenhagen]] by the Öresund Bridge.\n*[[Västerås]] - The centre of Swedish industrialisation. Only an hour away from [[Stockholm]].\n*[[Växjö]] - In the heart of Småland, this beautiful city defended Sweden against the Danes back in the day. \n*[[Linköping]] - A university city and the 7th most populous in Sweden. \n*[[Jönköping]] - A picturesque town surrounded by lakes in [[Småland]], also the 10th most populous in Sweden.\n*[[Kiruna]] - A mining town in [[Upper Norrland|Lappland]], and the northernmost city in Sweden.\n*[[Luleå]] - A industrial city in northern [[Norrland]], with a technical university.\n\n==Get in==\n\n===Entry requirements===\n{{Schengen}}\n\nAside from the Schengen requirements laid out above, the Swedish government specifies the following requirements for obtaining a work permit:\n\n'''Citizens of EU countries'''\n''Passport/ID is required''\nAs an EU citizen, you are entitled to work in Sweden without a permit. You also have the right to come to Sweden to look for a job. Your family has the right to join you in Sweden as long as you have right of residence in Sweden.\n\nWhen entering Sweden, you and any accompanying family members must have a valid passport or national ID card showing your citizenship.\n\n''Family from outside the EU?''\nIf your spouse/common law spouse/registered partner/dependent children/dependent parents are not EU citizens, they will need to apply for residence cards, but this can also be done after moving to Sweden, at the same time as you register your right of residence.\n\n''Long-term EU resident?''\nIf you have lived in another EU country with a residence permit for at least five years, you qualify as a long-term resident and can apply, in that country, for a special EU residence permit. This makes it easier to move to another EU country.\n\n'''Citizens of non-EU countries'''\n''Step one: a work permit''\nGenerally, citizens from countries outside the EU must apply for a work permit to work in Sweden.\n\nThere are a few exceptions to the rule. Citizens of Australia, Canada, New Zealand and South Korea aged 18–30 can also apply for a working holiday visa for up to one year.\n\nFor employment that lasts less than three months, citizens of certain countries must have both a work permit and a visa. Also note that employees in certain fields may be exempt from work permit regulations.\n\n''Requirements for a work permit''\nTo qualify for a work permit, you must have received an official offer of employment from a Swedish employer. The job must also:\n\n* have been advertised in the EU/EEA for at least ten days\n* offer terms of employment that match those set by Swedish collective agreements or those that are customary within the occupation or industry\n* pay a minimum monthly salary of SEK 13,000 before taxes.\nYou must also hold a valid passport in your home country.\n\n''Permits for family members''\nIf you are a non-EU citizen eligible to receive a work permit, your spouse/common law spouse/registered partner and children up to age 21 (as well as children over 21 who are financially dependent on you) have the right to join you in Sweden. They must apply for residence permits, either as part of your application or separately.\n\n''The application process''\nGenerally, you will need to apply for your permit before entering Sweden, though in some cases you may be able to apply from within Sweden if you are already legally living in the country.\n\n* Receive an offer of employment – which must have been approved by a relevant trade union.\n* Compile and submit your application – either online or through a paper application submitted to your closest Swedish embassy or consulate. Your completed application must include:\n* a completed application form\n* copies of the pages of your passport that show personal data, period of validity and whether you have permission to live in countries other than your country of origin (e.g. other visas or residence permits)\n* your offer of employment and the statement from the trade union\n* an application fee.\n* The Migration Agency considers your application and informs you of its decision, see current waiting times.\n* Submit data for visa and residence permit card.\n\n''Extending a work permit''\nIf you want to keep working after your current permit has expired, you need to apply for an extension. If you apply before your current permit expires, you are entitled to keep working while waiting for a decision.\n\n'''Citizens of Nordic countries'''\nCitizens of a Nordic country have the right to freely live and work in Sweden without registering with the Migration Agency. However, you should register with the Swedish Tax Agency to gain a Swedish personal identity number.\n\n'''Citizens of Switzerland'''\nSwiss citizens need a residence permit to work in Sweden for longer than three months. You apply for your residence permit after entering Sweden and can start working as soon as you enter the country. When entering Sweden, you must have a valid passport. Your family may join you.\n\n'''International students'''\nInternational students with a residence permit in Sweden are allowed to work alongside their studies. If they want to stay and work in Sweden after completing their studies, they need a work permit.\n\n===By plane===\nFor arrival and departure times, as well as lots of other information about flights and airports in Sweden, visit [http://www.lfv.se/ Luftfartsverket - the Swedish Airports and Air Navigation Services website]\n\nMajor airports:\n*[http://www.arlanda.se '''Stockholm Arlanda'''] ({{IATA|ARN}}) ({{ICAO|ESSA}}) - serves most major airlines. Check the [[Stockholm#Get in|Stockholm]] page for information on transfer between the airport and Stockholm City.\n*[http://www.landvetter.lfv.se/ '''Göteborg Landvetter'''] ({{IATA|GOT}}) ({{ICAO|ESGG}})  - serves several international airlines and provides convenient bus transfer (~20 min) to central [[Gothenburg]].\n* '''Copenhagen Kastrup (Denmark)''' ({{IATA|CPH}}) ({{ICAO|EKCH}}) [http://www.cph.dk/] - serves most major airlines. Located on an island between [[Copenhagen]] and [[Malmö]], good for jorneys to southern Sweden. Train connections leave from the airport to both cities.\n\nSmaller airports:\n* '''Stockholm Skavsta''' ({{IATA|NYO}}) ({{ICAO|ESKN}}) [http://www.skavsta-air.se/en/] - airport for low fares airlines like Ryanair [http://www.ryanair.com] and Wizzair [http://www.wizzair.com]. Located about 100 km from Stockholm, near the town of [[Nyköping]].\n*'''Stockholm Västerås''' ({{IATA|VST}}) ({{ICAO|ESOW}}) [http://www.vasterasflygplats.se/] - international flights to/from Copenhagen and London. Also about 100 km from Stockholm.\n* '''Malmö-Sturup''' ({{IATA|MMX}}) ({{ICAO|ESMS}}) [http://www.lfv.se/templates/LFV_AirportStartPage_Arlanda____38763.aspx] - serves domestic flights and low fares flights. Located about 30 km from [[Malmö]].\n* '''Linköping City Airport''' ({{IATA|LPI}}) ({{ICAO|ESSL}}) [http://www.linkopingcityairport.se/] - international flights with KLM to/from [[Amsterdam]], and seasonal to/from [[Prague]] with Czech Airlines. Located in the city of Linköping, about 250 km from Stockholm, it serves the southeastern parts of Sweden.\n\nMost airports can be reached by '''Flygbussarna - Airport coaches''' [http://www.flygbussarna.se/] for tickets around 70 to 100&nbsp;SEK. Copenhagen Airport is best reached by train. See '''Skånetrafiken''' [http://www.skanetrafiken.se] for schedules.\n\n===By train===\nYou can reach Sweden by train from three countries at present:\n\n* '''Denmark''': Trains depart [[Copenhagen]] and Copenhagen's airport for [[Malmö]] every 20 minutes, and cost only about SEK 100 (\"Öresundståg / Øresundstog\" regional trains). The train goes over the magnificent ''Öresund Bridge'' to get to Sweden in less than 30 minutes. Furthermore direct trains (X2000) leave from Copenhagen to [[Stockholm]]. The [[Elsinore]]-[[Helsingborg]] connection, known as one of the busiest ferry routes in Europe, might also be used (change to ship).\n\n* '''Norway''': Main connections between [[Oslo]] and Stockholm and [[Gothenburg]] as well as connections between [[Trondheim]] - [[Åre]] - [[Östersund]] and [[Narvik]] - [[Kiruna]] - [[Boden]] - [[Stockholm]].\n\n* '''Germany''': [[Berlin]] to [[Malmö]] with \"Berlin Night Express\". There are also several trains per day from Hamburg to Copenhagen, and night trains from München, Basel, Köln and Amsterdam to Copenhagen. See Denmark section about how to get from Copenhagen to Sweden.\n\n* '''Finland''': Travel via [[Kemi]]-[[Tornio]]-[[Haparanda]]-[[Luleå]] / [[Boden]] by bus. Interrail tickets are valid on that bus. There's no train connection as Finland and Sweden use a different gauge.\n\n===By bus===\nGet into Sweden by \"Eurolines\" [http://www.eurolines.se] or \"gobybus\" [http://www.gobybus.se] or [http://nor-way.pl Nor Way]. All connections here go via [[Copenhagen]].\n\nBuses from and to the Western Balkans are also operated by Toptourist, [http://www.toptourist.dk/index.html]. Call + 46 (0 ) 42 18 29 84 for more info\n\n===By boat===\n{{infobox|[[Baltic Sea cruises]]|''\"Our level of drunkenness was normal for a cruise of this kind.\"'' The managing director of shipping company Tallink gave an interesting quote after his and the entire board's drunken rampage on one of Tallink's cruise ships in 2006. (The accusations against the VIP's included sexual harassment against female staff, beating up a bartender and causing a fire by putting a fish in a toaster.) The director's explanation clearly shows the main PR problem about the cruise ships on the Baltic Sea: they have a reputation as trashy booze boats, far from the glamor of other international cruises. This is largely due to the fact that the tickets can be dirt cheap - sometimes less than 50 SEK - and that tax-free alcohol shopping is among the main attractions. Still, some of the new ships are really pretty, and it is an easy and cheap way to get a glimpse of a country on the other side of the Baltic Sea. Also, not all cruises include obnoxious drunks trying to toast fish. [[Stockholm]] is the main port in Sweden for the cruises, and the main destinations are [[Helsinki]], [[Åland]] and [[Turku]] in [[Finland]], [[Tallinn]] in [[Estonia]] and [[Riga]] in [[Latvia]]. Ships are operated by Silja Line [http://www.silja.com/en/], Viking Line [http://www.vikingline.se/], Birka Cruises [http://www.birka.se/] and, of course, Tallink [http://www.tallinksilja.com/en/], MSC cruises [http://www.msccruises.se/]. To get the cheapest tickets, try to go on a weekday in low season, share a four-bed cabin with some friends and make sure to keep your eyes peeled for last minute offers.\n|print=fullpage}}\n====Belgium====\n* From [[Ghent]] to [[Gothenburg]] by DFDS Torline [http://freight.dfdsseaways.com/dfds_ferries/north_sea_ferries/gothenburg_ghent_ferries/] ([[Freighter travel|cargo line]] with limited passenger capacity)\n\n====Denmark====\n* From [[Grenå]] to [[Varberg]] by Stena Line [http://www.stenaline.com].\n* From [[Frederikshavn]] to [[Gothenburg]] by Stena Line.\n* From [[Elsinore]] to [[Helsingborg]] by Scandlines [http://www.scandlines.se/SEFront/Front_COM] and Sundsbusserne. [http://www.sundbusserne.dk/]\n\n====Estonia====\n* From [[Tallinn]] to [[Stockholm]] (via [[Helsinki]]) by Viking Line [http://www.vikingline.fi/index.asp?lang=en].\n* From [[Tallinn]] to [[Stockholm]] (direct connection) by Tallink [http://www.tallink.com/].\n* From Paldiski to Kapellskär (direct connection) by DFDS Ferries\n\n====Finland====\n* From [[Helsinki]] to [[Stockholm]] (via [[Åland]]) by Tallink Silja [http://www.siljaline.se/] and Viking Line.\n* From [[Naantali]] to [[Kapellskär]] by Finnlines [http://www.finnlines.com/ferry-trips/].\n* From [[Turku]] to [[Stockholm]] (via [[Åland]]) by Tallink Silja and Viking Line.\n* From [[Vaasa]] to [[Umeå]] by RG Line [http://www.rgline.com/?lang=en].\n\n====Latvia====\n* From [[Riga]] to [[Stockholm]] by Tallink [http://www.tallink.lv/lv/].\n* From [[Ventspils]] to [[Nynashamn]] by Scandlines.\n\n====Lithuania====\n* From [[Klaipeda]] to [[Karlshamn]] by DFDS Seaways [http://www.dfdsseaways.se/#].\n\n====Germany====\n* From [[Travemünde]] to [[Trelleborg]] by TT-Line [http://www.ttline.com/en-GB/United-Kingdom/?c=1].\n* From [[Travemünde]] to [[Malmö]] by Finnlines [http://www.finnlines.com/ferry-trips/].\n* From [[Kiel]] to [[Gothenburg]] by Stena Line.\n* From [[Sassnitz]] to [[Trelleborg]] by Scandlines [http://www.scandlines.se/SEFront/Front_COM].\n* From [[Rostock]] to [[Trelleborg]] by Scandlines and TT-Line.\n\n====Norway====\n* From [[Sandefjord]] to [[Strömstad]] by Color Line [http://www.colorline.com/]\n\n====Poland====\n* From [[Gdansk]] to [[Nynäshamn]] by Polferries [http://www.polferries.pl/en/home].\n* From [[Gdansk]] to [[Visby]] by Polferries.\n* From [[Gdynia]] to [[Karlskrona]] by Stena Line [http://www.stenaline.pl/en/ferries/]. \n* From [[Świnoujście]] to [[Ystad]] by Polferries.\n\n====Russia====\n* From  [[Saint-Petersburg]] to [[Stockholm]] by St. Peter Line [http://anastasia.stpeterline.com/en/OnBoard/News.aspx].\n\n====UK====\n* From [[Immingham]] and [[Tilbury]] to [[Gothenburg]] by DFDS Torline [http://www.dfdstorline.com/Infobridge/] ([[Freighter travel|cargo line]] with limited passenger capacity).\n\n==Get around==\n\n\nThe ancient '''Right of Public Access''' (''allemansrätten'') grants everybody a right to move freely in nature on foot, swimming, by horse, by ski, by bicycle or by rowing boat  (but not driving) even on others' private property (although not on private lawns or gardens). However, with this right comes an obligation to respect the integrity of nature and the privacy of others. You are not allowed to disturb any animals or do any kind of damage to plants or trees. It is therefore important to understand the limitations. If you are camping it is important that you find a site that is well away from people’s houses and not on farmland. Choose hardy ground to pitch your tent, and avoid land used for grazing or for growing crops. \nLarge groups must obtain the landowner’s permission\nIt is within the Right of Public Access to pitch two or three tents for a night or two. But a large group of people pitching large numbers of tents can cause problems with sanitation and damage to the ground. The landowner’s permission must be obtained in such cases.\n\nSwedish train and local bus carriers use a coordinated ticket system named Resplus, allowing booking of door-to-door tickets at many places. (Air and long distance buses not included) [http://resplus.se/Resplus/Flersprak/English/Om-Resplus/] Booking can be done through [http://www.sj.se SJ].\n\n[http://www.resrobot.se/ Resrobot] is on-line tool for finding the best modes of transport between two locations, without booking features, though. The English flag button changes language.\n\n===By plane===\nDomestic flights are mainly for travellers with more money than time, and the vast distance in northern Sweden. There are also low-price tickets, but they must be bought well in advance.\n\nThe most important domestic airlines:\n\n*'''SAS''' [http://www.sas.se/en/] - the international airline, and flag carrier, has many domestic routes as well.\n*'''Blekinge Flyg''' [http://www.blekingeflyg.se/mainmenu/book.aspx] - the most south east airport in Sweden and the only one in [[Blekinge]].\n*'''Nextjet''' [http://www.nextjet.se/] - has many domestic routes to smaller places, has taken over some of Skyways routes.\n*'''Direktflyg''' [http://www.direktflyg.com/] - several domestic routes and also flights to [[Norway]].\n*'''Norwegian''' [http://www.norwegian.se/] - Europes third largest low-cost airline. Serves many domestic and a a lots of international destinations.\n*'''Malmö Aviation''' [http://www.malmoaviation.se/] - serves domestic destinations, [[Brussels]] and [[Nice]].\n*'''Gotlandsflyg''' [http://www.gotlandsflyg.se/] - connects [[Stockholm]] and the island of [[Gotland]].\n\n===By train===\nSweden has an extensive railway network. Most major lines are run by the government-owned company  Statens Järnvägar or '''SJ'''. To buy a railway ticket, or to obtain information, phone +46 771 75 75 75 or check their '''website''' [http://www.sj.se]. As of summer 2009, the cheapest SJ tickets are released exactly 90 days before departure, so time your online ticket purchases carefully if your itinerary is set and don't buy tickets earlier than 90 days before your trip. SJ recently started auctioning last minute tickets on the Swedish eBay site Tradera [http://www.tradera.com/ticketfinder/] (site only in Swedish), available from 48 until 6 hours before departure. Because point-to-point tickets are quite expensive, for more train journeys in Sweden InterRail [http://www.interrailnet.com/interrail-passes/one-country-pass/sweden] (for European citizens) or Eurail [http://www.scandinavianrail.com] (for non-European citizens) pass might be useful.\n\nRegional public transport is usually operated by companies contracted by the counties. For instance, when travelling regionally in the province of [[Scania]] (''Skåne'' in Swedish), one should refer to '''Skånetrafiken''' [http://www.skanetrafiken.se ]. For travelling in the region of [Mälardalen] (the \"Lake Mälaren Valley\"), you can check all train and bus operators on a mutual website, '''Trafik i Mälardalen''' [http://www.timinfo.se]. This regional traffic cooperation includes many of Sweden's major cities, such as ''Stockholm'', ''Uppsala'', ''Västerås'', ''Linköping'', ''Norrköping'', ''Örebro'' and ''Eskilstuna'', and reaches more than three million people. '''Connex''' [http://connex.se/tmpl/XStartPage____36412.aspx?epslanguage=EN] provides affordable railroad transportation up north. If you're on a tight schedule, be aware that trains, especially those bound for far destinations (i.e. the Connex and SJ Norrland trains), sometimes have quite significant delays (up to 1-2 hours).\n\nUnlike most European countries, however, bicycles are generally not allowed on SJ trains. The list of trains transporting bicycles is on SJ website [http://www.sj.se/sj/jsp/polopoly.jsp?d=222&a=139310&l=en]. The bicycle surcharge is 149 SEK and you should buy it at least one day in advance. Skånetrafiken, Öresundståg, Krösatågen and some other local trains do permit bicycles on a surcharge.\n\nTickets for local trains generally are the same as for local buses. They can be bought onboard using credit cards, even if advance purchase in newspaper shops is preferred. It is also possible to buy tickets for local trains and many local buses on [http://www.sj.se]. Note that in Stockholm and Göteborg tickets are not sold onboard buses.\n\n===By bus===\n'''Swebus''' [http://www.swebus.se] and '''gobybus''' [http://www.gobybus.se] runs a number of bus lines in the southern third of the country, Götaland and Svealand. They tend to be a little cheaper than going by train if you can't take advantage of SJ's youth discounts. '''Y-buss''' [http://www.ybuss.se] and '''Härjedalingen''' [http://www.harjedalingen.se] operate between Stockholm and Norrland.\n\nSwebus also operates from Stockholm and Göteborg to Oslo.  At the county or ''län'' level, buses are a good method for traveling short distances from town to town, as they are more frequent and cheaper than trains. It is best to check with the local transportation authority for routes and schedules. A newcomer on the bus market is Bus4You [http://bus4you.se/]\n\n===By taxi===\n[[Image:Stockholm taxi pricey vs cheap.jpg|thumb|300px|'''Taxi rip-off alert:''' NEVER step into a Swedish taxi without checking the yellow price sign on the rear window first! Taxi drivers are legally allowed to charge any prices as long as they are stated clearly on the sign. The taxi to the left is twice as expensive as the one to the right. The price tag should say around 300-350 SEK for a Stockholm cab.]]\nTaxi cars are readily available in Swedish cities. You can order a taxi by phone, in stands or by picking one up on the street. Most cars accept both cash and credit cards such as Visa, Mastercard and American Express.\n\nThe Swedish taxi business is completely unregulated. This means that the taxi drivers are free to charge any prices they want. Always make sure to check the yellow price sign on the rear windows and be wary of taxi cars that mimics the major taxi companies logotypes to fool tourists, especially at major destinations, i.e. airports, train stations and night clubs. Ask about the price for the trip in advance, most taxi drivers will offer a flat rate. Many companies also offer flat rates from the airport to the closest city.\n\n'''Stockholm'''\nTaxi Stockholm (Phone: 08-15 00 00)\nTaxi Kurir (Phone: 0771-86 00 00)\nTaxi 020 (Phone: 020-20 20 20)\n\n'''Gothenburg'''\nTaxi Göteborg (Phone: 031-650 000)\nTaxi Kurir (Phone: 031-27 27 27)\n\n'''Malmö'''\nTaxi Skåne (Phone: 046-330 330)\nTaxi Kurir (Phone: 0771-86 00 00)\n\n===By car===\nIn [[Svealand]] and [[Götaland]] driving takes you quickly from one place to the other. In [[Norrland]] the distances tend to be larger. Unless you really like driving, it is often more convenient to take the train or fly to the sites, particularly in Northern [[Norrland]]. Traveling by night can be dangerous due to wild animals on the roads, and the cold nights during the winter. Collisions with moose, roe deer, or other animals are a not uncommon cause of car accidents.\n\nSee also [[Driving in Sweden]] and [[Winter driving]].\n\n===By thumb===\nSweden has a reputation for being a pretty difficult country to hitch in, though it's still quite possible to hitchhike (but not assured to be risk-free). Ordinary people are often reluctant to pick up strangers. Truck drivers are probably most likely to pick up hitchhikers, so target them. Asking at gas stations works pretty well. Bus stops are common places to attract attention, position yourself before the actual bus stop so the vehicle can stop at the stop. This works best if the road is widened at the bus stop, allowing cars to pull off easily. It is illegal to bike, walk, hitch and pick up lifters on motorways.\n\n===By bike===\nMost Swedish cities have excellent bicycle paths, and renting a bike can be a quick and healthy method of getting around locally. Some cities have bikes for borrowing. Inter-city cycling is a good option for the experienced cyclist.\n\n===By foot===\nCars are by law required to yield at any unattended crosswalks (striped pedestrian crossing - no lights) to let pedestrians cross the road. But keep in mind that you are required to make eye contact with the driver and actively show your intentions of crossing the street. Accidents are prone at these points in heavy city traffic due to lack of careful driver - pedestrian interaction.\nThe requirements of interaction between driver and pedestrians makes four lane avenue crossing especially dangerous. Make sure cars in both lanes stop. Drivers in the outer lanes might not see you at all.\n\n==Talk==\n[[Swedish phrasebook|'''Swedish''']] is the national language of Sweden, but you will find that people, especially those born since 1945, also speak English very well - an estimated 89% of Swedes can speak English, which makes it one of the best countries in the world in English as a second language. [[Finnish phrasebook|Finnish]] is the biggest minority language. Regardless of what your native tongue is, Swedes greatly appreciate any attempt to speak Swedish and beginning conversations in Swedish, no matter how quickly your understanding peters out, will do much to ingratiate yourself to the locals.\n\n'''Hej''' (''hey'') is the massively dominant greeting in Sweden, useful on kings and bums alike. You can even say it when you leave. The Swedes most often do not say \"please\" ('''snälla''' say snell-LA), instead they are generous with the word '''tack''' (''tack''), meaning \"thanks\". If you need to get someone's attention, whether it's a waiter or you need to pass someone one in a crowded situation, a simple \"'''ursäkta'''\" (say \"or-shek-ta\") (\"excuse me\") will do the trick. You will find yourself pressed to overuse it, and you sometimes see people almost chanting it as a mantra when trying to exit a crowded place like a bus or train.\n\nSome things get English names that do not correspond to the original English word. Some examples are '''light''' which is used for diet products, and '''freestyle''' which means \"walkman\". Sweden uses the metric system and in the context of distance, the common expression ''mil'', \"mile\", is 10 kilometers, not an English statute mile. Because of the distances involved, ''mil'' is used in spoken language even though roadsigns all use kilometers.\n\nSwedish people learn British English at school, but also watch films and TV programs in American English. Whether they use British or American standards in speech varies from person to person; as a rule of thumb, young people are more likely to speak American English while British English is more prevalent among the older generations.\n\nYou should also be able to get by if you speak either Danish or Norwegian.\n\nForeign television programmes (including news interviews featuring foreigners) and films are almost always shown in their original language with Swedish subtitles. Only children's programmes are dubbed into Swedish.\n\n==See==\n{{Infobox|Raggare: The Swedish greaser culture|Since the 1950s, young Swedes have been fond of American cars, rock'n'roll and rockabilly music, and greased hair. A sub-culture known as '''raggare''' (also, though unrelated, the Swedish word for \"pick-up artist\") keeps the American greaser culture alive in the middle-Swedish countryside. As the legal driving age is 18, the younger teens in the countryside ride geared-down custom cars registered as tractors, a unique vehicle class. The '''Power Meet''' [http://www.bigmeet.com/] is a series of meetings for American vintage and custom cars, in several Swedish towns. The biggest meeting takes place in Västerås.}}\n\nSweden is less populated than most other parts of Europe, especially [[northern Norrland]]. Large cities are often located by the coast and rivers. An exception is [[Jonköping]] which is right by the shore of the [[Vättern]], Sweden's second largest lake. The inland mostly has smaller cities, lone houses, and a huge amount of forest interspersed with moors and lakes. The north of Sweden is dominated by the Scandinavian Mountains and coniferous forests, while the south has more mixed woodland and some agriculture.\n\n{{infobox|Where are the Vikings?|[[Image:Viking ship in Stockholms strom.jpg|170px|centre]] Many tourists from English-speaking countries wonder where they can see real Vikings. Unfortunately, they have not been around for a thousand years. ''\"Viking\"'' is not the name of a separate tribe or nation - it is simply the old Norse word for ''\"sailor\"'', ''\"navigator of the fjords\"'' or ''\"pirate\"'' depending on etymology. While most Swedish, Norwegian and Danish people of these days were ''not'' Vikings, but sedentary farmers or fishermen, some men (and in a few cases women) joined expeditions of trade, exploration and piracy, reaching as far as present-day Canada, Morocco and the Caspian Sea. As the pagan Scandinavians were christened around AD 1000, the Viking raids declined. There are still traces from the Viking age, such as ''runestones'' and burial mounds, everywhere in Sweden. Some good places to see Viking age artifacts are '''The Museum of National Antiquities''' (\"Historiska museet\") [http://www.historiska.se] in Stockholm, Gamla Uppsala in [[Uppsala]] and Birka and Adelsö just west of Stockholm.\nThe Viking Age heritage has been contorted through history - romanticized during the 19th century, as the horned helmets were made up. (A horned helmet would be very impractical in combat.) Most Swedes are proud of their Viking roots, though they don't take it very seriously.}}\n\n===Culture===\n\nSweden has some [[Old Towns]]: [[Stockholm/Gamla stan|Stockholm's Old Town]], [[Uppsala]], [[Visby]], [[Karlskrona]] and others, as well as several Royal palaces and castles: '''Drottningholm''' in [[Ekerö]] just outside of Stockholm, '''Gripsholm''' in [[Mariefred]], Solliden on [[Öland]], etc.\n\nAs mining and metallurgy have been the backbone of Sweden's economy since the Middle Ages, many mines and mills have been preserved, with [[Falun]] and [[Fagersta]] recognized by UNESCO.\n\nAmong more unusual UNESCO World Heritage sites are the Woodland Cemetery in [[Stockholm/Southern suburbs|southern Stockholm]], the Grimeton Radio Station in [[Halland]], and the Struve Meridian Arch in [[Norrbotten]].\n\n====Cities====\n*[[Lund]] -  A university city in [[Scania]].\n*[[Kristianstad]]\n*[[Sigtuna]] - Sweden's oldest city, near Stockholm-Arlanda airport.\n*[[Umeå]] - A university city in [[Norrland]].\n*[[Uppsala]] - A lively pretty old university city. Fourth largest city in Sweden.\n*[[Örebro]] - An old shoe manufacturing centre, about halfway between [[Stockholm]] and [[Oslo]].\n\n===Nature===\n\nAlthough there are some worthwhile towns, castles, gardens and museums, the country's main attraction is the great outdoors. The Swedes have certainly realized this, and a battalion of signposts and flyers exists to lead tourists (and the Swedes themselves, who rather appreciate their own nature) to the most interesting parts of the countryside. \n\nMost of the time, just typing in the name of a national park, nature reserve or other nature destination into your GPS will lead you to a parking lot with an info map and rather clean public toilets (but don't be surprised if it turns out to be an outhouse! With toilet paper and hand sanitizer).\n\n====''Naturums''====\nNaturums are small visitor centers located at Sweden's more popular national parks and nature reserves. They tend to be fairly small and not warrant a trip on their own, but they make for a nice rest stop when hiking through the area. \n\nAll Naturums have free public toilets and a parking lot in the vicinity. A small exhibition gives information on the geography, flora, fauna and culture of the area, oftentimes in several languages (Swedish, English, German). This information can include e.g. plant and animal specimen, objects to view through a microscope, historical tools, and aquariums. There's also usually a comfy reading area with several books about the nature and culture as well as an arts and crafts corner for kids (with e.g. coloring pictures). Sometimes binoculars are available for observation.\n\nSeveral offer drinks for free or a very small fee. A person by the counter is available for questions (they usually speak English extremely well and are very happy to help).\n\nThe Naturums and their closer vicinity are generally accessible for wheelchairs. If Sweden's usual narrow and uneven hiking trails are not possible for you, stopping by directly at the Naturum is a great way to take in at least some of its beautiful nature.\n\n====National Parks====\nSweden has 30 national parks distributed across the country. The national parks are nature habitats that are considered to be particularly worthy of protection. They are signposted and have several parking lots as well as color-marked hiking trails and free public toilets.\n\n[http://www.nationalparksofsweden.se/ Sweden's national parks]\n\n* [[Laponia]] National Park\n* [[Store Mosse]] - Sweden's largest moor outside of Lappland.\n* [[Söderåsen]] - Large area of beech forest with ridges and streams.\n\n====Nature Reserves====\nNature reserves are areas of nature that are smaller than national parks and have a weaker protection. However, they still feature beautiful and often unusual landscapes that are well worth a visit. Like national parks, they are signposted with parking lots and a map of hiking trails, and often have free public toilets. \n\n* [[Danska Fall]] - Forest with river and waterfall south of [[Simlångsdalen]].\n* [[Gamla Varberg]] - Moraine area with burial mound by the coast near [[Varberg]].\n* [[Haverdal]] - Beach and forest of twisted pines near [[Halmstad]]. Has Sweden's biggest sand dune.\n* [[Kjugekull]] - Hill with pine forest and large boulders lying about, in the area of [[Kristianstad]]. A popular place to practice climbing.\n* [[Kullaberg]] - Cliffs and grottoes near the town [[Mölle]].\n* [[Skurugata]] - A ravine with a hiking trail right through it, in the vicinity of [[Eksjö]].\n* [[Trollegater]] - Gaps between the rocks in this nature reserve near [[Rimforsa]], east of the lake Vättern, form narrow caves that can be freely explored. Bring a torch and wear suitable clothing! The caves are ''very'' narrow - you will definitely get bruised and dirty. [http://www.kindaturism.se/v?plats_id=1562&lang=en Guided tours] are available. This is a great trip for children.\n\n====Other====\n* [[Hovs hallar]] - Cliffs on the Bjäre peninsula.\n* [[Falsterbo]] - This peninsula is a resting place for migrating birds.\n* [[Fegen]] - Lakeland area that's popuar for boating.\n\n===Other Destinations===\n* [[Gotland]] - The largest island of Sweden as well as the Baltic Sea. Its capital [[Visby]] is on UNESCO's World's heritage list. A common vacation spot for mainland Swedes.\n* [[Öland]] - Sweden's second largest island, connected to the mainland by a bridge.\n* [[Riksgränsen]] - A ski resort at the very north, with snow well into June.\n* [[Åre]] - One of Sweden's largest ski resorts, with 44 lifts.\n* [[Österlen]] - A picturesque southeastern district of [[Scania]].\n\n==Do==\n====''The year in Sweden''====\n: ''See [[Winter in Scandinavia]] for Christmas and winter sports events.''\nSwedish weather is best during summer (late May to early September). If you like snow, go to Norrland or [[Dalarna]] in January to April.\n\nBe aware that daylight varies greatly during the year. In Stockholm, the sun sets at 3 PM in December. North of the Arctic Circle one can experience the midnight sun and Arctic night. However, even at Stockholm's latitude, summer nights exist only in the form of prolonged twilight during June and July.\n\nThe major holidays are Easter, Midsummer (celebrated from the eve of the Friday between June 19 - 25), Christmas (Christmas Eve, Christmas Day and Boxing Day are all considered holidays), and the \"industrial vacation\" throughout July. Expect closed establishments, heavy traffic (for the holidays) and crowded tourist resorts (for July).\n\nNote that most Swedish holidays are celebrated on the '''day before''' (Midsummer's Eve, Christmas Eve etc), while Swedish people do hardly anything on the holiday proper.\n\n====''Allemansrätten (Everyman's Right)''====\n\nDue to the Allemansrätten, most of Sweden's nature can be freely accessed unless the area is specifically protected or close to a house. This means that you can walk, camp and swim almost everywhere. Berry- and mushroom-picking is largely unrestricted, except of course in gardens and plantations. Angling is allowed in seawater (including the Baltic Sea), as well as major lakes (Vänern, Vättern, Mälaren, Hjälmaren and Storsjön). Fishing in other bodies of water often requires a license. \nHowever, you are supposed to be mindful while doing any of this. Picking or even collecting protected plants, disturbing protected animals and leaving trash behind are among the things that are definitely not okay!\n\nBefore you make use this right, carefully research the dos and don'ts: [http://www.swedishepa.se/Enjoying-nature/The-Right-of-Public-Access/This-is-allowed1/ Allemannsrätten in Sweden]\n\n===Hiking===\n\nThere are many hiking trails in Sweden from short ones of only a few kilometers to some that require days to finish. \nOne well-known hiking trail is [[Kungsleden]] which runs through Norrland.\n\n===Boating===\n\nWith its many lakes that often have several islands, Sweden is wonderful for boating. The Allemansrätten allows you to put an unmotorized boat on pretty much any body of water (in proper distance to houses and adhering to signs that tell you if an area is off-limits at certain times to e.g. allow birds to nest undisturbed). So boating is as easy loading your boat in your car and driving around until you see a lake that looks interesting. You'll find that the most difficult part is finding a suitable place for putting your boat into the water. If your boat is small, looking out for \"bathing place\" signs (a swimming person pictogram) is very useful - these usually are areas with little vegetation by a shallow shore and have a parking lot in the vicinity. \n\nParticularly worthwhile lakes are those that are longer than wide and have a shore with many bays and peninsulas. A popular destination for boating is the lakeland area [[Fegen]], which stretches over several kilometers and has many islands.\n\nIf you don't have your own boat, there are lots of places where you can rent one. You can even have your own lake - or part of a lake - during your vacation. Many holiday cottages are right next to a lake, and several of these have a boat as part of the facility.\n\n===Watching Wildlife===\nThere are some wildlife watching tours of moose/elk, beaver, brown bears, and wolf tracking.\nPeople who want to see elks in a more comfortable and reliable settings can go to one of the several Älgparks (elk parks).\n\n===Shopping and Nightlife===\nStockholm and Gothenburg have great nightlife and shopping opportunities.\n\nSweden has Scandinavia's biggest discounter: Gekås (in Ullared), which attracts several million customers per year. Aside from simple parking lots and parking houses, it also has a hotel, camping site, and small village of holiday cottages. Even if you do NOT intend to buy several shopping carts full of bed covers, groceries, riding gear, clothes, handbags, lamps, toys, and cosmetics, stopping by could be worth it - just to witness the oddity of it all.\n\n==Buy==\n<div style=\"float:right;padding:10px;\">\n<!-- begin conversion table -->\n<table style=\"background-color: #f3f3ff; border: 1px solid #9866FF; background-color: #f3f3ff; border-collapse: collapse;\">\n<tr><td style=\"text-align: center; border-bottom: 1px solid #C9AFFF; background-color: #ddddff; padding: 2px;\" colspan=\"3\">Currency conversion table  (January 2016)</td></tr>\n<tr><td style=\"text-align: center; border: 1px solid #C9AFFF; padding: 2px; font-weight: bold;\">'''Foreign currency'''</td><td style=\"text-align: center; border: 1px solid #C9AFFF; padding: 2px; font-weight: bold;\">'''Either one'''</td><td style=\"text-align: center; border: 1px solid #C9AFFF; padding: 2px; font-weight: bold;\">Swedish Kronor</td></tr>\n<tr><td style=\"text-align: left; border: 1px solid #C9AFFF; padding: 2px;\">&euro;0.106 Euro</td><td style=\"text-align: center; border: 1px solid #C9AFFF; padding: 2px;\">1</td><td style=\"text-align: right; border: 1px solid #C9AFFF; padding: 2px;\">9.36</td></tr>\n<tr><td style=\"text-align: left; border: 1px solid #C9AFFF; padding: 2px;\">&pound;0.081 Pound Sterling</td><td style=\"text-align: center; border: 1px solid #C9AFFF; padding: 2px;\">1</td><td style=\"text-align: right; border: 1px solid #C9AFFF; padding: 2px;\">12.19</td></tr>\n<tr><td style=\"text-align: left; border: 1px solid #C9AFFF; padding: 2px;\">&#036;0.116 US Dollar</td><td style=\"text-align: center; border: 1px solid #C9AFFF; padding: 2px;\">1</td><td style=\"text-align: right; border: 1px solid #C9AFFF; padding: 2px;\">8.55</td></tr>\n<tr><td style=\"text-align: left; border: 1px solid #C9AFFF; padding: 2px;\">&#036;0.17 Australian Dollar</td><td style=\"text-align: center; border: 1px solid #C9AFFF; padding: 2px;\">1</td><td style=\"text-align: right; border: 1px solid #C9AFFF; padding: 2px;\">5.87</td></tr>\n</table>\n<!-- end conversion table -->\n</div>\nThe national currency is the Swedish ''krona'' (SEK, plural ''kronor''), distinct from other currencies, such as the Norwegian or Danish krona. Automatic teller machines take major credit cards. Most stores, restaurants and bars accept all major credit cards or debit cards. Many restaurants and shops do not accept cash. You usually need an ID card or a passport when shopping with a credit card, regardless of the amount involved, though usually not in supermarkets and such where PIN code is king.\n\nIt is not common to bargain in shops but it might work in some instances, especially when buying more expensive products. Bargaining is also okay at flea markets and in antique shops. Tipping is not mandatory when dining out. You can tip 5-10%, or round the bill up if you've had a nice experience.\n\nMost shops, at least major chains in downtown areas, are open all week, even on Sundays. Closing times are rigid, most often on the minute.\n\nMany Swedes translate the word ''krona'', which means ''crown''. For example, instead of saying ''50 kronor'' they might say ''50 crowns'' when speaking English.\n \n===ATM===\nThe most used Swedish word for ATM is ''Bankomat'', although this is technically a trademark of the Trade Bank Consortium, much like the term ''cash point'' in the United Kingdom, and therefore not used by several banks. A more generic word would be ''Uttagsautomat''; ''Uttag'', ''Minuten'' and ''Kontanten'' may also occur. Nearly all machines regardless of operator will accept the MasterCard, Maestro, Visa, Visa Electron and American Express. You can withdraw up to 10&nbsp;000&nbsp;SEK ($1420/€1110) per use. During a seven-day period you can withdraw a maximum of 20&nbsp;000&nbsp;SEK ($2840/€2220).\n\nYou have three attempts to enter the correct PIN code. If you fail a third time, the machine retains the card and closing it. In order to facilitate the visually impaired have the keys on the machines equipped with Braille. You may have spoken guidance, press the TALK button. In some ATMs you can withdraw euros if you have a card issued by a Swedish bank. You may take up the maximum 1000 EUR per use. You can make multiple withdrawals after the other but a maximum 20 000 SEK per week.\n\n===Costs===\nCompared to other OCED countries, Sweden is one of the more expensive countries to inhabit, though you can find cheaper alternatives if you look around. For example: Sundries like a 33&nbsp;cl bottle of Coca Cola costs 10&nbsp;SEK ($1.70/€1.2), a beer in a bar will cost you around 45-70&nbsp;SEK ($7-10/€5-8), the average price of hotel accommodation is around 1300&nbsp;SEK ($215/€155), a room in a hostel varies between 150 and 350 SEK ($30-50/€25-35), a bus/subway ticket in Stockholm, Gothenburg and Malmö will set you back around 25 SEK ($4.20/€3.1), one meal during lunch will cost you around 100&nbsp;SEK ($16.5/€11.9) whilst dinner prices can go between 150-300SEK depending on where you eat, 1 litre of petrol fuel costs about 15&nbsp;SEK ($2.50/€1,8) and a pack of 25 cigarettes will cost you 70&nbsp;SEK ($11.60/€8.3). If you are a bit careful about your expenses, a daily budget of around 1000&nbsp;SEK ($156/€112) will be enough. While house prices outside metropolitan areas are probably among the lowest in Western Europe. and recently opened discount stores such as \"Lidl\", \"Netto\" and \"Willys\" offer a wide range of items, accommodation and dining out are cheaper in Stockholm than in most other west European capitals.\n\n===Shopping===\n[[Image:Dala_horse_by_Jake73.JPG|thumb|right|200px|caption|An example of a Dala Horse]]\n*An unofficial national symbol, the '''Dala Horse''' (Swedish: ''dalahäst'') is the souvenir of souvenirs to bring from Sweden. Named after their origin, the province of [[Dalarna]], these small wooden horses have been around since the 17th century. They are normally painted orange or blue with symmetrical decorations. They are fairly expensive: expect to pay around SEK 100 for a very small one or several hundred crowns for bigger versions. The horses can be bought in souvenir shops all over Sweden. If you want to know more about how the horses are made, visit Dalarna and the municipality of [[Mora]] where the horses are carved and painted in workshops open for tourists. And if driving towards Mora from [[Stockholm]], keep your eyes open when you pass the town of [[Avesta]] where the world's largest (13 meters high) Dala Horse overlooks the highway.\n*Swedish '''glass''' is world famous for its beauty. Several skilled glass artists have contributed to this reputation through innovative, complex (and expensive) art creations, but mass-produced Swedish table glass has also been an international success. Part of the province of [[Småland]], between the towns of [[Växjö]] and [[Kalmar]], is known as the '''Kingdom of Crystal'''[http://www.glasriket.se/]. 15 glassworks are packed into this small area, the most famous being ''Orrefors'', ''Kosta'' and ''Boda''. Tourists are welcome to watch the glass blowers turn the glowing melt into glittering glass, and you can even give it a try yourself.\n*Exclusive wines from [[#Systembolaget|Systembolaget]].\n*Swedish design, spanning from furniture to jewelry, is known for function, efficiency and minimalism. Designtorget [http://www.designtorget.se/designtorget/se/] is a chain of stores with a wide range of everyday products. Svenskt Tenn is another store with beautiful items by designers such as Josef Frank. \n*There are some items for the home, invented by the swedes that might be fun to bring back home, such as the adjustable spanners or adjustable wrenches, safety matches, paraffin cooking stove (Primuskök) or a good old Celsius thermometer.\n\n==Eat==\n{{infobox|The world's stinkiest fish dish|Adventurous diners might want to try ''surströmming'', which is (coastal) central and northern Sweden's entry in the revolting-foods-of-the-world contest. It's herring which is fermented in barrels and packed in tin cans, which may start to bulge and almost burst. It all gets so foul-smelling that the fish is only eaten outdoors to keep it from stinking up the house, although it has been known for unsuspecting visitors from other countries to be \"treated\" to an indoor surströmming experience for more intensity.[[Image:SwedishSurströmmingJake73.jpg|center|noframe|240px]]\nIt is considered bad manners not to notify (or invite) the neighbours before having a ''surströmmingsskiva'', a party where the delicacy is consumed. It is claimed that the best way to get over the smell is to take a deep breath of it just when you open the can, to as quickly as possible knock out your smelling sense. Surströmming season peaks in August. |print=fullpage}}\nSwedish cuisine is mostly meat or fish with potatoes. Besides the ubiquitous potatoes, modern Swedish cuisine is to a great extent based on bread. Traditional everyday dishes are called ''husmanskost'' (pronounced whos-mans-cost). They include:\n*'''Meatballs''' (''köttbullar''), the internationally most famous Swedish dish. Served with potatoes, '''brown sauce''' or '''cream sauce''' and '''lingonberry jam'''.\n*'''Hash''' (''pytt i panna'') consisting of meat, onions and potatoes, all diced and fried. Sliced beetroot and fried or whole boiled eggs are mandatory accessories.\n*'''Pea soup''' (''ärtsoppa'') with diced pork, followed by '''thin pancakes''' afterwards. Traditionally eaten on Thursdays since medieval times when the servants had half the day off as it is an easy meal to prepare. All lunch restaurants in Sweden with any self-respect serve pea soup and pancakes every Thursday.\n*Pickled '''herring''' (''sill''), available in various types of sauces. Commonly eaten with bread or potatoes for summer lunch or as a starter. Virtually mandatory at midsummer and very common for Christmas.\n*'''Blodpudding''', a black sausage made with pig's blood and flour. Slice it, fry it and eat it with lingonberry jam.\n*'''Gravlax''', a widely known and appreciated cold appetiser made from thin slices of salmon cured in salt, sugar and dill.\n*'''Falukorv''', a big baloney sausage from [[Falun]]. Sliced, fried and eaten with ketchup and mashed potatoes.\n*Sweden has more varieties of '''bread''' than most other countries. Many of them are whole-grain or mixed grain, containing wheat, barley, oats; compact and rich in fibre. Some notable examples are ''tunnbröd'' (thin wrap bread), ''knäckebröd'' (hard or crispbread - might not be an interesting experience, but it is nearly always available), and different kinds of seasoned loaves. Bread is mostly eaten as simple sandwiches, with thin slices of cheese or cold cuts. Some more exotic spreads are '''messmör''' (whey butter) and '''leverpastej''' (liver paté).\n*'''Tunnbrödrulle''', a fast food dish, consisting of a bread wrap with mashed potatoes, a hot dog and some vegetables. \n*'''Kroppkakor''' Potato dumpling stuffed with diced pork.\n*'''Ost''' Hard cheese. Swedes eat a lot of hard cheese. In an ordinary food market you can often find 10 to 20 different types of cheese. The most famous Swedish hard cheese would be Västerbotten, named after a region in Sweden.\n*'''Julbord''' Christmas buffet, containing an assortment of hot and cold dishes. The exact contents of the buffet vary between different parts of the country, but common are ham with mustard, various types of herring and salmon, meatballs, hard cheese, sausages, liver pâté, spare ribs, boiled potatoes, rye bread, beetroot, cabbage, and more. Dark beer and shots of strong spirits are offered to drink, and ''Julmust'' might be the non-alcoholic alternative. For desserts, a rice pudding is common. ''Julbord'' is offered in December up until Christmas Day in many restaurants .\n\nOther Swedish favourites:\n*'''Soft whey butter''' (''messmör'') with a sweetish, hard-to-describe taste. Also popular in Norway.\n*'''Caviar''', not the expensive Russian or Iranian kind but a cheaper version made from cod roe, sold in tubes and used on sandwiches. The most famous brand is ''Kalles Kaviar''.\n*'''Julmust''', stout-like Christmas soft drink that every year annoys The Coca-Cola Company in Sweden by lowering Coke's sales figures by 50%.\n*'''Crayfish''' (''kräftor''), hugely popular around August, when Swedes feast on them at big crayfish parties (''kräftskivor''). Silly paper hats and lots of alcohol included.\n*'''Semla''', a cream-filled pastry eaten around Fat Tuesday.\n* '''Rabarberkräm/Rabarberpaj''' rhubarb-cream or rhubarb-pie with vanilla sauce. Other cakes or pies on fresh blueberries, apples, or just strawberries with cream or ice cream are also very popular in the summer. \n*'''Spettekaka ''' A local cake from Skåne in south Sweden, made of eggs, sugar, and potato starch. \n[[File:Smorgatarta.JPG|thumb|250px|Smörgåstårta]]\n* '''Smörgåstårta''' A cold Sandwich layer cake, often with salmon, eggs, and shrimps. (Also often with tuna or roast beef). Swedish people often eat it at New Year's Eve, or birthdays and parties.\n* '''Polkagris''' A thicker, straight variant of the candy cane, originating from the town of Gränna. The handmade confectionery comes in a wide assortment of flavours.\n* '''Saltlakrits''' Salty licorice. \n* '''Lösgodis''' Bulk confectionery, sold by weight, is one the most popular types of candy in this sweet loving nation. A choice of chocolate, sours, sweet and salt flavours are always offered. \n* Swedish biscuits and pastries like ''bondkakor, hallongrottor, bullar'' or cakes like ''prinsesstårta'' are widely popular. It used to be a tradition to offer guest 7 different cookies when invited over for coffee. If you have a sweet tooth you should try ''chokladbollar, mazariner, biskvier, rulltårta, lussebullar''; the list goes on...\n\nAs in most of Europe, inexpensive '''pizza''' and '''kebab''' restaurants are ubiquitous in Swedish cities, and are also to be found in almost every small village. Swedish pizza is significantly different from Italian or American pizza and American-style pizza is usually sold as \"pan pizza\". '''Sushi''' and '''Thai''' food are also quite popular. Fast Food burger chains that are found throughout Sweden include '''[http://www.max.se Max]''', '''[http://www.mcdonalds.se, McDonald's]''', and '''[http://www.burgerking.com Burger King]'''. In parts of Norrland it is customary to eat hamburgers with a knife and fork. Another type of fast food establishment is the ''gatukök'' (street kitchen), serving hamburgers, hot dogs, kebab, meatballs and ''tunnbrödrulle'' (see above). \n\nHighway diners, ''vägkrogar'', have generous meals, but might be of poor quality, greasy and overpriced. If you have time, a town centre restaurant is preferable. Gas stations and convenience stores such as '''[http://www.7-eleven.se/ 7-11]''' and '''[https://www.pressbyran.se/ Pressbyrån]''' also offer decent packed salads and sandwiches.\n\nYou can get a \"cheap\" lunch if you look for the signs with \"'''Dagens rätt'''\" (meal of the day). This normally costs about 50-120 SEK (€5,50-13,30) and almost everywhere includes a bottle of water; soft drink; or light beer, bread & butter, some salad and coffee afterwards. Dagens rätt is served Monday to Friday.\n\nThe world famous furniture retailer '''IKEA''' has stores at the outskirts of 15 Swedish cities. These have cheap diners, which offer basic Swedish meals for as little as 40 SEK, and the store exit usually has a café selling hot dogs for as little as 5 SEK. (They hope that you spend some money on shopping too.) Expect crowds in rainy weather.\n\nIf you're on a tight budget, self-catering is the safest way to save your money.\n\nVegetarian and vegan lifestyles are accepted in cities, less common in the countryside but you should be able to find a falafel in any medium-sized town.\n\n==Drink==\n\n===Coffee===\nSwedish consumption of coffee (''kaffe'') is among the highest in the world. Drinking coffee at home or in a café, an act called ''fika'', is a common Swedish social ritual, used for planning activities, dating, exchanging gossip or simply spending time and money. Swedish coffee is usually stronger than American coffee - but still not the espresso of France or Italy. Italian varieties (espresso, cappuccino, caffe latte) are available at larger city cafés. One coffee will cost you around 25 SEK ($3,5/€2,8). Many towns and cities will have several coffee houses including a few chains such as '''[http://www.waynescoffee.com/ Wayne's Coffee]''' and '''[http://www.espressohouse.com/ Espresso House]''' which also offer free Wi-Fi for their customers.\n\n===Alcoholic beverages===\nThe most famous Swedish alcoholic beverage is '''Absolut Vodka''', one of the world's most famous vodkas. There are several brands of distilled, and usually seasoned, liquor, called ''brännvin'' or ''akvavit''. When served in a shot glass with a meal it is called ''snaps'' (not to confuse with the German \"Schnapps\"). It is part of custom to drink snaps at midsummers eve and at Christmas.\n\nSweden does produce some outstanding beers, and have in the recent years seen a rise in the numbers of microbreweries. If you are looking for great local beer keep an eye out for  breweries like \"Ocean\", \"Slottskällans\", \"Nils Oscar\", \"Närke kulturbryggeri\", \"Jämtlands ångbryggeri\" and \"Dugges Ale- & Porterbryggeri\". You may have some trouble finding them, unless you go to a bar specialized in providing uncommon beer, or one of the well stocked \"Systembolag\", but you will find a few of them in every major city. Despite this the most common beer is the rather plain \"international lager\". The beer you get in normal food shops is called ''folköl'' and has 2.8 or 3.5% alcohol. You are able to find a variety of different brands of beers in food stores, Swedish, English and even Czech beer. Sweden has a seasonal beer for Christmas, ''julöl''. It is sweeter than normal beer and usually seasoned with Christmas spices, mostly it is of the beer type ale. All Swedish breweries make at least one type of julöl. Wine is popular, but the Swedish production is very modest.\n\nDrinking alcohol in parks is generally legal, if notifications don't state the opposite. Drinking on public transport vehicles is prohibited, with the exception of trains or boats serving alcohol in a bar.\n\n===Systembolaget===\nOrdinary beer and lager is readily available in supermarkets. But access to strong alcoholic beverages is, as in [[Norway]], [[Finland]] and [[Iceland]], quite restricted and expensive. The only place to buy strong alcohol including ''starköl'' (beer which contains more than 3.5% ABV) over the counter is in one of the state-owned shops called '''Systembolaget''' [http://www.systembolaget.se/Applikationer/Knappar/InEnglish/] (also sometimes referred to as simply \"Systemet\" or \"Bolaget\"). They have limited hours of operation, usually 10-6 Mon-Wed, 10-7 Thurs-Fri, and 10-3 on Saturdays, with long queues on Fridays and Saturdays. Closing time at Systembolaget is more than rigid no matter how long the queue outside the store is, something the Swedes themselves joke about. They are always closed on Sundays. Most shops are of supermarket style. The assortment is very good, and the staff usually has great knowledge. Systembolaget does not serve customers under the age of 20 and will most likely ask for identification from younger looking customers. This also applies to any companions, regardless of who is making the actual purchase.\n\nBeverages are heavily taxed by content of alcohol, some liquor is very expensive (vodka is around 300 SEK a liter at Systembolaget), but the monopoly has brought some perks - Systembolaget is one of the world's largest bulk-buyers of wine, and as such gets some fantastic deals which it passes on to consumers. Mid-to-high-quality wines, and exclusive spirits, are quite often cheaper in Sweden than in the country of origin; sometimes even cheaper than if you were to buy the wine directly from the vineyard. This does NOT apply to low-quality wines, however, due to the volume-based tax on alcohol.\n\nAll brands are treated equally and there is no large-pack discount. Therefore, microbrews cost largely the same as major brands, and might be a more interesting choice. Beverages are not refrigerated.\n\n===Bars and nightclubs===\nThe minimum age requirement is 18 to get into bars and to buy regular (3.5%&nbsp;ABV or less) beer in shops (to prevent teenage drunkenness, some shops have decided to enforce a minimum age of 20 for 3.5% beer as well), and 20 in Systembolaget. Many bars have an age limit of 20, but some (especially in city centres on weekends) have age limits as high as 23 or 25, but this rule is arbitrarily enforced. Bring passport or other ID.\n\nSome posh clubs mandate an arbitrarily enforced dress code; ''vårdad klädsel'' is casual dress. For male guests, proper shoes (not sneakers or sandals), long-legged trousers (not blue jeans) and a dress shirt is almost always good enough.\n\nAge or dress rules are not rigid, and doormen have the right to accept or reject any patron for any reason other than gender, sexual orientation, creed, disability or race. Though illegal, a few nightclubs are infamous for rejecting \"immigrants\", which usually means anyone with hair and skin darker than the average Swede, on pretexts such as \"members only,\" \"too drunk,\" or \"dress code\"; men of Middle Eastern or African origin are most often subjected to this. You might avoid this problem by dressing properly and behaving well.\n\nSweden has enforced '''non-smoking''' in all bars, pubs and restaurants, save outdoor areas such as terraces, and designated smoking rooms (where drinks are not allowed).\n\nThe prices at clubs and bars are often expensive compared to other countries: a large beer (half a litre) usually costs 45-55&nbsp;SEK (US$7), but many low-profile bars advertise ''stor stark'' (0.4&nbsp;L of draft lager) for as little as 25&nbsp;SEK. A long drink costs around 60-110&nbsp;SEK. For that reason many Swedes have a small pre-loading party (\"förfest\") before they go out to get buzzed before they hit the town and go to nightclubs.\n\nLarge clubs can require a cover charge, usually about 100&nbsp;SEK (or more at special performances). They usually offer a rubber stamp on your hand so you can re-enter as you like without having to pay again.\n\nBe aware that you often have to stand in line to get into a bar or a club. Many places deliberately make their customers wait in line for a while, since a long queue indicates a popular club. At the very fanciest places in the major cities, the queue is often replaced by a disorganized crowd, and the doorman simply points to indicate who gets in and who does not.\n\nMost bars that close at 01:00 or earlier, will have a free entry policy. Most bars and clubs that remain open until 03:00 will charge an entrance fee. Some clubs in the larger cities remain open until 05:00. Their entrance fee will usually be around 200 SEK (~US$28.00.\n\nThe club's wardrobe (or coat-checking) fee is often mandatory, usually around 20&nbsp;SEK.\n\nAuthorised security guards carry a badge saying ''Ordningsvakt'', see [[#Stay safe]]. The club's own doormen carry a badge saying ''Entrévärd''. Though not allowed to use force, they should be taken seriously.\n\n'''Moonshine''' (''hembränt'') is popular in the countryside although it isillegal to produce and/or sell.\n\nIn some Swedish cities (generally the larger ones), clubs are quite often arranged illegally and underground outside of the city centre. This is because of the notoriously strict liquor and nightlife laws. Alcohol taxes are high, clubs and bars are legally required to also have a kitchen in order to serve alcohol, clubs and bars must close at certain times and always employ a number of certified security guards in accordance with the closing time and guest capacity. These aspects contribute to the development of underground  drinking cultures in several cities. These are, naturally, not listed and often known by word of mouth or on-line community basis. Generally, such clubs play techno, house and other electronic music, so ask locals for advice in legal clubs that play the same genre. The Swedish word for clubs arranged illegally is ''svartklubb'' (literally black club).\nWith the help of social media such as Facebook a new form of \"svartklubb\", sometimes referred to as \"gråklubb\" (grey club) has emerged in larger cities. To enter such venues, you must acquire a free membership for each event earlier the same day, or the day before the event - this is often done by email, contact information is usually distributed on \"Event pages\" on social media sites.\nDuring summer open air raves or \"skogsfest\" (forest parties) is arranged in the outskirts of larger cities, locations for each event is usually distributed through a mailing list or on Facebook event pages. Most such events serve no food or beverages.\n\n==Sleep==\nDriving through Sweden with a '''travel trailer''' or a '''RV''' is convenient and cost-efficient, as you can stay overnight nearly anywhere. The Swedish countryside is rife with designated RV sites. \n\n===Camping===\nIf you bring your own tent, accommodation in Sweden can be very cheap, even free! This is due to the Right to access (Every Man's Right) principle, allowing anyone to camp in uncultivated areas (including private property) free of charge. There are certain limitations, for instance you are only allowed to stay at a certain spot for one night before you have to move on. If you are travelling to Sweden in the summer, check out the local conditions when it comes to camp fires. Forests in Sweden can get extremely dry and temporary bans on lighting fires are not unusual.\n\nIf you prefer camping a bit more organized, most towns have campsites with showers and electric. Expect to pay around SEK 100-150 for a tent-site. More info on the official site for Swedish campsites: camping.se. The leading chain is called First Camp.\n\nThe Östergötland archipelago has some of the best island campgrounds in the world. Kayaking throughout and camping freely is a truly magical experience. There are multiple outfitters in the vicinity of Norrköping that offer guided and unguided camping tours.   \n\n===Holiday Cottages===\nHoliday cottages are very popular accomodations in Sweden. Often, they are much cheaper than a hotel and have the perk of offering much more privacy. The fee is generally calculated by week, and the expected day of arrival and departure is Saturday.\n\n===Hostels===\n'''Svenska Turistföreningen''' or STF is by far the most important operator of hostels, ''vandrarhem'', in Sweden, with a network of more than 300 hostels around the country. Membership for foreigners is SEK 175, and if you plan to stay four nights or more at hostels in Sweden you should join, since non-members pay an additional SEK 45 per night. STF is affiliated with Hostelling International or HI, and if you are a member of any HI organisation you are considered a member of STF.\n\n'''Sveriges vandrarhem i förening''', ''SVIF'' is another nation-wide hostel confederation. [http://www.svif.se/uk/]\n\nThe price per night in a hostel is SEK 80-280 depending on where the hostel is located and how classy or tacky it is. Sheets are required (just a sleeping bag is not enough) and if you don't bring any you have to purchase at the hostel for around SEK 50. You are expected to clean out your room when leaving. Cooking equipment is normally available at all hostels for those who want to self-cater.\n\nSome hostels are more spectacular than others; for instance Jumbostay at Arlanda Airport, located inside a decommissioned Boeing 747, [http://www.jumbostay.com/] and Långholmen Hostel in Stockholm, that used to be a prison. [http://www.langholmen.com/En/Hostel/AboutHostel.aspx]\n\nApartments and B&B:s are not the same thing, but Swedish online booking agencies tend to think so. Renting an apartment may be an interesting option if you plan to stay for a few nights in one of the major cities and want more privacy than a hostel offers.\n\nWhile on the road you may want to keep an eye open for road signs with the word Rum. They don't show the way to the nearest drinking den for pirates - Rum in Swedish means room and that sign points to a B&B.\n\n===Hotels===\nMost Swedish hotels tend to be clean, not-so-interesting and fairly expensive. A single room can easily set you back 1000 SEK. Most towns, even smaller ones, still have a traditional ''stadshotell'' (town hotel) somewhere in the city centre, which usually contains the town's largest restaurant and/or nightclub. On a more positive note, breakfast buffets at Swedish hotels are often impressive with plenty to choose from - try not to be in too much of a hurry in the morning! Major hotel chains include '''Scandic''', '''Nordic Choice''' and \n'''First'''.\n\nThe '''Icehotel''' in the village of Jukkasjärvi in the far north, is a hotel built from snow and ice that melts in spring and is rebuilt every winter. Ice hotels are built in several other countries, but the one in Jukkasjärvi is the original. One night in a single room is 2850 SEK, book in advance.\n\n==Learn==\nAll non-high education in Sweden is free for residents. Although the government has subsidized schools and classes, there also exist many private alternatives where a tuition fee is required. Students' Union membership is optional since 2010, but the union fee of around 100-500 SEK/year can give several perks, such as mediation of dorm rooms or entrance to union parties and events.\n\nSince 2011, all non-EU/EES/Swiss citizens (with the exception of exchange students) that aim to study at a Swedish university or other school of higher education have to pay tutition fees. The fees vary depending on the school and education programme, as well as the level of education. Social science programmes tend to be cheaper than programmes in the technology or natural science field. Education programmes in design and archtitecture tend to be the most expensive. Studying on bachelor level is cheaper than master. The average fee for a master's programme is 129 000 SEK/year. Apart from the tutition fees an application fee at 900 SEK has to be paid as well. Citizens of EU/EES and Switzerland do not have to pay any fees at all, and can study in Sweden on the same terms as Swedish citizens.\n\n'''Some important university cities''':\n* [[Uppsala]]\n* [[Lund]]\n* [[Gothenburg]]\n* [[Stockholm]]\n* [[Linköping]]\n* [[Umeå]]\n* [[Örebro]]\n\nIf you are a student there is something known as an \"academic quarter\" where classes and school-related events will start 15 minutes past the hour. At some schools after 18:00 this becomes a \"double quarter\" where events commence 30 minutes past the hour. Students are expected to be punctual and show up at the appropriate time.\n\nYou can find more useful information about studying in Sweden on the ''Study in Sweden'' website. [http://www.studyinsweden.se]\n\n==Work==\nEU and EEA citizens are allowed to work in Sweden without a permit. \n\nCitizens of some non-EU countries are permitted to work in Sweden without the need to obtain a visa or any further authorisation for the period of their 90 day visa-free stay - see the 'Get in' section above for more information. \n\nWorking Holiday visas are available for Australian, Canadian, New Zealand and South Korean citizens aged between 18-30, permitting the holder to work for one year.\n\nCitizens of other countries need a work permit, and getting one can be quite a hassle. Swedes, foreign citizens already living in Sweden, and EU/EEA citizens have preference over others in obtaining work in Sweden. Also, if the offer of work is for more than three months, you will also require a Swedish residency permit. More information about the paperwork required is found on the government website swedenabroad.com [http://www.swedenabroad.com/].\n\nFinding a job, can be done thru the public \"Arbetsförmedlingen\" ('Public Employment Service') or other private services such as Blocket or LinkedIn. \nSweden has an official unemployment rate of about 7.1% (Nov 2010). Salaries range from 15,000 to 70,000 SEK ($2200-$10300/€1600-€7700) per month (2008), but the average salary is around 30 000 SEK, April 2011 ($4500/€3100), and are typically paid only once per month.\n\n==Stay safe==\n{{infobox|[[Risks]] in Sweden|\nCrime/violence: '''Moderate'''<br>\n<small>Alcohol-related violence, petty theft, mugging</small><br>\nAuthorities/corruption: '''Low'''<br>\n<small>Nightclub bouncers might be rude</small><br>\nTransportation: '''Low''' to '''Moderate'''<br>\n<small>Wild animal crossings everywhere, and slippery roads in the winter</small><br>\nHealth: '''Low'''<br>\n<small>Tick and mosquito bites (Sweden has been free of Malaria since the 1930s) </small><br>\nNature: '''Moderate'''<br>\n<small>Blizzards and avalanches in the northern mountains. Freezing conditions and icy roads throughout long winters.</small>\n}}\n<!-- This is not the place to push a political agenda through claimed crime risks. Warnings for tourists should be put into an international context. -->\nMost of Sweden is below freezing point during winter, at least occasionally. See [[travelling in cold weather]].\n\nSweden has a moderate crime rate for European standards and is generally a safe place to travel, but crime has been rising in the cities since the 1980s according to police compstat. Use common sense at night, particularly on weekend nights when people hit the streets to drink, get drunk, and in some unfortunate cases look for trouble. There has been reports on muggers and rapists targeting drunk people so stay away from dark and lonely places. Never walk home alone from clubs at night.\n\nSome areas in the bigger cities might be less safe than others, eg. Rinkeby in Stockholm, with violent crimes and robberies being more and more common. Walking alone at night in these areas is not recommended, especially if you're a woman. However, walking in groups is generally not a problem. Heed whatever warnings you would in your own country and you will have no worries.\n\nAlthough there is a significant police presence in the city centres, especially on weekend nights, the rest of Sweden is quite weakly policed. This especially applies to the rural areas of Norrland, where the nearest patrol car might be a hundred kilometres away. \n\nIf involved in an argument, try to leave before the person becomes aggressive. If you see a street fight, keep a safe distance and dial the European emergency number 112. There have been reports on people injured or even killed when they've tried to stop a street fight. Young people, drunk people, or people who have taken drugs can be dangerous so use common sense. Do not argue with security guards or bouncers; they might become upset, and they are legally allowed to use some force when needed.\n\nSwedes generally tend to avoid eye contact, especially so in dangerous situations. Looking directly at someone behaving aggressively might provoke them.\n\nPickpockets are rare but not unheard of. They usually work in tourist-frequented areas, such as airports, rail stations, shopping areas and festivals. Most Swedes carry their wallets in their pockets or purses and feel quite safe while doing it. Still, almost all stores and restaurants accept most major credit cards so there is no need to carry a lot of cash around. If you have a bike, do lock it or you may lose it.\n\nCounterfeit Swedish banknotes or other documents are very uncommon. Newer 50, 100, 500 and 1000 SEK bills have holograms and a shiny foil strip. Except for the 20 SEK bill (from 1997 and onwards), all Swedish banknotes without a foil strip will be invalid as of 2014. Starting from 2015, all Swedish banknotes and coins will gradually be replaced with updated versions and a few new denominations.\n\nBe sure to watch for cars in the road junctions. There is a law in Sweden called \"The Zebra law\" which means that cars must stop at zebra crossings. Many Swedes believe that all the drivers do that. By watching for cars you may save not only your life but also a friend's, since reported injuries have increased because of the law. If you do drive then follow the law, police cars may not be seen everywhere but you never know when they appear. The Swedish police is one of the least corrupt in the world, and any attempt to bribe a police officer is seen upon harshly and can lead to serious consequences. \n\n===Driving===\nDriving in Sweden is safe and mostly like driving in any other European country. Wearing a '''seatbelt''' is mandatory for everyone in the car. Motorway driving is not as aggressive as in southern Europe, but there's not very much respect for the speed limits and there may be cars who will try to overtake you by driving close behind. There are long distances. Take rests if you are tired; it is dangerous to fall asleep when driving. Though it's not strictly enforced, you are required to keep your headlights on at all times - even during the daytime.\n\n'''Wild animals''' such as moose, deer and boar sometimes stray onto highways. The moose is a big and heavy animal (up to 700 kg and 2,1 m shoulder height) so a collision can be violent and endanger your life even if you wear a seatbelt. These are a fairly common sights outside of the southernmost part of Sweden (ie Skåne) - so care must be taken when driving at all times.\n\n===In Case of Emergency===\n'''112''' is the emergency phone number to dial in case of fire, medical or criminal emergency. It does not require an area code, regardless of what kind of phone you're using. The number works on any mobile phone, with or without a SIM card, even if it's key-locked.\n\nPolice officers are rarely on patrol, and might be too busy to head out for minor crimes. To report a theft or getting in contact with the police in general, there is a national non-emergency phone number 114 14 that will bring you in contact with an operator at a police station (usually nearby, but not always).\n\nNightclubs and shopping centers usually have security officers with a chest badge saying ''ordningsvakt'', authorized to use force, and infamous to do so. These should be respected. Officers with other labels (\"Security\" or \"Entrévärd\") have no special privileges, but are still notoriously violent (as they are usually recruited from the street, without background check). Don't argue with them.\n\n==Stay healthy==\nSince November 2009, the '''pharmacy''' business has been deregulated. Certified pharmacies carry a green cross sign and the text ''Apotek''. For small medical problems the pharmacy is sufficient. Major cities carry one pharmacy open at night.  Many supermarkets carry non-prescription supplies such as band aid, antiseptics and painkillers.\n\nSwedish '''health care''' is usually of a decent quality, but can be quite challenging for foreigners to receive. Most, but not all, medical clinics are state-owned, and their accessibility varies. Therefore, getting a time within a week at some medical centers could prove difficult. In case of a medical emergency, most provinces (and of course, the major cities) have a regional hospital with an around-the-clock emergency ward. However, if you are unlucky you can expect a long wait before getting medical attention.  In some parts of the country health care system is sub-standard and does not include preventative physical check ups.  It is almost impossible for a woman to get an appointment with a gynecologist unless she is already quite sick.  Waiting times for specialized care or tests are very long.  Family physicians usually wait long before they prescribe tests that involve equipment like MRI or tomography.  There is general lack of physicians and other medical staff.  Private care in most areas is virtually non-existent. Pharmacies are closed on Sundays and pharmacies open 24/7 almost do not exist.  It is recommended that EU members have EHIC cards that allow them to use health care system in the EU countries in case of emergency.\n\n'''Tap water''' in Sweden is of great quality, and contains close to zero bacteria. Water in mountain resorts might contain rust, and water on islands off the coast might be brackish, but it is still safe to drink. There is no real reason for buying bottled water in Sweden. Also, there is bottled water that doesn't meet the requirements to be used as tap water in Sweden.\n\nThere are few serious health risks in Sweden.  Your primary concern especially in wintertime will be the '''cold''', particularly if trekking or skiing in the northern parts.  Northern Sweden is sparsely populated and, if heading out into the wilderness, it is imperative that you register your travel plans with a friend or the authorities so they can come looking for you if you fail to show up.  Dress warmly in layers and bring along a good pair of sunglasses to prevent '''snow blindness''', especially in the spring. In snowy mountains, '''avalanches''' might be a problem.\n\n===Dangerous animals===\nA serious nuisance in summer are '''mosquitoes''' (''myggor''), hordes of which inhabit Sweden (particularly the north) in summer, especially after rain.  While they do not carry malaria or other diseases, Swedish mosquitoes make a distinctive (and highly irritating) whining sound, and their bites are very itchy. As usual, mosquitoes are most active around dawn and sunset &mdash; which, in the land of the Midnight Sun, may mean most of the night in summer. There are many types of mosquito repellents available which can be bought from almost any shop. Other summer nuisances are '''gadflies''' (''bromsar''), whose painful but non-poisonous bites can leave a mark lasting for days, and '''wasps''' (''getingar'') whose stings can be deadly if you're allergic. To minimize trouble from insects, use mosquito repellent, ensure your tent has good mosquito netting and bring proper medication if you know that you're allergic to wasp stings.\n\nIn southern Sweden and in northern coastal regions there are '''ticks''' (''fästingar'') which appear in summertime.  They can transmit Lyme's disease (borreliosis) and more serious TBE (tick-borne encephalitis) through a bite. The risk areas for TBE are mainly the eastern parts of lake Mälaren and the Stockholm archipelago. A vaccination against TBE is available but the first two doses should be completed before a reliable protection can be expected. Borreliosis can be treated with antibiotics. Although incidents are relatively rare and not all ticks carry diseases, it's advisable to wear long trousers rather than shorts if you plan to walk through dense and/or tall grass areas (the usual habitat for ticks). You can buy special tick tweezers (''fästingplockare'') from the pharmacy that can be used to remove a tick safely if you happen to get bitten. You should remove the tick from your skin as quickly as possible and preferably with the tick tweezers to reduce the risks of getting an infection. If the tick bite starts to form red rings on the skin around it or if you experience other symptoms relating to the bite, you should go visit a doctor as soon as possible. Since ticks are black, they are more easily found if you wear bright clothes.\n\nThere's only one type of venomous '''snake''' in Sweden: the European adder (''huggorm''), which has a distinct zig-zag pattern on its back. The snake is quite common, and lives all over Sweden except for the mountains in the north and farmlands in the south. Although its bite hardly ever is life-threatening (except to small children and allergic people), one should be careful in summer, especially when walking in the forests or on open fields. If you are bitten by a snake, seek medical assistance. Killing, injuring or capturing a snake is illegal.\n\nThere are no really dangerous marine animals in Sweden, although the Greater weevers (''Fjärsing'') could be a nuisance; this is a small fish that hides in the sand near beaches, its back has several spikes that are poisonous and will hurt a lot if stepped on. Its poison could be as dangerous as that of the European adder and will likely cause more pain (this can be quite severe) than damage. There are also types of poisonous [[jellyfish]] that can be quite common near beaches. These are distinguished from normal non-poisonous types by their bright blue or red color. These types of jellyfish aren't really dangerous but their venom will hurt.\n\nAs for other dangerous wildlife, there's not much more than a few extremely rare encounters with '''brown bear''' (''brunbjörn'') and '''wolf''' (''varg'') in the wilderness. Both of these animals are listed as protected species. Contrary to popular belief abroad, there are no polar bears in Sweden, let alone polar bears walking city streets. If you encounter a brown bear in the woods, walk slowly away from it while talking loudly - the bear is most likely to feel threatened if you surprise it. In the unlikely event of a brown bear attacking you should play dead, protect your head and make yourself as small as possible. Or the opposite, there have been people surviving a brown bear encounter by screaming as loud as possible, jumping, and making oneself as big as possible. Bears are most likely to attack if they are injured, provoked by a dog, going to hibernate or protecting their cubs.\n\nBears in Sweden have killed no more than a handful of people since 1900. Wild Swedish wolves have not killed a human being since 1821. In general, one shouldn't worry about dangerous encounters with wild beasts in Sweden.\n\n==Respect==\nMost Swedes have '''liberal, cosmopolitan, secular and environmentalist values''' by Western standards. This spares Western tourists from cultural clashes which might be imminent in other countries. However, some strict rules of etiquette are almost unique to Swedish people.\n\n{{infobox|Sweden - a country of numbers|Swedish people are reputed to be rigid and organized. Almost everything has a number. Swedish people have a ten-digit '''personal identity number''' (starting by date of birth in the form YYMMDD) used in contact with all kinds of government authorities, usually mentioned before the name. Customers in Swedish shops or bank need to take a '''queue number''' note from a machine to be served in order. Each product at ''Systembolaget'' is known for its product number (which is often easier to keep track of than foreign-sounding names), and the most important feature in selection is the '''alcohol content''' (often divided by price to find the most cost-efficient product). If you order a drink in the bar, be prepared to tell how many centiliters of liquor you want. Most grocers provide '''milk''' in four or more fat content levels (plus an organic version of each, barista milk and low lactose milk, not to mention ''filmjölk'', yoghurt and all other milk products). Before going outdoors, Swedes check '''air temperature''', and before bathing in open water, they check '''water temperature'''. Many Swedes also own barometers, hygrometers and rain gauges to support the eternal conversation about weather with statistics. In conversation about housing, Swedes define their '''flats''' by number of rooms (''En trea'' - \"a three\" - is simply a three-room-and-kitchen flat) and usually ask each other about the area by square meter. They have '''week numbers''' running from 1 to 52. The world famous furniture retailer IKEA diverts from this pattern, with Nordic product names.}}\n\n=== Social Etiquette and Breaches ===\n\n* '''Swedes tend to be direct, participative communicators''', and they tend to express their thoughts and emotions clearly and freely. This said, there is a tendency to avoid conflict or confrontation as modesty is regarded as a virtue in Swedish society. \n\n* '''Do not raise your voice or lose your temper in a conversation'''. Most Swedes converse in a calm, collective manner, even when there's a disagreement. \n\n* '''Swedes take turns and converse'''. Interrupting or butting into a conversation is seen as impolite.\n\n* Though '''narcotics''' are not unheard of, most Swedes, old and young, are strongly '''opposed''' to them. Punishment is harsh, even for private-use possession, consumption, and intoxication itself. This also applies to cannabis.\n\n* When it comes to alcohol, Swedes are as double-natured as Dr. Jekyll and Mr. Hyde. Before work or driving, one beer is one too many, and '''drunk driving is a crime''' genuinely despised in Sweden. However, drunkenness can be a regular part of many Swedish traditions (e.g. Midsommar, Valborg, etc.)--keep this in mind if you abstain from alcohol. Some Swedes frown on people being sober at a party and reject excuses other than driving or pregnancy--though no formal policy exists that would force one to drink against their will.\n\n* Salespeople, waiters and other service employees are usually less attentive than their colleagues in other countries, to respect customers' privacy, except a short \"hej\" to entering customers. Customers are supposed to call for attention.\n\n* When entering a bus or another form of public transportation it is often considered impolite to sit next to another person if there is another twin seat available.\n\n* Always ask if you should '''remove your shoes''' or not when entering a Swedish home. In most homes it is customary to remove your shoes. Only on very rare occasions is the wearing of shoes indoors considered acceptable. Generally, you will see a place by the front door of most homes where shoes are to be stored and can surmise from the presence of other guests' shoes what is expected. If you just assume that you are to take your shoes off upon entry, in most cases you will have done the right thing. Bringing ''indoor shoes'' to other people's homes is customary among some. Most Swedish homes have wood flooring; wall-to-wall carpets are uncommon. Should you be dressed up and the host asks you to take your shoes off, then you should do that. As in every other culture one's home is one's castle, and you would not like someone to be disrespectful in your own home.\n\n* Despite rumours of the \"Swedish sin\", Swedish people are generally not accepting of public nudity except at approved nudist beaches. Don't go skinny-dipping in public beaches if you are more than about four years old. Female toplessness is accepted but not very common (though prohibited at many public baths), breastfeeding in public is also accepted. Male toplessness is accepted in the countryside and at the beach, but might be frowned upon in urban areas.\n\n* Greetings between men and women who know each other (e.g., are good friends, relatives, etc.) are often in the form of a '''hug'''. Swedes don't cheek-kiss to greet but are aware that other cultures do. If you are a visitor from France and do cheek-kiss a Swede, they will return the favor but probably feel a bit awkward doing so.\n\n* Personal space. Most Swedes likes to have the distance of an arms length between themselves and another person in public spaces, unless you are standing in an apparant queue or in a very crowded area. If you are standing closer than that for any longer time, you will most likely be inteprented as seeking contact, or if you are unlucky - as being pushy.\n\n* A Swede who crosses their arms during a conversation is either listening attentive to you, or just warming their hands.\n\n* '''Show up on the minute''' for meetings and meals, preferably five minutes before the set time. There is no \"fashionably late\" in Sweden.  However, showing up early at a private invitation is considered rude. If it's acceptable to arrive late it's usually mentioned specifically (e.g.,\"...arrive after 1700\") or there exist formal rules (some universities apply an \"akademisk kvart\", an academic quarter hour, within which it is acceptable to arrive to lectures).\n\n* Swedes generally address each other with first names, unless the situation is very formal.\n\n* Don't be surprised if a woman wants to pay for dinner. If she offers to pay, all you need to do is simply to smile and say \"Thank you, how kind!\" or \"Tack, vad snällt av dig!\". If you like to, you can add \"It was delicious.\" or \"Det var jättegott.\", and praise the food. If you are closer acquainted, be prepared to claim the pay for the next meal you share, unless she insists on paying for it herself that time as well.\n\n*In regards to '''homosexuality''', Sweden is quite tolerant.  In fact, as of May 2009, same-sex marriages have legal standing in Sweden. The chance of facing extreme criticism or antigay views is low in Sweden, as the country has anti-discrimination and hate crime laws.  Violence against gays and lesbians is relatively rare.\n\n*Of equal importance is to '''avoid assuming positions or cultures based on identifiable signs'''. For example the Chinese girl you might meet may speak no word of Chinese and have never been anywhere near China. This point is especially true for individuals from areas with ethnic strife - don't assume that anyone you meet is either personally connected to, or shares the viewpoints of their ethnic-origin Nation.\n\n=== Things to avoid ===\n\n==== Politics: ====\n\n* '''Avoid criticisng the country'''. Swedes in general have some very strong patriotic and nationalistic views, and would not appreciate any criticisms about their country's lifestyle, prices, and others. To avoid getting into the bad raps of your hosts, it is advisable to praise the country and avoid bringing up anything negative about it.\n\n==== Symbols: ====\n\n* '''Do not compare another city or area in Sweden over the one you are presently visiting'''. Swedes are proud of their own town or region, and would not appreciate such comparisons.\n\n==== Sensitive Issues: ====\n\n* '''Avoid discussing issues related to immigration'''. If you must discuss it, do so with discretion as it remains an extremely complicated and divisive issue.\n\n==Cope==\n* Around payday, which falls between the 23rd and 28th of each month, stores and bars can get very crowded.\n\n* Smoking is not allowed in restaurants, bars or any other indoor establishments (except outdoor terraces and designated smoking rooms). Smoking in someone's home is usually out of the question; if you ask kindly you might be allowed to light up on the balcony or the porch. Some men and women use \"'''snus'''\" (snuff), a tobacco pouch inserted into the upper lip. It comes in a wide variety of different styles and flavors and in both loose and portion form. Portions are more popular and generally recommended for public events, as loose snus can be very messy when removed. Unlike American oral tobaccos, it is not usually necessary to spit if the snus is properly placed. Most bars and clubs will have snus receptacles instead of ashtrays on the tables. Be warned, however, that snus can seem very harsh to first time users, with a nicotine level several times that of cigarettes.\n\n===Bring===\t \n* '''Credit card'''. Nearly all stores and all ATMs accept VISA and MasterCard, as well as Maestro (Switch). PIN-pads are widely used instead of signatures (even for credit cards), so if your card has a PIN, memorize it before you leave home. Don't expect stores to accept foreign currency, apart from close to the borders, where usually only the neighbour currency is accepted (i.e. danish krone, Norwegian krone or euro). Larger stores in Stockholm and at larger airports and railway stations often accept payment in Euro, however. Even if the euro or Danish krone is accepted, do not expect the exchange rate to be generous.\n* '''Passport''' or '''EU national identity card''' as identification. A driver's license might work but that is not guaranteed. The police issues national ID cards to Swedish citizens, but those who have a driver's license prefer to have that as their ID. You will frequently be asked to prove age or identity - for instance when using your credit card, when buying alcohol, when renting accommodation or when entering bars and clubs. Banks accept only Swedish identity documents, so a visitor will be required to provide a valid passport or a EU national identity card. Swedish bureaucracy is efficient but rigid.\n* '''Warm''' '''clothes''' and extra shoes. Weather in Sweden is unpredictable. It can suddenly get cold and/or wet, and sometimes quite hot. Pack some rain protection if you plan on staying for an extended period of time. It may also be obtained locally, but for quality you also pay high prices. Sweden in winter requires preparations for visitors who are not aquainted with lots of snow and months of darkness in freezing temperatures during the winter months. If you are planning to visit Sweden during winter you should be ready with a warm jacket, hat, gloves, warm boots and a scarf to protect yourself from the cold. The temperature can sink as low as -20°C (-4° F) during winter months, especially in the northern parts.\n* '''Mobile phone'''. Swedish GSM, 3G and 4G coverages are great, at least in populated areas but don't expect it to work everywhere. In rural areas the state-owned operator Telia might be the only one available. If you have another operator you may only place SOS calls. Official figures say that 85% (by total area - most of the populated parts are covered fully) of the country has GSM coverage and about 54% for 3G. 71% of the populations is covered by 4G. Even the subway system and other public traffic tunnels offer an almost complete coverage. The number of public phones is dwindling due to most locals having a mobile phone. \n* '''Powerplug adapters''' are essential if your equipment does not match European standard 230 Volt 50Hz and the ''Schuko'' plug or the ''Europlug''. Many electronic shops offer, usually pricey, adapters and converters for most other standards.\n* '''European Health Service card''', if you are an EU/EES citizen.\n* '''Mosquito repellent''', ''myggmedel'', is available in most food stores and a part of life during summertime in forests, fields, mountains and also many inhabited areas. Ask for the traditional brands, and be careful with new brands that have not been tested for allergies and chemicals.\n\n===Do not bring===\n* Cash money from your home country - see above.\n* Possession of any brand of tear gas or pepper spray or any form of electroshock weapon will be liable for severe prosecution in the same category as possession of non-registered and un-licensed firearms. These must be disposed before passing the Swedish border and disposal will also be offered before passing security and identity control at international airports. You should also consult security regarding any other self-defense or weapon-like equipment. The laws regarding these products also vary greatly between EU and other European countries. This is important to know when travelling between many European countries. You will not be able to retrieve disposed illegal items at departure from Sweden.\n* Some European countries might offer a light local attitude towards small quantities of certain drugs. This is certainly not the case in Sweden, which has a next to zero tolerance towards all forms of narcotics and even some controversial medicines. To even consider carrying doubtful substances into hardline Sweden is a very bad idea. You could be offered a number of illegal drugs during your stay in Sweden, but you could also be kept for a longer and rather unpleasant stay than expected if you decide to get involved with them.\n\n==Contact==\nSweden's international calling code number is +46. Since 2015, there are no payphones, due to the vast spread of mobile phones.\n\nSweden has excellent wireless GSM and 3G/UMTS and LTE (4G) coverage, even in rural areas except in the central and northern interior parts of the country. The major networks are Telia, Tele2/Comviq, Telenor and 3 (Tre). Swedish GSM operates on the European 900/1800 MHz frequencies (Americans will need a triband phone), with 3G/UMTS on 2100 MHz (currently with 7.2-14.4 Mbit HSDPA speeds). Only the Telia network supports EDGE.\nLTE (4G) is available on the following frequencies: TeliaSonera(2600/800 MHz), Tre (2600/800 MHz) and Tele2/Telenor (2600/1800/900/800 MHz) and offer speeds up to 90Mbit in the larger urban areas.\nSome operators may ask for a Swedish personnummer (or samordningsnummer) to get a number, although with most operators you can get prepaid without any, \"personnummer\" or ID and these are sold and refillable at most supermarkets and tobacco stores \n\nPrepaid USB 3G modems can be bought cheaply (around 150&nbsp;SEK) in many shops. They are a good alternative to WiFi in Sweden. They cost around 100 SEK/week and 300 SEK/month to use. Data limits are high (typically 20 GB/month).\n\nSweden is the world's second most Internet connected country (second to [[Iceland]]). The Swedish postal system (Postnord) is often considered efficient and reliable, with locations placed inside of supermarkets and convenience stores (look for the round yellow logo with the blue horn). Stamps (frimärken) for ordinary letters (to anywhere in the world) are 12&nbsp;SEK and the letter usually needs 2 days within EU. Stamps can be purchased in most supermarkets, ask the cashier.\n\n\n\n\n\n[[ca:Suècia]]\n[[de:Schweden]]\n[[eo:Svedio]]\n[[es:Suecia]]\n[[fi:Ruotsi]]\n[[fr:Suède]]\n[[hu:Svédország]]\n[[it:Svezia]]\n[[ja:スウェーデン]]\n[[nl:Zweden]]\n[[pl:Szwecja]]\n[[pt:Suécia]]\n[[ro:Suedia]]\n[[ru:Швеция]]\n[[sv:Sverige]]\n[[wts:Category:Sweden]]\n\n\n[[WikiPedia:Sweden]]\n[[Dmoz:Europe/Sweden/]]\n[[World66:europe/sweden]]\n\n{{outline}}\n{{isPartOf|Scandinavia}}\n{{countryguide}}\n\n{{related|Driving_in_Sweden}}\n{{related|Sixteen_days_in_Götaland_and_Svealand}}"
        }
    }
}