{
    "parse": {
        "title": "Tonga",
        "pageid": 822,
        "wikitext": {
            "*": "{{pagebanner|Tonga Banner.jpg}}\n{{cautionbox|The CDC has identified [[Tonga]] as an affected area of the Zika outbreak. Pregnant women are advised to be cautious as the virus can lead to birth defects. Adults affected by the virus experience fever, rash, joint pain, and conjunctivitis (red eyes) typically lasting a week.  You can learn more by visiting [http://www.cdc.gov/zika/index.html the official CDC website].}}\n\n\n{{quickbar\n|image=Tonga 02.jpg\n|caption=waves in Tonga\n|location=Tonga in its region.svg\n|flag=Flag of Tonga.svg\n|capital=[[Tongatapu|Nuku'alofa]]\n|government=Hereditary constitutional monarchy\n|currency=pa'anga (TOP)\n|area=748 km<sup>2</sup>\n|population=106,137 (July 2002 est.)\n|language=Tongan, English\n|religion=Christian (Church of Jesus Christ of Latter-Day Saints claims 52,000 adherents; Free Wesleyan Church claims over 30,000 adherents)\n|tld=.to\n|electricity=230V, 50Hz (Australian plug)\n|timezone=UTC +13h\n|callingcode=676\n}} \n\n'''Tonga''', the \"Friendly Islands\", is an archipelago in the South Pacific Ocean. The country is divided into four island groups, or regions.\n\n==Understand==\nThere were pro-democracy riots in Nuku'alofa in November 2006 which left 8 people dead and large portions of the town centre flattened and burned. Tonga is one of the last absolute monarchies in the world and is based upon an essentially feudal system where the king disburses land and positions without recourse to any elected body. Although Tongan royalty is largely loved and revered by Tongans, younger people have an appetite for stronger accountability and a more modern constitution. An election was held in November 2010. This was planned to lead to a major reduction in the powers of the King and the land-owning nobility in favour of a more democratic form of governance. However, of the 26 seats in Parliament only 17 are elected, with the rest being allocated to the nobles. After some horse trading, it was a noble who emerged as the Prime Minister.\n\nTonga has an economy with none of the corporate chain stores and with local small businesses providing all necessary goods and services. Tourists were not a target during the riots and you will find Tonga a friendly and appealing place to visit although don't expect the same level of infrastructure as in more developed countries. Rebuilding after the riots in Nuku'alofa has been more or less completed and there are abundant tourism facilities.\n\n===History===\n\nThe archipelago of \"The Friendly Islands\" was united into a Polynesian kingdom in 1845, becoming a constitutional monarchy in 1875. From 1900 to 1970, Tonga was a British protectorate, with the [[United Kingdom]] looking after its foreign affairs under a Treaty of Friendship. Tonga became a member of the Commonwealth of Nations after the protectorate ended. In 2010, Tonga took a decisive step towards becoming a fully functioning constitutional monarchy, after legislative reforms paved the way for its first partial representative elections.\n\nIt is one of the few indigenous monarchies in the Pacific.\n\n==Regions==\n{{regionlist\n| regionmap=Tonga regions map.png\n| regionmaptext=\n| regionmapsize=upright=1.3\n\n| region1name=[[Tongatapu]]\n| region1color=#eaf59e\n| region1items=\n| region1description=home of the capital, Nuku'alofa.\n\n| region2name=[['Eua]]\n| region2color=#ddbe89\n| region2items=\n| region2description=an unspoilt island just southeast of Tongatapu\n\n| region3name=[[Vava'u]]\n| region3color=#a7cbcb\n| region3items=\n| region3description=a popular yachting destination.\n\n| region4name=[[Ha'apai]]\n| region4color=#9bc7d3\n| region4items=\n| region4description=the least populated group.\n\n| region5name=[[Niuas]]\n| region5color=#cdc5d7\n| region5items=\n| region5description=remote islands to the north of Tonga: Niuafo'ou, Niuatoputapu, and Tafahi are collectively known as the \"Niuas.\"\n}}\n\n==Get in==\n\n===Entry requirements===\n\nNationals of all [[European Economic Area|Schengen Area]] member states may enter Tonga visa-free for up to 90 days within a 180-day period.\n\nNationals of [[China]] (PRC) may enter Tonga visa-free for up to 30 days.\n\nNationals of [[Australia]], [[Bahamas]], [[Barbados]], [[Brazil]], [[Brunei]], [[Canada]], [[Dominica]], [[Fiji]], [[Hong Kong]], [[Ireland]], [[Israel]], [[Japan]], [[Kiribati]], [[Malaysia]], [[Macau]], [[Marshall Islands]], [[Federated States of Micronesia|Micronesia]], [[Monaco]], [[Nauru]], [[New Zealand]], [[Palau]], [[Papua New Guinea]], [[Russia]], [[Saint Kitts and Nevis]], [[Saint Lucia]], [[Saint Vincent and the Grenadines]], [[Samoa]], [[Seychelles]], [[Singapore]], [[Solomon Islands]], [[South Korea]], [[Turkey]], [[Tuvalu]], [[Ukraine]], [[United Kingdom]], [[United States of America]] and [[Vanuatu]] may obtain a free visa on arrival valid for 31 days, which is extendable up to 6 months.\n\nAll foreign nationals transiting through Tonga can obtain a transit visa on arrival and leave the airport during the transit if all of the following conditions are fulfilled:\n* The traveller is continuing their journey to a third country by the same or connecting aircraft with a valid ticket with reserved seats\n* The traveller has all the documents required for the onward journey\n* The traveller has a valid return ticket to the country where they can return after going to their onward destination\n* The transit time in Tonga is for a period of time that is less than 24 hours\n\nAll other foreign nationals not covered by an exemption above must obtain a visa (sometimes known as a 'visitor's permit') in advance before travelling to Tonga at a Tongan embassy, high commission or consulate. Tonga has diplomatic missions in Australia, China, New Zealand, the United Kingdom and the United States. The application fee for a visitor's permit is US$60 in China and the US, AU$60 in Australia, NZ$60 in New Zealand and £60 in the UK (see [http://www.pmo.gov.to/ministrydepartment/337-foreign-affairs/1851-new-revision-in-fees-structure-for-immigration-related-matters-] for details). The [http://tongaconsul.com/index.php?option=com_content&task=view&id=20 website of the Tongan Consulate-General in San Francisco] provides some information about the visa application process.\n\nIf you require a visa to enter Tonga, you might be able to apply for one at a British embassy, high commission or consulate in the country where you legally reside if there is no Tongan diplomatic post. For example, the British embassies in Amman[http://www.ukba.homeoffice.gov.uk/countries/jordan/commonwealth-bots/?langname=null] and Belgrade[http://www.ukba.homeoffice.gov.uk/countries/serbia/commonwealth-bots/?langname=UK%20English] accept Tongan visa applications (this list is '''not''' exhaustive). British diplomatic posts charge £50 to process a Tongan visa application and an extra £70 if the Tongan authorities require the visa application to be referred to them. The Tongan authorities can also decide to charge an additional fee if they correspond with you directly.\n\nIf you wish to stay for more than 31 days in Tonga, you can apply to extend your visitor's permit at the immigration department in the capital. \n\nYou either come in by airplane or yacht.[[Image:Tonga_01.jpg|thumb|upright=1.3|Typical roadside store on Tongatapu]]\n\n===By plane===\n'''Fua'amotu Airport (TBU)''' is on [[Tongatapu]] around half an hour from Nuku'alofa.\n\n* Air New Zealand flies from [[Auckland]] five times weekly.  \n* Virgin Australia flies from [[Sydney]] and Auckland twice a week.\n* [http://www.talofaairways.com/ Talofa Airways] flies directly from [[Samoa]] ([[Apia]]) and [[American Samoa]] ([[Pago Pago]]) four times weekly. \n* You can also arrive from [[Fiji]] ([[Nadi]] and [[Suva]]) on [http://www.fijiairways.com/ Fiji Airways], with connections from the USA, Hong Kong, Australia and Samoa.\n\nA crowd of local taxi drivers meets each incoming flight at the airport and they usually charge 40 pa'anga for a lift into Nuku'alofa. The Teta Tours and Toni's Tours mini-bus also meets flights and will deliver you to your hotel or guest house for TOP20.\n.\n\n===By private boat===\nLots of people arrive by private yacht since Tonga, particularly Vava'u, is a common stop on the around-the-world circuit.\n\n==Get around==\nTo get between island groups, you basically have to fly (or sail). [http://www.realtonga.to/ Real Tonga Airline] operates between the major islands, with flights from Tongatapu to 'Eua, Ha'apai, and Vava'u and from Vava'u to Niuafo’ou and Niuatoputapu. The flight from Tongatapu to 'Eua is, at eight minutes, said to be the world's shortest scheduled flight.\n\nMotorbikes, scooters and cycles can be rented on Tongatapu, Vava'u and Ha'apai. On Tongatapu you can hire a car. There are also taxis. To get around the main island, Tongatapu, Teta Tours and Toni's guest house offer day tours of all the main tourist sights.  The speed limit is usually 40km/h and this is stuck to by the local drivers. You're meant to also buy a local Tongan driving licence on top of your existing licence before you drive (TOP25). The roads are good in and around Nuku'alofa but deteriorate the further from the town and the further south you travel. Most cars in Tonga are in a terrible state, maintained on a budget and held together by a combination of 'Western Union' stickers and prayer. The low speed limit helps to keep accidents down. There are buses to various points on Tongatapu from Nuku'alofa although there are no timetables.\n[[Image:Tonga_03.jpg|thumb|right|200px| Ha'amonga 'a Maui trilithon]]\n\n==Talk==\nTongan is the most widely spoken language in Tonga. English is also widely understood because many of the high schools teach exclusively in English. Many Tongans when asked a question they are unsure of or don`t understand will reply with a \"Yes\". In this case, ask a follow up question and if the reply is still \"Yes\", ask someone else.\n\n==See==\n*'''Tongatapu.''' Tongatapu is Tonga's largest island with over two-thirds of the country's small population. It is a coral island surrounded by coral reefs. The capital, Nuku'alofa, on the north coast, has a relaxed air, despite the troubles of a few years ago. There are some interesting places to visit, such as ancient tombs and coastal blowholes, and some nice beaches with good snorkelling. Tongatapu also provides a good opportunity to view a unique culture. There are several small islands to the north of Tongatapu that have been developed into resorts. Nuku'alofa has good quality accommodation as well as guest houses within range of the backpacker.\n\n*''''Eua.''' 'Eua Island is located only 17.5km east southeast from Tongatapu. It is the highest island in Tonga and is not related geologically to the other islands, being much older. It has beaches on the western side but dramatic cliffs on the east coast, with Tonga’s largest tropical rain forest, which is a great place to go trekking. There are a few small guest houses.\n \n*'''Vava'u.''' Vava’u is a group of more than 50 islands, about 150 miles north of Tongatapu. They are either raised coral limestone or coral atolls. The beautiful harbour opposite the main town of Neiafu is a common destination for yachties sailing the South Pacific, attracting about 500 yachts every season. The waters of the islands are known for their clarity.  The area attracts many humpback whales between June and November and there are organised tours to see them. Other things to do include diving, renting a yacht, kayaking; game fishing and kite surfing. There are some good walks on the main island. There are many places to stay both in the capital Neiafu and on the outlying islands. \n[[Image:Niuafou.jpg|thumb|right|200px|Niuafo'ou Island from space]]\n\n* '''Ha'apai.''' Ha'apai is a group of about 60 islands, south of the Vava'u group and north of Tongatapu. Only 20 islands are constantly inhabited. This is where the ''Mutiny on the Bounty'' occurred in 1789. The total population is approximately 5,500. There are plenty of sandy beaches plus good diving and snorkelling and the opportunity to see some whales. Ha'apai offers the whole range of accommodation, from budget to upmarket resort.\n\nHa'apai Lulunga is the southern cluster of the Ha'apai group. To visit here you must get off the ship in Ha'afeva, usually in the middle of the night! Many motor boats cluster around the ship's loading platform and you have to jump onto one of the boats as they sway up and down on waves. Babies and supplies are thrown across the gap to waiting arms like rugby balls. Just about any boat with space will take you back to Ha'afeva (about a 40 minute ride) you may or may not be charged a small fee depending on how friendly you are with the skipper. Most likely you will be invited to stay with someone on the boat during your ride, so make sure you like the person, once you are staying with them it would cause the family to lose face if you go stay with someone else. Ha'afeva is a lovely island with a medium sized village on the harbour side. The back side of the island (referred to as 'Liku' on all the islands) is pristine beaches and forest. You could camp just about anywhere near the sea as the whole shoreline is designated as govt. nature preserve. there are usually 2 or 3 trails that meander back to different areas of liku shoreline on all the Lulunga islands. You will see fascinating coral rock formations and cliffs, pristine sand beaches and forest right down to the water in places. Papayas, mangoes, guavas, lemon and sour oranges, Sour-sop, rose apple (fekika) and Jengkol (indoneseian) (ifi nuts in Tonga), candle-nuts festoon the littoral forest. especially mango trees, perhaps seeds were long ago strewn by some Tongan Johnny Appleseed. \n\nOther islands in the subgroup around Ha'afeva are Matuku, Kotu, Tu'unga, O'ua, Fotuha'a. O'ua is elevated and surrounded by breathtaking cliffs. Kotu is closest to the volcanic  islands of Kao and Tofua. and has pristine beaches on the northwest liku. Tungua is likewise a fascinating assortment of lovely deserted beaches. Transport between all islands is relatively easy especially on Sunday when families circulate back and forth between the various islands. You would do well to have some Tongan language under your belt but people are exceedingly friendly and accommodating. each island has an island primary school and teachers are relatively fluent in English should you need help. A hosital is located on Ha'afeva, the most developed of the group. None of the islands have electricity or roads. get around on foot or horseback. Basic foods are available at small shops. \n\n*'''The Niuas.''' The Niuas are reachable by weekly flights from Vava’u. Niuatoputapu is 240km north of Vava’u and has a population of around 1400. It has beautiful white beaches, particularly on the north-west side of the island. Niuafo’ou is the northernmost island of Tonga. It is known as Tin Can island from the fact that in earlier times mail was delivered and picked up by strong swimmers who would retrieve packages sealed up in a biscuit tin and thrown overboard from passing ships. Niuafo’ou is the tip of an underwater volcano. The last eruption was in 1946, after which the whole island was evacuated for ten years. Accommodation on both islands is limited.\n\n==Do==\nApart from a few historical sites on Tongatapu most things to do in Tonga reflect its island nature. Diving, snorkelling, fishing, boat trips, kayaking and kite surfing are all possible. There are some lovely beaches if you just want to laze around. Tonga has some good restaurants and this is the place to come if you like lobster.\n\nTake time to learn a little about Tonga's fairly feudal culture and its many traditions. Go to church. Even if you are not religious the singing can be very moving. Watch tapa cloth being made from mulberry bark and try a drink of kava, the traditional drink, which is a mild narcotic.\n\n==Buy==\nThe national currency is the Pa'anga (ISO symbolisation: '''TOP'''), often called the Tongan dollar and sometimes abbreviated to \"T$\" in English. Denominations are 1, 2, 5, 10, 20 and 50 seniti coins and 1, 2, 5, 10, 20, 50 and 100 Pa'anga banknotes. Although Tonga is a developing country, prices for many things are comparable to or slightly greater than New Zealand or Australia. Most of what you eat, apart from fish, lobsters, roots and tubers, fruits and vegetables will have been imported. A good meal out will cost TOP30-50, a beer in a restaurant or bar costs about TOP5-6, hiring a car is about TOP50-60 a day and cigarettes are TOP7-8 for a pack of 25.\n\nIn February 2015,\n*USD1 = TOP2.05\n*€1 = TOP2.34\n*GBP1 = TOP3.09\n\n[[File:Tapa.jpg|thumb|upright=1.7|Tongan tapa]]\n* '''Tapa.''' Tapa cloth is made from the bulk of the paper mulberry tree. Although tapa is found throughout Polynesia, Tonga is the only country where it is still a part of daily life. The bark is stripped from the tree trunk and the outer bark is then scraped off from the inner bark and discarded. The inner bark is first dried in the sun before being soaked. It is then beaten into strips of 25cm using wooden mallets. The continuous beats of the tapa mallet are still a common sound in Tongan villages. The narrow strips are then beaten together into a wider sheet and decorated.\n\n==Eat==\nTongan feasts are a must-do. Tour companies and hotels organize feasts, together with traditional dancing, on several nights of the week on Tongatapu and in Vava'u.\n\n==Drink==\nThe legal drinking age is '''18'''.\n\nTonga is lively well into the evening, generally becoming suddenly very quiet at around 23:00. Expect to see people walking around until late. Beer and liquor are available from many outlets, including Fijian, Australian and New Zealand imports to complement the local brews. If you are keen to check out native drink, try '''Kava''' (something like liquid novacaine) at least once.\n\nThe local beer is called Ikale and is sold in 330mL bottles in most restaurants and bars (TOP4.50-5). Or you can buy the same bottles from one of the many 'Chinese' roadside shops or a supermarket for TOP2 or less. Imported beers are mainly from Australia although there are also some from Europe. Most are sold in 330mL cans or bottles.\n\n==Sleep==\nThere is a wide range of accommodation in Tonga, ranging from luxurious to budget. Most have relatively few rooms, though.  Tourism Tonga's, Visitor Information Centre has a full listing. See the detailed listings on the pages for [[Tongatapu]], [[Vava'u]] and [[Ha'apai]].\n\n===Budget===\n\n* ''Friendly Islander Hotel'' [http://www.friendlyislander-tonga.com] offers self-contained 1 or 2 room accommodation at competitive prices for short or long term stays. It is located on the waterfront along Vuna Road, across the road from sea pool.\n\n==Work==\nIf you don't work you don't eat. Tongans don't want to hear that it's hard on the coral beaches lined with palm trees and emerald lagoons. There are many opportunities for skilled trades from the streets to the shops, in the schools to the churches and yes from the markets to the office.  This is a hot spot for skilled navigators spanning throughout 169 villages and 150 islands.  Some major exports include vanilla, handcraft and speciality pumpkins grown for export to Japan.  Other agriculture sectors include root crops like taro, tapioca, sweet potatoes, yams, coconuts, bananas, mangoes, papayas, pineapples, watermelons and even peanuts.\n\nIf you are on a visitor's visa, you cannot be involved with business or take up employment while in Tonga. You also cannot take courses from an educational institution. It is mostly illegal to try to change a visitor's visa into a visa that allows for employment, so if you intend to have a job while in Tonga, make sure you have an employment visa in advance. Apply for your visa at least one month in advance. If you are already in Tonga and would like to extend it, contact the immigration department one month in advance about the extension.\n\nWhile employment visas are technically available, the immigration department will probably be reluctant to granted you one as Tonga has a high unemployment rate, and would prefer that jobs be taken up by Tongan citizens as opposed to outsiders. If you're coming to Tonga for humanitarian or volunteer work, you need an employment visa for that.\n\n==Stay safe==\nOne thing to remember when going for a swim is that there are many sharp corals near the beach, especially near Tongatapu and PangaiMotu.  It is a good idea to wear a cheap pair of sandals while in the water.  There are jelly fish and they do sting!  They are also hard to see.  \n\nAs a conservative Christian nation, '''male homosexuality is illegal''', and can be punishable by up to 10 years' imprisonment and whipping.\n\n==Stay healthy==\nThere is no malaria in Tonga. Tonga, along with other countries in the South Pacific, is experiencing an outbreak of the Zika Virus.\n\nExercise the usual caution when snorkelling as the coral can be dangerous.\n\n==Respect==\n\nTonga is a very conservative Christian nation. Over 90% of the population belong to a Christian denomination or sect, with the Free Wesleyan Church of Tonga (a Methodist denomination) being the official religion and adhered to by around one-third of the population. A further third are adherents of Mormonism or Roman Catholicism, and most of the rest adhere to a variety of Protestant denominations.\n\nAs one would expect, Sunday is strongly revered - the vast majority of the population will attend religious services, very few shops will be open and there is very little to do. Hotels will be open, as will some restaurant and beach resorts, although mainly to serve expats and tourists. Small shops, including, in Nuku'alofa, a popular bakery, may open later on Sunday afternoon. \n\nMany of the church services are very enjoyable. Strike up a friendship with some locals and you will have no problems finding an enjoyable Sunday experience.\n\nTV stations close or play Christian shows on Sundays. Radio stations will also play religious material on Sundays. To compensate, the cinema in Nuku'alofa usually has a screening just after midnight on Monday morning.\n\nFor maximum respect, keep your ankles covered (both men and women). Men, keep your shirt on everywhere except at the beach. Topless men off cruise liners have been arrested and held until after the ship has left!\n\n==Contact==\n\n===Internet===\n\n===Mobile phone===\n\n===Post===\n\n{{IsPartOf|Polynesia}}\n{{countryguide}}\n{{outline}}\n\n[[de:Tonga]]\n[[eo:Tongo]]\n[[es:Tonga]]\n[[fi:Tonga]]\n[[fr:Tonga]]\n[[hu:Tonga]]\n[[it:Tonga]]\n[[ja:トンガ]]\n[[nl:Tonga]]\n[[pl:Tonga]]\n[[pt:Tonga]]\n[[ru:Тонга]]\n[[sv:Tonga]]\n[[wts:Category:Tonga]]\n\n\n[[WikiPedia:Tonga]]\n[[Dmoz:Oceania/Tonga/]]"
        }
    }
}