{
    "parse": {
        "title": "Uruguay",
        "pageid": 867,
        "wikitext": {
            "*": "{{pagebanner|Uruguay Banner.jpg}}\n\n{{quickbar\n| image=Montevideo_-_Uruguay.jpg\n| caption=Montevideo\n| location=Uruguay in its region..svg\n| flag=Flag of Uruguay.svg\n| capital=[[Montevideo]]\n| government=Constitutional republic\n| currency=Uruguayan peso (UYU)\n| area=176,220km²<br />''land: 173,620km²<br />water: 2,600km²''\n| population=3,386,575 (Jul 2002 estimate)\n| language=[[Spanish]] (official), Portuñol, or Brasilero (Portuguese-Spanish mix on the Brazilian frontier)\n| religion=Roman Catholic 66%, Protestant 2%, Jewish 1%, nonprofessing or other 31%\n| electricity=\n| callingcode=598\n| tld=.uy\n| timezone= UTC -3h\n}}\n[http://www.turismo.gub.uy/ '''Uruguay'''] is a country in [[South America]]. It has a South Atlantic Ocean coastline and lies between [[Argentina]] to the west and [[Brazil]] to the north. It is the second-smallest country in South America (after [[Suriname]]). \n\n==Understand==\nThe name Uruguay means ''river of the colorful birds''. It is a word in Guarani that was spoken by the natives of the area.  \n\nOften called the [[Switzerland]] of [[South America]] not for geographical features but for a stable democracy and social benefits such as free education, but mostly due to a developed financial sector based on bank secrecy. In 2002 Uruguay faced one of its biggest economic crises which had very negative effects on crime.  Although economic activity by 2008 had returned to pre-crisis levels, crime remains relatively high compared to historical levels, but is still low by South American standards. Long a desired country for immigration, Uruguay has been suffering from high levels of emigration for almost four decades, mainly of highly trained workers and people with high-level studies (\"brain drain\") seeking better opportunities abroad.  \n\nUruguay has a rich agricultural and civic history among its indigenous people. The dominant pre-20th century live stock driving techniques are still utilized in the country, and are less visited tourist attractions than the pleasant beaches and city centres. The country has a mostly low-lying landscape. Cerro Catedral, the country's highest point, is 514m high. \n\n===Climate===\nUruguay has a wet, temperate climate. However, due to the absence of nearby mountains, which act as weather barriers, all locations are particularly vulnerable to rapid changes from weather fronts.\n\n===History===\nUruguay was discovered by Spanish Adelantados in the ends of the XVI century, and was part of the United Provinces of the De la Plata river until 1811.  (Although ''plata'' literally means \"silver\" in Spanish, \"plate\" is the traditional and correct translation as it was used as a synonym for precious metals up until the 19th century.) Originally, Uruguay was simply known as the Banda Oriental, or Eastern Band, of colonies along the eastern edge of the Uruguay and De la Plata river.  \n\nWhen Buenos Aires expelled the last Viceroy, Baltasar Cisneros, the capital of the Viceroyalty moved to Montevideo. The rebel navy sailed from Buenos Aires in an attempt to overcome the Spanish troops in that city, aided by the local rebel troops.\n\nWhen finally Montevideo was freed from Spain, Uruguay intended to secede from Buenos Aires, only to be invaded by the Brazilian Empire, which started the Argentine-Brazilian war in 1813. After a variety of confusing twists, the war ultimately ended in a stalemate.  With the assistance of mediation by the British government, both warring countries agreed to end their territorial claims on the Banda Oriental in 1828, thus giving birth to the new Eastern Republic of Uruguay. A constitution was subsequently drafted and adopted in 1830. British assistance in the creation of Uruguay led to a long history of British influence (including the habit of driving on the left), which ended only with World War II.  \n\nThe Argentinian Civil War which ravaged that country during the 19th century was not a stranger to Uruguay, which soon gave birth to two opposing parties, the Whites (liberals) and the Reds (traditionalists) that eventually also led to a Uruguayan Civil War that went on in various hot and cold phases until the beginnings of the twentieth century.  The story goes that the parties' colours originally came from armbands allegedly torn from the Uruguayan flag, but the conservatives switched to red armbands when they realized that red faded less quickly in the sun than blue.\n\nIn the early 20th century, President José Batlle y Ordóñez oversaw Uruguay's modernization and industrialization, and was also able to squash the remnants of ''caudillismo'' political culture from the Spanish colonial era which to the present continue to cause trouble in countries like Argentina.  This is why Uruguay since Batlle's presidency has enjoyed much lower levels of corruption than the rest of South America.  \n\nHowever, the simmering tension between the left and right wings of Uruguayan politics persisted. From 1954 to 1967, Uruguay tried an unusual solution borrowed from Switzerland: a collegiate Executive Office in which a different member was designated President every year. In this way, Uruguay became the \"Latin American Switzerland\" for a while, acting as a model of democracy and banking liberties until a military coup ended all this.\n\nA Marxist urban guerrilla movement, the Tupamaros, launched in the late 1960s, led Uruguay's president Juan María Bordaberry to \"agree\" to military control of his administration in 1973. (They returned the favor by firing him from his job in 1976 and appointing the first of several puppet presidents.) By the end of 1974 the rebels had been brutally crushed (and Tupamaro leader and future president Jose Mujica was imprisoned at the bottom of a well), but the military continued to expand its hold over the government, by engaging in widespread torture and disappearances of alleged insurgents and anyone unfortunate enough to be perceived as opponents of the regime. Civilian and democratic rule was not restored until 1985. \n\nToday, Uruguay's political and labour conditions are among the most free on the continent. In 2004, a leftist coalition (the ''Frente Amplio'' or Broad Front) which included the Tupamaros won elections which left them in control of both houses of congress, the presidency, and most city and regional governments. In 2009, former guerrilla leader Mujica was elected president, although he continued to lead a modest lifestyle of growing flowers on his farm outside Montevideo, driving an old Volkswagen Beetle, and donating 90% of his salary to charity.\n\n==Regions==\n[[File:Uruguay Regions map.png|thumb|upright=2.2|Map of Uruguay with regions colour-coded]]\n\n{{Regionlist\n\n| region1name=[[Atlantic Coast (Uruguay)|Atlantic Coast]]  \n| region1color=#83a8c1\n| region1items=[[Cabo Polonio]], [[Chuy]], [[La Paloma]], [[Punta del Diablo]], [[Piriapolis]], [[Punta del Este]] \n| region1description= great beach resorts fronting the Atlantic and a land crossing to [[Brazil]]\n\n| region2name=[[Rio de la Plata]]\n| region2color=#dbe086\n| region2items=[[Montevideo]], [[Colonia]]\n| region2description=the capital city, old colonial magnificence and a ferry crossing to Argentina\n\n| region3name=[[Northern Interior (Uruguay)|Northern Interior]] \n| region3color=#71b37b\n| region3items=[[Paysandu]], [[Salto]], [[Tacuarembo]]  \n| region3description= Gaucho culture, land crossings to [[Argentina]] and citrus growing \n\n| region4name=[[Central Interior (Uruguay)|Central Interior]] \n| region4color=#b5d29f\n| region4items=[[Durazno]]\n| region4description=agriculture, huge dams on the Rio Negro and land crossings to [[Brazil]]\n}}\n\n==Cities==\nAbout half of the country's population is crammed into the Montevideo metro area and a strip of sprawl reaching east to  Punta del Este. The rest are distributed among the small towns, farms, and ranches in the interior. \n\n*[[Montevideo]] \n*[[Chuy]] - Right on the border with [[Brazil]]\n*[[Colonia]] (Colonia del Sacramento) - a well preserved old colonial town and [[UNESCO World Heritage Site]]\n*[[Durazno]]\n*[[La Paloma]]\n*[[Paysandu]]\n*[[Piriapolis]]\n*[[Punta del Este]]\n*[[Salto]]\n\n==Other destinations==\nBeaches on the Atlantic Ocean or near Rio de la Plata, including:\n* [[Punta del Diablo]]\n* Fortaleza de Santa Teresa\n* [[Cabo Polonio]]\n\nBirdwatching in Rocha touristic \"estancias\".\n\n==Get in==\nHolders of passports (or MERCOSUR ID cards) from the following countries can enter without a '''visa''': Argentina, Armenia, Australia, Austria, Bahamas, Barbados, Belgium, Belize, Bolivia, Brazil, Canada, Chile, Colombia, Costa Rica, Croatia, Cyprus, Czech Republic, Denmark, Dominican Republic, Ecuador, El Salvador, Finland, France, Georgia, Germany, Greece, Guatemala, Honduras, Hong Kong, Hungary, Iceland, Ireland, Israel, Italy, Jamaica, Japan, Latvia, Liechtenstein, Lithuania, Luxembourg, Macau, Malaysia, Malta, Mexico, Monaco, the Netherlands, New Zealand, Nicaragua, Norway, Panama, Paraguay, Peru, Poland, Portugal , Romania, Russia, Serbia, Seychelles, Singapore, Slovakia, Slovenia, South Africa, South Korea, Spain, Sweden, Switzerland, Trinidad and Tobago, Turkey, Turkish Republic of Northern Cyprus, United Kingdom, United States, and Venezuela. Travellers from other countries should contact the local consular section of the Ministry of Foreign Affairs [http://www.mrree.gub.uy/mrree/Embajadas_y_Consulados/Misiones/Scripts_Misiones/paises.idc]. But usually Uruguay has its borders open to tourists and visitors from all countries and it is quite easy to get in or out.\nCitizens of India have to apply for tourist visas but this visa is free of charge.\n\n===By plane===\nThe country's largest airport and primary hub is '''Carrasco International Airport''' in the suburb of that name east of Montevideo. Carrasco is a relatively small airport and most travellers from around the world will have to connect at least once or twice to get there.  \n\nPluna, the old national airline, closed down in 2012 [http://en.wikipedia.org/wiki/PLUNA]. Iberia has connecting flights from [[São Paulo]], Asunción, Santiago de Chile and [[Madrid]].\n\nThere are other companies that also have flights to Montevideo. American Airlines has a non-stop flight from [[Miami]] to Montevideo.  The flight runs four times a week and runs all year round; the other three days it connects via Buenos Aires (EZE). Many long-haul flights to Montevideo stop in Buenos Aires, Santiago, or São Paulo before going on.\n\nLAN connects to Australia and New Zealand via Chile.  Since 2011, Copa Airlines has offered daily flights between its hub in Panama City, Panama and Montevideo.\n\n===By train===\nUruguay never had much of a railway network, and in 1985, the National Transport Plan recommended discontinuing the remaining passenger lines and focusing on freight trains only.  Today, there are very limited '''commuter train''' services linking Montevideo to some of the northern suburbs. There are some '''tourist trains''' which do not have a fixed schedule. You need to find announcements for them at the Montevideo train station. There is no regular '''long distance train''' service. The most usual means of public transport is the bus (inside Montevideo inner buses and from Montevideo to other main cities of the country).  \n\n===By car===\nUruguay is linked to Argentina via bridges over the Rio Uruguay at Fray Bentos, Paysandu, Salto, and Bella Union.  Uruguay is also linked to Brazil at Bella Union, Artigas, Rivera, Cerrillada, Acegua, Rio Branco, and Chuy.\n\nIf entering at Rio Branco, you must first get your exit stamp from the Brazilian authorities in Jaguarao. You cannot do this at the offices at the border. You must go to the Policia Federal office at the opposite end of town, [https://maps.google.com/maps?q=-32.556626,-53.385644 here]. Then you must get your stamp from the Uruguayan authorities. You cannot do this at the offices at the border. You must go to the office at the opposite end of town, [https://maps.google.com/maps?q=-32.601877,-53.401620 here].\n\n===By bus===\nThere are many buses running from the Brazilian cities of [[Porto Alegre]], [[São Paulo]] and [[Rio de Janeiro]]. The country features extensive bus networks and there are many services that run from Montevideo to different cities across the country. [http://www.trescruces.com.uy Terminal Tres Cruces], Agencia Central  and Terminal Ciudad Vieja are the three main hubs. Travel by bus is very safe. International bus service is available to Sao Paulo, Porto Alegre, (Brazil), most of the Argentinian Provinces (Buenos Aires, Cordoba, Mendoza, Entre Rios), Asuncion (Paraguay) and Santiago de Chile (Chile). The service is catered and buses have an outstanding level of service, much better than the average European or North American service.\n\nIf entering at Rio Branco, you must first get your exit stamp from the Brazilian authorities in Jaguarao. You cannot do this at the offices at the border. You must go to the inconveniently located Policia Federal office at the opposite end of town, [https://maps.google.com/maps?q=-32.556626,-53.385644 here]. Then you must get your stamp from the Uruguayan authorities. You cannot do this at the offices at the border. You must go to the inconveniently located office at the opposite end of town, [https://maps.google.com/maps?q=-32.601877,-53.401620 here]. Then, to get a bus to elsewhere in Uruguay, return to the center of Rio Branco, or ask someone if the bus you want stops near the immigration office. You can pay in cash on the bus. Remember to exchange your Brazilian cash before attempting to buy a bus ticket, because the bus companies do not accept credit card.\n\nThis process might be easier if your bus goes from Brazil to Uruguay, rather than stopping in Jaguarao and taking a different bus from Rio Branco. You should still ask if the bus will stop at the necessary offices to get both an exit and entry stamp. Also remember that buses from Brazil to Uruguay do not run as often as buses within the same country. They may sell out, forcing you to wait for several days. Therefore you should buy such a ticket a few days or more in advance.\n\n===By boat===\nThe '''Buquebus''' [http://www.buquebus.com/] ferry service operates between Buenos Aires, Argentina, and both Colonia del Sacramento and Montevideo, Uruguay. Some services continue from there to Punta del Este. For the Buquebus-Ferry from Buenos Aires to Colonia del Sacramento there are two options. One takes three hours and the other one hour to get there. A ticket to Montevideo for the three-hour ferry is about ARS147  and ARS190 (Mar 2010) for the fast one.\n\n[https://coloniaexpress.com/ar '''Colonia Express'''] operates between Buenos Aires and Colonia by one hour ferry and then by bus to Montevideo. Ticket prices to Montevideo from ARS898 (April 2018) or even cheaper in special web offers.\n\n[https://www.seacatcolonia.com/?i=en '''Seacat Colonia'''] operates as well between Buenos Aires and Colonia by one hour ferry and then by bus to Montevideo and Punta del Este. Ticket prices to Montevideo from ARS1400 (April 2018).\n\n==Get around==\n\n===Bus===\nUruguay has an extensive internal bus system. Non-local / departmental buses leave from the Tres Cruces station which also serves the international buses. The buses are frequent, safe, comfortable and many companies serve the same routes.\n\n=== Taxi===\nTaxis in Uruguay are safe and fairly affordable, costing about USD2/km. All taxis in Uruguay use meters and have fixed costs.\n\n===By remise or private transfer===\nRemise is a private sedan service, known for being more comfortable and professional than a taxi service. Drivers can speak English and wear suits. You can rent by the hour or point-to-point with advance booking; the cost is about USD1.5 per kilometre, or around USD20 per hour; see http://www.bybremises.com or http://www.airporttransfer.com.uy for additional information. This service can also be used for airport transfers at around USD42.\n\n===Car===\n\n====Car rentals====\nTo rent a car in Uruguay, residents of many countries (including the United States) need only their driver's license, passport, and credit card; only residents of certain countries must obtain an International Driver's Permit.  As in most developing countries, vehicle imports and gasoline are both heavily taxed.  Therefore, most Uruguayans prefer to buy cars with fuel-efficient manual transmissions, which in turn means that vehicles with automatic transmissions are rarer and much more expensive. If you can drive a manual transmission, you are looking at about USD50/day and up, while those requiring an automatic transmission will pay USD90/day and up for a car rental.  \n\nIt will cost USD60 and up to fill up the gas tank just  on a regular small sedan like a Chevy Aveo. Traditionally, the sole gasoline retailer in Uruguay was the state-owned monopoly, ANCAP. (ANCAP is the \"National Administration\" for \"combustibles,\" alcohol, and Portland cement, hence the name.) Today, ANCAP competes with Petrobras and Esso.  All gas stations are full service, so you will need to know enough rudimentary Spanish to tell the attendant to fill it up.\n\n====Driving====\nDriving in Uruguay is very similar to European driving, but with fewer traffic lights and lots of roundabouts.  North Americans accustomed to wild big-city driving (New York or Los Angeles) will not find it too difficult to adapt to.  As in many developing countries and parts of Europe, Uruguayans have a tendency to split lanes or make their own lane. Since manual transmissions take longer to spin up, Uruguayans like to watch for the cross-traffic's yellow light and then jump the green about a second in advance, which means you should ''never'' run yellow lights if you can brake safely. Many intersections are marked only with yield signs.  If you don't see a sign, treat it as a yield. If you see a stop sign (\"Pare\"), it means stop, ''please stop'', probably because it's a blind intersection or that someone was run over there. \n\nUruguay has not yet implemented sensor loops, so all traffic lights are on timers and you will have to sit there regardless of whether the cross-street has traffic. (Some local drivers will just run the red after sitting for a few minutes if cross-traffic is non-existent.)  Right turns on red after stop are not allowed.  Headlights must be turned on at all times while moving.  \n\nLike much of Latin America, Uruguay has a fondness for giant speed bumps, even in the middle of major roads. These are signed well in advance (especially the ones on major highways) and require drivers to brake to 20km/h or less; failure to brake in time will send one's car flying.  \n\nUruguayan law requires drivers to keep both hands on the steering wheel while moving, which means you cannot use a handheld cell phone while driving.  \n\nThe speed limit ranges between 75km/h to 110km/h on most intercity highways, with 90km/h standard on most stretches.  Uruguay does not have any long-distance freeways, expressways, or motorways.  Some short stretches of Routes 1 and 5 to the west of Montevideo have been upgraded to freeways.   \n\nLook out for pedestrians and slow-moving traffic in the roadway, especially in rural areas and poorer suburbs.  Because automobiles are so expensive, many Uruguayans get around solely by foot, taxi, scooter, motorcycle, or bus.  Like many developing countries, Uruguay lacks the resources to properly maintain sidewalks in poor neighborhoods, so sidewalks often have cracks, potholes, or worse.  Therefore, you will see pedestrians frequently walking in the street even when there appears to be a sidewalk or footpath next to the road.\n\n====Navigation====\nUruguayan national highways are well-maintained, well-designed, easy to drive, and in excellent condition; they are maintained by the private Highway Corporation of Uruguay (CVU) under the supervision of the National Highway Directorate (DNV).  CVU charges a standard toll (currently UYU70 for a regular auto) to traffic in both directions at toll plazas strategically sited throughout the country near bridges over major rivers (where it is difficult to find a toll-free detour).  Transitions between CVU/DNV and local department highway maintenance are always marked with large signs (if the jarring change in the quality of the pavement doesn't already make it obvious).  Roads under local maintenance tend to vary widely in terms of quality. \n\nThe most important long-distance highway in Uruguay is the Ruta Interbalneria linking Montevideo to Punta Del Este, which is a four-lane road with a broad median.  Note that the IB was built as what people from western North America call an expressway; that is, cross-traffic still crosses at-grade at intersections rather than at interchanges with overpasses and underpasses.  Most other highways are two-lane highways.  \n\nIt is nearly impossible to obtain paper road maps of Uruguay outside of the country. Fortunately, ANCAP sells an excellent map package at all its gas stations which, as of 2012, includes three maps.  Two are large foldable sheet maps.  One is an overview-level highway map, which has the entire Mercosur bloc on one side and all of Uruguay on the other. The other is a detailed street map of Montevideo. The third map is a booklet with detailed street maps of all departmental capital cities and several other major cities, including Punta del Este.  \n\nGoogle Maps, Bing Maps from Microsoft, and OpenStreetMap all have excellent coverage of Montevideo, and the first two also have thorough coverage of the rest of the country.  Although there are now mobile apps available which enable users to download OpenStreetMap data in advance to one's mobile phone, OpenStreetMap's coverage of areas outside of Montevideo and Punta del Este is still incomplete.  In 2015, Google finally made Google Street View available for Uruguay, which means that visitors can now fully preview the country before they arrive.  \n\nAnother important quirk to keep in mind is that ''only'' online map services accurately depict the one-way streets common in Montevideo and other Uruguayan cities and towns.  Virtually all Uruguayan paper road maps (including the ANCAP maps and the official maps from the Ministry of Tourism and Sport) lack arrows to show the direction of one-way streets.\n\n====Emergencies====\nTake notice of the emergency phone numbers prominently posted on the highways and keep them in mind. Uruguay is not a dangerous country, but since it is mostly agricultural and very sparsely populated between the towns, if your car breaks down it can take you a long time to walk to the nearest pay phone. It is recommended to carry a cell phone with you. Antel is one of the national cell companies and the main provider.\n\n\n=== Hitch Hiking ===\n\nIn rural areas hitch hiking is fairly common and as safe as hitching is anywhere. Uruguay has the lowest level of violent crime in Latin America outside Cuba.  If you are female don't hitch hike alone.  Play it safe, but it's more likely that the car is going to crash than something bad is going to happen.\n\n==Language==\n'''[[Spanish phrasebook|Spanish]]''' is spoken everywhere. The pronunciation and the use of the ''vos'' pronoun instead of ''tú', ' is common around the Capital, as in many other American countries.  The \"voceo\" means that most verbs are conjugated in the old form of Castillian, or Spanish.\n\n'''Portuñol''' (or Brasilero) is a mixture of [[Portuguese phrasebook|Portuguese]] and Spanish used on the Brazilian border. \n\nAmerindian traits can be found everywhere in Uruguayan culture, from cuisine to vocabulary. (there is no former Amerindian population in the present)\n\nAlthough most Uruguayans have studied '''English''' at school, they do not actually speak or use it. However, some Uruguayans have studied English at private institutes, so they can speak it well. Outside Montevideo and Punta del Este there are few English speakers. You will find English spoken in most tourist spots (shopping centers and in Punta del Este) and some restaurants will probably have English-speaking staff.\n\nIf you want to study Spanish in a language academy, you may want to check out the Grupo de Turismo Idiomático, a private sector initiative supported by the Ministry of Tourism.\n\n==See==\n[[File:Maldonado desde la Barra.jpg|thumb|upright=1.3|Maldonado bay.]]\n*<see name=\"Los Dedos (the fingers)\" alt=\"\" address=\"Punta del Este\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\"></see>\n*<see name=\"Castillo de Piria\" alt=\"\" address=\"Piriapolis\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\"></see>\n*<see name=\"Confitería Irisarri\" alt=\"\" address=\"Minas\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\"></see>\n*<see name=\"Abbotsford\" alt=\"\" address=\"Piriapolis\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\"></see>\n*<see name=\"Colonia del Sacramento\" alt=\"\" address=\"Colonia, Colonia\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">World heritage site</see>\n*<see name=\"Plaza Independencia, Palacio Salvo and Old City\" alt=\"\" address=\"Montevideo\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\"></see>\n*<see name=\"Montevideo Centenario Stadium and Football Museum\" alt=\"\" address=\"Montevideo\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\"></see>\n*<see name=\"Palacio Legislativo\" alt=\"\" address=\"Montevideo\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">The Uruguayan Parliament</see>\n*<see name=\"Rambla (Promenade) of Montevideo\" alt=\"\" address=\"Montevideo\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\"></see>\n*<see name=\"Jose Ignacio\" alt=\"\" address=\"Maldonado, costa atlántica\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\"></see>\n*<see name=\"La Paloma\" alt=\"\" address=\"La Paloma Rocha\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\"></see>\n\n==Do==\n*<do name=\"\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">Sunbathing, surfing and bathing in the oceanic coast. The most important beaches are Punta del Este, Piriapolis, La Paloma, La Pedrera, Cabo Polonio, Punta del Diablo and Santa Teresa(national park and camping)</do>\n\n*<do name=\"\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">One of the best experiences to have while your stay at Uruguay is to watch a game between Nacional and Peñarol, the two most followed football teams in the nation.</do>\n\n==Buy==\nCurrency is the Uruguayan ''peso''. Prices are often quoted using the ''U$'' or ''$'' symbol, which may be easily confused with the US$ (US dollar) symbol, so we use the International Standards Organisation's symbol of '''UYU''' placed before the amount with no intervening space.\n\nIn June 2018 \n* USD1 = UYU31.38\n* €1 = UYU36.62\n\nUruguay is like many developing countries in that the retail industry is still dominated by small specialized shops, small supermarkets, and small, crowded shopping malls.  There are no true department stores in the country remotely comparable to the giant stores found in New York or Paris.  In the entire country, there is only ''one'' true hypermarket, Geant (operated a joint venture between local chain Disco and the French chain Geant), that constitutes a reasonably decent facsimile of hypermarkets elsewhere (down to the huge parking lot, high ceiling and wide aisles). Uruguay does not have the big box \"category killer\" stores for which the US is famous (and which have been copied to a lesser extent in Australia and Europe).  \n\nUruguay does not manufacture most consumer goods locally. Most items in the stores have either been imported from China, or from Argentina or Brazil. Even worse, Uruguay charges high import tariffs and high value-added tax (IVA) of about 22% on virtually everything and 18% using debit cards.  Accordingly, most goods cost as much as in Australia, Canada, or Europe (or higher) and are much more expensive than in the U.S.   \n\nSome parts of Uruguayan stores feature numerous high-quality brands familiar to any North American, like Dove soap, Colgate toothpaste, Listerine mouthwash, Del Monte canned fruit, and so on.  There are other brands with familiar logos but strange names.  For example, Coca-Cola's South American juice brand is del Valle, which until 2012 had a logo very similar to Coca-Cola's North American juice brand, Minute Maid.  \n\nHowever, Uruguay is not a major priority for most other brands found in the developed world, which means their products are rare or non-existent here. Locally available brands (as noted, imported mostly from China) tend to be of poor quality.  Because the Uruguayan market is so small and most Uruguayans are still relatively poor compared to consumers elsewhere, Uruguayan retailers lack the bargaining power of their North American or European counterparts. In turn, Chinese factories often sell their highest-quality product lines to the dominant First World markets and send their mediocre-quality product lines to Uruguay and other small developing countries. For example, while American and European consumers are accustomed to advertisements for luxury bedding made of 700+ thread count textiles woven from Egyptian or pima cotton, luxury bedding in Uruguay may consist of 250+ thread count textiles woven from cotton/polyester blends.  \n\nPopular items to buy include '''yerba mate''' gourds, antiques, wool textiles, and leather goods: jackets, purses, wallets, belts, etc.  With regard to textiles and leather goods, although the prices may look like great bargains, one must keep in mind that local designs are different to designs elsewhere when it comes to the variable quality of metalworking, which may be a problem since leather goods like purses and belts have metal parts like clasps and buckles.\n\n==Eat==\n'''Prices:'''\nUruguayan cuisine is typical for temperate countries, high on butter, fat, and grains, low on spice. It is primarily Spanish with a very strong Italian influence (pizza and pasta) due to Uruguay's long history of Italian immigration. If you are from the Mediterranean, you will find it bland, but if you come from Northern Europe, Russia or the US, you won't have trouble getting used to it. \n\n* Breakfast for 4 people can cost as little as UYU58 (USD3) in a supermarket\n* 1 box (1 litro) of Tropical Fruit Juice - UYU35\n* 2 packages (5 ounce each) of coconut biscuits - UYU28 \n\nThere are many public '''markets''' where you can get a hundred varieties of '''meat'''. Vegetarians can order ravioli just about anywhere. \n\nEmpanadas (hand-sized meat or cheese pies) make an excellent portable, inexpensive, and delicious snack or lunch. You can find them easily at many corner bakeries. \n\nAt bars the local speciality is ''gramajo'', a dish made of fried potatoes, eggs, and ham. If you ask they can make it without the ham. \n\nUruguay has traditionally been a ranching country, with cattle outnumbering people more than two-to-one, and therefore features excellent (and affordable) steaks.  One dish that should not be missed is ''chivito'', a heart-attack-on-a-platter sandwich (some guidebooks call it a \"cholesterol bomb\") that is made of a combination of skirt steak (not goat as Argentines often mistake it for), tomato, lettuce, onion, eggs (hard-boiled and then sliced), ham, bacon, mozzarella cheese and mayonnaise and fries. \n\n\"Asado\" is a typical Uruguay dish, almost all the Uruguayans know how to make it (try it at the \"del Puerto\" market, in Montevideo). Uruguay, with its long shoreline, also enjoys an excellent variety of seafood and fish. The flavor of the most commonly offered fish, ''brotola'', may be familiar to people from North America, where it is called hake.  \n\nFor desserts, dulce de leche, a kind of caramel, is found in all manner of confections, from ice cream to alfajores (dulce de leche-filled cookie sandwiches), or Ricardito, a famous Uruguayan dessert (available in all supermarkets).\n\n==Drink==\nThe legal purchasing age of alcoholic beverages is 18 and is strictly enforced, although there isn't a legally defined drinking age.\n\n'''Yerba Mate''' is widely drunk on the streets, but can hardly be ordered in restaurants.  You may have to buy a package at a ''super mercado'' and make your own.  The drinking gourds are widely available and range from economical to super-luxe silver and horn.  Yerba Mate is a social drink. If you are with a group of Uruguayans they will probably not offer you any because they assume that foreigners do not like the bitter taste. If you try some it will make everybody happy.\n\nUruguay is also acquiring a reputation for its fine '''wines''', especially those made from the Tannat grape, which is known as one of the healthiest red wine in the world, due to Tannat having seeds high in antioxidants and skins high in polyphenols that lower your blood pressure and protect you against cardiovascular diseases.\n\n==Sleep==\nFor nature lovers, birdwatchers, and those seeking a respite from the fast-paced world, there are many \"estancias\" in serene and peaceful environments, surrounded by many species of native and migrating birds, which offer an unique opportunity to reconnect with nature.\n\nThere are many more beach houses to rent along the coast than actual hotel rooms. They are plentiful, and outside the high season affordable. During the first two weeks of January it's impossible to find anything, every cottage and hotel room is booked months in advance.\n\n==Work==\n\nThere are numerous English language schools which are looking for native speakers as teachers. They can arrange papers or pay teachers under the table. The pay is not a high one, but enough to live on in Montevideo. Work permits are not particularly difficult to obtain and Uruguay lets you convert a tourist visa to a work visa without leaving the country. Residency visas without permission to work simply require you prove access to $500 USD a month. Work permits are not particularly hard to get.\n\n==Stay safe==\n\nHistorically, Uruguay has enjoyed a very low rate of violent crime compared to its neighbours, with the stress on the word ''violent''.  Thus, Argentines and Brazilians traditionally go on vacation in Uruguay (even though Rio de Janeiro has far more beautiful natural scenery) because they love not having to worry about being carjacked, kidnapped, or assaulted while on vacation.  Even today, Uruguay is still relatively free of those types of crimes.  \n\nHowever, this does not mean that Uruguay is crime free.  The major differences are that most Uruguayan crimes are either non-confrontational or do not involve the gratuitous use of firearms.  Montevideo in particular has seen its crime rate gradually rise since the severe 2001-2002 financial crisis, and now has moderately high levels of theft, burglary, and robbery similar to those found in major US cities.  Fortunately, Punta del Este and most rural areas continue to enjoy relatively low crime levels. As long as you take basic precautions in Montevideo (eg use a money belt and/or hotel safe for valuables, look alert, and keep out of obvious slums), you will have a very safe trip.\n\nIn an emergency, call '''911''' or '''999'''. For firefighters, call, 104.\n\nAs in any foreign country, you should exercise the utmost caution to not do anything which could be deemed to be a violation of Uruguayan law.  This is particularly important in Uruguay because it is one of the few democracies in the world where criminal suspects can be held indefinitely for years before charges are actually brought.\n\nAs a result, Uruguayan prisons are rated among the worst in the world in regards of any respect for human rights. Human rights are \"systematically violated\" in Uruguayan prisons due to the degrading conditions and overcrowding in which the inmates live, according to the United Nations. Despite being one of the countries in the region with the lowest crime rates, Uruguay has one of the highest rates in the world of people behind bars, according to [http://www.laht.com/article.asp?CategoryId=23620&ArticleId=351801 United Nations figures] as published by the Latin American Herald Tribune.\n\n==Stay healthy==\nTap water is safe to drink in all major cities. The Hospital Británico (British Hospital), SUMMUM and BlueCross & BlueShield Uruguay have an European-quality service and they are clean and efficient. Asociación Española, Médica Uruguaya and CASMU are the largest healthcare companies in Uruguay and they also have a good quality level. Just don't make any unwise drinking decisions.\n\n==Respect==\nUruguay is a socially progressive country. Women got to vote in Uruguay 12 years before France. Uruguay is a secular state unlike Argentina, Chile or Paraguay; the Uruguayan state has not supported any religion since 1917. The population is mainly Catholic, but not very practicing.\n\nUruguay is not particularly open to its gay and lesbian communities in comparison to Brazil. There are a few gay and lesbian bars in Montevideo and in Punta del Este, but outside those two cities there is no public \"queer\" community. The only public monument to sexual diversity is in Ciudad Vieja (the old city).  However, it was the first Latin American country to pass a civil union law and is considered to be safe and welcoming to gay and lesbian visitors. Gay marriage is fully legal in Uruguay. Even in rural areas gay travelers and expats experience little overt discrimination. \n\nDespite linguistic and cultural similarity with Argentina (Uruguayan Spanish is very close to the one spoken in Argentina, especially in Buenos Aires, and both tango and yerba mate are popular in both countries), Uruguayans are very proud of their own country which is more liberal and calmer than their neighbour.  Treating Uruguay as if it were a part of Argentina won't help you get good friends.\n\nThe similarly sounding country Paraguay has very little in common with Uruguay.\n\n===Drugs===\nAlthough Uruguay has become '''The Netherlands of South America''', its drug laws are completely different from that of the Netherlands, as there is more government regulation.\n\n====Marijuana====\nCannabis was fully legalized in the country in December 2013. That being said, don't think you can just take a trip to Uruguay for the purpose of consuming cannabis. '''The new laws only apply to uruguayan citizens or legal residents of Uruguay that are 18 or older.''' Cannabis is prohibited to non-Uruguayan residents. If you wish to become a Uruguayan resident, you should be aware that you must register with the Uruguayan authorities in order to consume cannabis.\n\n==Contact==\n\n===Telephone===\nThe national landline telephone monopoly is Antel, which provides all public pay phones and is also the sole provider of landline Internet service. \n\nAlthough Antel pay phones only take Antel's proprietary magnetic cards, it is possible to use international calling cards to call home by taking the phone off the hook, waiting for a dial tone, and dialling the correct access code.  However, note that many public pay phones are not properly maintained. If you do not hear a touch tone emitted for each key, that means the phone is defective and you must try another one.\n\nUruguay's country code is +598.  Montevideo and suburbs have phone numbers beginning in two, while the rest of the country has phone numbers beginning with 4. \n\nThe national cellphone company is Antel, which competes with two private companies, Movistar and Claro. All three have numerous kiosks and stores throughout the country.\n\n===Mail===\nThe national postal service is Correos Uruguay.  Most of their post offices are very hard to find (the government is trying to save money by moving them to cheaper locations) and are open x Monday through Friday 09:00-1700; some are open 09:00-12:00 on Saturdays. \n\nLetterboxes for depositing outbound mail are made out of cheap blue translucent plastic and are extremely difficult to find outside of post offices.  Some post offices have three boxes: one for the local city, one for domestic mail (\"interior\") and one for international (\"exterior\").  \n\nUnfortunately, in Uruguay they don't build and maintain durable weather-hardened metal letterboxes as those found on sidewalks and street corners in most developed countries, so most Uruguayan letterboxes are designed only for indoor use.   Keep in mind that Correos licenses many retailers, such as pharmacies, as postal agents, and letterboxes can sometimes be found around those agents' premises as well.\n\n===Internet===\nAntel is the ''only'' provider of landline Internet service, while Dedicado is the main provider of fixed wireless Internet service.  Wi-Fi is ubiquitous and can be found in virtually all decent hotels as well as many restaurants, cybercafes, and shopping malls. \n\nAntel Wi-Fi hotspots are normally available only to Antel landline Internet subscribers, unless you are in a place with complimentary free service like Carrasco International Airport, in which case a public username and password for free access are prominently posted. Dedicado Wi-Fi hotspots are free for everyone.\n\n{{outline}}\n{{Countryguide}}\n\n[[ca:Uruguai]]\n[[de:Uruguay]]\n[[eo:Urugvajo]]\n[[es:Uruguay]]\n[[fi:Uruguay]]\n[[fr:Uruguay]]\n[[hu:Uruguay]]\n[[it:Uruguay]]\n[[ja:ウルグアイ]]\n[[nl:Uruguay]]\n[[pl:Urugwaj]]\n[[pt:Uruguai]]\n[[ro:Uruguay]]\n[[ru:Уругвай]]\n[[sv:Uruguay]]\n[[zh:烏拉圭]]\n[[wts:Category:Uruguay]]\n\n\n[[WikiPedia:Uruguay]]\n[[Dmoz:South America/Uruguay/]]\n[[World66:southamerica/uruguay]]\n\n{{isPartOf|South_America}}\n{{title-icons|otbp-icon}}"
        }
    }
}