{
    "parse": {
        "title": "Zambia",
        "pageid": 914,
        "wikitext": {
            "*": "{{pagebanner|Zambia Banner.jpg}}\n\n{{quickbar\n| image=VictoriaFallsZambia.jpg\n| caption=Victoria Falls\n| flag=Flag of Zambia.svg\n| location=Zambia in its region.svg\n| capital=[[Lusaka]]\n| government=Republic\n| currency=Zambian Kwacha (ZMW)\n| area=''total:'' 752,614km²<br />''water:'' 11,890km²<br />''land:'' 740,724km²\n| population=16,212,000\n| language= English (official), major vernaculars - Bemba, Kaonda, Lozi, Lunda, Luvale, Nyanja, Tonga, and about 70 other indigenous languages\n| religion=Christian (50%-75%), Muslim and Hindu (24%-49%), indigenous beliefs (1%)\n| electricity=230V/50Hz, Plug type C/D/G\n| callingcode=+260\n| tld=.zm\n| timezone=CAT (GMT +2 hours)\n}}\n\n[http://www.zambiatourism.com/'''Zambia'''] is a  a landlocked country in [[Southern Africa]]. It is, bordered by [[Tanzania]] to the northeast, [[Malawi]] to the east, [[Mozambique]] to the southeast, [[Zimbabwe]] and [[Botswana]] to the south, with a narrow strip of [[Namibia]] known as the [[Caprivi Strip]] to the southwest, [[Angola]] to the west, and the [[Democratic Republic of the Congo]] to the northwest.\n\n==Understand==\nZambia offers travellers some of the world's best safari opportunities, a glimpse into \"real Africa,\" and [[Victoria Falls]], one of the World's Seven Natural Wonders and a [[UNESCO World Heritage Site]].\n\n===History===\nThe territory of '''Northern Rhodesia''' was administered by John Cecil Rhodes's British South Africa Company from 1891 until it was formally administered as a British crown colony in 1923. During the 1920s and 1930s, advances in mining spurred development and immigration. \n\nBritain tried to administer Northern Rhodesia in a federation with Nysaland (Malawi) and Southern Rhodesia (Zimbabwe) however this was opposed by Northern Rhodesia which was concerned that the majority of the investment and money would flow to the south. During this period to help build the economy the British built the Kariba Dam on the Zambezi River creating Lake Kariba, one of Africa's largest lakes and providing hydro electric power for the area. The British granted self rule to their colonies in the period after the Second World War and after abandoning the federation idea Northern Rhodesia transferred to self government. \n\nThe name was changed to Zambia upon independence in 1964. In the 1970s, 1980s and 1990s, declining copper prices, one party democracy under Kenneth Kaunda and a prolonged drought hurt the economy. However Zambia under Kaunda was a staunch anti-Apartheid supporter, one of the only countries in the region to be so. As such it provided a base for the ANC to operate from, the previous South African President Jacob Zuma was at the time based in Lusaka. This created huge obstacles to Zambia, with South Rhodesia under Ian Smith's white rule invading and actually bombing Lusaka and with South Africa cutting its economic ties and attempting its own \"sanctions\" against the Zambians. \n\nElections in 1991 brought an end to one-party rule, but the subsequent vote in 1996 saw blatant harassment of opposition parties. The election in 2001 was marked by administrative problems with at least two parties filing legal petitions challenging the results. \n\nZambia transitioned to a proper functioning democracy with the advent of Levy Mwanawasa as President. He led the Movement for Multi-Party Democracy (MMD) to power with a platform of stamping out corruption. Following Mwanawasa's untimely death in office Zambia went on to the 2011 election and claimed the title of being one of the few African countries to have a sitting President lose an election. The peaceful election was taken as an indicator of how far Zambia had come and is viewed as a model African democracy.This was shown after the handover of power from the MMD to the Patriotic Front (PF) under Michael Sata. Sata would hold onto power until his untimely death in October 2014. Guy Scott served briefly as  president until new elections were held on 20 January 2015, in which Edgar Lungu was elected as the sixth President.\n\n===Economy===\n[[Image:Mfuwe Downtown.JPG|thumb|upright=1.3|Typical Zambian village]]\nMuch of Zambia remains poor, with GDP per capita of the order of USD1800/year, and the bulk of Zambia's population lives on subsistence agriculture. The economy continues to revolve around '''copper'''; after decades of mismanagement the industry is now doing better thanks to higher commodity prices and investments made after privatization. Another recent success story has been the rebranding of '''tourism''', driving tourists to the northern side of the Victoria Falls and Zambia's safaris, and the fast growth has come from a low base.\n\n===People===\nAs can be seen even from the bizarre squashed-peanut shape of the country, Zambia is one of the stranger legacies of colonialism, agglomerating a large number of different tribes (73, according to the official count) and languages (20, plus dialects).  Fortunately, with a long history of coexistence, significant migration around the country and similar Bantu-family languages, they all seem to get along pretty well and Zambia has been spared the violent inter-tribal strife that has decimated countries like [[Rwanda]].\n\nThe '''Bemba''' are the largest group in Zambia, but they still form only about 20% of the population. The Bemba came from the Congo in the 16th century, and while their homelands are in the north and middle of Zambia, many have immigrated to Lusaka and the Copperbelt.\n\nThe '''Chewa''', '''Ngoni''' and '''Nsenga''' tribes, all found in the east of the country, share the Nyanja language and form Zambia's second largest grouping with about 15%.\n\nThe '''Tonga''', '''Ila''' and '''Lenje''', known together as the ''Bantu Botatwe'' (Three Peoples), are a close runner-up with 15% of the population, concentrated in the west of the country in the Zambezi Valley and the plateaus to the north.\n\nThe '''Lozi''' in the far west (6%) are known for their craftwork, particularly basketry, and for a low-key (non-violent) secessionist movement calling for an independent Barotseland.\n\nOther tribes in Zambia's patchwork include the '''Lala''' and '''Bisa''' (5%), the '''Kaonde''' (3%), the '''Mambwe''' and '''Lungu''' (3%), the '''Lunda''' (3%), the '''Lamba''' (2.5%) and the '''Luvale''' (2%), and 57 more.  Despair not: the differences are not crucial for travelers, and locals will be happy to explain their traditions when needed, notably at festivals.\n\nWhite Africans of English or Afrikaner descent (1.2%) are also visible, particularly in the more upmarket areas of the major cities.\n\n===Festivals===\nA highlight of any trip to Zambia is a visit to any of the many traditional '''festivals''' held throughout the country.  Planning ahead can be tough though, as schedules are variable and not all are held yearly.  Also, if you do manage to attend, bring along tolerance for heat, dust and crowds (increasingly drunk as the evening wears on) and patience for endless speeches by local functionaries like the Assistent Vice-Secretary for Fertiliser Co-operatives in Rutungu Sub-Province.  On the plus side, any foreigners attending can usually sneak into the VIP stands, although you may get hassled for photo permits.\n\n* '''Kazanga''', [[Kaoma]] [Central Western Zambia] (June - August). The Kazanga ceremony is considered Zambia's oldest traditional ceremony having been celebrated by the Nkoya people for over 500 years. The ceremony celebrates and maintains Nkoya traditions of music, dance and many other ancient practices. \n\n* '''Kuomboka''', [[Lealui]]/[[Limulunga]] ([[Western Province (Zambia)|Western Province]], around Easter (March-April).  The most famous of Zambia's festivals, this is the ceremonial migration of the Lozi king (''litunga'') from his dry season abode at Lealui to his wet season palace at Limulunga.  Wearing an elaborate Victorian ambassador's costume, the ''litunga'' is taken by a flotilla of barges down the river, with musical accompaniment and, of course, much feasting at the destination.\n\n* '''Ncwala''', near [[Chipata]], 24 February.  A Ngoni festival to celebrate the first fruit of the season, where the Ngoni chief ceremonially tastes the fruit of the land, then spears a bull and drinks its blood.\n\n* '''Kulamba''', near [[Chipata]], August.  A Chewa thanksgiving festival known for its ''Nyau'' secret society dancers.\n\n* '''Likumbi Lya Mize (August)'''\nThis is a popular August festival(The Day of Mize). This ceremony takes place at Mize, the official palace of Senior Chief Ndungu, about seven kilometres west of Zambezi Boma. People of the Luvale tribe gather to celebrate their cultural heritage , bringing displays of all types of handicrafts and spicing the event with traditional singing and dancing while the chief holds court. Mize is the official palace of Senior Chief Ndungu. The Makishi dancers recreate famous events from Luvale mythology, and local artists display their work.\n\n*'''Livingstone Cultural & Arts Festival''' This was first held in 1994, this festival bring the traditional rulers from all the provinces of Zambia and visitors are also allowed with the knowledge of their culture in their tribe. This festival capture musicians, artist, poets, and dramatist.\n\n* '''Shimunenga ''' is a ceremony to show devotion to ancestors. The ceremony takes place on a full moon on weekends in September and October.  The Ba-lla tribe celebrate this ceremony at [[Malla]] on the Kafue Flats.\n* '''Umutomboko''' ceremony of the Lunda people in Luapula Province is held at Mwansabombwe to depict the coming to Zambia by the Lunda and Luba people from Kola in now Congo DR.The ceremony is held in July and is graced by Mwata Kazembe who performs a dance to commemorate the occasion.\n\n===Climate===\n\nIf you look at a map, Zambia appears to be squarely in the tropics, but thanks to its landlocked and elevated position it does have distinct seasons that run as follows:\n\n* '''Winter''' &mdash; May to July.  The coolest time of the year, with average minimum temperatures 6-12&deg;C during the day, can drop as low as 4 or 5&deg;C at night; average maximum temperatures 21-26&deg;C.  Probably the best time of year to visit Zambia: come early in the dry season for birdwatching or to see Vic Falls at their biggest, or later when the bush has dried up for good game-spotting on safari.\n\n* '''Spring''' &mdash; August to September.  The mildest time of the year, with average minimum temperatures 15-22&deg;C and average maximum temperatures 25-30&deg;C. Moonlight is the greatest this time of the year and you can literally read a book under the moonlight. Most of the traditional festivals are held during this reason. It is spring break for students.\n\n* '''Dry Summer''' &mdash; October to November.  Hottest and dryest time of the year with maximum temperatures up to 28-35&deg;C. This is a good time for safaris as wildlife clusters around the few remaining watering holes.\n\n* '''Wet Summer''' &mdash; Late November to March.  Minimum Temperatures range from 14 to 19&deg;C, and maximum range 25-30. True to the name, there is a lot of rain &mdash; sometimes just an hour or two, sometimes for days on end. Great time for tropical fruits. Zambian mangoes are some of the greatest.\n\n* '''Autumn''' &mdash; Late March to April.  Minimum Temperatures range from 9 to 15&deg;C, and maximum range 22-28. This is the harvest season and there is plenty of fress organic food. Zambia does not allow GMOs so if you are into organic foods, zambia is the place to be. The harvest festivals take place in winter. \n\nTemperatures do fluctuate based on the altitude, if you are in a valley (such as the Zambezi) it will be warmer and if you are higher up (Kasama) it will be cooler.\n\n==Regions==\n\nZambia can be divided into five geographic regions:\n\n{{Regionlist\n| regionmap=Zambia-regions-map.png\n| regionmaptext=Regions of Zambia\n| regionmapsize=400px\n\n| region1name=[[Central Zambia]]\n| region1color=#4F93C0\n| region1items=\n| region1description=\n\n| region2name=[[Copperbelt]]\n| region2color=#D09440\n| region2items=\n| region2description=\n\n| region3name=[[Eastern Zambia]]\n| region3color=#71B37B\n| region3items=\n| region3description=\n\n| region4name=[[Northern Plateau]]\n| region4color=#D5DC76\n| region4items=\n| region4description=\n\n| region5name=[[Zambezi Basin]]\n| region5color=#D56D76\n| region5items=\n| region5description=\n\n}}\n\n==Cities== \n\n*[[Lusaka]] {{-}} the capital and largest city\n*[[Chipata]] {{-}} provincial capital of Eastern Province, on the way to Malawi\n*[[Kabwe]] {{-}} large town midway between Lusaka and Ndola\n*[[Kitwe]] {{-}} mining city in the Copperbelt and Zambia's second largest\n*[[Livingstone]] {{-}} The Fourth largest city, Tourism capital of Zambia, and a gateway to Victoria Falls and Mosi o Tunya game park\n*[[Ndola]] {{-}} administrative capital of the Copperbelt\n\n==Other destinations== \n\n* [[Blue Lagoon National Park]] {{-}} very accessible, with lechwe, zebra and buffalo\n* [[Kafue National Park]] {{-}} largest national park of the country\n* [[Lochinvar National Park]] {{-}} excellent for bird watching\n* [[Lower Zambezi National Park]] {{-}} used to be the president's private game reserve, now pristine wilderness without mass tourism\n* [[North Luangwa National Park]] {{-}} only since recently open for day trips\n* [[Nsumbu National Park]] {{-}} used to be very popular in the 1970s but has declined in the last decades\n* [[South Luangwa National Park]] {{-}} one of Africa's greatest safari destinations\n* [[Victoria Falls]] {{-}} one  of the world's largest waterfalls\n* [[West Lunga National Park]] {{-}} the only one in Zambia covered by forest\n\n''See also'': [[African National Parks]]\n\n==Get in== \n[[Image:Elephants CrossingRiver.JPG|thumb|240px|Elephants crossing the Luangwa River, [[South Luangwa National Park]]]]\n\n===Visas===\nZambian visa policy is best summarized as '''confusing''': there is a bewildering thicket of rules on who needs visas, whether visas can be obtained on arrival, and how much they cost.  Local border posts also apply their own interpretations.  Due to recent political turbulence in Zimbabwe, Zambia has been cashing in on the unexpected boom in its tourism industry, with visa fees hiked and the previous visa waiver program canceled: you're now expected to pay in cash on arrival at the immigration kiosks. \n\nSince 2014, it has been possible to pay by credit card at Lusaka International (Kenneth Kaunda) Airport.\n\nThe upside is that once customs has figured out what category you're in, actually obtaining the visa is rarely a problem and a rule of thumb is that most Western visitors can get visas on arrival. Visa-free entry is possible for some nationalities, including [[Hong Kong]], [[Ireland]], [[Malaysia]], [[Singapore]], [[Zimbabwe]] and [[South Africa]]. See the immigration department's web-site [http://www.zambiatourism.com/travel/traveladvice/visa-immigration-info.htm][http://evisa.zambiaimmigration.gov.zm/] for the full list of visa-exempt nationalities. Current visa prices are US$50 for a single-entry and US$80 for a multiple-entry visa for all nationalities and is valid for 3 months; US passport holders can only apply for a multiple-entry visa, but it is then valid for 3 years.\n* A day entry visa is available to all nationalities at US$20, valid 24 hours\n* Transit visas carry the same cost as a single entry visa, valid 7 days\n\nDo check with the nearest Zambian embassy for the latest information; the Zambian Embassy to the US has some information on their homepage [http://www.zambiaembassy.org/], and getting the visa before arrival will reduce the uncertainty factor.\n\nIf you require a visa to enter Zambia, you might be able to apply for one at a British embassy, high commission or consulate in the country where you legally reside if there is no Zambian diplomatic post. For example, the British embassies in Al Khobar[http://www.ukba.homeoffice.gov.uk/countries/saudiarabia/commonwealth-bots/?langname=null], Amman[http://www.ukba.homeoffice.gov.uk/countries/jordan/commonwealth-bots/?langname=null], Belgrade[http://www.ukba.homeoffice.gov.uk/countries/serbia/commonwealth-bots/?langname=null], Budapest[http://www.ukba.homeoffice.gov.uk/countries/hungary/commonwealth-bots/?langname=null], Damascus[http://www.ukba.homeoffice.gov.uk/countries/syria/commonwealth-bots/?langname=null], Guatemala City[http://ukinguatemala.fco.gov.uk/en/visiting-uk/visas/countries-issue], Helsinki[http://www.ukba.homeoffice.gov.uk/countries/finland/commonwealth-bots/?langname=null], Jakarta[http://www.ukba.homeoffice.gov.uk/countries/indonesia/commonwealth-bots/?langname=null], Jeddah[http://www.ukba.homeoffice.gov.uk/countries/saudiarabia/commonwealth-bots/?langname=null], Kiev[http://www.ukba.homeoffice.gov.uk/countries/ukraine/commonwealth-bots/?langname=null], Prague[http://www.ukba.homeoffice.gov.uk/countries/czech-republic/commonwealth-bots/?langname=null], Pristina[http://www.ukba.homeoffice.gov.uk/countries/kosovo/commonwealth-bots/?langname=null], Rabat[http://www.ukba.homeoffice.gov.uk/countries/morocco/commonwealth-bots/?langname=null], Riga[http://www.ukba.homeoffice.gov.uk/countries/latvia/commonwealth-bots/?langname=null], Riyadh[http://www.ukba.homeoffice.gov.uk/countries/saudiarabia/commonwealth-bots/?langname=null], Rome[http://www.ukba.homeoffice.gov.uk/countries/italy/commonwealth-bots/?langname=null], Sofia[http://www.ukba.homeoffice.gov.uk/countries/bulgaria/commonwealth-bots/?langname=null], Tallinn[http://www.ukba.homeoffice.gov.uk/countries/estonia/commonwealth-bots/?langname=null], Vienna[http://www.ukba.homeoffice.gov.uk/countries/austria/commonwealth-bots/?langname=null], Warsaw[http://www.ukba.homeoffice.gov.uk/countries/poland/commonwealth-bots/?langname=null] and Zagreb[http://www.ukba.homeoffice.gov.uk/countries/croatia/commonwealth-bots/?langname=null] accept Zambian visa applications (this list is '''not''' exhaustive). British diplomatic posts charge £50 to process a Zambian visa application and an extra £70 if the authorities in Zambia require the visa application to be referred to them. The authorities in Zambia can also decide to charge an additional fee if they correspond with you directly.\n\nLusaka Airport Customs and Immigration is unprepared to deal with tourists. There are four lanes, segmented by: Zambian passport holders; Residents; Tourists; and Diplomats. Tellingly, the lane for tourists is sometimes unstaffed. Although there are many immigration officers present the tourist lane is often unstaffed. Be prepared for all other lanes to empty before being processed.\n\nFor those who would prefer to leave the hassle to someone else, specialist safari holiday companies [http://www.mahlatini.com/zambia-safaris] can arrange immigration for you.\n\n===By plane=== \nZambia's main international gateway is [[Lusaka]]; gone are the days when getting to Zambia meant flying via Johannesburg, Lusaka is fast becoming something of a regional hub. KLM now fly direct from Amsterdam and Emirates are offering low cost connections via it's middle east base alongside the existing British Airways service and a much expanded Ethiopian network. Kenya Airways, Angola Air and Rwanda Air are other  airlines that fly into Lusaka. Mostly on a daily basis. Kenya airways has several flights to Lusaka per day as well as at least one flight per day to Ndola and Livingstone and so does  South African Airways. Air Namibia also now offer low cost connections from Cape Town via Windhoek. British Airways fly to Livingstone from Johannesburg with Pro-Flight, a local operator, connecting Lusaka with [[Livingstone]], near spectacular [[Victoria Falls]], and [[Mfuwe]], near [[South Luangwa National Park]], and the other regional destinations. Mahogany Air is a new local airline offering competition to Proflight. They operate From Lusaka to Livingstone and Lusaka to Ndola at least twice per day. Mahogany Air has a new fleet of aircraft and is mostly cheaper than Proflight. \n\nLusaka remains well-served by flights from Johannesburg, Cairo, Dubai, Nairobi, Lilongwe, Addis Ababa, and London. KLM remains the main intercontinental carrier that flies to Lusaka from Europe, with direct flights from Amsterdam. South African Airways fly to Lusaka and Livingstone from Johannesburg with multiple flights per day.Flights to Lusaka are more plentiful and EgyptAir from Cairo, Kenya Airways from Nairobi and Ethiopian Airlines from Addis and Air Namibia from Windhoek fly daily. \n\n(NB: in Johannesburg the airlines have no control over baggage in transit and the airport's baggage concessionnaire is exempt from responsibility by contract, so lost and especially pilfered baggage can be an issue.)\n\nLivingstone International Airport has daily direct flights from Johannesburg with the carriers: South African Airways, British Airways and Kulula.  Direct flights from Nelspruit/Kruger are available on Airlink Monday, Wednesday and Friday.\n\nTravelers can also fly to Ndola without connecting through Lusaka International Airport using South African Airways which has a daily flight from Jo'burg to Ndola. Ndola is the capital of the Copperbelt province and has an international airport which services such regional airlines as Kenya Airways and the aforementioned South African Airways.\n\nLocal carriers have not fared well for various reasons with Zambian Airways, Zambia Airlines and Zambezi airlines all not trading as of mid 2013.\n\n===By train===\n[[Image:Zambia train.jpg|thumb|250px|A train in Zambia]]\n'''TAZARA''' [http://www.tazara.co.tz] trains run between [[Kapiri Mposhi]], Zambia, and [[Dar es Salaam]], [[Tanzania]], on Tuesdays and Thursdays.  According to the schedule the trip takes 38 hours, but these trains break down regularly.  If you are on a tight schedule, a train might not be your best option.  On the other hand, a train ride between [[Dar es Salaam]] and Zambia is a beautiful way to see the countryside at a reasonable price (about $55 for a first class sleeper and $40 for second).  \n\nSeveral important things to note about this trip, however:\n*Bring water.\n*Immigration officials stamp passports ''as soon as the train crosses the border'' &mdash; probably in the middle of the night.  Naturally, this is also when thieves work.  If you are riding in a first- or second-class cabin, be ''very careful'' when opening your door. \n*If you miss the immigration official, they will either: turn you around and send you back to the border; or, arrange for a stamp, pending payment of a \"special tax.\"\n*Immediately upon crossing the border, the crew no longer accepts the currency of the country you just exited.  In other words, if you are traveling from [[Lusaka]] to [[Dar es Salaam]], the moment you cross the border, your Kwacha is no longer legal tender; you must use Shillings.  It is, therefore, a good idea to exchange money ''before'' the journey &mdash; blackmarketeers along the railroad offer poor exchange rates.\n*Do not leave valuables near windows, especially at stops.\n*Normally train has restaurant car in middle of the train and in the end or train saloon car with a bar. However, some stage of the journey resaurant and bar may run out of stock. \n*Reservations are not always honoured; someone may be sleeping on your bed already if you came onboard on middle of the journey. \n*First class cabins women and men can be staying in same compartment but in 2nd class they are female and male only. \n*Tazara (Tanzania Zambia railways) has been build by Chinese people in 1970'. Wagons are brought from China, therefore they are high standard, only taking care of the system is failing.\n*The last stop in Zambia is in middle of nowhere, small town Kapiri Mposhi. Plenty of minibuses are eager to carry you to Lusaka, 2-3 hours. First reasonably town to Lusaka direction from Kapiri is Kabwe (it is rated among 5 most poluted place on earth due to mining!) \n\nVia [[Zimbabwe]]/[[Victoria Falls]]: trains in Zimbabwe run from [[Bulawayo]] to [[Victoria Falls]]. You can take a taxi or hike 13 km across the border at the Victoria Falls Bridge to [[Livingstone]] station in Zambia and catch a Zambia Railways train to [[Lusaka]] and the [[Copperbelt]] connecting with the Tazara railway in Kapiri Mposhi.\n\n===By car===\nVehicles drive on the left side of the road in Zambia.  \n\nThere are many ways to get into Zambia by car, but the most popular include: \n*through [[Livingstone]] (in the south) from [[Zimbabwe]]\n*via the Chirundu Bridge (in the south) from [[Zimbabwe]]\n*via the Kariba Dam (in the south) from [[Zimbabwe]]\n*through [[Chipata]] (in the east) from [[Malawi]]\n*through [[Chingola]] (in the [[Copperbelt]]) from the [[Democratic Republic of the Congo]]\n*via the Katima Mulilo Bridge from [[Namibia]]\n*via the Kazungula Ferry from [[Botswana]]\n*through [[Tunduma]] and Nakonde from Tanzania\n\nCrossing international borders by car will incur a tax, depending on the size of the vehicle. The process can also take awhile as you will have to pay at different booths or offices, often not conveniently located. For a standard sedan, you can expect to pay the following:\n*Carbon tax at K50,000, payable in kwachas only\n*Third Party Insurance at approximately US$46, payable in rands, US dollars, or kwachas\n*If you cross over the bridge between Zimbabwe and Zambia, you will also pay a toll fee of US$10, payable in dollars.\n\nBorder crossings are not without corruption and you are particularly vulnerable when travelling by car. Try to avoid arriving early in the day to avoid having to choose between paying a bribe or spending the night in the car at the border post.\n\n'''A nice 4x4 route in Zambia'''\n\nFor Adventurous Campers: \n\nThe South Luangwa tour:\n\nLusaka-Petauke-Malama-Mfuwe-Nsefu-Chipata-Lilongwe or Mpika\n\nVery adventurous en scenic routes and campsites. Recommendable and for sure unforgettable.\n\nZambia is a big country and the public roads are pretty fair for a normal car. Sometimes there are deep potholes (holes in the road), but they are avoidable if you do not drive too fast. Most Zambians drive in a controlled way, sometimes a little too fast. Be especially aware for buses and trucks. They are wide and very long and drive far too fast. If you see a truck or bus approaching, then drive slower and keep left as left as you can. They tend to use your half of the road, pushing you off the road. \nIf you want to see more of Zambia, you will need a good 4x4 four wheel drive car. Especially from december until early April at times rain falls and the roads are wet and muddy.\nZambia is a wonderful country, lovely paople, full of stunning nature and wildlife. The most well known parks in Zambia are Kafue (West of Lusaka) and South Luangwa (East of Lusaka). South Luangwa is known and ackowledged to be one of the most beautiful wildlife parks in all Africa. \nMost National Parks in Zambia, like South Luangwa National Parl (SLNP), can be visited with your privat car. However, to enjoy this to the full, you will need a 4x4 car.\n\nThe South Luangwa National Park is surrounded by the so called GMA’s (Game Management Areas). You will find only limited habitation and you will be able to see an abundance of wildlife, like, lions, leopards, elephants, girafs, etc. A recommendable tour is from Petauke to Malama, on to Mfuwe and to the Nsefu sector (or the other way around). This route can only be done with a well equipped 4x4 car. You will see and enjouy to the full, the true rural Africa, the local people and their villages and wildlife.\nFrom Lusaka you take the road to Chipata (Great Eastern Road) and from that road (well before Chipata) take the junction to Petauke. Once you drove through Petauke you will go off the tarred road on a very fair gravel road. After 60km on this road, you turn left followed by a 120km local rural road to Malama Chiefdom and Mfuwe. The road is really not too bad. On the way you will have to go over some steep hills, but you will manage. When you go under the electricity network cables (ZESCO Main Power Lines), you enter the Malama Chiefdom and will be only 15km away from the junction. This junction will lead (via the Malama Chief’s Palace) you either to the Lusangazi Gate of the National Park (left) or onwards direction Mfuwe (right). The junction is at a little village. If you are able and willing to do so: The people here and in the villages around the Chief’s Palace, are very friendly and helpful. Leave something for them. It will be highly appreciated because the local people are poor.\n\nIf you head for Mfuwe, you will find a campsite after 9km along the Luangwa River, called Malama Umoyo Camp. It is near (1,5km after) the scouts training center. This (basic) campsite is located at a stunning location overlooking the Luangwa River and a dry lagoon, most of the time filled with wildlife.\nYour hosts here are Menno en Virginie. From here it is also possible to make a daytrip to the National Park. \n\nFrom Malama Umoyo Camp it is 42km (2,5 hours drive) to Mfuwe. Mfuwe is a local but bigger than normal village. In the Mfuwe area you will find a lot of lodges, but also a good campsite. Recommendable is Croc Valley Camp. If you arrive from Malama and hit the tarred road, you turn left after 3km and after a few hundred meters right off the tarred road on to a gravelled road. Signposts will lead you further to Croc Valley Camp. Your hosts at Croc Valley Camp are Shaun and Milly. From here it is only a 5 minute drive to the main gate of the South Luangwa National Park (SLNP).\nEntree fee for the SLNP is USD 25 per person per 24 hours and USD 35 for a privat car entering the park. At 06:00 the park is open and for privat cars it is open until 18:00 hours. \nFrom Mfuwe/Croc Valley Camp you can proceed to the Nsefu sector. Do not forget to fill your fuel tank in Mfuwe. You follow the tarred road to Chipata and the local airport and after about 12km from Mfuwe (the cropping it is called) you turn left (you will see a signpost and two palm trees). After about 12km you will reach the gate of the National Park. If you are going to camp, then tell at the gate that you are on your way to Zikomo camp. Zikomo Camp is just outside the borders of the park. Right after the gate you turn left and follow the road (about 4 to 5 km) to Zikomo Camp. Your host at the camp is Demian Wallace. The Nsefu sector is part of the SNLP and considered by many as the most beautiful part of the park.\nAfter visiting Mfuwe, you can then return to Chipata (about 2 hours drive). Chipata is the capital of the Eastern Province and a good place to buy supplies and refuel. There are two supermarkets and lots of shops. Opposite Total fuel station you can find Afroc. Here you can refill camping gaz.\nFrom Chipata it is a 20 minutes drive to the Malawi border.\nCrossing the border will take about half an hour. When entering Malawi, you have to fill in a TIP form for your car and pay Malawi Kwacha 5,000. This will allow your car in Malwai for 30 days. Do not forget to insure your car for Malawi, because they check on it frequently. Just after the border there is an insurance company. Try to get Malawi Kwachas before you enter the border post because they only accept Malawi Kwachas and not US dollars or any other currency. At the border there are many money changers. Tip: Take one US 100 note in your hand, put away your wallet, and change this for 100 x 180 Malawi kwacha. Be careful. These guys are quick and often give you less then they say. So you get MKW 18,000 for USD 100. You should a least get a 15% better rate than the official bank rate.\nIf you passed the border it will be another 125km over a good tarred road to Lilongwe. Watch your speed, especially where it says you have to drive 50km.\n\nAlternative route:\n\nFrom Mfuwe there is the possibility to go right through the park to the North. This is a really adventurous road. Do NOT drive this road when it is wet/raining! When you passed the northern gate, you will reach the escarpment and you have to drive up a very steep road. It can be done by good 4x4 drivers, but do it slowly. Once out of the Luangwa valley you will have a stunning view over the valley. You then can proceed to Mpika. In Mpika you can camp and get new supplies and fuel. From Mpika you can visit Kasanka NP (in November you will be able to see the daily migrations of millions of bats) or you can go up north. Recommended is to visit Shiwa Ngandu. A beautiful mansion built by an excentric Bristish gentleman (Stewart Gore Brown) a 100 years ago in the middle of nowhere. Camping you can near the hot water springs. The water is lovely and relaxing for at least a half hour dip. Mark Harvey and his wife are your hosts here. From here you can proceed for example to Tanzania (to Ruaha NP, also a place not to miss). \n\nPS. When visiting Mfuwe, and you prefer a lodge for a good sleep, dinner and a warm shower: Thornicroft Lodge en Croc Valley are both recommendable (good value for money).\n\n===By bus===\nInternational bus routes exist.  You can take a bus across the border into [[Malawi]], [[Zimbabwe]], or [[Tanzania]].  Immigration might be painstaking, considering the large number of people requiring simultaneous processing .There is also a bus route into South Africa through Zimbabwe. Most cross border traders opt for this mode of transport as it is considered cheaper than flying. However it will take one more than one day non-stop driving to reach South Africa.\n\n===By boat===\nZambia is landlocked but borders on Tanzania's Lake Tanganyika, and there are regular international ferry services across the lake a few times a week. The ship, M/S Liemba was built in Germany in 1914, cut in pieces, shiped to Tanzania, carried by train to [[Kigoma]] (Tanzania)and reassembled there again. It is a ship of Titanic era, sunk twice, charming ship with reasonable services. This trip should be taken if you are not short of time.\n\n==Get around==\nZambia is large and distances long, so budget plenty of time for getting around.\n\n===By plane===\nDomestic flights on Proflight [http://www.proflight-zambia.com/] or [http://www.air-viva.com air viva] connect Zambia's major cities and tourist destinations. While undoubtedly the fastest and most comfortable way of getting around, they are quite expensive with an hour-long flight (say, [[Lusaka]]-[[Mfuwe]]) typically costing around US$150 one-way. Also note that planes are small and schedules sparse, but if you can rustle up enough people you can also charter planes for not much more.\n\n===By minibus===\n[[Image:Minibus StreetFighter.JPG|thumb|240px|A minibus ready to battle traffic]]\n\nMinibuses &mdash; meaning vans outfitted with seats &mdash; are popular, but they are often irregular, dangerous, and uncomfortable.  To maximize profits, a \"conductor\" will squeeze as many paying customers &mdash; and their luggage, or ''katundu'' (ka-TOON-doo) &mdash; into the bus as possible; whether or not the customers are comfortable is irrelevant.  In terms of meeting locals, however, this method is among the best, and it can provide a traveler with a truly \"authentic\" experience. Payment is made during the journey &mdash; banknotes are passed down the bus to the conductor at the front, and change comes back via the same route.\n\n===By bus===\nLarger, more sophisticated \"luxury coaches\" exist, too.  These tend to be more reliable and safer; they depart on-time; they have dedicated space for guests and luggage; and tickets may be purchased in advance.  Luxury coaches are much more comfortable and are virtually guaranteed to arrive, but they might seem \"generic\" to a seasoned traveler.\n\n===By car===\nVehicles drive on the left side of the road in Zambia &mdash; at least most of the time.\n\nCar rental agencies exist in Zambia, but the costs are potentially great.  Not only are rental rates high ($100/day), but some of the main roads in Zambia are in '''very poor''' condition.  Potholes often take up the entire road, and during the rainy season, large sections of the roads wash away.  As you move away from city centers (possibly only a kilometer or so away) you will encounter dirt roads.  Although they might look solid, the dirt is often loose, and the chances of an accident are huge if you do not keep to a reasonable speed.  Although you are not likely to get lost driving in Zambia (there are only a few roads), you are likely to underestimate the destructive power of these roads and damage a rental vehicle, or worse, yourself!  4WD vehicles are recommended at any time and necessary on dirt roads in the rainy season, although some roads will become completely impassable then.\n\nRemember: there are no Roadside Assistance Packages, and very few ambulances.  Emergency recovery and tow trucks are now available in the major towns and depending on the distance may cone to your rescue.\n\n===By train===\nYou can catch TAZARA line trains between [[New Kapiri Mposhi]] and Nakonde in the north-east ([[Tanzania]] border). The separate '''Zambia Railways''' line [[Livingstone]] and [[Kitwe]] via [[Lusaka]] and [[Kapiri Mposhi]] (2 km from the TAZARA station). They are relatively reliable and safe, but slow.\n\n===By thumb===\nHitchhiking in Zambia is popular, although it can be extremely hit-or-miss as traffic density is low.  Also note that, if picked up by a local, you will be expected to pay for the ride.  Nevertheless, hitchhiking does not carry with it the same stigma in Zambia as it does in the States; you are unlikely to be harmed, and you might make a great connection.  \n\nIn Zambia, travelers do not \"thumb\" a ride.  The proper method for flagging transportation is:\n# Pile your luggage near the road.\n# Sit in the shade.\n# When you see/hear a vehicle, jump up.\n# Rush to your luggage.  \n# From your shoulder, wave your entire arm up and down, palm open and facing the ground, as though you are fanning someone in front of you.  \n# Hope the vehicle stops.\n\n==Talk==\nThanks to its former colonial status, English is Zambia's official language and the language most often spoken in schools, on the radio, in government offices, etc.  However, there are over 70 different Bantu languages spoken throughout the country, the most important of which are [[Bemba phrasebook|Bemba]], spoken in Lusaka(a little), the Copperbelt and the north; [[Nyanja phrasebook|Nyanja]] (Chewa), spoken in the east as well as in Lusaka where it is the main language; [[Tonga phrasebook|Tonga]], spoken in the south and Livingstone; [[Lozi phrasebook|Lozi]], which predominates in Western province; [[Lunda phrasebook|Lunda]] and [[Kaonde phrasebook|Kaonde]] are spoken in Northwestern Province.\n\nMany urban Zambians will speak at least passable English.  As you move into the rural areas, though, expect communication to become more difficult.  Nevertheless, do not be surprised to find a rural Zambian who speaks flawless English.\n\nThe most important thing to remember when speaking to Zambians is to greet them.  When you first approach a Zambian, always begin by asking, \"How are you?\" even if you do not care.  They will consider you very respectful.  \nSport, especially football (soccer) is a very good conversation topic with men; church is a good topic with either gender.  \n\nWherever you happen to be in the country it is a good idea to learn the local way of exchanging greetings, asking for something politely and thanking someone.  These simple phrases will help make life easier.\n\n==Do==\nZambia is making a name for itself as a ''must do'' safari destination. It's marketing itself as the real Africa and if you visit any of the South African reserves before you go to Zambia you will agree with them! There are no traffic jams around the Lions here! The future for Zambia also looks a lot brighter than many of its neighbours, its new government under President Sata seems to be behind conservation. It recently declined granting a uranium mining licence in Lower Zambezi National Park because of the environmental damage it would cause.\n\nOrganised safaris are the way to go in Zambia. Self driving is an option but is only for the fully self sufficient. Zambia is home to some of Africa's greatest national parks. Lower Zambezi, South Luangwa and the frankly huge (the worlds second biggest NP) Kafue are the main ones, but North Luangwa and the virtually inaccessible Luiwa Plains are worth a mention. Although sometimes you might find the borders of them hard to define, there are no fences in Zambia, it really is the Africa of your imagination.\n\nSafaris are through various operators, many being very expensive, but good value options are available and it's best to use a local established operator such as [http://www.riversafaricompany.com The River Safari Company], [https://www.southluangwasafaris.com/ South Luangwa Safaris] or check Zambia's tourist information web site.\n\n==Volunteering==\n\nZambia offers many different opportunities for volunteering and giving back, such as wildlife conservation with Chimpanzees, English and sports education or community aid and healthcare. There are many ways to get in contact with the desired volunteer project, one of which is a comparison platform. On <listing name=\"Volunteer World\" alt=\"\" directions=\"\" lat=\"\" long=\"\" address=\"a social startup from Germany\" phone=\"\" tollfree=\"\" email=\"\" fax=\"\" url=\"https://www.volunteerworld.com/volunteer-in-zambia\" hours=\"\" price=\"\">, for example, you can search and compare all volunteering options in Zambia.</listing>\n\n==Buy==\nOn 1 January 2013 a new ''Kwacha'' was introduced using a rate of 1000 old Kwacha to one new Kwacha. New Kwacha are internationally symbolised as '''ZMW''' and old Kwacha ceased being legal tender on 1 July 2013.\n\nOriginally, the Kwacha &mdash; meaning \"sunrise,\" so-named to celebrate Zambia's independence &mdash; was tied to the US dollar, so conversion was simple.\n\nHowever, in the late-90's, the Kwacha was floated and subsequently devalued rapidly. Since mid 2005 the Kwacha re-appreciated strongly, due to international debt-relief and the boost of the copper prices. The currency became stronger and more stable through the latter part of the decade to the extent that in January 2013 the government re-based the currency. Effectively it got rid of three zero's! This means Zambia has new notes starting from the 2 Kwacha note and is now one of the few African countries to use coins. The new ISO code is ZMW (formerly ZMK). Initial reaction to the move was positive. Razia Khan, head of Africa research at Standard Chartered commented: “The rebasing might be Kwacha positive, to the extent that it is a continued commitment to low, and stable inflation”. \n\nGreat care is advised to anyone using informal traders when getting change.\n\nUS dollars used to be commonly used for larger purchases however, alongside the re-basing of the Kwacha from January 2013, this practice was made illegal for all Zambian businesses. All transactions are now carried out only in re-based new Kwacha. (The dollar was becoming less popular anyway due to its fluctuating exchange rates). \n\n===Buying in shops===\nMost shopkeepers advertise fixed prices and are unwilling to negotiate, but this is not a given.  On the other hand, most \"freelance\" salesmen &mdash; vendors selling curios; taxi drivers; etc. &mdash; who do not post their prices are usually willing to negotiate.  As a (very) general rule of thumb, assume the first price they mention is at least double the amount they will accept.  You should not be afraid to barter &mdash; after all, Zambians bargain among themselves &mdash; but try not to get carried away with saving a few pennies.  \n\nTipping is not required &mdash; indeed, it was at one point illegal &mdash; but often expected.  Porters expect USD0.50 or so per bag, and better restaurants typically add in a 10% service charge or expect an equivalent tip.\n\nFinally, keep in mind the Zambian custom of ''mbasela'' (em-buh-SAY-la) &mdash; giving a freebie when more than one item is purchased.  If you buy a few small items, do not be shy about asking for your ''mbasela''.\n\n===Costs===\nZambia is comparatively expensive compared to its neighbors.  A bare-bones budget traveller will be looking at a minimum of USD40/day just for a bed and three meals, and transport is (again, comparatively) expensive, in part due to the great distances involved. Foreign currencies just don't go as far as in other developing countries, and often prices in Zambia are the same as what one would be paying in the West. At the other end of the spectrum, all-inclusive safari lodges or Lusaka/Livingstone's five-star hotels will take care of all your needs but charge US$200/day and up for the privilege.  Finding a middle ground between these two extremes can be difficult but there are safari operators who will offer 'DIY' camping for around USD5 to USD95 and above - it pays to look around (see below).\n\nZambian safaris are amongst the best available in Africa; they offer top quality viewing experiences with the continent's top guides. Zambia's national parks are not 'commercialised' as in other countries (e.g. Kenya and South Africa) and one will not see the ridiculous zebra striped game viewing buses, Land Cruisers etc.\n\n=== Changing your money ===\nChanging your money to Kwacha is reasonably easy in the tourist centres of Lusaka and Livingstone and at your border entry. Most major banks will change money and there are various local bureaux de change. As with every country only use major companies to change your money, not road side money changers, this is especially important in Zambia if you are not familiar with the rebased notes, you could end up with worthless \"öld money\". \n\n'''US Dollar'''. If you bring US$ only the \"big heads\" (new notes) are accepted in banks and bureaux de change, small heads are not accepted (if you are lucky you can change them in Livingstone). U.S. $50  and U.S. $100 notes are the best to bring, for smaller nominations you will get a poorer rate at the bureaux (5-10% less) One dollar bills are not accepted unless you are in a major hotel, if you are heading to Zimbabwe save the one dollars, they are useful to pay for small items there.\n\n'''Euro'''. Changing '''Euros''' is a difficult thing to do especially up country, bureaux are giving a very poor rate (25% less then the market rate!). International banks will accept, but with commission charge. Finance Bank, Arcades shopping Centre Lusaka, is known to accept Euro's at a good rate and without commission charge. Bureaux and Banks will only change a maximum of 1000 US$ (or equivalent) per person per day though you can bypass this by simply going right to the next Bureaux or Bank! Watch the rates as they can change overnight, fluctuations '''of 3-5% per day are common.\n\n'''British Pound''' (Sterling)(GBP) Sterling is easy to change and is accepted in banks, bureaux and most hotels and commands a good exchange rate as it seems to fluctuate against the Kwacha less than the other major currencies.\n\n'''South African Rand''' Due to the rapid decline of the value of the Rand and concerns over its future value this can be a difficult sell to all but major hotels and banks.  Expect to be asked for British pounds or US dollars instead. You won't get a good rate of exchange even if you can change it, best to spend them in SA or Namibia.  \n\nOther second tier currencies like the Australian dollar are not worth bothering with. Expect blank looks from the locals, and a mocking laugh from those in the tourist trade.\n\n'''ATM'''s may be found in major cities, but you should not depend on them to be functional.  Most of the ATM's accept only VISA. Other international credit cards (like MASTERCARD and AMEX) are generally a problem except with First National Bank (FNB), Barclays Bank and Standard Chartered Bank.  Barclays does accept Mastercard and can be found at the airport (by the exit) and in Lusaka on Cairo Road. Maestro is definitely a problem in Zambia and very few ATM's accept Maestro. Most, if not all supermarkets and big restaurants accept '''debit''' or '''credit cards''', as do practically all high-end hotels and safari lodges. Surcharges don't apply in Zambia and ATMs only dispense local currency.\n\n=== Credit cards & Travelers cheques ===\nAlthough using forms of payment other than cash is growing in popularity, you should not depend on credit to get around the country.  Visa is the card of choice in this part of Africa, Mastercard is far less popular with all other cards virtually unheard of outside of the international hotel chains. It is worth noting that a Mastercard will not work in a Visa ATM or Visa card swipe machine. If you only have a Mastercard prepare to be declined! Currently Barclays and Stanbic are the only banks that operate MasterCard ATM's. Stanbic is in Livingstone town centre and in Lusaka the branch is opposite the Arcades Shopping centre. Barclays can be found at Lusaka airport, at the exit, and on Cairo Road in Lusaka. \n\nTraveler's cheques are almost impossible to process in Zambia, most chance you will have in the Lusaka international banks (Stanbic, Standard Chartered), but even then you will get a very poor rate, a high commission charge and it will take you a couple of hours, if you are lucky. If you prefer to take the risk and use Traveller's cheques, the only ones who will be accepted (if you are lucky) are the ones from American Express (Thomas Cook's are currently not accepted!).\n\n==Eat==\n[[Image:Nsima Relishes.JPG|thumb|240px|''Nsima'' with three relishes: rape and peanut (top left), cabbage (bottom left) and ''kapenta'' (bottom right)]]\n\nTraditional Zambian food revolves around one staple, '''maize''', served in one form, '''''nshima''''' (n'SHEE-ma).  Nshima is basically a type of thick porridge, rolled into balls with your right hand and dipped into a variety of stews known as '''relishes''' (''ndiwo'', ''umunani'').  Those who can afford them eat relishes of beef, chicken or fish, but the many who can't make do with beans, tiny dried fish (''kapenta''), peanuts, pumpkin leaves (''chibwabwa'') and other vegetables such as okra (''ndelele''), cabbage and rape.  At breakfast, nshima can be served watered down into a soup, maybe with a little sugar.  Local restaurants will serve nshima and relish for less than 5000K ($1).\n\nWestern food has also made major inroads, particularly in major cities, and in [[Lusaka]] or [[Livingstone]] you can find almost any food you like.  Fast food &mdash; including burgers, pizza, and fried chicken &mdash; is very popular in Zambia.  Bakeries making cheap fresh bread are a common sight in towns, and rice from [[Chama]] provides an alternative staple if all the maize starts to get to you.\n\nFor sit-down meals, ethnic eateries are popular.  In Lusaka, especially noteworthy is the Sunday brunch at '''The Intercontinental'''; and if you like Indian food, be sure to hit '''The Dil.'''  Of course, game parks often cater to wealthy &mdash; usually foreign &mdash; visitors; therefore, high-quality Western meals can be found easily.  Along the major roadways, you will find \"tuck shops\" featuring packaged cookies or take-away meals &mdash; meat pies or sausage rolls, for instance &mdash; which may or may not satisfy you.  \n\nFinally, in terms of '''hygiene''' outside the major cities, you are unlikely to find a proper washroom with running water.  You will probably be given or have a set up of a bowl of water, a piece of soap, and a (damp) towel.  Therefore, some travelers bring small bottles of anti-bacterial hand soap with them.\n\n==Drink==\nTap water in Zambia is generally not drinkable, at least unless boiled.   Bottled water is widely available in cities, but not necessarily in rural areas.\n\n===Soft drinks===\nA traditional local drink worth trying is '''''maheu''''', a somewhat gritty and vaguely yogurty but refreshing beverage made from maize meal.  Factory-produced maheu is sweet, comes in plastic bottles and is available in a variety of flavors including banana, chocolate and strawberry, while homemade versions are usually unflavored and less sweet.\n\n'''Coke''' products are accessible and cheap at less than a quarter a bottle, but beware of the deposit system: in rural areas, you may have to return an empty bottle before they'll sell you a new one!\n\n===Beer===\nZambia's best-known brew is '''Mosi''', a clear 4% lager available everywhere.  '''Eagle''' has more taste and more kick at 5.5%, while '''Zambezi Lager''' is a microbrew worth sampling if you run into it.  The South African brand '''Castle''' is also bottled locally, and all of the above run around $1 in a store or $1-2 in a bar.\n\nIf you are near the borders, you are likely to find '''Carlsberg''' (good, from [[Malawi]]), '''Simba''' (excellent, from the [[Democratic Republic of the Congo]]), '''Kilimanjaro''' (nice lager, from [[Tanzania]]), and '''Tusker''' (strong, from [[Kenya]]).  Other imports can be found in larger markets but will also cost more.\n\n===Local alcohol===\n[[Image:Kachasu.jpg|thumb|Distilling kachasu]]\nThe locals' drink of choice is '''''masese''''' (muh-SE-say) or '''''ucwala''''' (uch-WALA), also known as '''Chibuku''' after the biggest brand, made from maize, millet, or cassava and resembling sour porridge in texture and taste.  If you want to try this, it's best to look out for the factory-made kind in milk-carton-like containers.\n\nIn rural areas, there are opportunities to drink local \"homebrews.\"  A wide variety of homebrews exist in Zambia, from beers made from honey (in the Southern province of the country), to wine made from tea leaves (in the Eastern portion of the country).\n\nFinally, there is ''kachasu'' (cuh-CHA-suh) a spirit distilled from anything Zambians can get their hands on &mdash; including battery acid and fertilizer.  For obvious reasons, therefore, it is better to avoid this moonshine.\n\nOn a final note, most men at bars are relaxing, while many women at bars are working. Therefore, if you are a single woman in a Zambian bar, be aware that you might be approached and offered the opportunity to do something you did not intend to do.\n\n==Sleep==\nIn Zambia, you can sleep in an top-notch hotel for a few hundred dollars (such as '''The Intercontinental'''); you can stay in an independent hotel (like the '''The Ndeke'''), for about $50; or you can opt for a budget experience and spend about: $8(camping) or $15(dorm bed) $30(double room)  (at ''' Lusaka Backpackers''') for a highly adequate space. If you are overlanding in your own, or a hired vehicle Zambia is a dream destination, its almost what Zambia is made for. The only word of caution for overlanders is in towns and cities, although Zambia is largely safe overlander vehicles can be temptation to some, use a dedicated accommodation site where you can park up and leave your vehicle and belongings safely whilst you are exploring the city or shopping. Currently Wanderers Lodge & Backpackers] is the only place to safely leave your overland vehicle in centrail Lusaka, they have a safe clean campsite, ensuite rooms, a bar that serves food, and importantly you can walk to Manda Hill knowing your vehicle is safely locked away.  Of course, choosing accommodation off the beaten path might be more exciting but unsafe. \n\nOutside the big cities or tourist areas, however, you might be hard-pressed to find quality accommodation.  If your tastes run to the elegant &mdash; or even if you demand constant electricity &mdash; you might want to reconsider venturing too deep into the bush.  However, if you seek an enjoyable, memorable, and authentic night at a local hotel, you might be pleasantly surprised.\n\n==Learn==\nThe University of Zambia is the official university.  However, it is not affordable for most Zambians.  There are also Technical Schools throughout Zambia, and Teacher's Training Colleges are found in each Provincial Capital, providing two year's coursework for about $300.\n\nNorthrise University is in Ndola.  As a private university, it focuses on business, information technology and theological study.  \n\nFor tourists, the biggest educational experiences would likely be:\n*Visit a game park and learn as much as possible about the area's animals from the guides.  Guides can be an incredible source of information.  Remember to tip them.\n*Arrange for an overnight stay in a \"Traditional African Village\".  Of course, because the locals have prepared for you, it is no longer 100% authentic, but you will get an idea of the hardships Zambians face.\n\n==Work==\nUnemployment in Zambia was 16% in 2005 according to the Zambian Central Statistical Office.  The agriculture, forestry and fisheries industries employ over 70% of Zambian workers.  The legal minimum wage for nonunionized workers equates to around $16.50 (83,200 kwacha) per month.   Most minimum wage earners supplement this through subsistence farming.  In practice, almost all unionized workers received salaries considerably higher than the nonunionized minimum wage.\n\nAs for tourists, temporary work is likely to be difficult to secure.  Although there is a substantial expat community in Zambia, most of these individuals are contracted by international agencies; by and large, they did not come to Zambia and ''then'' find work.  Persistence and connections might pay off, but outside of the few hostels or Western-oriented bars, a tourist should not expect to find ready employment.\n\n==Stay safe==\nZambia is one of the few African countries which is generally safe, crime levels are similar to a European country. Bearing this in mind you should always be aware that some of the people are desperately poor and common sense should prevail.\n\nWomen should avoid going to bars alone.  Furthermore, men should avoid purchasing drinks for Zambian women they meet casually in bars; this is an invitation to spend the night.\n\nWhile it's possible to get a good exchange rate from an ''individual'' money-changer on the street (although you really should use banks if you can), you should avoid changing money with ''groups'' of men.  They are likely running a scam.\n\nGenerally, Zambians are friendly people. However &mdash; as with any location &mdash; be careful about walking at night, especially if you've been drinking. There are few streetlights, and many of the locals are very poor.\n\nCarjacking is also a potential risk while driving after dark.\n\nMany places of accommodation have electric fences, gates  and guards for added security. You can check before booking.\n\nCorruption became endemic in Zambia under president Rupiah Banda. Don't expect the police to be of any substantial assistance to you. If you need to log a report for insurance purposes, you can expect to have pay to do so. If you make an accusation or indicate a suspicion with a local, the person you lodge the complaint against may be interrogated and beaten by the police. However this situation has improved under new president Michael Sata.\n\n\n=== Gay & Lesbian Travelers ===\n\nAs is the case in most African countries, Zambia has a social and cultural atmosphere of discrimination towards the LGBT community. There are laws against sexual relations between males. These have been enforced against Zambians, but it is unlikely that foreign tourists will be arrested. Increased foreign pressure has been put to bear on Zambia's policies towards this human rights issue.  The former Deputy President, Guy Scott, has indicated that the government is held to God following the conservative local population. Considerable change is unlikely any time soon. Guy Scott suggested the Zambian government is aware of gay bars in Lusaka and had no intention of moving against them, but suggested however that gays should remain restrained. In this part of the world, a Don't Ask, Don't Tell policy is a significant improvement on overt prosecution.\n\nWhilst staying in a hotel is generally safe, your best bet might be a backpackers. These tend to be owned, run and frequented by more cosmopolitan staff and guests who are often well traveled and will have seen it all before. You should be aware that on leaving your backpackers, public signs of affection are not a good idea.\n\n==Stay healthy== \nDrinking '''tap water''' in the cities is potentially risky, unless either (a) you have a strong stomach, or (b) you are at a restaurant or hotel that caters to foreigners.  If neither of these conditions apply to you, you should probably stick with the bottled stuff.\n\n'''The HIV infection rate among adults was estimated to be 16.5% in 2003. Do not have unprotected sex.''' \n\nZambia is a highly [[malaria]]l country.  Especially at dusk, you should make every effort to cover exposed skin with clothing or insect repellent.  In addition, using malarial prophylaxis in highly recommended.\n\nIn practice, [[yellow fever]] is not a problem in Zambia anymore, except perhaps in the extreme west along the Congolese borders.  However, many countries will insist on a yellow fever vaccination certificate if they find out you've been to Zambia, so it's best to get a jab.\n\n==Respect==\nZambians follow a strict patriarchal society &mdash; men are afforded more respect than women, and older men are respected more than younger men.  However, you might find that a white person, of any gender or age, is granted the most respect of all.  A holdover from colonial times, this might make a traveler uncomfortable, but this is largely a Zambian's way of being courteous.  Accept their hospitality.\n\nZambians are a curious people.  To a Western mindset, this might be interpreted as unnecessarily staring at you or talking about you in front of you.  Be prepared to be greeted by kids yelling ''mzungu, mzungu!'' (literally, ''white man'') and answer lots of questions about yourself.  \n\nZambians love to shake hands, and you should oblige them.  However, Zambians often like to ''hold hands'' for the duration of a conversation.  This should not be interpreted as anything sexual; they are merely trying to \"connect\" with you.  If you feel uncomfortable, simply pull your hand away.  \nIf you wish to be courteous or show respect then holding your right wrist or elbow with your left hand as you shake is acceptable.  Do not expect a firm handshake as this is considered agressive, likewise do not be too firm in yours.  \n\nEye contact is also considered aggressive and disrespectful, you can make eye contact but do not hold it, slide your eyes away, but do not face away.\n\nWomen should not wear shorts or mini-skirts, especially as they travel away from Lusaka.  (Thighs, to Zambian men, are huge turn-ons.)  Low-cut tops, however, while discouraged, are not nearly as provocative.  \n\nPointing with the index finger should not be done, it is considered vulgar.\n\nFinally, when meeting a Zambian &mdash; even to ask a question &mdash; you should always say hello and ask how they are.  Properly greeting a Zambian is very important.  They are uncomfortable with the Western notion of simply \"getting to the point.\"  Enquiries about children are generally welcome and are a good way to break the ice.\n\n==Contact==\n===By mail===\nThe Zambian mail service is slow and a little flaky (especially in Lusaka), but not completely hopeless. This is due to the amount of mail they receive in Lusaka against a small number of  employees. Smaller like Livingstone and Ndola tend to have better service delivery. However, with the EMS branch of the Zambia Postal Service, you're better off using them as they are very efficient sometimes more than private courier service.  Using a private courier service is still recommended if sending something important.\n\n===By phone===\n[[Image:Payphone MrMbele.JPG|thumb|Public telephone, Zambian style]]\n\nThe country code for Zambia is \"260.\"  The city code for [[Lusaka Province]] is \"0211\" , Southern Province \"0213\" Copperbelt province \"0212\" For the city code for other towns check the directory. However, '''phone service''' both within Zambia and into Zambia is very hit-or-miss.  In large cities, you are more likely to get regular, dependable phone service, but it is by no means a guarantee.  The farther you travel from [[Lusaka]], the less likely you are to maintain a good connection.  International calling rates can be as high as $1.5 per minute.\n\nCell phones have been booming in recent years, and Zambia has a highly competitive market with three main operators: '''airtel''' (097), '''Zamtel''' (095) and '''MTN''' (096).  Generally speaking, airtel has the largest network, while Cell Z is the cheapest. You can pick up a local SIM card for as little as  K5 ($0.5).  Prepaid time is sold in \"units\" corresponding to dollars: figure on 0.2 units for an SMS or up to 1 unit/minute for calls, although as always the precise tariffs are bewilderingly complex.  If you plan on roaming with your non-Zambian SIM, check first to see if your home operator has made any roaming agreements; Zambia is usually not on the top of their list.  Also note that the roaming prices are very high and coverage in rural areas can be spotty.\n\nBooths labeled \"public telephone\" these days consist, more often than not, of a guy renting out his cellphone.  Typical rates are K5/min ($0.5) for domestic and K15/min ($1.5) for international calls.\n\n===By internet===\n'''Internet cafes''' are springing up in Zambia, but again, connections can be sporadic and ''very'' slow.  Moreover, because constant electricity is not a guarantee, some Internet cafes operate backup generators, which can be extremely costly.  Be prepared to see Internet cafe charges as high as 25 cents per minute.  Some hotels might offer Internet connections to their guests.\n\n[[ca:Zàmbia]]\n[[de:Sambia]]\n[[eo:Zambio]]\n[[es:Zambia]]\n[[fi:Sambia]]\n[[fr:Zambie]]\n[[hu:Zambia]]\n[[it:Zambia]]\n[[ja:ザンビア]]\n[[nl:Zambia]]\n[[pl:Zambia]]\n[[pt:Zâmbia]]\n[[ro:Zambia]]\n[[ru:Замбия]]\n[[sv:Zambia]]\n[[zh:赞比亚]]\n[[wts:Category:Zambia]]\n\n[[WikiPedia:Zambia]]\n[[Dmoz:Africa/Zambia/]]\n[[World66:africa/zambia]]\n\n{{related|African_National_Parks}}\n{{related|African_flora_and_fauna}}\n\n{{isPartOf|Southern Africa}}\n{{outline}}\n{{countryguide}}"
        }
    }
}