{
    "parse": {
        "title": "Andorra",
        "pageid": 188,
        "wikitext": {
            "*": "{{pagebanner|Andorra Banner.jpg}}\n\n{{quickbar\n| location=LocationAndorra.png\n| flag=an-flag.png\n| capital=[[Andorra La Vella]]\n| government=parliamentary democracy\n| currency=euro (€)\n| area=468km²\n| population=71,201 (July 2006 estimate)\n| language=[[Catalan]] (official), [[French]], [[Spanish phrasebook|Castilian]], [[Portuguese]]\n| religion=Roman Catholic (predominant and official)\n| electricity=220, 50Hz (European plug)\n| tld=.ad\n| timezone=UTC +1\n| calling code=+376\n}}\n[http://www.andorra.ad/en-US/Pages/default.aspx '''Andorra'''] is a small, mountainous country in the [[Pyrenees]] mountains between [[France]] and [[Spain]].\n\n==Cities==\n*[[Andorra la Vella]] - Capital of Andorra\n*[[Santa Coloma]] -South of [[Andorra La Vella]] towards the border with Spain\n*[[Sant Julia de Loria]] -South of Santa Coloma towards the border with Spain\n*[[Escaldes-Engordany]] -This is really an eastern suburb parish of [[Andorra La Vella]]\n*[[Encamp]] - Parish to the NE of [[Andorra La Vella]] between Engordany and [[Canillo]] on the road to [[France]]\n*[[La Massana]] -- small town and parish about 5 miles north of [[Andorra La Vella]]. You can access Arinsal - [[Pal]] ski area from it directly\n*[[Ordino]] - Northernmost and least populated parish but almost the largest\n*[[Canillo]] - Northeasternmost parish on the main road and border to [[France]]\n*[[Arinsal]] - Small village in the north west\n\n==Other destinations==\n*Madriu-Perafita-Claror Valley\n\n==Understand==\n[[Image:Landscape of Andorra.jpg|thumb|240px|Landscape of Andorra]]\nFor 715 years (1278 to 1994), Andorrans lived under a unique co-principality ruled by the French chief of state and the Spanish Bishop of Urgell. This system was modified in 1993, with the titular heads of state retained but the government transformed into a parliamentary democracy. Long isolated and impoverished, Andorra achieved considerable prosperity through its tourist industry after World War II. Many migrant workers (legal and illegal) are attracted to the thriving economy and its lack of income taxes.\n\n__TOC__\n===Economy===\nTourism, the mainstay of Andorra's tiny economy, accounts for roughly 80% of GDP. An estimated 9 million tourists visit annually, attracted by Andorra's duty-free status and summer and winter resorts. Andorra's comparative advantage as a tourist destination has eroded recently as the economies of neighboring France and Spain have been opened up, providing broader availability of goods and lower tariffs. The banking sector, with its \"tax haven\" status, also contributes substantially to Andorra's economy. Agricultural production is limited -- only 2% of the land is arable -- and most food has to be imported. The principal livestock activity is sheep raising. Manufacturing output consists mainly of cigarettes, cigars, and furniture.\n\n===Electricity===\nElectricity is supplied at 220 to 230V 50Hz. Outlets are the European standard CEE-7/7 \"Schukostecker\" or \"Schuko\" or the compatible, CEE-7/16 \"Europlug\" types.\n\n==Get in==\nDue mainly to the mountainous nature of Andorra, there is only one road entering Andorra from [[France]] and only one widely-used road entering Andorra from Spain. Almost all entry into the country happens at one of these two points.\n\nAndorra is not a member of the EU, EEA or Schengen Area. However, Andorra is a member of the EU Customs Union and is treated as an EU member for trade in manufactured goods (no tariffs) and as a non-EU member for agricultural products. \n\nAndorra has no visa requirements and requires only a passport or European Union national identity card for entrance. However, in practice, as entry is only possible through Schengen countries, one must satisfy the conditions of entry into Schengen. Visitors from outside the EU should note that, as Andorra is not a Schengen member, exiting France or Spain into Andorra will (theoretically) terminate a single-entry visa. In practice, though, immigration does not enforce this, seeing as one must re-enter the Schengen Area in order to travel onwards.\n\nA souvenir passport stamp may be available at the border on request.\n\n===By plane===\nThere are no airports in Andorra. The nearest airports are: \n\n[[Perpignan]] (France) 128km to the east, no coach connections but you can take a Yellow train to La Tour de Carol and farther to L'Hospitalet.\n\n[[Carcassonne]]  (France)  130km to the North North East.  2 hours by car, depending on weather. Ryanair offers cheap flights to Carcassonne from limited European airports.\n\n[[Lleida]] (Spain) 157km to the south, [[Lleida-Alguaire]] Flights from the UK only during the ski season, chartered by ''[[Thomas Cook]]''  Airport is 2.5 hours away from Andorra by bus. This airport was chosen in 2011 by the UK-Based tour operator \"Neilson\" to cater to tourists visiting the ski resorts. Flights arrive/depart on Sundays. For independent travelers, getting to Andorra from Lleida Airport can be difficult, as Montmantell bus company will leave you in Lleida town, a 20-minute taxi ride from the airport.\n\n[[Toulouse]]–Blagnac (France) 196km to the north. You can pre-book a coach or a taxi from [[Toulouse]] Airport to all the resorts in Andorra with Andorra Airport Transfers. [http://www.andorraairporttransfers.com/toulouse.php]\n\n[[Barcelona]] (Spain) 202km to the south. There are frequent connections to Andorra from Barcelona.\n\n(From airports to Andorra by car: 3 hours)\n\n*'''An airport for Andorra''' Andorran, Spanish and regional Catalan governments developed a Pirineus - la Seu d'Urgell airport (also known as Pirineus-Andorra airport) [http://www.laseuairport.com/] at [[Seu d'Urgell]] but there are no scheduled flights there.\n\n===By helicopter===\nFrom Andorra la Vella, La Massana or Arinsal to airports, the journey for a maximum of 5 passengers takes around 30 minutes and costs €2,500.\n\n===By train===\nThere are no train lines or stations in Andorra, and none close to the Spanish border. The nearest rail stations are: \n\n*[[L'Hospitalet]] (France), 3 km (1.8 mi) from the Andorran border. Served by SNCF [http://www.sncf.com/en/passengers] trains from [[Toulouse]], in addition to a sleeper service to/from [[Paris]].\n*[[Puigcerdà]] (Spain), 80 km (50 mi) from Andorra. \n\nThat said, buses operate daily from L'Hospitalet to Pas de la Casa, the first town after the Andorran border, from where it's possible to take frequent buses to Andorra la Vella — every 30min with Cooperativa Interurbana line 4 (+376 806 556, [http://www.interurbana.ad/web/horaris-tarifes.php]) or cia Hispano-Andorrana (+376 807 000, [http://www.andorrabus.com/index.php?accion=contingut&idmenu=2&id=11124]). Timetables can be found here [http://www.transportpublic.ad/Angles/internacional.htm].\n\nThe Hispano Andorra Bus departs Andorra la Vella at 5:45 and Pas de la Casa at 6:40 and arrives in L'Hospitalet at 7:10, departing L'Hospitalet at 7:45 and arriving in Pas de la Casa at 8:15 and in Andorra la Vella at 9:10.\nThe evening bus departs Andorra la Vella at 16:45 and Pas de la Casa at 18:15 and arrives in L'Hospitalet at 18:50, departing L'Hospitalet at 19:45 and arriving in Pas de la Casa at 20:10 and in Andorra la Vella at 21:00.\nOneway fare from Pas de la Casa to L'Hospitalet is 4,50 €. Buses run every day except December 25th.\n\nReaching Andorra by train is only cost-effective for holders of SNCF discount cards such as Carte 12-25 or those coming on the sleeper train from Paris; other travelers would be better off taking a direct bus service from nearby cities like Toulouse. In any case, everybody under 26 years-old traveling off-peak hours with SNCF is entitled to the \"Découvert 12-25\" discount.\n\n'''Caution''': One should bear in mind that the L'Hospitalet train station is located in a deserted area, is often unmanned, and its rooms have restricted open hours, so it's important to match connections well. If you need assistance, you may want to call the Toulouse train station at +33 8 91 67 76 77.\n\n===By car===\n[[File:Andorra map.png|thumb|upright=1.7]]\nRoads in Andorra are generally of a good quality. Entering on the main road from the Spanish side is a relatively straightforward drive; however, entering from France is a more stressful affair involving many hairpin bends. Border control officers at both sides are generally fine. Entering Andorra, you generally do not need to even stop, but you must slow down and be prepared to stop if it's requested. When leaving Andorra, you must stop and be prepared for delays during busy times. Be sure your car is in good condition - Andorra has many steep roads at high altitude. Gas prices are usually cheaper in Andorra compared to France and Spain, so it's a good idea to fill up the tank before you leave the country.\n\nAlso beware of black ice and snow drifts as the temperature in Andorra can be much colder than at sea level.\n\nIf entering from France, one can pass through the 2.9km long '''Tunel d'Envalira''', which requires a fee payable by cash or credit/debit card. The amounts are: Winter (remainder of year) \n*Cars €6.60 (€5.80) \n*Others €16.70 (€10.70) \nWinter is from 1 Dec-31 Mar\n\n'''Car rental''' The usual car hire companies operate from Andorra la Vella / Santa Coloma. The desks are sometimes quiet and unmanned, so it may be a good idea to book in advance online.\n \n*From November to April, it is prudent to have winter tires and/or snow chains available for your car. In very snowy road conditions, cars without winter tires or snow chains may not be allowed to drive. This is often enforced at police checkpoints on access roads to the ski resorts and on mountain passes such as the CS-311 and the road above Pas de la Casa.\n\nDrivers are considered to be at fault in fatal accidents, and are always prosecuted and usually imprisoned.\n\n'''Taxi'''  Taxi Josep provides a Mercedes Benz car and speaks many languages Tel: 376 323111; Taxi Domènec Segura provides a van but does not speak English or French tel:  34 636 490 685.  Taxi Josep can arrange the ride with Taxi Domènec Segura if you absolutely need a van. Payment must be in cash.\n\nTaxi Barras 376 323743 provides local service.\n\n===By bus===\nThere are many coach services operating into Andorra. \n\nFrom [[France]] there is a coach service from [[Toulouse]], '''Andbus''' [http://www.andorrabybus.com], from the bus station adjacent to Toulouse Matabiau train station (departing at 10:30 am, 3:00 pm (May-November), and 7:30 pm) and from the [[Toulouse–Blagnac]] airport (departing at 11:30am, 3:30 pm (May-November), and 8:00 pm). It is 35 euro one way or 65 for a round trip. The entire trip takes 3 1/2 hours, leaving you just one hour in Andorra la Vella if you decide do a day trip. Arrive at least 15 minutes prior to scheduled departure as the driver will leave once everyone who was waiting has boarded. Andbus is easily identified by its name in large letters on the side. Tickets can be purchased online, at the ticket counter in the bus station (closed on holidays!), or you can pay the driver directly. The bus stop at the Toulouse airport is close to where the fire truck is parked. A second coach service operates via L'Hospitalet and La Tour de Carol.\n\nFrom Spain, coaches to Andorra can be caught from a variety of locations, such as Barcelona, [[Madrid]], [[Malaga]], [[Lleida]] and [[Valencia (City)|Valencia]]. There are at least two bus companies offering daily service from the Barcelona airport. Eurolines departs from outside the door of Terminal B, but you must be early and quick because the driver has a habit of arriving early and driving off if no one is there. Also, you don't pay for the ticket at the airport, but rather have to travel to the Barcelona Sants and get off there to buy a ticket. Service is slow. One should also remember that one will need to show one's passport here. Trip time is about 3.5 to 4 hours.\n\nAndbus also operates a service from the Barcelona airport, outside Terminal 1 and 15 minutes later outside Terminal 2. €33 one-way or €56 for a round-trip (as of June 2017); tickets available on the official website [http://www.andorrabybus.com/en/time-and-rates] or on the bus. Be wary of a late flight however; their sales team say you can take the next bus but their drivers will state otherwise.\n\n[http://www.autocarsnadal.com Autocars Nadal] also travels between Andorra and Barcelona and its airport.\n\nThe bus company Alsina Graells has eight trips a day from Barcelona. The trip takes 3.5-4 hours and costs €23 one-way and €40 round trip.\n\nAlsa [http://www.alsa.es] has daily trips between Barcelona and Andorra.\nIn Andorra, buses arrive at the new bus station (centrally located) where you can buy tickets, credit cards accepted; the building has a small waiting area with about 30 seats, two vending machines and free wifi.  If you arrive late, or leave early, these may be your only dining options. They tell you to come 30 minutes early, but it is not necessary; make sure you check at ticket counter to get a boarding card to give it to a driver.\n\n==Get around==\nIf you have a few days in Andorra, then you can easily visit most of the main villages using the local bus service, called the [http://www.interurbana.ad/web/index.php Cooperativa Interurbana Andorrana, S.A.]\n\nThere are 8 main bus lines ('linies') and all of them pass through Andorra La Vella. The fare is anything from €1.20 to two or three euros depending on how far you are going. Drivers will provide change. For the towns nearest to Andorra La Vella, the service is very regular, and as frequent as every 10 minutes during the day. If you are traveling to outlying rural places like Canolic, there are only 2 or 3 buses per day. A map of bus routes can be downloaded at [http://www.interurbana.ad/imatges/admin_ckeditor/liniesperwebok.pdf]\n\n'''The lines are''':\n*L1 Sant Julia de Loria - Escaldes-Engordany\n*L2 Andorra la Vella - Encamp\n*L3 Andorra la Vella - Encamp - Canillo\n*L4 Andorra la Vella - Encamp - Canillo - Soldeu\n*L5 Andorra la Vella - Encamp - Encamp - Canillo - El Pas de la Casa\n*L6 Andorra la Vella - La Massana - Arinsal\n*L7 Andorra la Vella - La Massana - Ordino\n*L8 Andorra la Vella - La Massana - Ordino - El Serrat\n\n==Talk==\nAndorra's official language is [[Catalan phrasebook|Catalan]]; however, [[Spanish phrasebook|Spanish]] is the dominant language of communication among people of different linguistic backgrounds. [[French phrasebook|French]] is widely spoken, especially in [[Pas de la Casa]]. [[Portuguese phrasebook|Portuguese]] is the native language of 13% of the population. English is widely spoken by those involved in the tourism industry.\n\n==Buy==\n{{Euro}}\n[[Andorra La Vella]] is a good destination to buy all kinds of cheap goods, due to the country's status as a \"tax haven.\"\n\nHowever, do compare the base price with that in your own country or region. Tax free does not necessarily bring you net lower final expense. If you don't just want to buy new releases of brand-name luxury goods, whose base prices can be very different from the \"just arrived\" category, Andorra is not the right place for you. Just wander around then, it is also very enjoyable.\n\n==See==\nAndorra's huge ski resorts with their family-friendly slopes are probably the main reason for Andorra's popularity among tourists, but the country has other things to offer. In terms of landmarks and culture, the many churches and shrines are a main sight. The famous statue of Our Lady of Meritxell was destroyed in a 1972 fire, but a nice replica is still on display. In the country's capital, [[Andorra la Vella]], you'll find the Romanesque '''Església de Sant Esteve''', located in the old part of town and therefore a perfect stop during a city walk. Just 2 kilometres out of town, the church of '''[[Santa Coloma d'Andorra]]''' is even older, as it dates back to the 9th century.\n\n==Do==\n\n===Ski resorts===\nMost of these resorts were once small mountain villages which have grown in recent years because of the skiing industry.\n\nThe resorts have all joined together so that your ski pass covers neighboring areas. As a result, there are two large alpine skiing areas known as '''Vallnord''' and '''Grandvalira'''. \n\n'''Vallnord''' covers [[Arcalis]]  and the [[Arinsal]]-[[Pal]] ski area. Despite the considerable distance between Arcalis and Arinsal-Pal, the two ski areas have been connected by cable car in recent years. The Arisnal-Pal ski area is directly accessible from [[La Massana]] the middle of the town. 93km (58&nbsp;mi) of pistes.\n\n*[[Arcalis]] -- ski area located at the head of the valley from El Serrat\n*[[Arinsal]] -- skiing resort part of the Arinsal Pal ski area. Also known as Vallnord, which means \"Valley North\" in English\n*[[Pal]] -- skiing resort part of the Arinsal Pal ski area\n\n'''Grandvalira''' covers [[Soldeu]] and [[Pas de la Casa]]. The '''Soldeu''' ski area is also accessible from [[El Tarter]], [[Encamp]] and [[Canillo]]. This quite cleverly has opened up these areas to cope with the influence of visitors without putting all the strain on Soldeu. It has 210km of ski slopes between 1710-2640m. The area of Grandvalira is about 1,926 hectares, and it's divided into 6 different sectors. These are (from left to right on their piste map):\n\n*[[Pas de la Casa]] -- skiing resort located right on the French border with a good sized town that has plenty of duty free shops, hotels and restaurants.\n*[[Grau Roig]] -- skiing resort only with a large car park and a hotel\n*[[Soldeu]] -- skiing resort in a small town with hotels, restaurants and shops\n*[[El Tarter]] -- skiing resort in a small town with hotels, restaurants and shops\n*[[Canillo]]-- skiing resort accessed by gondola from a medium sized town with hotels, restaurants and shops\n*[[Encamp]] -- a large town with hotels, restaurants and shops connected to the Grandvalira ski slopes by the 6.1km Funicamp gondola - was the longest in Europe but maybe surpassed now. \n\n'''La Rabassa''' is a cross-country (Nordic) skiing area in southern Andorra above the town of Sant Julia de Loria.\n\n===Hiking and trekking===\nIf you would like more information on the mountain huts in Andorra, go to [[Mountain huts in Andorra]] [http://www.hola-andorra.com/arinsal/english/refugisGB.html]. If you are afraid of sleeping in a tent because of wild animals and night sounds (\"demons\"), a good place to stay while hiking and trekking in Andorra is the Himàlaia Hotel in [[Soldeu]] [http://www.himalaiahotels.com], which has its own team of hiking guides who go every day with their guests to walk and discover a lot of interesting hiking routes around the country. Be sure to bring something other than sandals for your feet and a purse for your cellphone.   \n[[Image:Andorra_Mountains_Summer.jpg|thumb|Mountain stream during Summer, Andorra]]  \n\nAndorra is a great place for hiking. The point of departure is the town of Arinsal at the foot of the Coma Pedrosa 2,942m (9,652&nbsp;ft) and the Pic de Médécourbe 2,914m (9,560&nbsp;ft).\n\n* '''Treks from Arinsal (1,500m)'''   -  Pic de Sanfons (2,888 m/9,475 ft, 4h45, climb 1,310 m/4,298 ft, medium until the hut, difficult on the ridge). View on the Coma Pedrosa, the valley of Tor, the lakes of Baiau in Spain as well as on the Pallars mountains. Mountain hut and lake on the way. Parking at Torrent Ribal 1,580 m (5,184 ft). \n\n* '''Pic de Médécourbe 2,914m'''  (4h30, climb 1,335m/4,380 ft, medium until the hut increasing to difficult on the ridge).  A classic!  Mountain hut half-way up, lakes and a breathtaking view over the valley of Arinsal, Boet and Vicdessos (France).  Parking at Torrent Ribal 1,580m (5,184&nbsp;ft). The peak is the western tripoint international boundary of Andorra, France, and Spain.\n\n* '''Pic de Coma Pedrosa 2,942m''' (4h30, climb 1,370m, medium until the lake, difficult on the ridge). The highest mountain in Andorra.  Mountain hut half way up, lakes.  Beautiful view of the surrounding summits, the valley of Arinsal and to the West, the Maladeta and Ecantats massifs.  Parking at Torrent Ribal 1580m. \n\n* '''Montmantell lakes and the Pic del Pla de l'Estany 2,859m''' (4h20, climb 1,280m, medium).  Mountain hut half-way up, lakes, magnificient view over the Ariège mountains in France and over Andorra. Parking at Torrent Ribal 1580 m.  \n\n* '''Arinsal - Percanela - les Fonts - Pla de l'Estany - Arinsal circuit 2,055m''' (4h30, climb 670m, medium) 2 mountain huts.  Very pleasant circuit which one can do either way.  Lovely views of Coma Pedrosa via the imposing natural amphitheatre of Les Fonts.  A few bordas (farm houses) on the way, some renovated, some in ruins.  Parking at Arinsal 1,466m.  \n\n*'''Camí del coll de les Cases 1,950m''' (1h40, climb 490m, medium) Panoramic view over the Ordino mountains and la Massana.  Ideal picnic and meditation site.  One can continue along the GR11 to Arans (parking at Mas de Ribafeta 1466m) but transport back to Arinsal must be provided.\n\n===Mountain Biking===\n\nAndorra is a great place to go mountain biking. There are is a chairlift assisted bike park, and plenty of other trails throughout the country. Each year the UCI World Cup comes to Andorra as well [https://www.vallnordworldcup.com/en].\n\n* '''Vallnord Bike Park''' 29 circuits at different levels (21 downhill, 2 enduro, 4 cross-country, 1 four-cross, 1 electric bike course, 1 practice area, 1 kids Bike Park and 1 pump track).\n\n==Eat==\nLamb is the main meat; different French and Spanish cuisines and cheeses are used as well. You can enjoy French and Spanish cuisine in the same area.\n\n==Drink==\n\n==Sleep==\n\n==Learn==\n\n==Work==\nAs Andorra is not in the European Union, virtually citizens of all countries require a work permit. Usually with an employment offer signed by your prospective employer it is relatively easy to get an Andorran work permit.\n\n==Stay safe==\nThere is not much threat from other people in Andorra, but keep safe on mountains. Don't go too high without knowing what you are doing. See [[Altitude sickness]] for more.\n\nDrivers are warned to avoid crossing back into France if the Spanish side of the Pyrenees has enjoyed beautiful warm sunshine all day and the road temperatures drop considerably towards the evening - there is danger of black ice from ice melt.  The weather in the French Pyrenees is frequently vastly different than that of Andorra and the Spanish Pyrenees.  Stay overnight if necessary, as cold morning temperatures are more apparent and less treacherous than sudden evening icing.\n\n==Stay healthy==\n[http://www.caldea.com/ Caldea] is a very popular spa/swimming pool complex which is located up at the top end of Andorra la Vella. You can't miss it because of its unique glass spire structure.\n\nThe main hospital in Andorra is the Meritxell (pronounced merichai) Hospital (+376 871 000).\n\n==Contact==\n\n===Internet===\nAndorra is a well-connected country that has accepted the internet with open arms. Almost as many people subscribe to the internet as own landline phones.\n\n===Postal Service===\nAndorra relies on the Spanish and French postal systems; the main office for each is located in Andorra la Vella.  \n\nThe French post office (CORREUS FRANCESOS) located at Carrer de Bonaventura Armengol AD500 Andorra la Vella, Andorra [http://maps.google.es/maps?oe=utf-8&rls=org.mozilla:en-US:official&client=firefox-a&um=1&ie=UTF-8&q=oficina+de+correus+francesos+andorra&fb=1&gl=es&hq=oficina+de+correus+francesos&hnear=Andorra+la+Vieja,+Andorra&cid=0,0,14423966354648456240&ei=6SYSTK-AEMaBOPeU1c8H&sa=X&oi=local_result&ct=image&resnum=1&ved=0CBYQnwIwAA] is usually open from 8:30AM - 2:30PM Monday - Friday and Saturdays from 9:00AM - 11:59AM \nTel: +376 820 408\n \nThe Spanish post office (CORREUS ESPANYOLS) is open from 8:30AM - 2:30PM Monday - Friday and Saturdays from 9:00AM - 1:00PM \nTel:  +376 820 257.\n\nVisitors should note that since Andorra is not part of the EU/EEA, using mobile phones may be a lot more expensive than in France or Spain.\n\n==Get out==\n*At Andorra Estacio, there are regular buses to Barcelona and Toulouse. To get to Toulouse, take '''Andbus''' [https://www.andorrabybus.com] (departs at 5:00 am, 10:00 am, and 3:00 pm). The bus drops makes stops at Pas de la Casa, Toulouse Airport and Toulouse Matabiau train station. It costs 35 euro.\n\n* Latour-de-Carol - first stop on the scenic descent for Perpignan with the open-top [https://www.ter.sncf.com/languedoc-roussillon/loisirs/ligne-touristique-train-jaune Yellow Train] (fr: Petit Train Jaune) is reachable with the same TER train line 22 that serves L'Hospitalet-près-l'Andorre.\n\n\n\n\n\n\n{{isPartOf|Iberia}}\n\n[[ca:Andorra]]\n[[de:Andorra]]\n[[eo:Andoro]]\n[[es:Andorra]]\n[[fi:Andorra]]\n[[fr:Andorre]]\n[[hu:Andorra]]\n[[it:Andorra]]\n[[ja:アンドラ]]\n[[nl:Andorra]]\n[[pl:Andora]]\n[[pt:Andorra]]\n[[ro:Andora]]\n[[ru:Андорра]]\n[[sv:Andorra]]\n[[wts:Category:Andorra]]\n\n\n[[WikiPedia:Andorra]]\n[[Dmoz:Europe/Andorra/]]\n\n{{countryguide}}\n{{outline}}"
        }
    }
}