{
    "parse": {
        "title": "Angola",
        "pageid": 191,
        "wikitext": {
            "*": "{{otheruses}}\n{{pagebanner|Angola Banner.jpg}}\n{{quickbar\n| image=LuandaAngola2005crop.jpg\n| caption=Luanda\n| location=Angola in its region.svg\n| flag=Flag of Angola.svg\n| capital=[[Luanda]]\n| government=Republic, nominally a multiparty democracy with a strong presidential system\n| currency=kwanza (AOA)\n| area=''total:'' 1,246,700km²<br />''water:'' 0km²<br />''land:'' 1,246,700km²\n| population=12,127,071 (July 2006 est.)\n| language=[[Portuguese]] (official), Bantu and other African languages\n| religion=Indigenous beliefs 47%, Roman Catholic 38%, Protestant 15% (1998 est.)\n| electricity=0 kWh\n| callingcode=+244\n| tld=.ao\n| timezone=UTC+1\n}}\n[http://www.angola.org/ '''Angola'''] is a country in [[Central Africa]] rich in natural resources. It has large reserves of oil and diamonds, hydroelectric potential, and rich agricultural land. Despite this, Angola remains very poor, having been ravaged by a bloody civil war from 1975 to 2002.\n\nIt's bordered by [[Namibia]] in the south, [[Zambia]] in the east and the [[Republic of Congo]], as well as the [[Democratic Republic of the Congo]] in the north.\n\n==Understand==\nThe people of Angola are stoics. They have a deep understanding of patience, and avoid blaming the difficulties the country faces on the fact that there was war. In fact, Angolans behave as if there was no war, although it is deeply rooted in every Angolan. Music is the heart and soul of every Angolan, and can be heard everywhere with anything used as an excuse to party. Angola has a wide range of music, mainly Kuduro, Kizomba, Semba, and Tarrachinha, the latter being more sensual than all the others. All in all, it is safe to say that Angolans are fun loving people with a thirst for more of what life has to give. \n\n===History===\nAngola was a Portuguese overseas territory from the 16th century to 1975. The Portuguese were nearly all exiled convicts who became slave traders and later participants in the \"forced labour\" trade. After independence, Angola was the scene of an intense civil war from 1975 to 2002. The country is the second-largest petroleum and diamond producer in sub-Saharan Africa, however, these riches are in the hands of the \"big people\": Angola's politicians, miners, oilmen and the associated multinational corporations. Angola's life expectancy and infant mortality rates are both among the worst ranked in the world. In August 2006, a peace treaty was signed with a faction of the FLEC, a separatist guerrilla group from the Cabinda exclave in the North, which is still active. About 65% of Angola's oil comes from that region.\n\n===Climate===\nLike the rest of tropical Africa, Angola experiences distinct, alternating rainy and dry seasons. \n\nThe coastal strip is tempered by the cool Benguela Current, resulting in a climate similar to coastal Peru or Baja California. It is semiarid in the South and along the coast to Luanda. There is a short rainy season lasting from February to April. Summers are hot and dry,the country do not have winter. The northern part has a cool, dry season (May to October) and a hot, rainy season (November to April). In the interior, above 3,300 ft (1,006 m), the temperature and rainfall decrease. The interior highlands have a mild climate with a rainy season from November through April followed by a cool dry season from May to October. \n\nThe heaviest rainfall occurs in April, and is accompanied by violent storms. The far north and Cabinda enjoy rain throughout much of the year.\n\n===Electricity===\nOfficially 220V 50Hz. Outlets are the European standard CEE-7/7 \"Schukostecker\" or \"Schuko\" or the compatible, but non-grounded, CEE-7/16 \"Europlug\" types. Generally speaking, US and Canadian travellers should pack an adapter for these outlets if they plan to use North American electrical equipment in Angola.\n\nAlso, be aware of the power related problems in Angola. If you plan to rent a house, you for sure should rent a house with a generator. Power outages are quite frequent.\n\n==Regions==\n{{Regionlist\n| regionmap=Angola Regions map.png\n| regionmaptext=\n| regionmapsize=450px\n\n| region1name=[[Greater Luanda]]\n| region1color=#69999f\n| region1items=\n| region1description=The population centre of the country and home to the capital [[Luanda]]\n\n| region2name=[[Northern Angola]]\n| region2color=#5bab67\n| region2items=\n| region2description=Northern area mostly bordering [[Democratic Republic of the Congo]] with significant areas of rainforest\n\n| region3name=[[Central Angola Highlands]]\n| region3color=#72aed4\n| region3items=\n| region3description=A series of irregular, high escarpments which drop steeply to the Atlantic coast\n\n| region4name=[[Southwest Angola]]\n| region4color=#daa354\n| region4items=\n| region4description=the most arid region of the country with savanna plains and the northern continuation of the Namibian desert \n\n| region5name=[[Southeast Angola]]\n| region5color=#b5d29f\n| region5items=\n| region5description=Mostly savanna plains interesected by five great rivers \n\n| region6name=[[Cabinda]]\n| region6color=#b773b7\n| region6items=\n| region6description=Northern exclave on the Atlantic ocean with a huge proportion of the nation's oil reserves and an active secessionist movement }}\n\n==Cities==\n* [[Luanda]] - the capital\n* [[Benguela]]\n* [[Huambo]]\n* [[Lobito]]\n* [[Lubango]]\n* [[Namibe]]\n* [[Kuito]]\n* [[Menongue]]\n\n==Other destinations==\n*[[Cangandala National Park]]\n*[[Iona National Park]]\n*[[Kissama National Park]]\n\nMussulo Island is a beautiful extension of land situated in the south of Luanda. It is famous for its natural beauty.\nIt is a place one has to visit, one of the most known tourist attractions in Luanda.\nThere one can find everything, from fishermen to the most beautiful and modern restaurants. You can have your sun tan, hide below the shadows of coconut trees and palm trees, relax with peace of mind, have fun with diverse aquatic sports, find accommodations in paradisiac motels, and explore some of the typical food such as ‘pirão’, funge, and moamba.\n\n==Get in==\n\n===Visa===\n\nAngolan visa rules have been simplified by presidential decree. From March 30, 2018, many nationalities receive a 30 day tourist visa on arrival (e.g. EU, US, Canada, much of southern Africa). A visa is not needed for international airline transfers of less than 24 hours, and visitors from [[Namibia]], [[Zimbabwe]], [[Botswana]], [[Mozambique]], and [[South Africa]] are completely visa-free.\n\nYour passport must be valid for another six months minimum and contain two blank pages. Travellers need an international yellow fever certificate in order to obtain a visa, a hotel booking, and proof of sufficient funds. Transit visas are also available in Angola if entering from Congo, but you will often only be issued a five day transit visa for Angola. If travelling by road, this will only give you enough time to get to Luanda where it takes up to four days to get another five day transit visa. If you're coming into Angola from DR Congo, you may well need an Angolan visa before entering DR Congo, as the new visa regulations are still not well-tested.\n\n===By plane===\n[[Image:UNFlightAngola.jpg|thumb|upright=1.3|A UN airplane in Angola]]\n\nLuanda-4-de-Fevereiro is situated 4km outside Luanda. There are public phones and bank facilities at the airport.\n\nReliable Taxi facilities are pretty much non-existent Eco Tur do run reliable airport transfers.\n\n''TAAG Linhas Aereas de Angola'' has flights between [[Luanda]] and some states in Africa, for example to [[South Africa]] ([[Johannesburg]]), [[Namibia]] ([[Windhoek]]), [[Zimbabwe]] ([[Harare]]), [[Democratic Republic of the Congo]] ([[Kinshasa]]) and the [[Republic of Congo]] ([[Brazzaville]]). TAAG recently started to have two or three weekly flights to [[Rio de Janeiro]] and [[São Paulo]] ([[Brazil]]), and daily to [[Lisbon]].\n\n*[http://www.emirates.com Emirates] flies directly from [[Dubai]] and from there to more than 100 destinations worldwide.\n*Ethiopian Airways [http://www.flyethiopian.com] flies from [[Addis Abeba]] to [[Luanda]].\n*South African Airways [http://www.flysaa.com] operates from [[Johannesburg]] to [[Luanda]].\n*Royal Air Maroc [http://www.royalairmaroc.com] flies from [[Casablanca]] to [[Luanda]].\n*Air France [http://www.airfrance.com] between [[Paris]] and [[Luanda]]\n*British Airways [http://www.ba.com] offers direct connections between [[London]] and [[Luanda]]\n*Brussels Airlines [http://www.brusselsairlines.be] flies from [[Brussels]] to [[Luanda]].\n*KLM [http://www.klm.com] flies from [[Amsterdam]] to [[Luanda]].\n*Lufthansa [http://www.lufthansa.de] flies from [[Frankfurt]] to [[Luanda]].\n*Sonair's Houston non-stop Express. The company is the first to provide direct transportation of passengers and cargo between Angola and the United States. The airline provides three times weekly service from Houston to Luanda.\n*TAP Air Portugal [http://www.tap-airportugal.pt] flies daily from [[Lisbon]] to [[Luanda]].\n*Kenya Airways as from 2010 from Nairobi\n\n===By train===\nThere are no railway links between Angola and other nations.\n\n===By car===\nYou can go in from [[Namibia]] at the border post near Oshikango(Namibia)/Ngiva(Angola).\n\nEntering from the North was, as of 2002, via Luvo, a small town on the Kinshasa-Matadi 'road'. If you want to drive through Angola, it's a real experience. Off the beaten track, road conditions might not be quite what you are used to so be prepared, particularly during the rainy season where potholes are likely to be a frequent occurrence. Also, keep a look out for livestock and the overloaded vehicles of the Angolan residents.\n\nSince 2006 there has been extensive road building by China, so travel is getting smoother. However, the construction has not always been the best quality - so check on current road conditions.\n\nTravelling by road from anywhere you will need the following:\nAs you will need a 4 x 4 vehicle you should have the following documents:\nPolice clearance from country of origin, where the vehicle is registered, original registration certificate of the vehicle, licence discs or insurance that is up to date. Make copies of these documents and get them certified.\nMake a copy of your passport and soon after entry before going to customs (and soo after immigration ) make copies of the entry stamp. Have a passport sized photo. Lastly ensure that you have a colour photo of your car front, rear and driver´s side. If you do not have these documents, your car will not be allowed into the country. If you are not the owner of the vehicle, have an original (and copy of the original) letter from the owner clearly stating (your name, passport number and driver´s license)  that you have been authorised to drive the vehicle into Angola.\n\nThis applies if you are a foreigner and not a resident. If you are Angolan or a resident foreigner - you will not be allowed to drive into angola in  a vehicle that is more than 3 years old and not a left hand drive!\n\n===By bus===\nThere are bus lines between Angola and Namíbia\n\n===By boat===\nThere are no official ferry links between Angola and other nations. As of 2003, it was at least possible to enter Angola via a small passenger ferry near Rundu in Namibia. There was both an Angolan and Namibia border official present. The crossing was mostly used by Angolans for the purposes of acquiring food and other supplies in Namibia. There are (as of 2007) ferries running from the enclave of Cabinda to Luanda, which can be useful to avoid the unstable DRC. They carry cars as well. Seek local advice for when they depart. Sources claim that they run twice a week, cost $180 per person (bike included), and take 14 hours to do the trip (2005).\nIf there are no ferries, there might be cargo planes that you (and your car) can ride on between Cabinda and Luanda [http://www.mail-archive.com/ugandanet@kym.net/msg04791.html]. Be warned - these planes are unsafe. Use them at your own peril.\n\n==Get around==\n\n===By plane===\n\n===By train===\nAngola's train system is finally being restored with the help of Chinese firms after more than 30 years of disuse. There are three main lines which are not connected to each other.\n\nThe northern line, ''Caminho de Ferro de Luanda (CFL)'' between the capital [[Luanda]] to [[Malenje]] is back to full service. There are three classes, '''Primeira''', with reclining leather seats with individual television sets; '''Exspresso''', with comfortable chairs arranged in fours around tables and communal televisions; and '''Tramway''', the cheapest option fitted out with benches to maximize passenger numbers. Ticket prices hover around AOA2,500 (USD26; GBP15). Carriages are clean and modern with functioning toilets and a restaurant car.\n \nThe middle line, ''Caminho de Ferro de Benguela (CFB)'' has just started services between [[Lobito]], [[Cubal]] and [[Huambo]] with the intention of reaching [[Luau]] at the border to the Democratic Republic of the Congo before the end of 2012.\n\nThe southern route, ''Caminho de Ferro de Moçâmedes (CFM)'' between [[Namibe]], [[Lubango]] and [[Menongue]] is starting services by fall 2012.\n\n===By bus===\n\n=== By boat ===\n\n=== By car ===\n\n==== Hiring a car ====\n\n=== Cycling ===\n\n==See==\nIn Luanda: the Mussulo island for clean tropical beaches and water sports, the Benfica Market for Kwanza River.  \n\nEco Tur Angola do various bespoke no tours Angola including Kissama with specialist game viewing vehicles. \n\nIn Benguela: Baia Azul for beautiful desert beaches. Art deco architecutre in Beguela. Lobito City for the Restinga Penisnula and ice cold draught Cuca beer, the Benguela Rail road, and fantastic scenery!\n\n\nIn Kwanza Sul - Cubal Canyon, Conde Hot springs and Cachoeiras / Binga Waterfalls, with the Cambambe Dam on River Kwanza. Waku Kungo plains has fantastic scenery!\n\nIn Malange - Kalandula Waterfalls and Pungo n'Dongo Black Stones.\n\nIn Huila - Serra de Leba, Tunbda Vala Gorge, Mumuila tribes people, fantastic scenery and much more!\n\nIn Namibe - Arco Lagoon, beaches and a desert, and Mucubais Tribes People. \n\nIn Huambo - City Tours, Alto Hama hot springs, and fantastic scenery. \n\nIn Cunene - Himba tribes peoople, Ruacana Falls, and fantastic scenery.\n\n==Do==\n\n==Talk==\n\nThe sole official language of Angola is '''[[Portuguese phrasebook|Portuguese]]'''. Over 39% of the population has Portuguese as their native language, and 80% of the country in general has at least some knowledge of Portuguese. Compared to other African countries, the knowledge of the colonial language in Angola is extremely high, and used as a native language on a far wider scale.\n\nA very low percentage of the local population can communicate in English. Travelling in Angola therefore requires a basic knowledge of the [[Portuguese]] language, or a local guide/interpreter. Also, due to the fact that many people migrate from neighbouring countries to Angola, it is sometimes possible to use [[French phrasebook|French]] or [[Afrikaans phrasebook|Afrikaans]].\n\nThere is little literature on Angola available at all, and most of the available literature is in Portuguese or (in some cases) French.\n''Bay of Tigers: An Odyssey through War-torn Angola'' by Pedro Rosa Mendes was translated from the Portuguese and published by Harcourt in 2003. Mendes traveled across the country by train in 1997 while the war was still going on in Angola, it's a very fascinating look at the people and the nature of life there during the war. \n\nTry also John Frederick Walker's \"A Certain Curve OF Horn\", documenting the history of the magnificent and sub species of Antelope unique to Angola - \"Palanca Negra Gigante\" (Hippotragus níger variani).\n\nAnother excellent read is Ryszard Kapuściński's compelling journalistic narrative ''Another Day of Life'' in which he reports on the chaotic period leading up to Angola's independence from Portugal in 1975. As one of the only journalists in Angola during this very dangerous period, his perspective is rare and full of insight.\n\nHere are a few words and phrases in Portuguese:\n\nHello=Olá\n\nHow are you?-Como está?\n\nFine and you?- Bem e tu?\n\nGoodbye-Adeus\n\nSee you later-Até logo\n\nGood morning-Bom-dia\n\nGood afternoon-Boa-tarde\n\nGood evening-Boa-tarde\n\nGood Night-Boa-noite\n\n==Buy==\nThe official currency of Angola is the ''new kwanza'' ('''AOA''') and has been one of Africa's more stable currencies for the last few years. As of April 2014, USD1 = AOA97.4, €1 = AOA134.5, and GBP1 = AOA163.5. However, since the oil price crash of 2014, the currency has been in free-fall, resulting in a parallel exchange rate which is multiple times separate from the official exchange rate (e.g. as of mid-2016, official exchange rate is $1 = 166 AOA, but parallel rate is $1 = 600 AOA; this has since declined to $1 = 400 AOA, mid-2017). Check [http://www.Kinguilahoje.com Kinguilahoje] for the current market exchange rate .Keep in mind that such unofficial currency exchange is illegal and theoretically you may encounter issues. You will also be unable to exchange extra AOA back into USD at the end of your trip at anything close to the official exchange rate, and may even have trouble exchanging it at the black market rate. \n\nAlthough the import or export of any sum of kwanza had been strictly prohibited, the ban was lifted in February 2012, so travellers are now allowed to bring in or take out up to AOA50,000.\n\nJust south of Luanda, the Benfica Handcrafts Market offers the best prices for handcrafts and souvenirs. This is an open market where local artists and artisans display their products, and bargaining is not only acceptable, but recommended. The products range from sculptures and paintings to jewellery, batik cloths and accessories.\n\n==Eat==\nGenerally, eating and dining out is not very easy in Angola, not even in Luanda because food is expensive and many of the less well equipped restaurants have poor hygienic conditions. Nonetheless, Angolan cuisine is varied and tasty, with local dishes based mainly on fish, cassava products and spicy stews. Angolan seafood is abundant and very good, and the Angolan coast is a special place to eat fresh lobster right off the fisherman's boat. Tropical fruit in Angola is also a treat, for artisanal means of production have maintained organic methods, and rich fruit flavors, unusual to the Western palate accustomed to industrially produced tropical fruits. If, however, you are situated in Luanda and need to dine, it is recommended that you get to Ilha de Luanda, where beach-restaurants (of varying price-classes from very exclusive to rather informal) can serve most foreign needs. It should also be said that restaurants in Luanda are increasing in numbers and quality, since the recent peace has brought stability and significant investment to the country.\n\nGenerally, all restaurants accept US dollars in cash. Credit cards will not be accepted.\n\n==Drink==\nThe legal drinking/purchasing age of alcoholic beverages is '''18'''.\n\n==Sleep==\nWorld class hotels include the Tropico Hotel, the Alvalade Hotel, Le President Meridien Hotel, the Continental Hotel, and the Palm Beach Hotel, among others.\n\nDue to the oil boom, costs can be extremely high and this includes hotels. Cheap hotels are hard to find and dirty.\n\n==Learn==\n\n==Work==\n\n==Stay safe==\n\n[[Image:DeminingTrainingAngola.jpg|thumb|upright=1.3|Training in removing mines]]\n\nIn general, '''you shouldn't travel within Angola without the assistance of qualified personnel'''. However, if you follow some basic rules, travelling in Angola isn't dangerous. First of all, travelling after dark and alone is never a good idea. If possible, join with several cars of the same make and model because of the possible need for spare parts. '''Carry a satellite telephone''' in the case of a breakdown or other emergency. Be aware, that while Iridium [http://www.iridium.com] satellite phones have global coverage, Thuraya satellite phones have coverage in most of Angola, but may '''not''' have coverage in the southern parts of the country (check the Angola  Thuraya coverage [http://www.satellitephonefaq.com/thuraya/network/angola/] map for details).\n\nFor the city of Luanda, other rules apply. Stay in your car (with the doors locked) while you're outside reach of security personnel, which you will find at all hotels and restaurants.\n\n'''Avoid using your camera in front of police''' (dressed in blue uniforms). Photography will result, at best, in a very heavy fine, but could also have more dire consequences. Throughout Angola, taking photographs of sites and installations of military or security interest, including government buildings, may result in arrest or fines and should be avoided. \n\n'''NEVER''' step beyond the red and white HALO Trust posts. These denote '''mine fields'''. In fact, beware of anything surrounded by any kind of red stones or similar markers.\n\nDue to the high rate of HIV in the country, all forms of prostitution are illegal, and punishments are severe.\n\n==Stay healthy==\nTravellers should only drink mineral water or, in an emergency, boiled water, because water in Angola is untreated and therefore not safe. Because malaria is endemic to this country, travellers should also avoid mosquito bites by using insect repellent and repellent-impregnated bed nets. Furthermore, there is a risk of being bitten by the tse-tse fly while in Angola, which causes sleeping sickness. Consult a doctor immediately if you start having insomnia. \n\nAIDS and HIV is prevalent among adults in Angola at '''4.0%''' or '''1 in 25'''.\n\n==Respect==\nSmiling around natives is incredibly important. It shows respect. Also, avoid criticism on the way Angola is or talking about the war around natives.\n\n==Contact==\nThe phone country code of Angola is '''244'''.\nTelephone connections, cellular and landline, are heavily overloaded, making communication difficult at times. International lines are, however, often better.\n\n\n{{isPartOf|Central Africa}}\n{{outline}}\n{{countryguide}}\n\n[[ca:Angola]]\n[[de:Angola]]\n[[eo:Angolo]]\n[[es:Angola]]\n[[fi:Angola]]\n[[fr:Angola]]\n[[hu:Angola]]\n[[it:Angola]]\n[[ja:アンゴラ]]\n[[nl:Angola]]\n[[pl:Angola]]\n[[pt:Angola]]\n[[ro:Angola]]\n[[ru:Ангола]]\n[[sv:Angola]]\n[[wts:Category:Angola]]\n\n[[WikiPedia:Angola]]"
        }
    }
}