{
    "parse": {
        "title": "Azerbaijan",
        "pageid": 179,
        "wikitext": {
            "*": "{{pagebanner|Azerbaijan Banner.jpg}}\n\n{{quickbar\n| image=Baku-super142546.jpg\n| caption=Baku\n| location=Azerbaijan in its region.svg\n| flag=Flag of Azerbaijan.svg\n| capital=[[Baku]] (Baki)\n| government=Republic\n| currency=Azerbaijani manat (AZN)\n| area=86,600km²\n| population=9,047,000 (Aug 2010)\n| language=[[Azerbaijani phrasebook|Azerbaijani (Azeri)]] 93.4% (official),  [[Russian phrasebook|Russian]] 2.5%, Lezgin 2.2%, other 1.9%\n| religion=Muslim 95.4%, Russian Orthodox 2.8%, other 1.8%\n| electricity=220V/50Hz (European plug)\n| tld=.az\n| callingcode=+994\n| timezone=UTC+4\n}}\n: ''This article is about the country of Azerbaijan.  There is also a region of [[Iran]] called [[Iranian Azerbaijan|Azerbaijan]].''\n\n[http://www.azerbaijantourism.az/ '''Azerbaijan'''] is a former Soviet republic in the [[Caucasus]] and variously considered part of [[Europe]] or [[Asia]]. The country lies on the Caspian Sea. It borders [[Russia]] and [[Georgia (country)|Georgia]] to the north, [[Armenia]] to the west, and [[Iran]] in the south. Through the autonomous exclave of [[Nakhchivan]], which lies between [[Armenia]] and [[Iran]], Azerbaijan also shares a short border with [[Turkey]].\n\n==Understand==\n\nThe majority of the population (over 90%) is composed of Azeris, who share a culture very similar to Turkey. History, with Russian and Persian influence, has left the Azeris of Azerbaijan and Iran with some moderate differences. Minorities in Azerbaijan include Lezghins, Russians, Avars, Turks, Tatars, Ukrainians, and Georgians. Most inhabitants are Shia Muslim, although a long history of Russian colonialism has left many with very liberal, laisez-faire attitudes towards Islam and the country is staunchly secular. The government is a kleptocracy run by the Aliyev family and their allies. While the opposition is often sacked or imprisoned, it is not as severely authoritarian compared to Turkmenistan, Iran or the Russian Caucasus. Following independence in 1991, Azerbaijan has allowed western companies to develop its neglected, but extensive, oil fields, especially since the mid-2000s. \n\nDespite this and related investments, Azerbaijan has its fair share of problems. Corruption is rife, and the government, which eliminated presidential term limits in a 2009 referendum, has been repeatedly accused of human rights abuses. Although the poverty rate has been reduced and infrastructure investment has increased substantially in recent years, reforms have not adequately addressed weaknesses in most government institutions, particularly in the education and health sectors, as well as the judicial system. \n\nThe [[Nagorno-Karabakh]] enclave, which is part of Azerbaijan, has been the subject of a war with [[Armenia]] that has left it a ''de facto'' independent republic, which is not internationally recognized by any UN member including, ironically, Armenia which \"supports\" it. Azerbaijan has lost control of 20% of its territory and must support some 800,000 refugees and internally displaced persons as a result of the conflict. Despite a 1994 cease-fire, Azerbaijan has yet to resolve its conflict with Armenia over the Nagorno-Karabakh enclave. Occupied by the local Armenian troops to this day, this conflict has not officially ended and minor skirmishes are frequent, and this is a major source of contention among Azerbaijanis.\n\n===Celebrate===\nThese are the nationally recognized holidays for people living in Azerbaijan.  \n\n*New Year (1-2 Jan)\n*Women’s Day (8 Mar)\n*Victory Day (9 May)\n*Republic Day (28 May)\n*Day of National Salvation of Azerbaijan People (15 Jun)\n*Day of Military Forces of Azerbaijan Republic (26 Jun)\n*State Sovereignty Day (18 Oct)\n*Constitution Day (12 Nov)\n*National Rebirth Day (17 Nov)\n*Solidarity Day of World Azerbaijanis (31 Dec)\n*Novruz Bayram – 5 days\n*Gurban Bayram (Day of Sacrifice) - 2 days\n*Ramazan Eid (Days after Ramadan fasting) 2-3 days\n\n===Climate===\n[[Image:Lerik Azerbaijan.JPG|thumb|250px|Subtropical forests near Lerik, close to the Iranian border]]\nAzerbaijan is known for having nine of the 11 defined ecological zones. Much of the country is temperate year-round. Nation-wide the average temperature for the year is 14-15°C (57-59°F). The Caucasus Mountains protect the country from the Arctic air masses that affect Russia in winter while the Caspian Sea shields it from the hot, dry air of Central Asia in the summer. Temperatures in the winter are mild (0-15°C/32-59°F) at lower altitudes and along the coast and drops moderately as you head inland and drastically as you head into the mountains (-20°C/-4°F is possible in the Caucasus Mountains). Summers range from warm to hot (20-40°C/68-104°F) throughout most of the country, although breezes off the Caspian make life pleasant along the coast. Nakhchivan is quite different, high and arid, summers here can easily surpass 40°C (104°F) while winter nights often drop below -20°C (-4°F)...in fact the country's extreme minimum and maximum (-33°C/-27°F & 46°C/115°F) were both recorded in southern Nakhchivan!\n\nSnow is rare in Baku and along the coast in general while common inland and copious in the mountains, where many villages may be cut off during the winter. The southern forests are the wettest part of the country, with plenty of rain in late autumn and early spring. The western central coast is fairly dry. Lankaran receives the most annual precipitation (1600-1800mm/63-71&nbsp;in) while the region around Baku averages 200 mm (8 in). Baku is very breezy, much like [[Chicago]] or [[Wellington]], most of the year.\n\n===Terrain===\n[[Image:Azerbaijan mud volcano.png|thumb|250px|Mud volcanoes in Gobustan.]]\nLarge, flat Kur-Araz Ovaligi (Kura-Araks Lowland) (much of it below sea level) with Great Caucasus Mountains to the north, Qarabag Yaylasi (Karabakh Upland) in west; Baku lies on Abseron Yasaqligi (Apsheron Peninsula) that juts into Caspian Sea.\n\n; '''Elevation extremes''' : \n; ''lowest point'' : Caspian Sea -27m (-89&nbsp;ft)\n; ''highest point'' : Bazarduzu Peak 4,466m (14,652&nbsp;ft)\n\n; '''Environment - current issues''': Absheron Yasaqligi (Absheron Peninsula) (including Baku and Sumgayit) and the Caspian Sea are ecological concerns because of  pollution from oil spills that date back more than a century ago. Heavy traffic in the capital contributes to heavy pollution as well.\n\n===Electricity===\nElectricity is supplied at 220V 50Hz with sockets the European standard CEE-7/7 \"Schukostecker\" or \"Schuko\" or the compatible, but non-grounded, CEE-7/16 \"Europlug\" types. Generally speaking, US and Canadian travellers should pack an adapter and tranformer for these outlets if they plan to use North American electrical equipment in Azerbaijan.\n\nAdditionally, some older buildings may be still equipped with Soviet-era outlets. The Soviet GOST-7396 standard was very similar to the current European CEE-7/7 \"Schuko plug\", but the pins were of a 4.0mm diameter, while the Schuko features 4.8 mm pins. As such, the pins of a Schuko may be too large to fit into a Soviet-era outlet, although the smaller Europlug will still fit. Although the Soviet-era outlets have largely been phased out, travellers who are particularly concerned with having the ability to plug in at all times may consider packing an adapter for the Soviet-era outlets too, just in case.\n\nAlso, make sure to bring your own automated voltage transformer because the electricity in Azerbaijan short circuits and \"jumps\" a lot and many items may get shocked if you don't bring the adapter.\n\n==Regions==\n{{Regionlist|\n\nregionmap=Azerbaijan regions.png |\nregionmapsize=400px |\nregionmaptext=Regions of Azerbaijan |\n\nregion1name=[[Baku Region]] |\nregion1color=#5c7a7a  |\nregion1items= |\nregion1description=The political, economic, and cultural centre of Azerbaijan. Oil has been extracted here since 1871. |\n\nregion2name=[[Ganja Region]] |\nregion2color=#e0fa92 |\nregion2items= |\nregion2description= |\n\nregion3name=[[Nagorno-Karabakh]]  |\nregion3color=#77cbb3 |\nregion3items= |\nregion3description=Called ''Artsakh'' in Armenian, this territory is occupied by Armenian forces, the unrecognised government of Nagorno-Karabakh, remains under dispute (after a 1994 ceasefire) and can only be accessed via neighbouring Armenia. |\n\nregion4name=[[Nakhchivan (region)|Nakhchivan]]  |\nregion4color=#e25c5c  |\nregion4items= |\nregion4description=An exclave bordering [[Turkey]] to the west |\n\nregion5name=[[Northeastern Azerbaijan]]  |\nregion5color=#e9df25  |\nregion5items= |\nregion5description=An ethnically diverse region in the Greater Caucasus mountains covered with lush green forests |\n\nregion6name=[[Sheki Region]]  |\nregion6color=#38911c  |\nregion6items= |\nregion6description=A beautiful green mountainous region bordering [[Kakheti|Georgia]], containing Azerbaijan's loveliest city |\n\nregion7name=[[Southern Azerbaijan]]  |\nregion7color=#b6bc4d  |\nregion7items= |\nregion7description= |\n\nregion8name=[[Talysh Region]]  |\nregion8color=#ffd577  |\nregion8items= |\nregion8description= |\n}}\n\n==Cities==\n* [[Baku]] &mdash; The capital and largest, most cosmopolitan city of the [[Caucasus]]\n* [[Ganja]] &mdash; Azerbaijan's second largest city has a long history and some important sites\n* [[Lankaran]] &mdash; Southern city near the [[Iran]]ian border\n* [[Mingechivir]] &mdash; A mid-sized city on the large Mingechivir Reservoir\n* [[Naftalan]] &mdash; A town best known for its special petroleum oil baths (spas)\n* [[Nakhichevan City]] &mdash; The administrative capital of Azerbaijan's Nakhchivan exclave\n* [[Sheki]] &mdash; A beautiful city in the forested Caucasus Mountains with lots to see and do\n* [[Sumqayit]] &mdash; Azerbaijan's third largest city, on the Absheron Peninsula\n* [[Khachmaz]] &mdash; This is the largest tourist destination in Azerbaijan with great beaches and beautiful forests.\n* [[Shusha]] &mdash; This is one of the most beautiful cities of Azerbaijan in Nagorno-Karabakh, which was populated mostly by Azerbaijanians till the 1991. However the city still remains under occupation and lost its beauty after the war.\n\n==Other destinations==\n* [[Khinalug]]&mdash;scenic, remote mountain village once a centre of Zoroastrianism; today the few inhabitants are an ethnic isolate believed to be decendants of the Caucasus Albanians (Not to be confused with modern-day Albanians of Albania in south-eastern Europe who are entirely unrelated to them).\n\n* '''Mud volcanoes''' which spout up in over 300 locations nationwide, constitute more than half the total throughout the world, each site with its own character \n\n* '''Caspian Hyrcanian forests''' found near the Iranian border\n\n* '''Tears of Kyapaz''' a string of seven idyllic mountain lakes near Mount Kyapaz and Nagorno-Karabakh\n\n==Get in==\n{{VisaRestriction|*Entry will be refused to citizens of [[Armenia]], citizens of Armenian ancestry (i.e. An Armenian surname), and anyone carrying products made in Armenia or with Armenian labelling. \n*Entry will be refused to citizens of [[Kosovo]].\n*Anybody showing proof of entry to [[Nagorno-Karabakh]] without prior consent from the Azerbaijani government will be '''permanently banned''' from entering the country. \n}}\n\n\n===Visa Requirements===\nForeign nationals of the following countries can enter Azerbaijan '''visa-free''':\n\n'''For up to 90 days:''' Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Mongolia, Russia, Tajikistan, Ukraine, Uzbekistan\n\n'''For up to 30 days:''' Turkey\n\n'''For up to 15 days:''' Iran\n\n===How to apply===\n\nForeign travelers must obtain a visa to travel to Azerbaijan. Azerbaijan simplified electronic visa system (https://evisa.gov.az/) for citizens of designated countries in January 2017.The system is called ASAN Visa and the visas are issued for a single-entry visit up to 30 days. According to Presidential Decree on ASAN Visa, foreign visitors may able to get evisa through following steps:\n\n1) Applying to website '''https://evisa.gov.az/'''\n\n2) Submit information on passport, personal information and arrival date to the system of ASAN Visa and pay the state fee ($24).\n\n3) E-visas will be issued to the email of the applicant within 3 working days\n\nThe e-visa should be printed and presented together with the passport (that should be valid at least 3 months more than the validity period of the electronic visa) at the border checkpoint.\n\nShould note, e-visa is available for citizens from 93 countries, including USA, Australia, United Kingdom, China, Hong Kong, Macau. \n\n====Good to know====\nNationals of Bahrain, China, Hong Kong, Indonesia, Israel, Japan, Kuwait, Macau,  Malaysia, Oman, Qatar, Saudi Arabia, Singapore, South Korea and UAE can obtain a visa on arrival at any International Airport. The cost of a single entry visa on arrival is 55 USD (Free of Charge for Japanese citizens)\n\nCitizens of Turkey can obtain a visa on arrival only at Baku International Airport.\n\nCitizens of the United States can obtain a visa on arrival at Baku International Airport if arriving on the Azerbaijan Airlines direct flight from New York (JFK)\n\nA letter of invitation (LoI) from a contact in Azerbaijan is not required. The embassy in Tbilisi, Georgia does not issue transit visas. Around the corner from the embassy, MEDEA TRAVEL will organise a visa within 3 days, priced €80 in total which covers everything. The embassy of Azerbaijan in Washington, D.C. will issue visas without a LoI, provided your stay in Azerbaijan is no longer than a few days. According to Azerbaijani law, foreign nationals intending to remain in Azerbaijan for more than 30 days must register with local police within three days of their arrival. Foreign citizens should approach the passport section of the local district police office and fill out an application form. The registration fee is AZN9.90. If you should fail to register within the first three days of your arrival, you are liable to a fine of AZN300. If you are still within the 30 days and happen to have a double or multi entry visa, an option is to hop over to Georgia and the period will start over.\n\nIt is now possible to enter Azerbaijan on an e-visa.   Generally, if you book accommodation through an agent (even if not for your entire stay), the visa price will be incorporated into the accommodation rate.  \n\nOther agencies offering reasonable rates are Evisa Services [https://e-visa.az/], Azerbaijan Tourism [https://azerbaijantourism.az/], Azterra [http://azterra.az/azerbaijan/en/index.php] and Turizm.az Travel [http://turizm.az/].\n\nSample rates from the above agents would be USD 230 for two nights at the Swan Hotel (normally around USD 95 per night) and processing of the e-visa, effectively making the e-visa USD 40.  Rates for the e-visa without any accommodation or land services start at around USD 60.  Most agents will require a stamped letter from your hotel confirming that you have paid and booked your accommodation before they will proceed with an e-visa only transaction, making booking accommodation via the agent a convenient proposition.  Some agents quote prices in Euro and Azerbaijani Manat.\n\nTo process the e-visa, you will need to send the agency a scanned copy of your passport photo page, a scanned passport photo, your confirmed air tickets to and from Azerbaijan, and the completed visa form (the agency will email you a copy to complete).\n\n===By plane===\nThe primary international gateway is Heydar Aliyev International Airport in [[Baku]], with additional international airports (whose international routes are basically some Russian cities, Istanbul and Tehran) found in [[Nakhchivan (city)|Nakhchivan City]], [[Ganja]], & [[Lankaran]].\n\nNational air company AZAL (Azerbaijan Airlines) is the main carrier which flies to Ganja, Nakhchivan, Yevlakh, Lenkoran, Tbilisi, Aktau, Tehran, Tel-Aviv, Ankara, Istanbul, Trabzon, Antalya, Aleppo, Dubai, Moscow, [[Saint Petersburg]], Kiev, Nizhniy Novgorod, Rostov-on-Don, Urumqi, Mineralniye Vodi, Milan, New York, Beijing, London and Paris. [http://www.ba.com British Airways] flies seven days a week to Baku. Lufthansa also has a couple flights a week to Baku (which continue onwards to [[Ashgabat]]). Turkish Airlines is another carrier connecting Baku with and via Istanbul. Also, there are several Russian, Ukrainian, Uzbek, Iranian, and Austrian airlines connecting Baku with several cities of the world.\nQatar Airways flies to Baku with 2 flights a day, one to Tbilisi and one to Doha connecting to their global network. The cheapest option to fly from Europe is Wizzair from Budapest to Baku.\n\n===By train===\nTrains connect Azerbaijan with [[Georgia_%28country%29|Georgia]] and [[Russia]]. \n\nThere is an overnight train connecting [[Tbilisi]], [[Georgia_%28country%29|Georgia]] and Baku. Heading out of Azerbaijan, this costs 26AZN and departs nightly from Baku at 20:00. The time of the trip varies considerably based on how long is spent at the border (longer when entering Azerbaijan). Be careful on your visa as the train does not arrive at the border until the next day. They will boot you off the train and make you take a taxi to the border control (50km away from the border) and then you need to take a taxi back to the border (50 euro, May 2014). This segment of track is currently being modernized as part of a project, financed in part by Azerbaijan, which includes the construction of a rail segment from Akhalkalaki, Georgia with [[Kars]], [[Turkey]]. Originally scheduled to open in 2010, it is now planned to finish in 2017 connecting the railways of Azerbaijan with Turkey via Georgia. Look out for Baku-Istanbul service once completed.\n\nThere is a domestic train line running from Astara on the Iranian border to Baku and there are high hopes to get a 300km connector line built from Astara to [[Qazvin]], [[Iran]] to connect the Azerbaijani and Iranian rail networks. Rail service to Iran, which once existed from Nakhchivan after crossing through southern Armenia, was severed after the border with Armenia was closed.\n\n===By bus===\nThere are buses that run daily from [[Georgia_%28country%29|Georgia]], [[Turkey]], [[Iran]] and [[Russia]] to Azerbaijan.\n\nA minibus also runs from the Georgian border at Krazny Most (Red Bridge) and should cost about AZN10 or 12 (or GEL25). It can be picked up at either side of the border (don't worry if they ask you to pay on the Georgian side - they turn up to pick you up. Insist on bringing your own bags across, however). Journey time to Baku should take about 8 hours. Be warned, driving in Azerbaijan is a ''genuinely scary'' experience. Virtually all drivers have scant regard for the rules of the road and the standard of the roads themselves is shockingly poor. It is emphatically not for the faint-hearted, so whilst the long train might challenge your stamina your nerves should remain intact. Check AZAL flights from Tbilis-Baku well in advance for some reasonable deals.\n\nReturn minibuses to Tbilisi can be caught at the indescribably chaotic bus station, which doubles up as an eerily quiet shopping-centre  (take bus 65 from outside Double Gate in the old town for the 20min trip, which leaves you with a 400m long dodgy stretch of road/highway with pestering taxi-drivers on which to walk: Cost 20q) or simply taxi it from the centre for approx. AZN15 (worth it!), which saves on hassle. Both buses and minibuses are available from this station direct to Tbilisi, price approx AZN12 for both. Bus counter 26 at very back of ground floor. The bus is a few hours slower and not guaranteed to pick you up once you cross the Georgian border, so minibus is preferable.\n\n===By car===\nThe safest way to rent a car is to reserve it through rental offices at the airport or online reservation in advance through AVIS, Expedia and etc. While using taxi services UBER and Taxify are preferable, simple taxis may overcharge. If you are using one of \"London\" Taxi services make sure that driver turned on the counter. There are no card payments in taxi cars, except online payment on UBER or Taxify. There is no Lyft in Azerbaijan. The best way to reach the city center from the airport is to use Airport Express (Hava Limani Express) buses which cost about 1.20 AZN.\n\n===By boat===\n'''There is currently no ferry or cruise service with any other country on the Caspian.''' Be forewarned that the much talked about \"ferries\" on the Caspian are simply cargo ships with some extra space to take on passengers. Getting a ride on one of these \"ferries\" is no easy task. First you must find the notoriously difficult to find ticket office, which basically keeps track of ships which are departing. If you manage to find the ticket office and manage to get a booking, you still have little idea of when the ship will depart. Give them a phone number to reach you and be prepared, they may call you an hour or two prior to departure...two days after the first departure the office gave you and the day before the second departure date they gave you! This is only the first of you troubles. After paying for your place on the boat (about USD50-100), the captain and perhaps other crew members will expect an additional amount to get a bed and a shower. You are expected to bring your own food. The crossing will only take 1 day (Turkmenistan) or 2-3 days (Kazakhstan). Most ships go to Turkmenistan, where ships must wait for an open berth...so you can wait 2-5 days on the boat just waiting for a place to dock! Unless you are on a ''very'' small budget or have a bike and especially if you are on a short time schedule, you should pay twice as much (c. USD200-250) for a one way airfare to Kazakhstan, Russia, or Tashkent, Uzbekistan.\n\n==Get around==\n[[Image:Khinaliq road.jpg|thumb|250px|Mountain road leading to [[Khinalug]].]]\n\n===By road===\nThe total of 31,800km of \"paved\" roads includes some all-weather gravel-surfaced roads and many \"unpaved\" roads are made of un-stabilised earth and are difficult to negotiate in wet weather.\n\nBuses, minibuses (marshrutka), and taxis connect most cities. There is often a hub such as a bus station near the bazaar in these cities. The fares for buses and minibuses are posted usually in both old and new manat (qepik). Taxis, on the other hand, require negotiating skills, and this usually takes a proficiency in the language that ordinary non-Azeri/Russian/Turkish speakers do not have.\n\nThere are roads to all cities of Azerbaijan. They are not really wide and most of them have only two lanes.  \n\nLocal travel agents can arrange private cars to the borders.  Some Georgian travel agents such as  [http://concordtravel.ge Concord Travel] can arrange to pick you up in Baku and then go to [[Tbilisi]].  Although more expensive than bus or train, it will be faster and can be combined with sightseeing along the way. \n\nIf you decide to rent a car, there are a growing number of car rental companies, including  Europacar,  [http://naniko.az Naniko Rent a Car] and others throughout central Baku.\n\n===By train===\n\n==Talk==\n[[Azerbaijani phrasebook|Azerbaijani]] is the official language. This is a Turkic language, closely related to Turkish itself. However, English is spoken in most places popular for tourists within the capital city. In all fast-food places within Malls, in all middle and upper-class restaurants, English service is provided, and a menu is written also in English. During city walks, if you need to ask something try to reach young people aged between 16-26, as they are English educated generation. If you are planning to travel to regions make sure that you know basic Azerbaijani phrases. Most people speak Russian (which is now declining and slowly being replaced by English), especially in the capital city, Baku. Turkish is mutually intelligible with Azerbaijani, so people will likely understand you as long as you stick to simple words and speak slowly.\nDue to the political reasons (Russia's policy towards Azerbaijan is covertly hostile) many Azerbaijanis speak Russian reluctantly.\n\n==See==\n[[Image:Atesgah Baku Fire Temple.jpg|thumb|250px|Atesgah of Baku (the \"Fire Temple\") is a 16th century Zoroastrian compound near Baku.]]\n\n==Do==\n*Visit Maiden Tower, Baku for wonderful views of the city\n\n*Visit Gobustan [http://www.gobustan.info] open air rock art preserve and modern museum located in Gobustan National Park \n\n*Try to attend an Azerbaijani Wedding\n\n*Take in the breathtaking views of Flag Square, Baku Crystal Hall and the Caspian Sea from Martyr's Alley\n\n*Wander around the Old Town, Baku aimlessly - really try to get lost and soak up the atmosphere in this wonderful old town\n\n*Visit the beautiful Palace of the Shirvanshahs (entry fee 10 AZN (Oct 2017), extra for camera)\n\n*Walk along the promenade, just as the locals do\n\n*Contrary to reports, Azeri wine is more than drinkable and is a pleasant treat! Find a local drinking-hole and while away the hours!\n\n*Buy local souvenirs and carpets. Don't be put off by the pestering stall-keepers. Persevere and get some really wonderful bargains!\n\n*The Petroglyphs at Gobustan\n*<do name=\"Equestrian Federation of Azerbaijan Republic\" alt=\"RATM\" address=\"\" directions=\"20min taxi ride from Sheki. \" phone=\"050 409 96 18 / 070 409 96 18 / 99444 277 0053\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">Horseback riding tours around Sheki and in the Caucasus Mountains, offered by the polo and horse riding club.</do>\n\n==Shopping==\n\n==Buy==\n'''Currency''': New Azerbaijani manat (Yeni Manat)\n\n'''Currency code''': '''AZN'''\n\n'''Exchange rates''' (approximate, January 2018):\n* GBP1 = AZN 2.31\n* €1 = AZN 2.02\n* USD1 = AZN 1.70 For more rates please visit the [http://www.cbar.az/other/azn-rates/?language=en web page of the Central Bank of Azerbaijan Republic]\n\nKeep in mind that import and export of big amounts of manat '''is strictly forbidden'''.\n\n'''Economy - overview''': Azerbaijan's number one export is oil. Azerbaijan's oil production declined through 1997 but has registered an increase every year since. Negotiation of production-sharing arrangements (PSAs) with foreign firms, which have thus far committed $60 billion to oilfield development, should generate the funds needed to spur future industrial development. Oil production under the first of these PSAs, with the Azerbaijan International Operating Company, began in November 1997. Azerbaijan shares all the formidable problems of the former Soviet republics in making the transition from a command to a market economy, but its considerable energy resources brighten its long-term prospects. Baku has only recently begun making progress on economic reform, and old economic ties and structures are slowly being replaced. An obstacle to economic progress, including stepped up foreign investment in the non-energy sector, is the continuing conflict with Armenia over the Nagorno-Karabakh region. Trade with Russia and the other former Soviet republics is declining in importance while trade is building with Turkey and the nations of Europe. Long-term prospects will depend on world oil prices, the location of new pipelines in the region and Azerbaijan's ability to manage its oil wealth.\n\n==Eat==\n[[Image:Azerbaijan Light snack.jpg|thumb|250px|Appetizers and snacks.]]\nCabbage, grape leaves, and eggplant wrapped meat (''kelem, yarpaq, badimjan - dolmasi''), kabab (''kebab''), rice with different variety of toppings (''plov'' - It is said that ''plov'' is the king of Azerbaijani cuisine), ''gutab''s and meatballs (''kufta'') are some of the several specialties of Azerbaijan. \n\nBread is a staple, and is quite revered by the people of Azerbaijan.  \n\nGeorgian food, in particular kajpuri (a cheese-filled bread), along with some Russian staples (borsh, creps) have become common throughout Azerbaijan. Other cuisines such as Turkish, Italian, Asian, Western & fast food, along with Asian food can be found in Baku.\n\n==Drink==\nSome local drinks include ayran (a yogurt drink based on sour milk) and sherbet (made from rose petals or saffron). There are also different sorts of quite decent wines produced from local grapes and a wide array of mineral waters from natural springs.\nIn some areas of Azerbaijan the markets offer lemonades (limonat/dushes) made from pears or taragon.\n\n==Sleep==\nThere is a good selection of hotels in [[Baku]], including many Western chains, but options elsewhere in the country are limited.  Prices for the hotels start from USD60 and higher.  Rental apartments might be a good choice as they are cheaper than hotels and sometimes are even more comfortable.\n\n==Learn==\nYou can get the information you need about Azerbaijan from the hotels where you will stay. They have different guides for Azerbaijan. Also at some new bus stations in Baku there are maps of the capital.\n\n==Work==\nThere is a great deal of work to be done in Azerbaijan from teaching and NGO work to work in the oil and tourism sectors.\n\n==Stay safe==\nRobbing and pickpocketing in the capital Baku, especially in poor and sparsely populated areas is possible but rare and is higher across the capital at night. Common sense is useful as in all other countries. Also watch your stuff in public transport. \n\nCorruption is widespread. But as a foreigner you have a fairly strong position in refusing to pay \"hörmet\" (bribe). Never give any bribe. Often Azeris are so ashamed of their corrupt economy, that they might hide it from you anyway.\n\n===Safety tips===\n*Try to travel outside the city  during the day time, unless taking a night train. The roads can be treacherous at night due to unseen potholes and dimly lit cars.\n\n===Emergency contact numbers===\n* Ambulance: 103\n* Fire: 101\n* Gas Emergency 104\n* Speaking Clock 106\n* Police: 102\n\nYou must speak in Azeri, Turkish or Russian to communicate your needs. It would be a good idea to memorize key phrases before coming to Azerbaijan - see the [[#Talk|'''Talk''' section]] for phrase books.\n\n==Stay healthy==\nMake sure your diphtheria, tetanus, and Hepatitis A and B immunisations are up to date. Malaria is a risk in lowland Azerbaijan, particularly around the border with [[Iran]]. Anti-malarials are not a ''must'' for [[Baku]], but the risk is present in rural areas not far from the city.\n\nWater should not be consumed unless from a sealed bottle. Bottled soft drinks or boiled drinks, such as tea or coffee, also reduce risks.\n\n==Respect==\n[[Image:Ayriliq Korpusu.jpg|thumb|250px|Bridge of Separation (\"Ayriliq Korpusu\") on the Iranian border which, through two treaties, separated the Azeri people between Persia & Russia.]]\nAzerbaijanis are a very reserved but very polite and well mannered people.\n\n[[Image:Petroglyphs of Qobustan.jpg|thumb|250px|Petroglyphs of Qobustan]]\n\n===Things to do===\n* '''Women in Azerbaijan are traditionally treated with the utmost respect''', as is also the case in the entire CIS/former USSR area. Female travellers should not act surprised or indignant when their Azerbaijani male friends pay their bills at restaurants, open every door in front of them, offer their hand to help them climb down that little step or help them carry anything heavier than a handbag - this is not sexual harassment or being condescending to females. Male travellers should understand that this is exactly the sort of behaviour that most Azerbaijani girls and women will expect from them, too. \n\n* '''When you are invited into an Azerbaijani home, make sure to bring them a gift'''. Anything is fine from flowers (be sure to get an odd number of flowers, as an even number is associated with funerals) to chocolate (but not wine or other alcoholic beverages), and indeed something representative from your country. In Azerbaijani culture it is the thought behind the gift, rather than the price, that matters.  And if you really want their respect, thank your host for the invitation and compliment them. The host will make sure to make you feel at home, so don't take advantage of their kindness. \n\n* '''When you arrive at the house take off your shoes''' just outside or immediately inside the door, unless the owner explicitly allows you to keep them on. Even then, it might be more polite to remove your shoes. You may be offered slippers to wear. Do not worry that your feet will get dirty - the floors are just as clean as the walls - Azerbaijanis are very neat and clean people.\n\n* '''Azerbaijanis respect elderly people''', so in a bus, tram, subway and in other forms public transportation, young(er) people will always offer you a place to sit if you are an old(er) person as well as a handicapped person or a pregnant woman or have children with you. \n\n* It is respectful to bend slightly (not a complete bow) when greeting someone older or in a position of authority.  Younger people always initiate greetings with older people or those in a position of authority.\n\n* As mentioned above, it is considered polite to let women first to board and leave the bus, tram, subway and in other forms public transportation or to enter and leave a room.\n\n* If you do not know the person well, use their first name followed by an appropriate honorific. For women, use \"'''Xanım'''\" - pronounced \"''hanm''\" (\"Mrs.\"). For men, use \"'''Cənab'''\" - pronounced \"''jenab''\" (\"Mr\"). If they do speak English use their last name preceded by the appropriate English honorific \"Mr.\" or \"Mrs.\". The English honorific \"Ms.\" does not exist in the Azerbaijani language, as women are '''not''' distinguished according to married and unmarried status and addressing a young woman \"Ms\" would be considered inappropriate and offensive.\n\n===Things to avoid===\n\n'''Politics:'''\n\n*'''At all costs, do not insult or speak badly of the president''', as well as the '''Aliyev family''' in general. This carries a prison sentence, or if you are a foreign citizen, the remote possibility of deportation from the country.\n\n*'''At all costs, do not mention or speak positively about Armenia.''' Azerbaijan has lost control of a fifth of its territory and it must support thousands of refugees that have been displaced by the conflict, and discussing anything about Armenia or the Nagorno-Karabakh conflict is bound to make many Azerbaijanis emotionally hostile and aggravated. Antipathy and hatred towards Armenia and Armenians run very high.   \n\n*'''At all costs, do not insult or speak badly of the country or its people'''. Azerbaijanis in general have some very patriotic and nationalistic views of their nation and would view any criticisms of their country very negatively. To avoid getting onto the bad side of the locals, it's advisable to praise the country wherever necessary, and keep any negative sentiments to yourself. If you're in doubt, always ask. Azerbaijanis are always happy to explain things wherever necessary. \n\n'''Symbols:'''\n* '''Do not desecrate or insult the national flag.''' Azerbaijanis will be very offended. \n\n* '''Do not mock or insult the national anthem.''' Azerbaijanis will be very offended. \n\n'''Religion:'''\n\n* Even though 95% of the population is officially '''Islam''', Azerbaijan is officially a strictly '''secular state''' is by and large a'''agnostic and non-religious nation'''. This is true not only in large cities but even in villages and rural areas as well. Don't assume that anyone you do not know believes in God or has a passion for Islam or in other faiths. Investigations into people's faith are largely unwelcome, and outside places of worship, displays of your faith should be kept private. Any religious signs, flags, slogans in public are prohibited by law, and you might get fine or deportation for violation. However, it is ok to have small neckles with your religious symbol, just don't wear shirts or hats or cary a flag with religious symbols. Those with long beards may arouse the suspicion of the authorities. Respect that and you will also be respected.\n\n'''Social custom and etiquette breaches:'''\n\n* '''Don't blow your nose during meals''', even discreetly. \n\n* '''Don't pick your teeth during meals''', even discreetly. \n\n* '''Don't put your feet up while sitting and try not to show the bottom of your feet to someone'''. \n\n* '''Don't point with your finger at someone''', even discreetly. \n\n* '''Don't chew gum while having a conversation''' and during public occasions. This is considered extremely rude.\n\n* '''Don't touch females without permission'''. This is considered extremely rude. However, note that if anyone stepped on your foot they will immediately hold your hand for a second or so. It is custom and even strange to you people will do that as a sign of apology and respect. But prefer just to say sorry when you stepped on someone's foot, not everyone likes touching.\n\n* '''Don't bear hug or back slap someone''', especially in formal situations and occasions and with someone you just met and/or you do not know well enough. This would be a very awkward situation. Do not hug or touch female without their contest, it would be extremely rude. \n\n* '''Don't raise your voice or shout in public''', especially on public transportation. \n\n* '''Give a seat to women, parents with small kids, and elderly people on public transportation, try to hold doors for them, and give a right of way unless you are on the line.''' It is custom in this country, and people around will feel disrespected if you will not do so. Women and Elderly people are highly respected in Azerbaijan. \n\n* '''Don't use swear words''' during conversation or while talking to oneself in public.\n\n===Other things to watch for=== \n* '''Don't smile at a stranger in the street'''. If you do they may not respond in kind and they will regard you as odd. Smiling at a stranger in public is not done and will be considered inappropriate. Smiling is traditionally reserved for family and friends; smiling at a stranger without addressing them will be considered offensive, as they will either think that you are making fun of them and there is something wrong with their clothes or hair. Furthermore, an automatic \"Western smile\" (ie grinning) is widely regarded as insincere, as in \"You don't really mean it\". However, a sincere polite smile is appropriate and will be appreciated when addressing a person. Smiling is still very rare in customer service as sales assistants, public servants and the like are expected to look serious and businesslike. On television, news presenters, weather presenters very rarely smile. Hence the very common misconception about Azerbaijanis is that they are a cold people and never smile - they do, once they get to know you and become very welcoming and kind. \n\n* '''Never refuse a handshake''' it would be insulting to local people. Majority of male locals will offer you a handshake as welcoming. You also may offer a handshake while welcoming someone. However, it is not preferable to offer a handshake to a woman.\n\n* '''Public displays of affection''' in larger cities and tourist resorts is tolerated but might invite unnecessary stares from the public. In more rural areas it is frowned upon and is to be avoided. Gay and lesbian travelers should avoid any outward signs of affection, as this will definitely invite unnecessary stares from the public. However overt displays of affection regardless of sexual orientation is regarded as inappropriate.\n\n* '''You will notice how Azerbaijanis tend to keep their voices down in public places'''. Do not raise your voice in a conversation. A decent silent conversation is the Azerbaijani way of doing business and will be much appreciated. Talking on a mobile phone on public transportation and in restaurants is considered normal, unless the conversation is loud and too \"private\". \n\n* '''Littering is considered very bad manners''' and you may be fined. There are many waste containers and trash cans on the sidewalks and near most stores.\n\n===Gay and lesbian travellers===\nHomosexuality is no longer criminalized in Azerbaijan, but the negative stigma still is strong throughout Azerbaijan. Same-sex relationships are not recognized by the government and showing your orientation openly is very likely to draw stares and whispers.  The few establishments geared towards homosexuals are almost (if not exclusively) in Baku and and are mostly underground.  Azerbaijan is not the happiest place in the world for LGBT travellers; be quite cautious when travelling as a LGBT traveller.\n\n==Contact==\nThere are three mobile operators: Azercell, Bakcell, Nar Mobile.  Each network has its own 3 digit code that's different for each operator followed by the 7 digit long subscriber number. For example (050) xxx xxxx, (051) xxx xxxx, or (055) xxx xxxx, or (070) xxx xxxx, or (077) xxx xxxx\nYou can buy cards for use with different operators almost in every store. (See note below)\nAll of them have LTE (4G) network.\n\n*Azercell is the largest one. To dial an Azercell number you need to dial (050) or (051) and then the number. Only with Azercell can you talk in the metro (subway) in Baku. \n*Bakcell is OK. It works almost everywhere and is cheaper than Azercell. To dial a Bakcell number you need to dial (055) and then the number. \n*Nar Mobile is pretty cheap but doesn't work in some regions. For dialling Nar Mobile numbers you need to dial (070) and then the number. \n*'''If you need local sim card:''' Since February 2017 it is impossible to buy a local simcard for a short time tourist. But Azercell offers \"Guest Pack\" sim, which costs 17 AZN ($10) and includes 10 GB of data and 20 mins of international calls. You can obtain it in their shops with your international passport.\n \n===Area Codes===\nAgjabedi\t113,\t\nAgdam\t\t192,\t\nAgdash\t        193,\t\t\nAgsu\t\t198,\t\nAgstafa\t        244,\t\t\t\nAstara\t\t195,\nBabek\t\t136,\t\nBakou\t\t12,\nBalaken\t        119,\t\nBerde\t\t110,\nBeylagan\t152,\t\nBilesuvar\t159,\nDashkesen\t216,\nDevechi\t        115,\t\t\nFizuli\t\t141,\nGandja\t\t22,\nGedebey\t        232,\t\nGoranboy\t234,\nGoychay\t        167,\t\nHajigabul \t140,\nHoradiz\t        141,\t\nİmishli\t\t154,\nİsmayilli\t178,\t\nJebrayil\t118,\t\nJelilabad\t114,\nJulfa\t\t36,\t\nKelbejer\t137,\nKurdemir\t145,\t\nLachin\t\t146,\nLenkeran\t171,\t\nLerik\t\t157,\nMasalli\t\t151,\t\nMereze\t\t150,\nMingechevir\t147,\t\nNabran\t\t156,\nNaftalan\t255,\t\nNakhchivan\t136,\nNeftchala\t153,\t\nOguz\t\t111,\nOrdubad\t        136,\t\nQakh\t\t144,\nQazakh\t        279,\t\nQazi Memmed\t140,\nQebele\t\t160,\t\nQobustan\t150,\nQuba\t\t169,\t\nQubadli\t        133,\nQusar\t\t138,\t\nSaatli\t\t168,\nSabirabad\t143,\t\nSalyan\t\t163,\nSamukh\t        265,\t\nSederek\t        136,\nShahbuz\t        136,\t\nShamakhi\t176,\nSheki\t\t177,\t\nShemkir\t        241,\nSherur\t\t136,\nShirvan\t        197,\nSiyezen\t        190,\nSumqayit\t18-64,\t\nShusha\t\t191,\nTerter\t\t246,\t\nTovuz\t\t231,\nUjar\t\t170,\t\nKhachmaz\t172,\nKhankendi\t162,\t\nKhanlar\t        230,\nKhizi\t\t199,\t\nKhojali\t\t102,\nKhudat\t\t172,\t\nYardimli\t175,\nYevlakh\t        166,\t\nZagatala\t174,\nZengilan\t196,\t\nZerdab\t\t135.\n\n{{isPartOf|Caucasus}}\n{{outline}}\n{{Countryguide}}\n\n[[ca:Azerbaidjan]]\n[[de:Aserbaidschan]]\n[[eo:Azerbajĝano]]\n[[es:Azerbaiyán]]\n[[fi:Azerbaidžan]]\n[[fr:Azerbaïdjan]]\n[[hi:अज़रबैजान]]\n[[hu:Azerbajdzsán]]\n[[it:Azerbaijan]]\n[[ja:アゼルバイジャン]]\n[[nl:Azerbeidzjan]]\n[[pl:Azerbejdżan]]\n[[pt:Azerbaijão]]\n[[ru:Азербайджан]]\n[[sv:Azerbajdzjan]]\n[[wts:Category:Azerbaijan]]\n\n\n[[WikiPedia:Azerbaijan]]\n[[Dmoz:Asia/Azerbaijan/]]"
        }
    }
}