{
    "parse": {
        "title": "Cape Verde",
        "pageid": 328,
        "wikitext": {
            "*": "{{pagebanner|Cape Verde banner.jpg}}\n{{cautionbox|The CDC has identified [[Cape Verde]] as an affected area of the Zika outbreak. Pregnant women are advised to be cautious as the virus can lead to birth defects. Adults affected by the virus experience fever, rash, joint pain, and conjunctivitis (red eyes) typically lasting a week.  You can learn more by visiting [http://www.cdc.gov/zika/index.html the official CDC website].}}\n\n{{quickbar\n| image=Fort Real de Sao Felipe, Cape Verde.jpg\n| caption=Fort Real de São Felipe, Saotiago\n| location=Cape Verde in its region.svg\n| flag=Flag of Cape Verde.svg\n| capital=[[Praia]] (moved from [[Cidade Velha]] in 1770)\n| government=republic\n| currency=Cape Verdean escudo (CVE)\n| area=4,033 sq km\n| population=506,000* <sleep name=\"\" alt=\"\" address=\"\" directions=\"\" phone=\"\" lat=\"\" long=\"\" tollfree=\"\" email=\"\" fax=\"\" url=\"\" checkin=\"\" checkout=\"\" price=\"\"></sleep> (August 2013 est.)\n| language=[[Portuguese]], Kriolu\n| religion=Roman Catholic (infused with indigenous beliefs); Protestant (mostly Church of the Nazarene)\n| electricity=220V/50Hz (European plug)\n| timezone=UTC -1\n| callingcode=+238\n| tld=.cv\n}}\n\n'''Cape Verde''' [http://www.anv.cv/] (Portuguese: ''Cabo Verde'', Kriolu: ''Kabu Verdi'') is a country in [[West Africa]]. It comprises a group of [[islands of the Atlantic Ocean]], west of [[Senegal]].  It is part of the region of Islands collectively known as Macaronesia.\n\nDespite its remoteness in elevation with all but 3 islands being mountainous, the lack of natural resources, its isolation from many other countries, and devastating famines in the later 20th century, Cape Verde has won a positive reputation in promoting what is considered the most stable democracy in Africa, a standard of living higher than most African nations, and one of the most politically liberal nations on the continent, and in the world. \n\n==Understand==\nCape Verde (pop. 506,000) is located 500 km from the west coast of Africa.  The once uninhabited islands were discovered and colonized by the [[Portugal|Portuguese]] in the 15th century; they subsequently became a trading center for African slaves and later an important coaling and re-supply stop for whaling and transatlantic shipping. Independence was achieved in 1975.\n\nMost Cape Verdeans have both African and Portuguese antecedents. \n\n===Climate===\nCape Verde’s climate is tropical, with a warm, dry summer. As a part of the greater Sahel region of Africa precipitation is meager and falls between the months of June to February, peaking in September.\n\nSome islands see almost no rain, these are Sal, Boa Vista and Maio; these are arid. The islands with the most rain fall are Santiago, Fogo and Santo Antao, but are nonetheless semi-arid.\n\n===Holidays===\nThe national holiday is the 5th of July, Independence Day.\n\n==Regions==\n\nCape Verde is formed by 10 main islands and about 8 islets. The main islands are (clockwise from northwest):\n\n{{Regionlist\n| regionmap=Cabo Verde regions map.png\n| regionmaptext=\n| regionmapsize=380px\n\n| region1name=[[Santo Antão]]\n| region1color=#d5dc76\n| region1items=\n| region1description=Great hiking.\n\n| region2name=[[São Vicente]]\n| region2color=#709ea3\n| region2items=\n| region2description=With the cultural capital of [[Mindelo]].\n\n| region3name=Santa Luzia\n| region3color=#ac5c91\n| region3items=\n| region3description=Santa Luzia is uninhabited but can be visited as a day trip from [[São Vicente]].\n\n| region4name=[[São Nicolau]]\n| region4color=#d09440\n| region4items=\n| region4description=Rural mountainous island based on agriculture. A quiet and relaxed get away.\n\n| region5name=[[Sal]]\n| region5color=#578e86\n| region5items=\n| region5description=Has great beaches, water sports and resorts aplenty.  \n\n| region6name=[[Boa Vista (Cape Verde)|Boa Vista]]\n| region6color=#71b37b\n| region6items=\n| region6description=Even nicer beaches. Great scuba diving\n\n| region7name=[[Maio]]\n| region7color=#b383b3\n| region7items=\n| region7description= Even more nice beaches.\n\n| region8name=[[Santiago (Cape Verde)|Santiago Island]]\n| region8color=#8a84a3\n| region8items=\n| region8description=The first island settled in Cape Verde. It holds the current capital [[Praia]], the original capital [[Cidade Velha]], and the bulk of the nation's population.\n\n| region9name=[[Fogo]]\n| region9color=#4f93c0\n| region9items=\n| region9description=A spectacular volcano island which erupted as recently as November 2014.\n\n| region10name=[[Brava]]\n| region10color=#d56d76\n| region10items=\n| region10description=A small island only accessible by boat and is a great place to get away from it all.\n\n}}\n\n==Cities==\n* There are 24 cities in Cape Verde.\n\n* [[Praia]] – the capital, on [[Santiago (Cape Verde)|Santiago Island]] \n* [[Mindelo]] – port city on [[São Vicente]], probably the country's liveliest\n* [[Cidade Velha]] (Ribeira Grande) – A historic town on [[Santiago (Cape Verde)|Santiago]]\n* [[Espargos]] is the capital of [[Sal]] where the airport is and [[Santa Maria]] is the main tourist area at the south of the island\n* [[Assomada]] is the seat of municipality of [[Santa Catarina]] on [[Santiago (Cape Verde)|Santiago]]\n* [[Santa Maria (Cape Verde)|Santa Maria]] - former administrative capital and the most populous city on [[Sal]]\n* [[Sao Filipe]] - historic town on [[Fogo]]\n\n==Other destinations==\n*[[Brava]], the smallest island, is a botanist's paradise, home to many unique flora that live in its misty forests \n*'''Pico de Fogo''' - an active volcano on [[Fogo]] that has created a unique landscape best explored on foot or horseback\n\n==Get in==\n\n===Visas===\nIf you are arriving from a country with a Cape Verde embassy, you are required to purchase a visa in advance (though visitors from countries with an embassy seem to be allowed to purchase the visa in the airport). Otherwise, a visa can be purchased on arrival. The visa costs 25€. It is recommended that you carry exact change with you to purchase the visa.  \n\nThe Cape Verde Bureau (Cape Verde Consul) in Liverpool, <b>England</b> provides travel visas for travellers from the UK and Ireland.\n\nCape Verde has an embassy in Lisbon, Portugal. [http://www.embcv.pt/lista_sub.asp?idarea=5&idsub=780]\n\nCape Verde has an embassy in Brussels, Belgium.\n\nCape Verde has an embassy in Geneva, Switzerland.\n\nCape Verde has a consulate in Rotterdam[http://www.conscv.nl/servicosconsulares/vistos.html], The Netherlands.\n\nCape Verde has an embassy in Washington, D.C., USA\n\nCape Verde has a consulate in Quincy, MA, USA\n\nCape Verde has a consulate in Moscow, Russia. [http://cv-consul.ru/en_visa.htm]\n\nCape Verde has an embassy in Brasília, Brazil. [http://www.embcv.org.br/portal/modules/mastop_publish/?tac=Visto]\n\nCape Verde has a consulate in Vienna, Austria. [http://www.konsulat-kapverde.meixner.at/]\n\nCape Verde has an embassy in New Delhi India : 6/24 shanti niketan, new delhi\n\n===By plane===\nCape Verde has international airports on the islands of Sal, Santiago, Boa Vista and São Vicente. Connections to Europe, Africa, and the Americas.\n\nNot all the connections are visible to travel booking websites, it is usually worth checking with a travel agent.\n\n====From Europe====\n\nThere are regular flights from [[Amsterdam]], [[Lisbon]] (daily), [[Madrid]], [[Milan]], [[Munich]], and [[Oporto]] operated by  TACV [http://www.flytacv.com/].\n\nTransavia flies twice a week from [[Amsterdam]] to the island of [[Sal]]. Plus there are flights from Paris (ORLY Sud) to Sal and Boa Vista [http://www.transavia.com/].\n\nTAP Portugal [http://www.flytap.com/] flies from [[Lisbon]].\n\nJetairfly [http://www.jetairfly.com/] has cheap flights from [[Brussels]] to [[Sal]] and [[Boa Vista (Cape Verde)|Boa Vista]].\n\nTUIfly [http://www.tuifly.com/] has cheap flights from various German cities and [[Basel]] to [[Sal]] and [[Boa Vista (Cape Verde)|Boa Vista]].\n\nBinter Canarias [https://www.bintercanarias.com/] flies twice a week, for as low as 100€, to [[Praia]] from [[Gran Canaria]], Spain.\n\nThere are several options to fly from the UK. [[London]], [[Manchester]] and [[Birmingham]] all have non-stop flights to Cape Verde with TUI [http://flights.thomson.co.uk/en/index.html].\n\n====From the Americas====\n\nThere are regular flights from [[Boston]] (weekly), [[Fortaleza|Fortaleza (Brazil)]] (weekly).\n\nStarting in June 2015 TACV will offer two weekly flights from Providence (PVD) on a 757 (210 seat) aircraft to the city of Praia (RAI) on the island of Santiago on Tuesdays and Fridays through June 30th. A third weekly flight on Wednesdays  will be added during the peak travel season of July through early September.\n\n====From Africa====\nWest Africa is also serviced by the oldest functioning and leading regional airline TACV Cabo Verde Airlines.\n\nRoyal Air Maroc[http://www.royalairmaroc.com/] fly from [[Casablanca]].\n\n===By boat===\nThere are only infrequent, expensive connections to the mainland.\n\n==Get around==\nTimetables in Cape Verde are not to be taken too seriously - don't be too surprised if that boat departs ''ahead'' of schedule . This is important to consider if you decide to do some island-hopping. Due to weather and other conditions flights may be delayed or canceled. Carry your toothbrush with you and build in some buffer time to your planning especially if you need to meet an international connection.\n\n===By plane===\nTACV Cabo Verde [http://www.flytacv.com/] airlines has regular flights between the majority of the islands.\n\nIf you can afford to wait until you arrive, domestic tickets are cheaper if purchased in Cape Verde.\n\nIf your international flights are booked with TACV, you can purchase a Cabo Verde Air Pass for flights within 21 day period. Price start at €110 for two coupons and €60 for every extra coupon.\n\nTACV flights can be rebooked for 2,000$.\n\n*TACV Cabo Verde Islands [http://www.flytacv.com/]\n*TACV Air Pass [http://www.flytacv.com/promo.html]\n*TACV (German Site) [http://www.tacv.de/]\n*Cabo Verde Express [http://www.caboverdeexpress.com]\n\n===By boat===\nThere are ferry services between the islands.  Depending on the distance between the islands you are going from and to, flying can be significantly shorter but also significantly more expensive.\n\nPrivate Yacht. Cape Verde is a popular transit stop off for yachts that cross the Atlantic Ocean bound for the Caribbean.  In November the ARC+ rally and the Cornell Odessey all arrive at the marina in Mindelo whilst those not part of an organised rally anchor locally.  Requirements for entry of private yachts is relatively easy with immigration and customs offices in Mindelo and Praia.  Special permission is required to visit some islands, obtained from the local Police.\n\n===By taxi===\nNice, new taxis are available in the major cities and are metered.  \n\n''Aluguers'', which are usually either open back pickup trucks with bench seats or 15 passenger Toyota vans, tend to travel between more rural destinations, particularly on Santo Antão. Also called ''hices'' (due to its model, Toyota Hiace), they work as a collective taxi: they drive by the main streets, usually near the city market, and they announce the final destination from the window, gathering passengers. They depart when they are full, which may take some time.\n\n==Talk==\n\nThe official language is '''[[Portuguese phrasebook|Portuguese]]''', used in all official publications and announcements as well as in business, media and schools, but the local language is '''Cape Verdean Creole''' (''Kriolu kabuverdianu''), a Portuguese-based creole language with 95% of the words from Portuguese and the rest mainly from West African languages. It is divided into 9 dialects spoken on various parts of the country. Even though Kriolu is comprehensible to a skilled Portuguese-speaker, almost all people can also ''speak'' Portuguese as a second language. French is also known by many, and some people also speak English.\n\nIt is a good idea to know some Kriolu or at least Portuguese, since even though young urban people are often quite proficient in English, this does not apply to old and rural people, and even those who can speak English will highly appreciate any attempt you do to speak Kriolu or Portuguese.\n\n==See==\n\n==Do==\n* Game fishing\n* Kite surfing\n* Jetskiing and other water sports\n* Canyoning in Santo Antao\n* Hiking on Fogo: [http://fogo-guide.appspot.com/tour.html here some proposals]\n\n==Buy==\n\n* famous Coffee of Fogo\n* Wine from Cha das Caldeiras/Fogo\n* Grogue (local term for rum)\n* Cans of local tuna\n\n===Currency===\nThe official currency of Cape Verde is the escudo, abbreviated CVE and indicated with a cifrão (a symbol similar to the dollar sign, but with two vertical strokes instead of one) after the amount. The currency is fixed against the euro at 110$ per euro.\n\nIn the resort islands of Sal and Boa Vista, euros are commonly accepted, although you might receive change in escudos.\n\nMoney can be changed from all major currencies at the international airports at Sal and Praia. Bank branches at larger towns will also change money. Larger towns also have ATMs that will take Visa, MasterCard and Maestro.\n\nHigh end hotels will accept credit cards. Other hotels will expect cash although many mid-range ones will accept euros at a reasonably exchange rate (slightly worse than the banks). For everything else, expect to pay in escudos.\n\n===Costs===\nSince most goods are imported, the cost of living is moderate to high. On the island resorts of Boa Vista and Sal, the cost of living oftentimes can be compared to their Caribbean counterparts. The island of Santiago is reasonably the least expensive.\n\n==Eat==\nCape Verde has fantastic fresh seafood. Tuna is common, as is Wahoo - a white fleshed fish with similar texture.\n\n*'''Lagostada''' – a lobster dish\n\n*'''Cachupa''' - the national dish made with maize and potato. Fish or chicken commonly added for flavor.\n\n*'''Tosta mista''' - common toasted ham and cheese sandwich.\n\nEuropean food is common on all the islands.  Italian is especially popular on Sal.  Vegetarians can ask for omelets or salads.\n\n==Drink==\n* '''Beer''': Strela is a Cape Verdean beer, produced by the Sociedade Cabo-verdiana de Cerveja e Refrigerantes (SCCR).\n* '''Grogue''', also known as grogu or grogo (derived from English grog), is a Cape Verdean alcoholic beverage, an aguardente made from sugarcane. Its production is fundamentally artisanal.\n* '''Ponche''' is a Cape Verdean cocktail which includes grogue, lime and molasses.\n* '''Caipirinha''', from the Portuguese caipira for hillbilly, is a cocktail popular throughout the former Portuguese colonies. Made with cachaça (white lightning), sugar and lime. Specifically with cachaça, the alcohol results from the fermentation of sugarcane juice that is afterwards distilled\n* You can easily find international beers and other drinks, including some from Portugal.\n* Local '''wine''' from Fogo: Ch&atilde; (red, white, rosé), Saudade, Manecom\n* '''Bottled water''', most of the islanders drink desalinated water, for those who have a hard time adjusting to this bottled water is available. Please recycle.\n\n== Sleep ==\n \nThere are plenty of hotels and guest houses throughout the archipelago. Though the largest hotels are based on the islands of Sal (Riu Funana and Garopa hotels--1000 rooms combined), and Boa Vista (Riu Touareg--881 rooms).\n\nIn the last decade a number of private villa resorts have been developed across the Islands, most notably on Sal, however with the 2008 property crash now subsiding a number of new private villas, townhouses and apartments in luxury resort communities have come onto the holiday rental market with many of the new resorts now on islands other than Sal.  [http://www.capeverdeprivaterentals.com Cape Verde Private Holiday Rental Villas]\n\n==Learn==\nThere are 10 universities including institutes in the country. The largest universities are: University of Cape Verde and Jean Piaget University of Cape Verde.\n\n==Work==\nThe Cape Verdean economy is largely service-based, i.e., most Cape Verdeans work in industries, hospitals, transportation and tourism related activities.\n\n==Stay safe==\nCrime rates are relatively low. \n\nBe careful in lonely areas. Don't showcase jewelry, expensive watches etc.\nMostly you are secure in an attendance of a local guide of your trust.\n \nThe emergency number is 132.\n\n==Stay healthy==\nIn the resorts, the tap water is usually desalinated and safe to drink. In other areas, bottled water is cheap and commonly available.\n\n==Respect==\nPeople are mostly polite and friendly. \nSenegaleses immigrants will try to sell you something. If you refuse, they will invent stories about the hardship of their families. It is your decision to buy something, but important to bargain.\n\n==Contact==\nThe telephone system is effective and improving. There is mobile phone coverage in all cities and most towns. Check with your provider as to the roaming costs.\n\nConsider whether a local SIM-Card is benifical for you because of exorbitant roaming costs.\n\nThe country also has Internet service provider. \n\nYou will be friendly helped to prepaire you device for telephone and internet in the telephone shop.\n\nPerhaps helpful (in German): [http://www.kapverden.de/forum/dies-und-das-f8/umts-3-g-t2346.html]\n\nSome hotels offer WLAN.\n\n{{outline}}\n{{isPartOf|West_Africa}}\n{{countryguide}}\n\n\n\n[[ca:Cap Verd]]\n[[de:Kap Verde]]\n[[eo:Kabo-Verdo]]\n[[es:Cabo Verde]]\n[[fi:Kap Verde]]\n[[fr:Cap-Vert]]\n[[hu:Zöld-foki Köztársaság]]\n[[it:Capo Verde]]\n[[ja:カーボベルデ]]\n[[nl:Kaapverdië]]\n[[pl:Republika Zielonego Przylądka]]\n[[pt:Cabo Verde]]\n[[ru:Кабо-Верде]]\n[[sv:Kap Verde]]\n[[zh:佛得角]]\n[[wts:Category:Cape Verde]]\n\n\n[[WikiPedia:Cape Verde]]\n[[Dmoz:Africa/Cape Verde/]]"
        }
    }
}