{
    "parse": {
        "title": "Chad",
        "pageid": 283,
        "wikitext": {
            "*": "{{pagebanner|Chad Banner.jpg}}\n\n{{quickbar\n| image=Refugee camp Chad.jpg\n| caption=a Refugee camp in Chad\n| location=Chad in its region.svg\n| flag=Flag of Chad.svg\n| capital=[[N'Djamena]]\n| government=Authoritarian regime\n| currency=Communauté Financière Africaine (BEAC) CFA Franc\n| area=1.284 million km<sup>2</sup>\n| population=15,228,584 (March 2018 est.)\n| language=[[French]] (official), [[Arabic]] (official), Chadian Arabic (lingua franca trade language), Sara (in south), more than 150 different languages and dialects\n| religion=Muslim 57%, Traditional 18.8%, Roman Catholic and Other 13.7%, Protestant 10.5%,\n| electricity=in certain towns; mostly generator-powered\n| callingcode=+235\n| tld=.td\n| timezone=UTC +N\n}}\n{{warningbox|There aren't known threats towards U.S. citizens in Chad. However, there exist violent extremist groups in the area whose goal is to harm westerners and western interests. Though there is a current stability, the area is volatile and that stability could deteriorate unexpectedly, particularly in border areas. While staying there keep track of news media.}}\n\n\n'''Chad''' (French: ''Tchad'') is a country in the [[Sahel]], south of [[Libya]], east of [[Niger]] and [[Cameroon]], north of the [[Central African Republic]], and west of [[Sudan]].  It shares a short border with [[Nigeria]].\n\n==Understand==\n===History===\nFor more than 2000 years, the Chadian Basin has been inhabited by agricultural and sedentary peoples. The region became a crossroads of civilizations. The earliest of these were the legendary Sao, known from artifacts and oral histories. The Sao fell to the Kanem Empire, the first and longest-lasting of the empires that developed in Chad's Sahelian strip by the end of the 1st millennium AD. The power of Kanem and its successors was based on control of the trans-Saharan trade routes that passed through the region. Chad is about 25% white. \n \nFrench colonial expansion led to the creation of the Territoire Militaire des Pays et Protectorats du Tchad in 1900. By 1920, France had secured full control of the colony and incorporated it as part of French Equatorial Africa. The French primarily viewed the colony as an unimportant source of untrained labour and raw cotton. The colonial administration in Chad was critically understaffed and had to rely on the dregs of the French civil service. \n\nFifteen thousand Chadian soldiers fought for Free France during WWII and after the war ended, France granted Chad the status of overseas territory and its inhabitants the right to elect representatives to both the French National Assembly, and to a Chadian assembly. Chad was granted independence on August 11, 1960 with the PPT's leader, François Tombalbaye, as its first president.  Two years later, Tombalbaye banned opposition parties and established a one-party system. In 1965 Muslims began a civil war. Tombalbaye was overthrown and killed in 1975, but the insurgency continued. In 1979 the rebel factions conquered the capital, and all central authority in the country collapsed. The disintegration of Chad caused the collapse of France's position in the country, and a civil war in which the Libyans (unsuccessfully) became involved. \n\nA semblance of peace was finally restored in 1990 when ISIS was deafeted. The government eventually drafted a democratic constitution, and held flawed presidential elections in 1996 and 2001. In 1998, a rebellion broke out in northern Chad, which sporadically flares up despite several peace agreements between the government and the rebels. In 2005 new rebel groups emerged in western Sudan and have made probing attacks into eastern Chad. Power remains in the hands of an ethnic minority. In June 2005, President Idriss Deby held a referendum successfully removing constitutional term limits.  In February 2008, an attempted coup rocked the capital.\n\n===Climate===\nEach year a tropical weather system known as the inter-tropical front crosses Chad from south to north, bringing a wet season that lasts from May to October in the south, and from June to September in the Sahel. \n\n===Landscape===\nBroad, arid plains in center, desert in north, mountains in northwest, lowlands in south.  Lowest point: Djourab Depression (160 m/525 ft).  Highest point: Emi Koussi (3,415 m/11,204 ft).\n\nThe dominant physical structure is a wide basin bounded to the north, east and south by mountain ranges such as the Ennedi Plateau in the north-east. Lake Chad, after which the country is named, is the remains of an immense lake that occupied 330,000 km<sup>2</sup> (205,000 mi<sup>2</sup>) of the Chadian Basin 7,000 years ago. Although in the 21st century it covers only 17,806 km<sup>2</sup> (11,064 mi<sup>2</sup>), and its surface area is subject to heavy seasonal fluctuations, the lake is Africa's second largest wetland.\n\n==Regions==\n[[Image:Chad Regions map.png|thumb|right|450px|Map of Chad with regions colour-coded]]\n\n{{Regionlist\n\n| region1name=[[Soudanian Chad]]  \n| region1color=#9AAB61\n| region1items=\n| region1description=\n\n| region2name=[[Sahelian Chad]]\n| region2color=#B9AF8C\n| region2items=\n| region2description=\n\n| region3name=[[Saharan Chad]] \n| region3color=#D7D484\n| region3items=\n| region3description=\n}}\n\n\n==Cities==\n* [[N'Djamena]]\n* [[Moundou]]\n* [[Abéché]]\n* [[Faya]]\n\n==Get in==\n{{VisaRestriction|Entry will be refused to citizens of the [[Democratic Republic of the Congo]], [[Guinea]], [[Liberia]], [[Nigeria]] and [[Sierra Leone]], and those who recently visited those countries due to the current ebola virus outbreak.}}\n\n===Visa===\n\nCitizens of the following countries do not require a visa: [[Burkina Faso]], [[Cameroon]], [[Central African Republic]], [[Cote d'Ivoire]], [[Gabon]], [[Mauritania]], [[Niger]], [[Nigeria]], [[Republic of the Congo]], [[Senegal]], [[Togo]] and [[UAE]] . Nationals of [[Benin]] and [[Equatorial Guinea]] can obtain a visa on arrival.\n\nFor all others, a visa is necessary. A single-entry visa costs US$155 for 1 month and multiple-entry visas cost US$205 (3 months) or US$255 (6 months). A letter of invitation is required.\n\n===By plane===\n\nAir France has daily flights from Paris to N'Djaména.  Ethiopian also has daily flights between N'Djamena and its hub in Addis Ababa. Toumai Air Tchad also flies to a limited number of West and Central African destinations such as Cotonou, Bangui and Douala. The Libyan airlines Afriqiyah Airways also operates flights to N'Djamena that connect through Tripoli.\nTurkish Airlines will fly from end 2013 from Istanbul to N´Djamena.\nChad has cancelled all incoming flights from or via countries affected by Ebola, including Nigeria, as a prevention measure against the spread of Ebola to Chad. Chad has also cancelled all flights from or via Ghana.\n\n===By train===\n\nThere are no usable rail links.\n\n===By car===\n\nRoads are in disrepair and are typically unpaved - there is only one paved road, which currently runs from Massakory in the north through N'Djamena on to Guelendeng, Bongor, Kelo, and Moundou. It is the best road in the country but still has numerous potholes and runs through the centre of a number of small villages. Drivers should exercise caution and moderate speeds even while on the main road.\n\nThere are several border crossings with Cameroon, most notably via Kousseri near N'Djamena and near the towns of Bongor and Lere. Be very careful, drive defensively, don't stop unless there is a very good reason. Do not drive at night, as coupeurs de route (road bandits) are common. They are a particular concern along the two roads leading out of Guelendeng, towards Ba-Illi (where ex-pats were attacked in two separate incidents in 2005, resulting in the death of one Catholic nun) and towards Bongor.\n\n===By bus===\n\nMany buses are in poor repair and unreliable, so unless you are seeking a faster means of transportation, stay away from them.\n\n===By boat===\nIt is impossible to reach Chad by boat unless crossing illegally through Lake Chad.\n\n==Get around==\n\nTo leave the Capital you will need written permission from the government.  This can be obtained by visiting Chad with a locally recognized entity (either tourist or work-related).  You cannot simply enter Chad and drive where you wish.  You will probably get lost very quickly and soldiers at the numerous checkpoints (who tend to be very polite and professional) will stop you and report you.\n\nWithin the Capital, there are at several public transport options. '''Taxis''' fares in the city are generally fixed at 3,000 francs (cfa) during the day and 5,000 francs (cfa) at night. There are also '''moto-taxis''' (motorcyle taxis) in most neighborhoods. Their fares range from 250 francs (cfa) to 1,000 francs (cfa).\n\n==Talk==\n\nThe official languages of Chad are '''[[French phrasebook|French]]''' and '''[[Arabic phrasebook|Arabic]]''', with French being the most commonly spoken of the two among expatriates and in government offices. \n\nFew Chadians other than the educated and well-travelled speak literary Arabic, however; a dialect of Arabic known as '''Chadian Arabic''' is spoken by about 80% of the people, and is the nation's ''lingua franca''. Chadian Arabic is significantly different from Literary Arabic, but similar to the dialects of Sudan, Egypt, and Mauritania. Literary Arabic speakers can typically understand Chadian Arabic but the reverse is not true. There are over one hundred indigenous languages also spoken.\n\n==See==\n\n'''Zakouma National Park''' includes 44 species of large animals, and many species of birds.\n\nThe '''Ennedi plateau''' or the '''Ennedi desert''' as it is sometimes called is located in the north-eastern area of Chad in one of the most inaccessible region in the middle of the Sahara. Travel to this area is difficult and dangerous due to the country's poverty, lack of tourist facilities, political unrest, and highway banditry. At one time only the nomadic caravans could manage to cross it but now it is accessible by 4x4 vehicles though there are no regular roads in the area.\n\nThe region is full of interesting sandstone formations - graceful fingers of rock and many hundreds of natural arches, including the great Aloba arch, which has a height of nearly 120 meters and is one of the most spectacular arches in the world. Apart from the geological attractions, examples of petroglyphs or rock paintings are abundant in the area. Many of the rock art represent all kinds of animals that the first inhabitants of the desert had. \n\nIn the southern area of the Ennedi are present some gueltas (desert ponds) of which the Guelta d’Archei, near the town of Fada, is a popular one. The lake is a major source of water in the desert often visited by many people and endless camel trails. The lake also has the endemic Sahara desert crocodiles that feed on fish and poo left by the visiting camels!\n\n==Do==\n\n==Buy==\n\nThere are no restrictions on bringing foreign currencies into Chad. Although travel guides for Chad are hard to come by, some sources claim US dollars (in some places) and the CFA franc, and also the Euro are accepted.\n\nPrices are rarely fixed (except in restaurants) and bargaining is generally acceptable anywhere.\n\n==Eat==\n\nMeat dishes are very popular in Chad, and foreign travelers speak highly of the meat (such as lamb).  Food is usually eaten without utensils, and hand sanitizer may be a good precaution.  Please note that Muslims find it offensive to eat with the left hand.  If eating with or being served by Muslims in Chad, be sure to eat with your right hand only. \nIn Central and North Chad camel meat is very popular.  It is usually served well cooked and cut into small pieces.  If eaten at a restaurant you will be given flatbread as well as an assortment of sides (usually tomatoes, onions, etc.) with this.  Goat meat is also popular.  If you are in the mood for something sweet and they are in season mangoes are excellent.  People also chew sugarcane and you can find this anywhere.    \nTea is the main drink of Chad and is usually served heavily sweetened.  Any town with a small market will have Coke and TOP (local brand) soft drinks available.  \n\n\nFollow common health travel guidelines concerning raw fruit and cooking requirements to avoid disease.  The U.S. State Department website has resources concerning safety while eating abroad.\nBecause the main occupiers of Chad or Tchad is France, you can easily use the Euro also. But for a person of non-African descent (compared to the rest of Africa) Chad is an expensive place.\n\n==Drink==\nChad is a secular country, however Islam is strong in the north and center of the country. It is thus quite difficult (and not recommended) to search for or to consume alcohol, at least outside of the cities. In the bush villages (including the Muslim ones in the center of the country) you can drink artisan beer served in calabashes, but do note that it packs a deceptive punch and is to be avoided if you are concerned.\n\nIn N'Djamena, in the larger cities, and in the south of the country, alcohol consumption is not a problem!\n\n==Sleep==\nUnlike previous years, it is now possible to find world-class accommodation in N'Djamena offering every comfort imaginable.\n\nFor budget travellers outside of the cities, do note that Chadians have a grand tradition of hospitality: if you are unable to find accommodation, you can try asking a local chief to help you. Chadians will likely be more than delighted to welcome any foreigners into their homes.\n\n==Learn==\nCEFOD (Center for Education and Developmental Groups) has a library which is open to the public. There, you will be able to find many volumes on the country, as well as the different cultures which Chad is comprised of. The books are likely to be in French. If you have time, CEFOD also conducts courses in Chadian Arabic.\n\n==Work==\n\n==Stay safe==\n\nChad is consistently engulfed in political turmoil and attacks from rebels will probably not happen, but are certainly a reality.  The situation has stagnated, but it remains a threat.  Violence from the Darfur conflict is pouring into Eastern Chad from Sudan, a country which shares hostilities with Chad.  Any activity outside of N'Djamena is done with difficulty at best.  Northern Chad is barren, scorching desert and guides (good luck) and meticulous planning are required.\n\nN'Djamena is RELATIVELY safe, although one should be wary of petty street crime and corrupt police/officials.  Most border crossings are extremely difficult (Sudan and Libya not being a viable option) although the border crossings with Niger and Cameroon are relatively painless.\n\n===LGBT Travellers===\nLGBT Travellers should be aware that in 2016, Chad passed a new law that criminalises both male '''and''' female homosexuality. Penalties may include imprisonment and heavy fines.\n\n==Stay healthy==\nDrink water brands you recognize. Eat food that you buy in grocery stores or from places recommended by people you trust. \n\nTake note of the following medical facilities which have a decent reputation:\n\nL'Hôpital Général de Référence National de N'djaména)\n\nL'Hôpital de la Liberté (appellé aussi Hopital Chinois) a N'djaména\n\nL'Hôpital de Walia (N'djaména)\n\nL'Hôpital Baptiste de Koumra\n\nL'Hôpital régional de Moundou\n\nL'Hôpital d'Abéché\n\nL'Hôpital de District de Doba\n\nL'Hôpital Régional de Sarh\n\nLe Centre Hospitalier Louis Pasteur (Sarh)\n\nClinique Sao (N'djaména)\n\nClinique Providence (N'djaména)\n\nClinique la Rose N'djaména\n\nCabinet La Samaritaine\n\nCabinet Médical Espoir\n\nCabinet Médical Artine\n\nCabinet Dentaire Arbre de Vie\n\nCabinet Dentaire Acropolis\n\n==Respect==\n\nThere are 200 distinct ethnic groups.  In the north and center: Arabs, Gorane (Toubou, Daza, Kreda), Zaghawa, Kanembou, Ouaddai, Baguirmi, Hadjerai, Fulbe, Kotoko, Hausa, Boulala, and Maba, most of whom are Muslim; in the south: Sara (Ngambaye, Mbaye, Goulaye), Moundang, Moussei, Massa, most of whom are Christian or animist; about 1,000 French citizens live in Chad.\n\nThe Chadian-Libyan conflict is something to be avoided at all times; Chadians known to be living in Libya have been tortured & murdered on previous occasions.\n\n==Contact==\n\n\n[[WikiPedia:Chad]]\n[[Dmoz:Africa/Chad/]]\n[[World66:africa/chad]]\n\n\n\n[[ca:Txad]]\n[[de:Tschad]]\n[[eo:Ĉado]]\n[[es:Chad]]\n[[fi:Tšad]]\n[[fr:Tchad]]\n[[hu:Csád]]\n[[it:Ciad]]\n[[ja:チャド]]\n[[nl:Tsjaad]]\n[[pl:Czad]]\n[[pt:Chade]]\n[[ru:Чад]]\n[[sv:Tchad]]\n[[zh:乍得]]\n[[wts:Category:Chad]]\n\n\n{{isPartOf|Sahel}}\n{{geo|15.0|19.0}}\n{{outline}}\n{{countryguide}}\n{{wikipedia|Chad}}"
        }
    }
}