{
    "parse": {
        "title": "Costa Rica",
        "pageid": 320,
        "wikitext": {
            "*": "{{pagebanner|Costa Rica Banner.jpg}}\n\n{{quickbar\n| image=DirkvdM_orosi_valley_bird.jpg\n| location=LocationCostaRica.png\n| flag=cs-flag.png\n| capital=[[San Jose (Costa Rica)|San Jose]]\n| government=Democratic Republic\n| currency=Costa Rican colón (₡, CRC)\n| area=51,100km²\n| population=4,301,712 (2011 Census)\n| language=Spanish (official), Limonese creole (Mekatelyu) spoken in [[Limón Province]]\n| religion=Roman Catholic 76.3%, Evangelical 13.7%, other Protestant 0.7%, Jehovah's Witnesses 1.3%, other 4.8%, none 3.2%\n| tld=\n| electricity=\n| callingcode=+506\n| timezone=CST(UTC -6)\n}}\n\n[http://www.visitcostarica.com/ '''Costa Rica'''] ([[Spanish]]: ''Costa Rica'' or ''República de Costa Rica'', pronounced ''[reˈpuβlika ðe ˈkosta ˈrika]'') is a small country in Central America bordered by [[Nicaragua]] to the north, [[Panama]] to the south, the Pacific Ocean to the west, and the Caribbean Sea to the east.\n\n==Understand==\nCosta Rica is officially known as the '''Republic of Costa Rica''' \n\nSince the late 1980s [[Costa Rica]] became a popular nature travel destination, and its main competitive advantage is its well-established system of national parks and protected areas, covering around 23.4% of the country's land area, the largest in the world as a percentage of the country's territory, and home to a rich variety of flora and fauna, in a country that has only 0.03% of the world's landmass, but that is estimated to contain 5% of the world's biodiversity. The country also has plenty of world renowned beaches, both in the Pacific Ocean and the Caribbean Sea, within short travel distances between both coasts both by air and land, and also several active [[volcano|volcanoes]] that can be visited with safety.\n\nBy the early 1990s, Costa Rica became known as the poster child of [[ecotourism]]. According to the '''Costa Rican Tourism Board''', 46% of international tourists visiting the country in 2009 engaged in activities related to ecotourism, including trekking, flora, fauna, and bird watching, and visits to rural communities. However, most visitors look for adventure activities, which Costa Rica offers as well. Costa Rica was included by ''Ethical Traveler magazine'' in the 2011 and the 2012 list of ''The Developing World's 10 Best Ethical Destinations''.\n\nCosta Rica historically managed to stay away from the political turmoil and violence from which neighbouring nations still suffer. The nation constitutionally abolished its army permanently in the 1940s. It has also managed to be the only Latin American country included in the list of the world's 22 oldest democracies, paying homage to its stance as a peaceful and politically stable nation. Costa Rica has also consistently been among the top Latin American countries in the Human Development Index, and is cited by the UNDP as one of the countries that has attained much higher human development than other countries at the same income levels.\n\nCosta Rica is ranked third in the world and first among the Americas in terms of the ''2010 Environmental Performance Index''. And the New Economics Foundation (NEF) ranked Costa Rica as the happiest nation in the world, both in 2009 and in 2012. This same organization (NEF) ranked Costa Rica as the \"greenest\" country in the world. Among budget travelers and increasingly among ordinary tourists Costa Rica is ranked as the most expensive country in Central America and perhaps in the whole of Latin America. Wine, chocolate, coffee, entrance fees for national parks, are expensive compared to prices in Western Europe and North America. \n\nThis nation has bewilderingly diverse culture, climates, flora, fauna, and landscapes. From rain forests, to dry tropical and temperate forests, to volcanoes, to Caribbean and Pacific beaches, to high mountains, and marshy lowlands. \n\n===History===\nCosta Rica has a rich and vibrant history that first marked the history books on September 18th 1502. This date was when the land mass was first discovered by Christopher Columbus. Originally the land belonged to the four tribes of Carib, Boruca, Chibcha and Diquis Indians (The Carib met Columbus as he landed there and showed him the island). There is also further evidence to suggest that the country had human life up to 10,000 years prior. Although it cannot be pinpointed to an exact date this is the closest scientists can estimate intelligent lifeforms living in the territory. The name Costa Rica (Rich Coast) was given to the land by a Spanish man who noticed the heavy golden jewelry that the Indians wore. When the Spaniards started to move into Costa Rica to colonize the territory in 1524, many of the indigenous people died from disease or moved away. This did not lead to a huge rise in immigration because there was not many resources from the land to make a profit on. The people there lived a simple life with the bare minimum and worked to sustain themsleves. Many only moved there to further their claims in Central America where the gold and silver was heavily mined. Others used it as a stepping stone to reach Mexico, Central America and North America. Juan Vasquez De Coronado created the first city in 1562, before that it had only been small communities and towns. Later on in 1821 Costa Rica successfully declared independence from Spain and two years later after disputes in the capitol declined to be a part of Mexico. In 1848 \"Don Pepe\" took charge of the country and Costa Rica became a republic. This granted voting right to minorities and established rules and regulations to check and balance the country when needed. It then hit a peaceful period which some would call \"neutral.\" Peace and stability reigned over the land and prevented uneccessary conflicts. This is when Costa Rica constitutionally and permanently abolished its army in 1949. Finally in the 1970's the economy there took a serious hit and instead of relying on exports, the country now looks to the mass tourism it receives every year.\n\n===Geography===\nCosta Rica is located on the [[Central America|Central American isthmus]], lying between latitudes '''8°''' and '''12°N''', and longitudes '''82°''' and '''86°W'''. It has a total of 1,290 kilometres (800&nbsp;mi) of coastline, 212km (132&nbsp;mi) on the Caribbean coast and 1,016km (631&nbsp;mi) on the Pacific.\n\nCosta Rica also borders Nicaragua to the north (309km or 192&nbsp;mi of border) and Panama to the south-southeast (639km or 397&nbsp;mi of border). In total, Costa Rica comprises 51,100 square kilometres (19,700&nbsp;sq&nbsp;mi) plus 589 square kilometres (227&nbsp;sq&nbsp;mi) of territorial waters.\n\nThe highest point in the country is [[Chirripo National Park|Cerro Chirripó]], at 3,819 metres (12,530&nbsp;ft); it is the fifth highest peak in Central America. The highest volcano in the country is the Irazú Volcano (3,431m or 11,257&nbsp;ft). The largest lake in Costa Rica is [[Lake Arenal]].\n\nCosta Rica also comprises several islands. [[Cocos Islands|Cocos Island]] (24 square kilometres / 9.3 square miles) stands out because of its distance from the continental landmass, 480km (300&nbsp;mi) from [[Puntarenas]], but Calero Island is the largest island of the country (151.6 square kilometres / 58.5 square miles).\n\nNear 25% of Costa Rica's national territory is protected by '''SINAC''' (the ''National System of Conservation Areas''), which oversees all of the country's protected areas. \n\n[[Image:Laguna azul, Rio Celeste, Parq Tenorio.jpg|upright=1.7|thumb|Celeste River, located at [[Tenorio Volcano National Park]], is among the most popular destinations by both foreign and domestic tourists]]\n\n===Flora and fauna===\nCosta Rica is one of the world's most popular destinations for eco-tourists because of its biodiversity. Costa Rica possesses the greatest density of species in the world, and around 25% of its national territory is protected by a system of conservation areas and national parks. It has been stated in various places that Costa Rica may contain as much as 6% of the world's plant and animal species. Both tropical plant and animal species abound in Costa Rica. Some of the more impressive plants range from huge ficus trees with epiphytes abounding on their limbs to approximately 1500 different orchids. The animals are equally as impressive, whether it's a jaguar (the largest cat in the New World), the ever-elusive Margay, or the wonderful birds like the green or scarlet macaws (''lapas'' in Costa Rican Spanish.) The amphibians are also quite impressive; the poison dart frogs with their bright colors are bound to catch your attention, or the giant cane toads.\n\n[[File:Tucan in Costa Rica 2.png|thumb|upright=1.3| Toucan]]\n\n===Climate===\nBecause Costa Rica is located between eight and 12 degrees north of the Equator, the climate is Tropical year round. However, the country has many microclimates depending on elevation, rainfall, topography, and by the geography of each particular region.  \n\nCosta Rica's seasons are defined by how much rain falls during a particular period and not to the four seasons in the Northern Hemisphere. The year can be split into two periods, the dry season known to the residents as summer, and the rainy season, known locally as winter. The \"summer\" or dry season goes from December to April, and \"winter\" or rainy season goes from May to November, which almost coincides with the List of Atlantic hurricane seasons, and during this time, it rains constantly in some regions.\n\nThe location receiving the most rain is the Caribbean slopes of the Central Cordillera mountains, with an annual rainfall of over 5000 mm. Humidity is also higher on the Caribbean side than on the Pacific side. The mean annual temperature on the coastal lowlands is around 27°C, 20°C in the main populated areas of the Central Cordillera, and below 10°C on the summits of the highest mountains.\n\n'''Costa Rica Weather Averages''' \n\n<TABLE border=\"0\" align=\"center\" cellpadding=\"3\" cellspacing=\"1\" bgcolor=\"#dddddd\">\n              <TR bgcolor=\"#000080\">\n                <TD align=\"middle\" bgcolor=\"#019B00\">Months</TD>\n                <TD align=\"middle\" bgcolor=\"#019B00\">January</TD>\n                <TD align=\"middle\" bgcolor=\"#019B00\">February</TD>\n                <TD align=\"middle\" bgcolor=\"#019B00\">March</TD>\n                <TD align=\"middle\" bgcolor=\"#019B00\">April</TD>\n                <TD align=\"middle\" bgcolor=\"#019B00\">May</TD>\n                <TD align=\"middle\" bgcolor=\"#019B00\">June</TD>\n                <TD align=\"middle\" bgcolor=\"#019B00\">July</TD>\n                <TD align=\"middle\" bgcolor=\"#019B00\">August</TD>\n                <TD align=\"middle\" bgcolor=\"#019B00\">September</TD>\n                <TD align=\"middle\" bgcolor=\"#019B00\">October</TD>\n                <TD align=\"middle\" bgcolor=\"#019B00\">November</TD>\n                <TD align=\"middle\" bgcolor=\"#019B00\">December</TD>\n              </TR>\n              <TR bgcolor=\"#ffffff\">\n                <TD><FONT size=\"2\"><STRONG>High Temperature (C)</STRONG></FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF9900\"><FONT size=\"2\">27 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF9900\"><FONT size=\"2\">27 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF6600\"><FONT size=\"2\">28 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF6600\"><FONT size=\"2\">28 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF9900\"><FONT size=\"2\">27 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF9900\"><FONT size=\"2\">27 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF9900\"><FONT size=\"2\">27 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF9900\"><FONT size=\"2\">27 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF9933\"><FONT size=\"2\">26 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF9933\"><FONT size=\"2\">26 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF9933\"><FONT size=\"2\">26 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF9933\"><FONT size=\"2\">26 </FONT></TD>\n              </TR>\n              <TR bgcolor=\"#ffffff\">\n                <TD><FONT size=\"2\"><STRONG>Low Temperature (C)</STRONG></FONT></TD>\n                <TD align=\"center\" bgcolor=\"#0099FF\"><FONT size=\"2\">17 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#0066FF\"><FONT size=\"2\">18 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#0066FF\"><FONT size=\"2\">18 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#0066FF\"><FONT size=\"2\">18 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#0066FF\"><FONT size=\"2\">18 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#0066FF\"><FONT size=\"2\">18 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#0066FF\"><FONT size=\"2\">18 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#0066FF\"><FONT size=\"2\">18 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#0099FF\"><FONT size=\"2\">17 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#0066FF\"><FONT size=\"2\">18 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#0066FF\"><FONT size=\"2\">18 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#0066FF\"><FONT size=\"2\">18 </FONT></TD>\n              </TR>\n              <TR bgcolor=\"#ffffff\">\n                <TD><FONT size=\"2\"><STRONG>Precipitation (mm)</STRONG></FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF3300\"><FONT color=\"#FFFFFF\" size=\"2\">6.3 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF3300\"><FONT color=\"#FFFFFF\" size=\"2\">10.2 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF3300\"><FONT color=\"#FFFFFF\" size=\"2\">13.8 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF3300\"><FONT color=\"#FFFFFF\" size=\"2\">79.9 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#000099\"><FONT color=\"#FFFFFF\" size=\"2\">267.6 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#000099\"><FONT color=\"#FFFFFF\" size=\"2\">280.1 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#000099\"><FONT color=\"#FFFFFF\" size=\"2\">181.5 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#000099\"><FONT color=\"#FFFFFF\" size=\"2\">276.9 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#000099\"><FONT color=\"#FFFFFF\" size=\"2\">355.1 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#000099\"><FONT color=\"#FFFFFF\" size=\"2\">330.6 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#000099\"><FONT color=\"#FFFFFF\" size=\"2\">135.5 </FONT></TD>\n                <TD align=\"center\" bgcolor=\"#FF3300\"><FONT color=\"#FFFFFF\" size=\"2\">33.5 </FONT></TD>\n              </TR>\n              <TR bgcolor=\"#ffffff\">\n                <TD><FONT size=\"2\"><STRONG>Average Percent Sunshine</STRONG></FONT></TD>\n                <TD align=\"center\"><FONT size=\"2\">40</FONT></TD>\n                <TD align=\"center\"><FONT size=\"2\">37</FONT></TD>\n                <TD align=\"center\"><FONT size=\"2\">39</FONT></TD>\n                <TD align=\"center\"><FONT size=\"2\">33</FONT></TD>\n                <TD align=\"center\"><FONT size=\"2\">25</FONT></TD>\n                <TD align=\"center\"><FONT size=\"2\">20</FONT></TD>\n                <TD align=\"center\"><FONT size=\"2\">21</FONT></TD>\n                <TD align=\"center\"><FONT size=\"2\">22</FONT></TD>\n                <TD align=\"center\"><FONT size=\"2\">20</FONT></TD>\n                <TD align=\"center\"><FONT size=\"2\">22</FONT></TD>\n                <TD align=\"center\"><FONT size=\"2\">25</FONT></TD>\n                <TD align=\"center\"><FONT size=\"2\">34</FONT></TD>\n              </TR>\n          </TABLE>\n\n== Regions ==\n{{Regionlist\n| regionmap=Costa Rica regions map.png\n| regionmaptext=Map Showing Regions\n| regionmapsize=upright=1.7\n\n| region1name=[[Caribbean Costa Rica]]\n| region1color=#8f9fd1\n| region1items=\n| region1description=The least visited region of the country, owing to its relative isolation (and mosquitoes), which has great opportunities for whitewater rafting and sea turtle spotting\n\n| region2name=[[Central Valley (Costa Rica)|Central Valley]]\n| region2color=#b6d18f\n| region2items=\n| region2description=The population centre of Costa Rica. The capital and main airport is located here.\n\n| region3name=[[Central Pacific]]\n| region3color=#bfb191\n| region3items=\n| region3description=Perhaps one of the most visited regions of the country. There are many beaches, tourist accommodations, and national parks.\n\n| region4name=[[Guanacaste]]\n| region4color=#d1be8f\n| region4items=\n| region4description=The \"dry region\" of Costa Rica, with few rains any time of year, fabulous beaches and surfing, and some large volcanic and dry forest parks in the North by the [[Nicaragua]]n border\n\n| region5name=[[Plains of the North]]\n| region5color=#d18f97\n| region5items=\n| region5description=A sparsely populated, but beautiful and mountainous region, most famous for its active volcano, Arenal, and the surrounding hot springs and volcanic lakes\n\n| region6name=[[South Pacific Costa Rica]]\n| region6color=#91bf96\n| region6items=\n| region6description= One of the most bio-diverse environments on the planet, full of exotic endemic flora and fauna, and some of the planet's most beautiful and remote tropical beaches\n}}\n\n==Cities==\n<!--This list may not exceed nine cities. If you think this list should be altered, please first discuss your proposed changes on the talk page. -->\n\n* [[San José (Costa Rica)|San José]] - The capital.\n* [[Cartago]] - Costa Rica's first capital\n* [[Dominical]] - the South Pacific coast's largest city, among incredibly biodiversity and natural beauty\n* [[Alajuela]] - location of Juan Santamaría International Airport\n* [[Heredia]] - Coffee plantations\n* [[Liberia (Costa Rica)|Liberia]] - Location of Daniel Oduber International Airport and gateway to the beaches of [[Guanacaste]], such as [[Samara]], [[Nosara]], Carillo \n* [[Puerto Limón]] - Main city on the Caribbean side\n* [[Puntarenas]] - Ferry to [[Nicoya Peninsula]]\n* [[Quesada]] - the largest city by far in the country's North, surrounded by hot springs popular with Costa Rican vacationers\n\n==Other destinations==\n[[File:Arenal Volcano.jpg|thumb|upright=1.3| Arenal Volcano]]\n<!--This list may not exceed nine destinations. If you think this list should be altered, please first discuss your proposed changes on the talk page. -->\n\n* [[Cahuita National Park]]\n* [[Chirripo National Park]]\n* [[Cocos Island National Park]]\n* [[Corcovado National Park]]\n* [[Fortuna (Costa Rica)|Arenal Volcano]] - active volcano\n* [[Manuel Antonio|Manuel Antonio National Park]]\n* [[Monteverde and Santa Elena Cloud Forest Reserves]]\n* [[Pacuare River and Protected Zone]]\n* [[Rincón de la Vieja Volcano National Park]]\n\n==Get in==\nMost visitors can get into Costa Rica without the need of a Visa and can stay in the country for 90 days. People of ANY nationality holding valid US, Canada, Japan, South Korea or Schengen visas do not need a prior visa. The only conditions being that the visa must be valid for 3 months and should be stamped in your passport.\n'''NOTE''': on arrival, ensure you are able to show proof of onward travel out of Costa Rica, especially if entering overland! See below for further details\n\nCosta Rica requires valid Yellow fever certificate if arriving from most neighbouring countries. If such is not presented you would not be allowed to enter/board the flight. At Bogota airport - if you have certificate you can have it emailed to the airline and then proceed to the local vaccination authority for duplicate certificate to be issued free of charge. The critical part is to get the printed version on time. If you don't have certificate or cannot get it on time you will probably be approached by friendly police officers to arrange such for a fee. Keep in mind that the date of the vaccination should be at least 10 days prior entering the country from which you are flying. \n\nAnother way to get to Costa Rica that many people are unaware of is travelling by car and driving the Pan-American highway that stretches from Alaska all the way to Southern Panama and passes right through Costa Rica. If you enter Costa Rica by car, crossing the border with Nicaragua at Peñas Blancas, expect it to take 3-6 hours. All passengers have to leave the car with their luggage and pass it through a scanner, the car and driver goes through a different scanner, you line up for passport control, fill in several forms for the car, find an official who stamps and signs every form etc.  Everything is chaotic, totally inefficient and obviously corrupt. The procedure is repeated on the other side of the border. Take note that a car insurance, written in Spanish and mentioning explicitly that it is valid for Costa Rica, will not be accepted, you have to buy a new one and pay 37 dollars.\n\nAs of November 2012 to cross the border you need to show a return ticket from Costa Rica. The ticket must be \"from Costa Rica\", so for example flights from Panama are not accepted, although you need to leave Costa Rica to get to Panama. At the border crossing with Nicaragua there is a small Tica Bus office that sells tickets without a fixed travel date. At the main border crossing with Panama there is a Tracopa office where you can buy a return ticket without a fixed date. Note that if you use this ticket when re-entering from Nicaragua they want to see a ticket with a fixed date.\n\nNote that occasionally, immigration officials will stop buses that are travelling from cities near the border to check identification cards and passports. If you don't like carrying your actual passport on you, make sure you have a copy of your passport AND a copy of the stamp showing the date you entered Costa Rica to validate you haven't been in the country more than 3 months.\n\n===By plane===\n'''Juan Santamaría Airport''' ({{IATA|SJO}}) is located close to the cities Alajuela, Heredia and the capital San José.\n\nSJO is currently under remodelling, and in July 2009 its operation was taken over by the same organization that runs the airports in Houston, Texas. An otherwise pleasant airport features the normal assortment of duty-free shops, interesting souvenir and bookshops, but an inadequate selection of overpriced restaurants (Church's Chicken, Burger King, Poás Deli Cafe and Papa John's pizza). SJO is serviced daily by Air Canada, Air Transat (Seasonal) American Airlines, Canjet (Seasonal), Condor, Delta, Frontier Airlines, Iberia, Interjet, JetBlue Airways, Thomas Cook, Spirit Airlines, Southwest Airlines, United, Volaris, Westjet, [http://www.avianca.com Avianca], Copa Airlines and AirPanama [http://www.flyairpanama.com]. Connecting the airport with cities such as: Los Angeles, [[New York]], [[Houston]], [[Dallas]], [[Miami]], Baltimore, Washington DC, Philadelphia, Charlotte, [[Atlanta]], Phoenix, Orlando, Chicago, Newark, [[Toronto]], Montreal, Madrid, London, Frankfurt, [[Mexico City]], Bogotá, [[Medellín]], Caracas, Lima, Guayaquil, Quito and all of Central America.  \n\nThere is a USD29 exit fee at the Juan Santamaría Airport. This must be paid in cash, or by Visa (in which case it will be processed as a cash advance).  The fee can also be paid in advance at some hotels or banks (Banco Credito Agricola de Cartago and Banco de Costa Rica). Some airlines already have this tax included in their ticket price - travellers can check the Juan Santamaría Airport website to find out what airlines already have the fee included.\n\n'''Daniel Oduber Quirós International Airport''' (LIR) is near Liberia in the Guanacaste province. This airport is closest to the Pacific Northwest coast. Liberia receives flights from Delta, American, Southwest, Sun Country, United, JetBlue, Air Canada, Westjet, CanJet (charter), Sun Wing (charter), and First Choice (charter). Connecting the airport with Atlanta, Charlotte, Los Angeles, Chicago, Miami, Houston, Dallas, Minneapolis, Newark, Toronto, Vancouver, Calgary, London, etc. The new terminal is open and is a wonderful addition to this airport.\n\n'''Tobías Bolaños International Airport'''  (Spanish: Aeropuerto Internacional Tobías Bolaños) ({{IATA|SYQ}}) i(LIR) is in the Pavas district of San José about a 10-15 minute drive from the city centre. This airport primarily serves as the gateway linking to local Costa Rican domestic flights or nearby international destinations of Nicaragua and Panama.Currently, this airport is the hub for [http://www.natureair.com.com Nature Air]. The terminal is neat, and clean though small and lacks any food concession so eating before an early morning flight is advisable.\n\n===By car===\nThe '''''Interamericana''''' ('''Pan-American Highway''') runs through Costa Rica and is the main entry point by car. The border post in the north (to Nicaragua) is called [[Penas Blancas|Peñas Blancas]] and in the south (to Panamá) [[Paso Canoas]] (closes at 22:00, Costa Rica time or 23:00, Panamá time). Virtually all travel out of the capital (except to the Caribbean side) will involve travelling this road. The locals call the  highway \"''Via Muerta'',\" and after you have been on it a while you understand why — near San Jose and other major cities, the road is paved and has excellent signage; outside of the major cities, however, the road is gravel in places with fairly tight turns and substantial changes in elevation.  You will see more large truck traffic on this road than in any part of Costa Rica. There are many speed traps along this major artery, as well as some random police checks for seat belts and, especially near the borders, for valid travel documents.  \n\nThe highway speed is 80km/h, but since the ''Interamericana'' (a.k.a. Highway #1) passes through innumerable small towns, the speed frequently drops to 50 or even 30km/h as you suddenly find yourself in a school zone.  Most of the highway is not divided.  A common indicator that a police checkpoint is ahead is that oncoming cars flick their lights at you. New laws that went into effect in 2010 have greatly increased the amount of tickets; it used to be a max of about USD20; there are now tickets that exceed USD400 for attempting to bribe an officer, and other big tickets for drunken driving, speeding, and other illegal actions including talking on a cell phone and not using seat belts. Be nice to the police if you are pulled over because, as a result of the new laws, it is possible for them to \"throw the book\" at you, although they generally do not. This could mean citing you for minor offenses that the new laws have instituted, such as the requirement that every car carry an emergency kit. New laws have also now enforced a 3 year prison sentence for driving with a 0.08 blood alcohol level and a USD480 fine. Driving over 20km/h over the speed limit is a USD310 and losing 20 points. Police now tend to target tourists because they think that Costa Ricans don't have the money to pay the big tickets---and they're right. The police themselves earn about USD500 per month, and that happens to be the average monthly wage in Costa Rica.\n\nThe good news is that there is a brand new highway known as Autopista Del Sol (Highway of the Sun) that stretches from the beaches around Orotina all the way into San Jose. This highway is smooth as U.S. or European highways, in fact it was constructed by a company that is based in Spain. There are tolls along this highway but if you travel the entire stretch it will still only come out to be a few dollars in total. 2011 update: unfortunately, problems have been found with this highway and parts of it are sometimes closed for repairs.\n\nMany Costa Rican roads are in terrible shape, and short distances can take a very long time. Even the only road in and out of popular tourist destinations are riddled with major potholes.  To avoid potholes, drivers will often snake through the left and right lanes, usually returning to the right when oncoming traffic approaches.  While this may seem erratic, you can become quickly accustomed to it.  If you see a tree branch or pole poking out of the middle of a road, that is a \"sign\" that there is a deep sinkhole, pothole or manhole ''without a cover''.  '''Stay away from it'''.\n\nDriving at night is '''''highly''''' inadvisable, due to the unpredictability of road conditions and lack of safety features such as guard rails on the many hairpin turns in the hills.  To put safety in perspective, Costa Rica's per capita traffic death rate is comparable to that of the United States, but there are undeniably many hazards, and they are likely to be unfamiliar ones.\n\nMany roads are unpaved, and even the paved roads have lots of unpaved sections and washed out or unfinished bridges. Bridges are often only wide enough for one vehicle; one direction usually has priority. Do not expect to get anywhere quickly; supposed three-hour journeys can turn into '''five or more hours''' easily: there are always slow cars/buses/trucks on the road. This causes a lot of crazy driving, which you begin to emulate if you are in-country for more than a day. The government does not seem to be fixing the infrastructure well (or at all!); 50km/h is good over unpaved roads.  Some hotels located in the mountains require a four-wheel-drive vehicle to reach the destination. Call ahead. This is more for the ground clearance than the quality of the road.  Four-wheel-drive vehicles are widely available at the car rentals near the airport, but call ahead.\n\nNavigation can prove challenging. Road signs are relatively few, and those that do exist can be inaccurate.  It is recommended that you have a good road map with the small towns listed, since road signs will often only indicate the next town, not the direction of the next major city.  Towns generally do not have town-limit signs; it is best to look at the names on the roadside food stores and restaurants to determine the place you are passing.  Stop and ask, practice your Spanish.  The center of town is usually a public park with a Catholic church across from it.\n\nThere are no formal street addresses in Costa Rica, but two ''informal'' systems exist.  The first (often used in tourist information) indicates the road on which the establishment is located (''e.g.'', \"6th Avenue\"), together with the crossroad interval (''e.g.'', \"between 21st and 23rd Streets\").  In practice, street signs are virtually non-existent, and locals do not even know the name of the street they are on.  The second system, which is much more reliable and understood by locals, is known as the \"Tico address\", usually involving an oriented distance (''e.g.'', \"100 metre south, 50 metres east\") from a landmark (''e.g.'', \"the cathedral\").  \n\nIt is worth noting the particular road naming system in San Jose. '''Avenues run east-west''' and '''streets run north-south'''.  The numbering is less straightforward. Starting at Central Avenue going south are 2nd, 4th, 6th Avenue, etc. while going north are 1st, 3rd, 5th, etc.  Streets use even numbers going west, and odd numbers going east. This means that if you are at 7th Avenue and 4th Street, and looking for 6th Avenue and 5th Street, you are on the wrong side of town. \n\nGas stations are full-service and the guys there are very cool about taking US dollars or colones. The interesting thing is that Costa Rica is small so you do not burn a lot of gas getting places, even though it seems like forever. Costa Rica is also a land of traffic circles, so people from Europe should have no problem, but North Americans should make sure they know how they work.  The gas stations really are full-service, and you can have your oil checked, water filled, and tire pressure topped off.  The state owns a gasoline company and the private companies raise their prices to the level of the state-set price. It is recommended to always use super gas and '''''not''''' regular; the '''regular gas is soiled'''. If you use the \"regular\" gas, you will have to change the gas filter and clean the injectors after 5000 miles.\n\n===By bus===\nThere are bus services from the neighbouring countries of [[Panama|Panamá]], [[Nicaragua]], [[Honduras]], [[El Salvador]], [[Mexico]] and [[Guatemala]]. Bus companies like Tica and Tracopa that operate international routes charge significantly more than national companies that go as far as the border. At all land borders you have to get out of the bus, take your luggage and walk across. At the main land borders with Nicaragua and Panama there are lots of local buses and it is easy to catch another bus at the other side. Keep in mind you have to show CR immigration proof of onward travel: a plane ticket out of San José or a bus ticket. I do not know whether it is a scam, but immigration officers refer to Tracopa and Tica ticket boots near their office. Once you have bought a ticket which you may not need you can enter without a problem. E.g. at the Penas Blancas border with Nicaragua 25USD is the price of the cheapest bus ticket 'for returning' to Nicaragua, but if you plan to travel to Panama you will have lost this money. At the land border with Panama a similar ticket to return to Panama with Tracopa will cost you 21 USD (SJ - David).\n\nThere is an extensive network of bus routes within the country with reasonable fares. Departures are very punctual, though routes often take longer than expected. Stop by the Tourist Office downtown (underneath the Gold Museum in the Plaza--ask anyone and they'll be able to help you out). The bus system is a safe and even fun way to see a lot of the country cheaply and not have to worry about car rentals. Getting around without Spanish is no problem.\n\n===By boat===\nThere is twice daily boat service from [[Los Chiles]] (in NE Costa Rica), former home of the Contras, to [[San Carlos (Nicaragua)|San Carlos]], [[Nicaragua]]. The cost is about USD12, plus a USD1 fee. The boats usually leave  [[San Carlos (Nicaragua)|San Carlos]] at 10:30 and 16:00.\n\nSmall ship cruises carrying less than 100 passengers begin in [[Panama]] and end in Costa Rica or reverse. These cruises visit popular National Parks such as Manuel Antonio but also visit remote beaches and coastline not accessible by road.  Prices range from USD2,000-6,000 per person for 7-10 day tours.\n\nLarger cruise ships occasionally dock or anchor at Porto Caldera and Puntarenas for a day or so, usually to begin, end or continue cruises with itineraries through the Panama Canal to or from Caribbean or US ports.\n\n==Get around==\n[[Image:CocosIslandCostaRica.jpg|thumb|upright=1.3|Cocos Island coastline]]\n\nKeep in mind that Costa Rica does not have a publicly known street nomenclature system. Many important streets in San José have names and most people know those names, but outside of the capital (and even within the capital) directions are given using well known buildings, stores, or other structures as references.  \n\nIn addition to paper maps, you can also use the GPS maps from various providers.  GPSeTravelguides offers a complete navigation map for Costa Rica, http://www.gpsetravelguides.com/page/costa-rica-gps-map.html. Trackit GPS provides maps in local retailers, http://www.trackit.co.cr.  Kaart Data apps can be used on iOS and Android, http://www.kaartdata.com/mobile-apps/  Cenrut maps can be loaded on Garmin devices, iPhones and Android phones: http://www.cenrut.org/adw/over.htm And if you want to locate the best Costa Rican beaches to surf or for a family outing then you want to use [http://crsurf.com/costaricamap.html CRSurf.com's Costa Rica Map], created by a surfer, who has surfed every wave on this Google map, for surfers. \n\n===Private and Shared Shuttles===\nWhen traveling alone or with your couple and need to keep an eye on your budget then '''Shared Shuttles''' are a great way to travel around Costa Rica. Get to your destination fast, secure and on time while meeting other people. \n\n- Shared Shuttles are available on a daily basis\n- Morning and afternoon departs (depending on the destination)\n- Door-to-door service (We will pick you up at your hotel and leave you at your next destination hotel)\n- From/to most popular destinations in Costa Rica, including Arenal Volcano, Monteverde, Manuel Antonio, Jaco, Tamarindo, San Jose (SJO) and Liberia (LIR) airports. Please check the complete list of Shared Shuttles Destinations.\n- Insurance for each passenger\n- Prices are per person.\n\nA '''Private Transfer in Costa Rica''' is often the best choice for families and groups of friends. You have the van for your exclusive use, meaning private service with no other passengers except for those in your party. If traveling with more than 3 people this is your choice. Features:\n\n- Airport Meet & Greet\n- Departing at time and place of your convenience\n- Includes all Costa Rica destinations\n- Door-to-door service\n- Bilingual guide-driver\n- Stops on the road at your convenience\n- Sightseeing\n- Insurance for each passenger\n\n===Public bus===\nMost major tourist destinations in Costa Rica are serviced by at least two daily buses from and to San José. The advantages of public transportation in Costa Rica are that tickets are cheap (rarely more than USD7 per person) and they cover most towns around the country. However, nearly the entire bus system is based on routes in and out of San José and this can add significant travel time. The buses are also not booked with a reservation system so it is possible to not have a seat on popular routes.  However, many do have assigned seats once you buy a ticket at the station and so get there early to be sure you get your bus.\n\nIn San José there is not one central bus station, but rather several different ones, with each station roughly serving a different area of the country, with some exceptions.  For example, most of the service to the Caribbean side of the country leaves from the Terminal Gran Caribe.  However, in November 2012 the direct service to the far south Caribbean coast moved to the Puntarenas bus station, which mostly serves the west side of the country.  Still, you can still get to the Caribe side by taking a bus (on the Autotransportes Caribeños‎ line) from the Terminal Gran Caribe to Limón, and then transferring there to another bus south (the Mepe line). Or just go to the Mepe terminal in SJ for a direct bus to Puerto Viejo or any other place on the South Caribean coast. In short, do some research beforehand so you don't get lost looking for your bus. Often you can just call or email your final destination (e.g. your hotel) and they will tell you what bus to take, where to catch it and how often it runs. Schedules are available [http://horariodebuses.com online].\n\nWarning: taxi drivers await incoming bus passengers at almost all terminals in San José. Many of them focus on foreigners and try to rip you off. They claim it is necessary to make a detour to reach your hotel or they offer to call your hotel and call a friend who says it is full. Then they offer you another hotel. The standard rip off fee is 50 USD or an invisible commission from another hotel. It is now (March 2017) almost a standard practice in San José. The police are aware of the problem, but do not address it effectively. Often hotels send warnings after you booked.\n\n===Rental car===\nOne great advantage of renting a car is that you can visit many of the secluded beaches and mountain areas. And with the power of the Internet, you can now rent just about any vehicle online and have it waiting for you when you arrive.\n\nFor USD350-700 a week you can rent an Economy or Mid-size 4x4. Insurance is the majority of this cost and it is not optional.  Four-wheel-drive is good for extensive travelling outside the Central Valley, especially in the wet season. In the dry season going from La Fortuna to Monteverde via a direct route was over a boulder strewn 15-30mph road. Four-wheel-drive was also useful on the Nicoya coast.(above based on 2001 roads). It's often possible to rent a car with a local driver from the various tour companies, if driving yourself seems a bit daunting.\n\nDue to the condition of most roads outside San Jose, car insurance, even with a zero-deductible option, generally does not cover tires and rims. Car rental companies require a guaranty deposit from USD750 during the rental period and a credit card is '''''necessary''''' for this process. Using an insurance program provided by some types of gold or platinum credit cards is a good advantage, since these credit cards would cover small scratches, small dents as well as the entire rented vehicle in case of collision or theft. \n\nYou have to '''''exercise caution''''' when renting a car in Costa Rica; where it is not uncommon for rental companies to claim \"damage\" they insist ''you'' inflicted on the vehicle. It is by far the best policy to '''rent a car through a Costa Rican travel agent'''. If you are travelling on a package, your agent will sort this out. Otherwise, go into '''an ICT-accredited travel agent''' in San Jose and ask them to arrange rental for you. This should be no more expensive than renting on your own and will help guard against false claims of damage and other accusations; rental companies will be less willing to make trouble with an agent who regularly sends them clients than with individual customers who they may not see again.\n\nMake sure to '''''check the car carefully''''' '''''before''''' you sign off on the damage sheet. '''Check the oil, brake fluid, fuel gauge (to make sure it's full) and that there is a spare tire ''with a good air pressure'' ''and'' a jack'''. Look up the Spanish word for \"scratches\" ('''''rayas''''') and other relevant terminology '''''first''''', so you can at least scrutinize the rental company's assessment. Ask them to write down '''''all''''' the minor damages, not just check on the drawing, and '''keep a copy of this document on you'''.\n\nTake the '''maximum''' insurance (around USD15-20 per day); because of the country's high accident rate, you need to be covered for damage to the vehicle, yourself, any third party and public property.\n\nWhen you book a rental car online, it may show very low price that doesn't include insurance. You'll then get a nasty surprise at airport at the time of rental when they typically charge you about USD40/day, no matter how low you might have booked online.\n\n===Rental motorcycle===\nFor about USD420 a week, depending on the bike and the season, you can rent a dual sport bike or a cruiser. A motorcycle rental company requires a guaranty deposit from 600 USD during the rental period.\n\nThe road conditions are very bad so be prepared especially if you easily get motion sickness.\n\n===Taxi===\nAnother easy way to get around Costa Rica is to use the services of mini-vans. At most of the hotels, the receptionist is able to assist travelers who want to travel across the country by arranging for the services of a driver. Rates are reasonable (USD29 per person, for example, to get from San Jose to [[Tamarindo]] in April 2007) The drivers know the roads well; the vans are clean and comfortable; and they take you from door to door.\n\nTaxis are available in most large cities. They are usually expensive for foreigners, charging you whatever they want. It is not recommended to use any cab, but if you have to, ask for help at your hotel or ask other locals who use taxis. The meter is called \"''la maria''\"; ask the driver to turn it on '''''immediately''''' upon getting in the car, or he may leave it off and make up his own, more expensive, price when you get to your destination. Also try checking it wasn't running before you got in, the initial fare shouldn't be higher than 600. Most Drivers know familiar routes such as San Jose to Santa Ana and you can find the rate by asking \"Cuanto para ir a _____\" and he will tell you the flat rate. This can keep you from paying too much because the driver will not make unnecessary detours. Official taxis are red with a yellow triangle on the side. They also have yellow triangles on the side of the car which will have a number in it.  If the number matches the number listed on the license plate, it is an official taxi. Do not get in if the numbers do not match''.  \"Pirate Taxis\", though sometimes cheaper, are NOT SAFE.  Do not risk it.  If you are alone, especially. If you are female, ride in the back seat, as riding in the front with the driver can be seen as suggestive.  Caution should be exercised when using this service, extra caution. Do not ride non-red cabs.\n\n===Hitching===\nHitchhiking is far more common in rural areas than in urban areas. If you choose to hitchhike, Costa Ricans are generally very friendly and helpful, particularly in more rural areas where traffic on the dirt roads can be light.  As always, be gracious and offer a bit of money, which will probably be declined due to the kindness.\n\n===By plane===\nThere are two internal airlines that connect the major tourist towns.  You are limited to 25 or 30 pounds of carry-on luggage per person, depending on the airline.  Nature Air allows more luggage per person, as their planes are larger and are also twin-engine. The main airlines are NatureAir [http://www.natureair.com] and Sansa [http://www.flysansa.com/].\nIn 2017, 2 deadly accidents happened with Nature Air : one in september with 2 killed on 6 and in december 2017, all 10 passenger and both crew members aboard Nature Air Flight 9916 were killed in a crash shortly after takeoff. According to Tico Times, the local newspaper from January 14th, announces that Civil Aviation autorities suspend all operations of Nature Air which had to cancel all the flights. Travelers tried to be refunded of the cancelled flights, but Nature Air didn't refund the money and sent  to customers this message by email : \"Gentleman, I have sent your emails to my superior.\nI would like to help you but there is nothing more that I can do, in the end I know that you will not have your money back because the company has established it, they are in crisis and do not have money to make these repayments, I am sorry .\" So a lot of travelers have never been refunded by Nature Air for their cancelled flights and there a lot of complaints on social networks and travel forums.\nIn april 2018, the situation remains unchanged. To be followed for the future...\n\n==Talk==\nSpanish is the official and most spoken language in Costa Rica.  All major newspapers and official business are conducted in Spanish.  English is used widely in most areas, especially those frequented by tourists, and information for visitors is often bilingual or even exclusively in English.  A number of businesses operated by European proprietors can accommodate guests in Spanish, English and their native languages.\n\nSome Costa Rican colloquial expressions:\n\n* ''Mae'' or sometimes ''\"Maje\"'' is used akin to the American English word 'dude'. Generally spoken among the male population, or among friends. It is as informal as the word 'dude'. Mae is mostly used by the younger population and Maje by the older population. It is pronounced 'maheh'.\n\n* ''Pura vida'', literally translated as \"pure life,\" is an expression common to Costa Rica.  It can be used in several contexts, as an expression of enthusiasm, agreement, or salutation.  It's pronounced 'poora veeda'.\n\n* ''Tuanis'', means \"OK\" or \"cool.\" Was believed to be taken from English phrase \"too nice\", but it is actually a word borrowed from the ''Código Malespín'', a code developed for communication during the various Central American civil wars in the 19th century.\n\nA prevalent version of slang in Costa Rica, and other regions of Latin America, is called ''\"pachuco\"'', ''\"pachuquismo\"'' or ''\"costarriqueñismo\"'' and is used by all social classes (to some degree), however, it can be at times vulgar and is considered an informal way of speaking.\n\nFor the word \"you\" (singular informal form), instead of \"tú\", most people of Cartago use \"vos\" (as in \"vos sos\" - you are) which is also common to other American dialects of Spanish (Argentina, Uruguay, Guatemala...), but the word \"usted\" is prominent in south Pacific Costa Rica and the [[Central Valley (Costa Rica)|Central Valley]], and preferred over \"vos\". Either way, formal Spanish is understood and you may use any form of the word \"you\" you consider proper.\n\nCosta Ricans tend to use the term ''Regaláme'', literally \"gift me\", instead of \"get me\". An example is when a Costa Rican says: ''\"regáleme la cuenta\"'', literrally \"gift me the bill\", which is unusual to other Spanish speaking countries, however, it is a very common Costa Rican term. Another such case might be when Costa Ricans go out to buy something, in which case they might use the term this way: \"''Regáleme un confite y una Coca''\", literally, \"Gift me a piece of candy and a Coke\", but it is understood that the person asking is going to buy said things and is not expecting the other to gift him or her those things. A more precise phrase in standard Spanish would be: \"''Me vende un confite y una Coca''\", meaning: \"Sell me a piece of candy and a Coke\".\n\n'''Limonense Creole (Mekatelyu)'''\n\nAs well as Costa Rican Spanish, there is also an English-based Creole language spoken in [[Limón Province]] on the Caribbean Sea coast of [[Costa Rica]]. It is called '''Limonese Creole''' or '''Mekatelyu'''. This Creole language is similar to varieties such as Colón Creole, Miskito Coastal Creole, Belizean Kriol language, and San Andrés and Providencia Creole since all originated from English seafarers and settlers. The name ''Mekatelyu'' is a transliteration of the phrase \"make I tell you\", or in standard English \"let me tell you\".  It is basically English language however it has a very distinctive pronunciation and vocabulary very similar to Jamaican English.\n\n==See==\n[[File:Butterflies (Costa Rica).jpg|thumb|upright=1.3|Butterflies (Costa Rica)]]\n[[File:Tucan in Costa Rica.png|thumb|upright=1.3| toucan]]\n[[Image:Great_Green.jpg|thumb|upright=1.3| Green Parrot]]\n[[File:HeliconiusDorisLinnaeus.jpg|upright=1.3|thumb|Heliconius doris Linnaeus butterfly of Costa Rica]]\n'''Wildlife''' - Costa Rica is world famous for having an incredibly high level of biodiversity throughout its tropical forests (this covers what you may hear referred to as rain forests, cloud forests, and dry forests).  There are tropical mammals such as monkeys, sloths, tapirs, and wild cats as well as an amazing assortment of insects and other animals. There are many many birds (both migratory and resident) - more on that below.  With 25% of the country being national parks and protected areas, there are still many places you can go to see the abundant wildlife and lush vegetation of the country.  Just like anywhere, the farther you get off the beaten path, the more likely you are to see a wide variety of flora and fauna.  \n\nThere is such biodiversity in Costa Rica not only because it's a land bridge between North and South America, but also because the terrain is so varied and there are weather patterns moving in from both the Pacific and Atlantic/Caribbean.  There are impressive volcanoes, mountain areas, rivers, lakes, and beaches all throughout the country.  There are many beautiful beaches - most of the popular ones are on the Pacific side but the Caribbean has many excellent beaches as well.  \n[[Image:Costa-rica-colibri-humming-bird.jpg|thumb|250px|Costa Rica Colibrì Amasilla Saucerrottei.]]\n \n'''Bird Watching''' - One of the most wonderful activities for people who love nature is bird watching. You can enjoy bird watching in many areas of Costa Rica.  Due to the great diversity of climates, temperatures and forest types in Costa Rica, there is a wonderful variety of birds, with over 800 species. Some helpful books available on bird watching are ''Birds of Costa Rica'' by F. Gary Stiles and Alexander Skutch (Cornell University Press) or ''An Illustrated Field Guide to Birds of Costa Rica'', illustrated by Victor Esquivel Soto. These books can be found at certain bookstores in San José or before  coming to Costa Rica. They are both heavy books; many people tear out the plates of the Stiles & Skutch book to carry into the field and leave the rest of the book in their car or room. Plastic cards with the most common birds are available for many areas and are sold at gift shops.   \n\n'''Costa Rica's list of birds includes''':\n*16 species of parrots including the fabulous scarlet macaw. \n*50 species of hummingbirds. \n*10 species of trogons with the resplendent quetzal as the jewel. \n*6 species of toucans, including the keel-billed and chestnut-mandibled. \n*Half the bird species in Costa Rica are passerines including warblers, sparrows and finches. \n*16 species of ducks, including the fulvous whistling, white-faced ruddy and American wigeon. \n*13 species of falcons, including the peregrine falcon, merlin and American kestrel. \n*36 species of prey, including the gray hawk, swallow-tailed kite, solitary eagle and northern harrier. \n*6 species of cracidae which look like turkeys. \n*8 species of new world quails. \n*15 species of rallideas including the rufous-necked wood-rail, American coot and ruddy crake. \n*19 species of owls including the black-and-white, Costa Rican pygmy, central American pygmy and striped. \n*3 species of potoos including the great, northern and common. \n*16 species of woodpeckers, including cinnamon, chestnut-colored and pale-billed. \n\n'''The coastal list of birds includes''':\n*19 species of herons & wading birds such as the great blue heron, great egret, boat-billed heron, reddish egret and yellow-crowned night-heron. \n*2 species of recurvirostridae which are waders and include the black-necked stilt and American avocet. \n*2 species of jacanas including the northern and wattled. \n*34 species of scolopacidae including the short-billed dowitcher, spotted sandpiper, wandering tattler, surfbird, and red phalarope. \n*9 species of gulls including the gray, Heermann's and ring-billed. \n*14 species of sternidae (terns) including the gull-billed tern, Forster's tern, least tern and white tern. \n*4 species of vultures including the king vulture. \n*24 species of doves and pigeons. \n*11 species of swifts including the black, spot-fronted and Costa Rican. \n*6 species of kingfishers including the green, Amazon and American pygmy. \n*5 species of threskiornithidaes including the roseate spoonbill and white-faced ibis. \n*2 species of ciconiidae including the wood stork and jabiru.\n \n'''Good Bird watching spots include''':\n*Monteverde Cloud Forest has more than 400 species of birds, including resplendent quetzals. \n*Tortuguero National Park has 300 species of birds. \n*Santa Rosa National Park has more than 250 species of birds. \n*Cahuita National Park has toucans, parrots, rufous kingfishers; the park is on the beach. \n*La Selva Biological Station in the northern lowlands has 420 species of birds. \n*Helconia Island has 228 species of birds. \n*Corcovado National Park has 400 species of birds and 1,200 scarlet macaws. \n*Huedal Nacional Terraba-Sierpe has a myriad of birds along the coast and swamps. \n*Carara National Park has 400 species of birds. \n*Tárcoles has 400 species of birds and great river tours highlighting crocodiles. \n*Whale Marine National Park has frigate birds, boobies, ibises and pelicans. \n*La Amistad National Park has 500 species of birds including resplendent quetzals. \n*Manuel Antonio National Park has 350 species of birds and three lovely beaches. \n\nMost hotels, as well as tourist information centers, will provide bird watching guides, maps and other essentials for bird watching. Unless you are an experienced neo-tropical birder, it can be a lot more productive to go out with an experienced birding guide. Do not forget to bring a hat, rain gear, boots, binoculars and camera. In hot areas, an umbrella can be more useful than a poncho or jacket. Southern Costa Rica is generally considered the better option for bird watching.\n\n[[Image:Arenal volcano 2007.jpg|thumb|250px|Arenal Volcano]]\n'''Volcanoes''' -Costa Rica is one of the most seismologicly active countries in the western hemisphere, and as a result several volcanoes have sprouted over the years- most notably volcanoes Poas, Irazu, and Arenal.\n\n==Do==\n\n===Beaches===\n[[File:Manuel Antonio.jpg|thumb|250px|Beach in [[Manuel Antonio]]]]\nCosta Rica is a country with an extraordinary wealth of things to do, but regardless of your travel interests, you're going to want to spend time at one of the country's great beaches. The lion's share of beach tourism is concentrated on the Pacific side, in the [[Central Pacific]] region near [[San José (Costa Rica)|San José]], the [[Nicoya Peninsula]], and in the dry tropical forests of [[Guanacaste]]. Less touristed, but no less beautiful are the beaches in the tropical rainforest of the [[South Costa Rica|southern Pacific coast]] near [[Corcovado National Park]], or on the exotic, rastafarian, eco-tourism paradise of the [[Caribbean Costa Rica|Caribbean side]].\n\nWhile some of the best beach vacations will be found on tiny quiet beaches off the beaten path, or even at exclusive resorts, here's a quick list of the country's biggest and most popular beach destinations:\n\n<!--This list is limited to NINE beaches. If you would like to change this list, please discuss first on the talk page.-->\n\n*[[Corcovado]] &mdash; the main beach on Costa Rica's [[Osa Peninsula]], with black sand beaches fronted by the thick Costa Rican tropical rainforest\n*[[Dominical]] &mdash; probably the biggest surfing destination in the country, with a good nightlife scene\n*[[Jaco_%28city%29|Jacó]] &mdash; the party beach city right by [[San José (Costa Rica)|San José]], a surfer's paradise full of nightlife and casinos\n*[[Nicoya Peninsula|Montezuma]] &mdash; the bohemian option, on the [[Nicoya Peninsula]], full of dreadlocks, surfers, and what you would expect would come along with them (known as \"monte fuma\" by the locals)\n*Playa Santa Teresa &mdash; One of the most beautiful beaches in Costa Rica, located on the Western tip of the Nicoya Peninsula, known for its great surfing conditions, consistent all year round.\n*[[Playa Grande]] &mdash; this tranquil white sand beach is home to the largest nesting site for the Leatherback sea turtle on the Pacific coast, as well as, one of the best surfing waves in the Guanacaste Province\n*[[Tamarindo]] &mdash; well known as a surfing and fishing destination with a big choice of hotels and restaurants.\n*[[Tortuguero]] &mdash; the Caribbean side's most famous beach, which caters to eco-tourists looking to explore the rain-forest and spot some Manatees\n\nIf you want to locate the [http://crsurf.com/costaricamap.html best Costa Rican beaches] then check out CRsurf.com's [http://crsurf.com/costaricamap.html Costa Rica Map]. It was created by Greg Gordon who has surfed every break on this map. There are some hidden gems.\n\n===Guides===\nGuided treks/tours can be booked and arranged [https://www.flashpackerconnect.com/costarica online].\n\n===Rafting===\nCosta Rica is one of the countries with more rivers per square kilometer than anywhere else in the world. Nearly anywhere you go you will find some kind of river trip to enjoy nature from a very unique point of view. \n\nThere is a wide variety of exciting rafting trips offered in Costa Rica. For many years, the rafting Mecca of Costa Rica was [[Turrialba]], a large town embedded in the mountains near the Reventazon and Pacuare Rivers, on the Caribbean slope of Costa Rica. \n\nHowever, the Arenal Volcano area is now an increasingly-popular whitewater rafting destination with close access to the Sarapiqui and Toro Rivers, as well as the Class II-III Río Balsa which delight rafting enthusiasts in the Northern slopes of the country. \n\nOn the Pacific slope, the river with the largest volume, El General, is famous for multi-day adventures and for being an incredible playground for kayakers. The Coto Brus River is also part of this watershed. Further north, on the central Pacific coast, are the Savegre and Naranjo Rivers. In this area you have the opportunity to enjoy both half-day trips on the Naranjo River and 1-to-2-day trips on the Savegre River. \n\nThe Class III-IV Tenorio River near [[Canas]], [[Guanacaste]] is a favorite among day-trippers from the beaches of Guanacaste, as well as part of shuttle-tour-shuttle services from the Arenal Volcano and Monteverde to the Guanacaste area. The lower section of the Tenorio River is widely-known for being an excellent nature float trip.  \n\nThe Pacuare River (Class III-IV) is at the top of the list for 2- or 3-day adventures. If you are interested in similar trips, the Savegre River (Class III-IV) is an excellent alternative for an overnight rafting excursions. \n\nIf you want more adrenaline, the '''Chorro Section''' (Class IV+) of the Naranjo River, near [[Manuel Antonio]], [[Quepos]] is one of the most exhilarating rafting trip of the country. This section is run from December to May. \n\nAs for nature-oriented trips, the Peñas Blancas River near the Arenal Volcano provides a great look at the tremendous biodiversity of the country. \n\nMost likely, any of these rafting trips will be the highlight of your active vacations, so don’t miss your chance to paddle one.\n\n===Fishing===\nCosta Rica has some of the best Sport Fishing in the world and is the first country to practice catch and release fishing. The Pacific side has incredible fishing for Sailfish, Marlin, Dorado, Tuna, Wahoo, Roosterfish, Snapper, Grouper and more. The Caribbean side is famous for big Tarpon and big Snook. Over sixty-four world records have been caught in Costa Rica. Half day, Full day and Multi-Day Trips are available.[http://www.vacationscostarica.com/travel-guide/sportfishing/]\n\n===Scuba Diving===\nCosta Rica is home to some of the best scuba diving in Central America. With diving on both the Pacific and Caribbean coasts as well as the world famous Cocos Island, there is something for all scuba enthusiasts. \n\nIn Playa Conchal, the water is very calm, it has very few waves, and the water is super clear. The water has a perfect temperature,  It does not feel too cold in the morning and the in afternoons it's warm, which is ideal for enjoying snorkeling. You can see fish, in all their variety, small and full of beautiful colors.  You can also see many black sea urchins; you can carefully play with them. You can also observe the beautiful ecosystems where they live. This is one of the things you can do in this Costa Rican beach, at no cost, the only that you need is a snorkel mask and you’re ready to enjoy.\n\nCocos Island is a famous island located approximately 300 kms off shore and is only accessible by liveaboard boats. The area is a national marine park and is the only place in Costa Rica that you can regularly find schooling hammerheads. \n\nThe Gulf de Papagayo is a well established dive location with three major diving options. Local diving, the Catalinas, and the Bat Islands are the options within the Gulf. Diving centers are mainly located around Playas del Coco and Playa Flamingo. Out of the three options, Bat Islands is probably the most exciting as this national marine park is home to the often feared bull sharks. The dive site \"Big Scare\" allows divers the chance to dive face to face with these sharks and is also home to other large pelagics such as manta rays and the occasional whale shark.\n\n===Surf===\nCosta Rica has many surfing hotspots.  The best time of year to surf is from November - August. \n\nThe Pacific coast, particularly in the [[Central Pacific]] and [[Guanacaste]], has some of the best surfing in Central America. \n\nIn the [[Guanacaste]] there are several beaches to choose from if you intend to go surfing.  Among them, Playa Negra and Playa Grande are two stand out breaks.  Playa Negra breaks over a shallow lava reef producing fast hollow waves for advanced surfers only.  Playa Grande is the most consistent break in the area with surfable conditions most days of the year.  It breaks over a sandy bottom and is good for beginner and experienced surfers. \n\nTamarindo is a good beach to learn how to surf, whilst Playa del Coco offers advanced surfers the chance to surf at Witches Rock and Ollie´s Point. On the Caribbean side there are beautiful beaches, but limited surfing prospects.\n\nThe southern Costa Rica area has two very good spots for surf: [[Dominical]] and Pavones Beach. Pavones Beach has thick, heavy waves which consistently barrel and can get really big. It's little known, but picturesque and untamed; Definitely not for the light hearted.\n\nIn the southern tip of the Nicoya Peninsula, Montezuma has one of the most beautiful beach breaks in the area, called Playa Grande. It's a short eastward walk from Montezuma village. The break is great for all surfers.\n\nThere's a good book on Costa Rica surf spots on Amazon: [http://www.amazon.com/Essential-Surfing-COSTA-RICA-Guide/dp/1441407553/ Surfing Costa Rica Surf Spots]\n\n===Biking===\nCosta Rica has great mountain biking routes, particularly near Irazu, Turrialba and Arenal Volcanoes. There is popular dirt road that connects Irazu Volcano and the foothills of Turrialba Volcano that is perfect for mountain biking, as it traverses the mountain and presents great views of the Cartago Valley (weather permitting, of course).\n\nNear Paraiso, Cartago, there is an amazing waterfall and biking tours around the valley\n\nThe area around Lake Arenal is also a great spot to bike. You can circle the lake in one long day, or break up the ride in two sleeping in Tilarán or Nuevo Arenal. The use of mountain bikes is a must, since the southern shore of the lake is unpaved.\n\nThe Nicoya Peninsula also has great riding, particularly the stretch between Sámara, Puerto Coyote and Malpais. There is a coastal road that connects these three beach towns.\n\n===Golf===\nCosta Rica is also know as a haven for some of the most lush, tropical golfing environments in the world. At any course, you can expect to an ensemble of exotic, indigenous animals; jungle; mountainous terrain; and a surreal, blue ocean painting a brilliant, seclusive experience.\n\nCourses are located in 3 major areas of Costa Rica: [[Guanacaste]], [[San Jose (Costa Rica)|San Jose]] and [[Central Pacific|Mid Pacific]]. Due to road conditions, you should check the driving times between courses.\n\nThere are many tournaments during the year that any traveler can participate in. Most courses offer shoe and club rentals.\n\n===Other active/extreme Sports===\nWind surfing in the [[Tilarán]] area is some of the best in the world.\n\n\"Canopy tours\" or zip-lines are very popular tourist activities and are found all over Costa Rica. These typically cost between USD30-50 depending on the company and use a series of zip-lines to travel between platforms attached to the trees, through and over the forest canopy and over rivers. The person is secured with harnesses to the metal cords, as some go very high off the ground. Be sure to ask about the zip-line certification before booking and be sure to take part in the safety briefing before participating.\n\nAnother form of canopy tour is via an aerial tram which are ski lifts modified for the rainforest. These trams are slower allowing the visitor to view wildlife in the canopy. Each tram has a guide who will explain the flora and fauna. The trams exist at adventure parks near Jaco Beach and just outside Braulio Carrillo National Park and are appropriate for all ages. The trams may be combined with ziplining and often have other attractions such as medicine gardens or serpentaria so guests may learn more about Costa Rica.\n\n==Buy==\nFor a developing country, Costa Rica is an expensive destination, something that is particularly noticeable when compared to its neighbours, Nicaragua and Panama. Prices for hotel accommodation, restaurant meals, and private transportation are on par with what's found in the United States and Canada, and only slightly less than typical prices found in Western Europe.\n\nThe local currency is the colón (plural, colones) named after Columbus (Spanish: Colón) ('''CRC''').\n  \nAs of March 2017, the exchange rate was 554 colones per US dollar. Money exchange is provided at most banks; however, it is recommended to do so at the state banks, especially the Banco Nacional, since they have better rates. There is also a money exchange service at the airport, but it is outrageously expensive. But note that the use of US dollars is quite common; in the tourist setting, almost everything is priced in dollars (but sometimes prices are cheaper in colones). Note that when a price is quoted in \"dollars\", the speaker may be thinking of a dollar as 500 colones;  so it is always worth checking whether this is what is meant.\n\nYou can find ATMs in most places. They normally dispense US dollars and colones. With Visa you get money at almost all ATMs. If you've got a MasterCard try the ATMs in the AM/PM supermarkets, they give you up to 250,000 colones (c. USD500). Another option are the ATH-ATM's but they just give you up to 100,000 colones (c. USD200) each transaction.\nEC-Cards (European) are accepted on all ATMs. The limit is usually only set by the Card. In addition, drawing money with your EC-Card will almost always give you a better exchange rate than changing cash in a bank.\n\nIt is also very common to pay even small amounts by Credit Card (Visa, Master Card, Amex is less common).\n\nKeep in mind that most banks and credit unions charge not only fees to get money out of an ATM in a foreign country, but also a foreign exchange fee (usually 2% or 3%) for the amount of the transaction.  So to withdraw USD100 worth of colones with your ATM (debit) card you could pay a fixed fee to the ATM operator (often USD3 or more), a fixed fee to your bank (USD2 or more), and then 2% to 3% of USD100, so you end up paying USD108 for USD100 worth of colones.  Paying a merchant directly with your card only incurs the foreign exchange fee.\n\nYou might get a discount (such as between 5% and 10%) when paying in cash, but it is not common enough to be expected. Also, it is not really necessary to get colones at the airport because you can pay everywhere in USD and receive colones as change. Most places except smallest restaurants take credit cards and many places including the gas stations take American Express. \n\nTraveler's checks are rarely used. When paying with traveler's checks, unless for hotel nights, change them first at a bank. Expect long delays with traveler's checks at the bank, lots of stamping, the higher up the official at the bank the more stamps they have. Dollars are easier.\n\nThe most common souvenirs are made from wood.  Unless it's marked as responsible (plantation grown wood), it is most likely not and may be contributing to the deforestation of Costa Rica &mdash; or even Nicaragua or Panama!\n\nMost visitors returning home are not allowed to bring back any raw foods or plants.  Accordingly, the single most desirable commodity for visitors to take home may be roasted (not green) coffee,considered by many as some of the world's best.  Numerous web sites explain the fine qualities of various growing regions, types of beans, types of roasting and sources for purchase.  Best prices come by purchasing several (sealed) bags of 12 ounces or so, but you can also buy in larger quantity if you look hard enough (the Mercado Central in San José has a coffee vendor that sells many varieties, including organic, by the kilo).  And experts definitely recommend buying whole beans (entero): in any kind of storage, they last longer, and ground coffee sold in Costa Rica often contains sugar because it preferred by locals -- if you want pure coffee without additives look for \"puro\" on the package.  The stores in San José airport will sell you excellent coffee, but other good quality blends can be found in local supermarkets and direct from the roasters.  It can be an expensive but delicious habit.  If you're serious about your coffee, bring at least a partially-empty suit case and fill it with perhaps a year's supply (web sites explain how to store it that long).  Take care with tourist outlets (especially at the airport) where small quantities may cost as much as ordering on the Internet.\n\n==Eat==\n\nCosta Rican cuisine can be described as simple but wholesome.  The spiciness often associated with Latin America has typically originated in Mexico, most Costa Rican foods are not spicy, but, as they simmer in a large pot, the flavors are blended.\n\n'''Gallo pinto''' is a mixture of rice and beans with a little cilantro or onion thrown in. While more common at breakfast, it can also be served at lunch or dinner.\n\n'''Casado''', which means married, is the typical lunch in Costa Rica, containing rice and beans with meat, chicken or fish, always served with salad and fried plantain. \n\n'''Plato del dia''', is the 'Plate of the Day' and is often a '''Casado''', but has the meat or fish selection of the day.  Usually around 5.00 USD and includes a natural juice.\n\nGood, fresh '''fruit''' is abundant in variety and low in cost.  Mercados provide an excellent place to sample fruit and other Costa Rican fare, with many including sit-down snack bars. You are encouraged to experiment because some of the local fruits do not \"travel well\" as they are bruised easily and or have a short shelf life.  The mango found in store in North America are much more fibrous and less sweet than the mangos found in Costa Rica.  The fingerling bananas are much more creamy and less tart than the ones found in North America. \n\nBe sure to stop off at a rest stop along any of the roads: a Casado and beer will cost ~USD3.\n\nDon't forget to try the '''Salsa Lizano''' that you will surely find at any restaurant. It is a mild vegetable sauce that has a hint of curry and is slightly sweet. It's often referred to as Costa Rican ketchup.  It tastes good on just about anything!  Bring some home with you!  You can find smaller sized bottles at any market.\n\nAlso as per usual in Central America standard breakfast fare is a ham sandwich, so people averse to eating pork might be advised to check out a grocery market for something else.  Many Ticos will go to a local bakery and buy a loaf of white bread.  \n\nVegetarians will find it surprisingly easy to eat well in Costa Rica. There are several International cuisine options also. In addition to American style food, Italian, Mexican, Peruvian and Indian are also available. Indian food generally has vegetarian, vegan and gluten free dishes. Try Indian '''Naans & Curries''' dishes. They taste better in Costa Rica because of natural ingredients. \n\nDon't forget to tip tour guides, drivers, bellboys and maids. Restaurant bills include a 10% gratuity but leave an extra tip for good service. North Americans often get better service because they are used to tipping separately, but it's not necessary.\n\nThe beef cattle are raised on grass; the meat will taste differently from corn fed cattle. The cuts of meat at the local restaurants are also different. The taste of chicken is not discernibly distinct.\n\n==Drink==\nMost places (such as cities) have potable water, so don't worry about drinking tap water. Bottled water is also available at low prices. Nevertheless, exercise caution about places with doubtful water sources. These places tend to be away from population centers or near the beach/coast. \n\n''Refrescos'' or simply ''frescos'' are beverages made from fresh fruit (cas, guayaba/guava, sandia/watermelon, mora/blackberry, fresa/strawberry, piña/pineapple, papaya), sugar and either water or milk (depending on the fruit). All ''sodas'' serve these.  You can also easily buy the standard international soda pops; 'Fresca', 'Canada Dry' and the local 'Fanta Kolita' (fruit punch) are recommended.\n\nTypical \"refrescos\" include: Agua de Cebada (Barley water) and Horchata de arroz.\n\nA common drink is called \"Cacique\", which is made from fermented sugar cane. It is sometimes called \"guaro\", which can also refer to alcohol in general. It is similar to vodka, and is usually drunk with water and lemon. It is very inexpensive, however note that it's not a very \"clean\" liquor, so exercise caution.\n\nThere are approximately 8 different national beers available (and most international), which are sold in cans, bottles and even kegs. The most common beers in the country are Pilsen and Imperial: all bars and restaurants serve both. Bavaria, \"Bavaria Negra\" (dark) and Bavaria Light are considered higher quality but more expensive, Rock Ice and Rock Ice Limón (lemon flavor) has a higher alcohol percentage. Heineken is locally made under license and is more expensive as well.\n\nCoffee in Costa Rica is of very top quality. It is common to have coffee, not only for breakfast, but during the afternoon as a little coffee break. \n\nA typical drink here is called ''Aguadulce'', which is a hot drink made of water and Panela (unrefined whole cane sugar). Aguadulce literally means \"sweet-water\".\n\n==Sleep==\n\n<!--DO NOT add links to specific accommodations or to booking sites here. The country article is for only general information about accommodations. Links to specific companies placed in this section without discussion will be blacklisted. -->\n\nYou can find many places to stay all over Costa Rica, including hotels, aparthotels, condos, vacation rentals, and cabinas. Hostels, Vacation Homes, Cabinas, and Condos can be less expensive than hotels and provide more flexibility in your adventure to Costa Rica. Costa Rica is known as a world leader for eco and sustainable travel and accommodations are often listed as 'eco-lodges'. They do tend to be more expensive though the government does have a well functioning certification program.\n\n==Learn==\n\nYou can learn Spanish in Costa Rica.  Reflecting the higher living standard, it's a little more expensive than other countries such as [[Guatemala]], but then again, the education level of your teachers will be much higher.\n\nCosta Rica is a great place to learn Spanish as the \"ticos\" have a dialect that is easy to understand and digest for someone just starting to learn the language. There are many language schools that provide intensive instruction with group classes lasting 4 hours per day, Monday to Friday. Almost all Spanish schools will also offer host family accommodations and possibly some alternative such as a student residence or discounted hotel rates.  \n\nThe key factor when going to study Spanish in Costa Rica is to decide what is the right location for you. The beach locations tend to be on the touristy side so they do not necessarily give the greatest immersion experience, however there are many Spanish schools near the beach as students like to split their time between studying Spanish in the classroom combined with activities on the beach or just relaxing on their time away from work. There is a growing trend of these Spanish schools at the beach also offering Surfing or Photography classes due to the environment around the school and the proximity to good surf. \n\nStudying in the San Jose area has many benefits. There is the luxury aspect of city life since it tends to be much more modern than the rustic beach locations. Host families and Spanish schools tend to have nicer facilities.  \nSan Jose also has fewer tourists so it is great from an immersion point of view as you can practice your Spanish in a setting where people are not automatically switching to English to accommodate your native language. It is much better that you struggle with your Spanish and force your brain to think in a different language so your communication becomes much smoother. \n\nThere are also a number of language schools that can be found throughout the Central Valley, particularly in Heredia and its surrounding cantons. These language schools typically offer only Spanish to foreign students from the United States and Europe but some, including the Instituto Norte Americano in Heredia, offer Spanish to foreign students, and English and Mandarin to local ones. Many of these language schools are also instrumental in helping the surrounding community, either through monetary donations or educational opportunities that otherwise may not have existed for the local Costa Rican population. Schools such as IAC (Instituto de Aprendizaje de Costa Rica) in Manuel Antonio, La Escuela Armonía in Guanacaste, as well as the Instituto Norte Americano in Heredia have frequently acted as educational hubs for their surrounding communities, giving free English classes to teachers of nearby schools and helping to raise money for worthy causes. Similarly in the Guanacaste region, Spanish schools such as Instituto Estelar Bilingüe in Liberia work closely with volunteer organizations and non-profits in the area in order to help the local people and give back to the community. Students are able to volunteer their time in a variety of ways while studying Spanish and travelling. \n\nSome hostels offer packages that include Spanish lessons and daily home-stays with the locals (in addition to your room and board). \n\nCosta Rica is also a good place to become proficient in ocean sports like surfing and scuba diving. There are numerous surf shops, that provide surfing lessons and surf camps throughout the coastal areas.\n\nCosta Rica has numerous private international K-12 schools where students are taught in either English or a mixture of English and Spanish. Education standards in these schools are comparable to that of private schools in countries such as the United States, at around a third of the cost. Lincoln School is one of the most highly regarded international schools in Costa Rica and Central America. Some of these schools also offer Spanish lessons for those who wish to learn.\n\n==Work==\nThe local newspaper, La Nación, has an extensive jobs listing every Sunday and Monday. You must be a resident or be sponsored by a company to work legally in Costa Rica.  ESL teachers can find work in Costa Rica with Bachelor`s Degree and a TESOL certification.  ESL teachers can expect to earn 226,700 - 566,750 CRC (monthly) and will usually teach 8 – 15 hours in a week. Contracts will usually not include accommodations (the employer may help), airfare, and health-care.\n\nCosta Rica is an open business country and investors are always welcome, so if you or your company is interested in founding a new or buying a business in Costa Rica, it is best to contact a Costa Rican lawyer about your interest in investing. \n\n===Volunteering===\nThere are several opportunities to engage in volunteer work in Costa Rica. Volunteer projects range from turtle conservation, building houses, teaching English and community development work.\nSome schools offer visits to Costa Rica as part of the World Challenge activity, which combines a Trekking expedition with some of the students time assigned to helping local people on community projects.\n\nSereval options to volunteer in Costa RIca.\n\n*[https://www.abroaderview.org/volunteers/costa-rica Volunteer Costa Rica]\n*[https://www.abroaderview.org/programs/sea-turtle-conservation Volunteering in Costa Rica]\n*[https://www.abroaderview.org/programs/language-immersion/costa-rica-escazu-immersion-spanish-lessons Gap Year Costa Rica]\n\n==Stay healthy==\n\nCosta Rica has one of the highest levels of social care in the world. Its doctors are known worldwide as some of the best. Many people from U.S, Canada and Europe go there to be treated, not only because the quality of the service but for the cost. First class Hospitals can be found in the capital.  There is a public/private hospital system.  There is excellent care in each.  The public system has much longer waits, while the private system has shorter waits.  If you are unfortunate enough to have a very sick child requiring hospitalization, the child will be transferred to the only children's hospital in CR, located in the capital.  This children's hospital is public.\n\nThere have been outbreaks of [[dengue fever]] in some areas of the country and an outbreak of [[malaria]] was reported in November 2006 from the province of Limon but just a few cases.  Protection against mosquito bites is very important, wearing lightweight long pants, long sleeved shirts and using insect repellents with high concentrations of DEET is recommended by the CDC. If you are going to be in very rural areas known to be malaria-infested areas, you might want to consider an anti-malarial med. However, most travelers to Costa Rica do just fine with updated childhood immunizations and taking preventative measures against mosquito bites (rather than take anti-malarial medication). [http://wwwnc.cdc.gov/travel/destinations/traveler/none/costa-rica '''The CDC has a complete list of recommended vaccines when traveling to Costa Rica.''']\n\n'''Tap water''' in urban areas of the country is almost always safe to drink. However, being cautious may be in order in rural areas with questionable water sources.\n\n==Stay safe==\nWith 1.9 million travelers visiting Costa Rica annually, travel is quite popular and common. Still, travelers to Costa Rica should exercise caution. The emergency number in Costa Rica is 911.\n\n* Traffic in Costa Rica is dangerous, so be careful. Pedestrians in general do not have the right of way. Roads in rural areas may also tend to have many potholes. Driving at night is not recommended.  \n\n* Use common sense. Do not leave valuables in plain view in a car or leave your wallet on the beach when going into the water. Close the car windows and lock the car or other things that you might not do in your own country.  \n\n* In the cities, robbery at knife point is not altogether uncommon. \n\n* The capital of San Jose is usually packed with foot traffic during any part of the day. However the streets rapidly become deserted shortly after dark when the public buses stop running. It is extremely dangerous to be walking in San Jose after dark when there is no foot traffic, and if you find yourself in this situation, it is recommended you find a taxi to go to wherever you need to go. \n\n* Buses and bus stops - especially those destined for San Jose - are frequent locations for robbery.  Any bus rider who falls asleep has a good chance of waking up and finding his baggage missing.  Don't trust anyone on the buses to watch your things, especially near San Jose.\n\n* Like any other tourist destination, watch out for [[Pickpockets|pickpockets]]. \n\n* Purse snatching, armed robberies and car-jacking have been on the rise lately.  Stay alert and protect your valuables at all times, especially in the [[San Jose (Costa Rica)|San Jose]] area.  \n\n* \"Smash and grabs\" of car windows do happen, so do not leave valuables in your vehicle, or if you must, make sure they are not visible.  \n\n* Another common robbery scheme includes slashing your tires, then when you stop to fix the flat, one or two \"friendly\" people stop to help and instead grab what valuables they can. \n\n* If you are motioned to pull over by anyone, do not do so until you are at a well-lit and safe place.\n* Make use of hostel or hotel lock boxes if they are really secure – this is great when you want to swim or kick back and really not worry. \n\n* On a long trip, it's advised that you make back-up CDs (or DVDs) of your digital photos and send a copy back home. In the event that you are robbed, you will thank yourself!\n\n* When encountering a new currency, learn the exchange rate from a reliable source (online ahead of time or a local bank, preferably) and create a little cheat sheet converting it to US dollars or the other Central American currency you are comfortable with. Travel with small denominations of US dollars (crisp 1s, 5s, 10s) as back-up... usually you'll be able to use them if you run out of local currency. \n\n* Go to a bank to change money when possible and practical. If you find yourself needing to use the services of a person who is a money changer (Sunday morning at the border, for instance) make sure to have your own calculator. Do not trust money changers and their doctored calculators, change the least amount of money possible and take a hard look at the bills – there's lots of false ones out there. Always insist that your change be in small bills – you'll lose more at one time if a large bill is false, plus large bills are hard to change (even the equivalent of USD20 in Costa Rica or USD5 in Nicaragua can be difficult in some small towns, believe it or not!) Money changers do not use the official exchange rate - you are better off going to a state owned bank to exchange your currency at no fee. \n\n* Do not exchange money at the San Jose airport in the luggage area. The exchange rate used there is not the official rate and you will get a lot fewer colones.  However there is a bank upstairs that has fair rates, it is next to where you pay your departure tax.\n\n* Traveling alone is fine and generally safe in Costa Rica, but carefully consider what kind of risks (if any) you are willing to take. Always hike with other people and try to explore a new city with other people. On solo forays, if you feel uncomfortable seek out a group of other people (both women and men). A well lit place with people you can trust is always a plus. A busy restaurant or hostel is a great source of local info as well as a great place to relax and recharge.\n\n===Narcotics===\n\nMarijuana traffic, distribution and commerce is illegal in Costa Rica, despite recreational marijuana use being quite popular among locals, as there is absence of law when you carry marijuana for personal use quantities only (a few joints) although police could try to get money from you or keep you in the local commissary for up to 12 hours.  The United States DEA is also present in Costa Rica and they have been known to disguise themselves as tourists.  There is a Costa Rican equivalent of the DEA as well.  It is not advised to do illegal drugs in Costa Rica.  It is also not advised to bribe a police officer.  Do so at your own risk.\n\n===Prostitution===\nProstitution is legal in Costa Rica and can be a destination for those looking for more than sun and surf on their vacation. San Jose and Jaco are hot spots for this activity. \nAs with any other sex destination, there are some tourists that hire minors. Prostitution with minors (less than 18 years old) is considered a crime in Costa Rica. The majority of sex tourists in Costa Rica are from the [[United States of America|United States]], and, if they engage in prostitution with a minor, are prosecutable by the Protect Act of 2003. This act gives the US government the power to prosecute US citizens who travel abroad to engage in sex tourism with children under the age of 18. Several other countries including [[France]], [[Canada]], the [[United Kingdom|UK]], [[Italy]], [[Germany]], [[Netherlands]], and [[Australia]] have similar laws. Arrests, warrants and prosecutions are being made under these laws.\n\n===Bus travel tips===\n\nBelow is a list of suggestions for traveling by bus in Costa Rica and neighboring countries. These are overcautious tips, but the bottom line is that they can help prevent being ripped off. Nearly all thefts on the bus are preventable thefts!\n\n* Travel with someone else when possible. A trusted friend is best, of course - not just someone you met last night at the hostel, but he or she will do in a pinch. (Trust your gut feeling with new friends – most are great, but some may be con artists!) Traveling with a friend makes the journey more entertaining and more fun:  you can talk and share travel stories and each of you can take turns sleeping on long bus rides. Also, there is the fact that \"two heads are better than one\" and it's always good to be able to brainstorm if you aren't sure what the answer to your travel question or concern is. \n\n* A money belt with your passport, cash, credit/debit cards and ticket (bus or plane) is a good way to carry your travel documents. Even if all your other belongings are stolen, you would still be able to get to your next destination. The waist belts are best; a neck pouch can be lifted while you are asleep. A thief would really have to disturb you and your personal space to get a waist belt.\n\n* On any bus ride (1st, 2nd, 3rd class, whatever!) try to sit above the luggage compartment so that you can watch that your bag doesn't \"walk away\" when others get off the bus. Costa Rican buses usually have one compartment for those heading to the main destination, and a separate one for people getting off along the way to avoid problems. Be aware if the \"destination\" compartment is opened en route!\n\n* Try not to fall asleep or take turns with a travel partner (when you are lucky enough to have one.) Best way to snooze alone is with your bag on your lap and your hands crossed over it. Don't leave valuables in outside compartments.\n\n* Make conversation with locals on the bus so that they can see that you are competent in Spanish and comfortable in the Spanish speaking environment. (You'll enjoy yourself plus this may make them feel friendly towards you and more willing to alert you if someone is snooping in your stuff. Or it might warn them that if they steal from you, you will talk to the bus driver and police and make a full report.) Even some Spanish is better than none – use what you have! It's great practice and the more you improve the safer you'll be! \n\n* Don't bring anything that you are not willing to lose. Keep your day pack '''attached to you''' at all times when traveling – the straps get wrapped around your leg and the bag squeezed between your knees or feet. You don't want to lose your travel notes, camera, etc.\n\n* Be cautious about leaving anything in the overhead bins.  Almost 100% of all thefts on buses are from the overhead bins.  Keep it on your lap if possible.\n\n===Beaches, weather and wildlife===\n\nThe coasts of Costa Rica are known for strong currents and rip-tides in some areas but most of them are great to be with the family. Costa Rica has some of the best beaches in the world. The Atlantic coast is just five hours away from the Pacific one and both offer completely different views and landscapes. There are no signs indicating an unsafe beach due to riptides, so take precautions and listen to the locals on where it is safe to swim. The public beaches do not have life guards.  A traveler should learn how to swim out of a rip tide and not swim alone.  There are some active volcanoes in Costa Rica and they ''are'' dangerous, so follow the warning signs posted. The slopes of the Arenal volcano invite visitors to climb closer to the summit, but there have been fatalities in the past with unseen gas chambers. Also be wary of the climate of Costa Rica. It is very hot in the daytime, but in the morning and evening it becomes very cool, so you should bring a light weight jacket.\n\n*'''Crocodiles''' are quite common in certain parts of Costa Rica and, although not as dangerous as the Nile or saltwater species, are still considered occasional man-eaters and can grow to lengths of up to 20 feet/6 meters. The biggest spot for them is the Tarcoles river bridge in the central pacific as posted in the Jaco wiki. It is recommended to stop the vehicle nearby and walk across it. Some locals throw chicken meat and watch them eat. Great care should be taken when swimming or snorkeling, especially near areas where fishing is common or near river mouths. \n\nWhen you go to the Guanacaste beaches on the Pacific you can see some crocodiles over the Tempisque river. The bridge across this river was donated by the Taiwanese government. (Subsequently, China gave away a 35000-seat stadium after Costa Rica ended diplomatic recognition of Taiwan.)\n\n*While large, the beautiful '''jaguar''' is extremely rare and even most locals have never seen the very large predatory cat. They appear to be very shy and elusive; there is very little risk of attack. \n\n*'''Bull sharks''' share much of the same territory as the crocodiles and probably account for more shark related attacks in the world than any other species.\n\n*'''Dogs''' are trained to be protective of property and people (perro bravo) and there are also many strays.  Dog bites are not uncommon.  Do not approach an unknown dog. Get a rabies shot if bitten.\n\n=== Gay and lesbian ===\n\nCosta Rica is a very conservative and traditionalist nation. The state's official religion is Roman Catholicism and its population is quite religious. Nevertheless, Costa Rica caters to the [[Gay and lesbian travel|gay and lesbian traveller]] and his or her needs.  There is a thriving gay scene in [[San Jose (Costa Rica)|San Jose]] with many gay and lesbian options for night-life (La Avispa, Club Oh!, Bochinche among others). The Manuel Antonio, Jacó, and Quepos area is also a favorite spot with several gay hotels and bars.\n\nThere are a good number of Gay/lesbian or Gay-Friendly accommodations in Costa Rica. Accommodations seem to be of the higher quality offering a variety of services and of course, discretion. Many hotels, travel agencies, and resorts are run by gays and/or are gay-friendly.\n\n===Medical Tourism ===\n\nAccording to the Costa Rica Tourism Board, about 200 medical procedures are performed every month at the nation's hospitals for medical tourists.  Among the procedures done are cosmetic surgery, knee and hip replacement, cataract removal and other eye treatments, weight loss surgery and dental care.   Health care in Costa Rica is attractive for international patients because of the low prices, high care standards, and access to tourist attractions.  For example, a hip replacement costs around USD12,000 and a tummy tuck costs around USD4,400.\n\nThe main medical tourism centers are CIMA Hospital, Hospital Clinica Biblica and Hospital Hotel La Catolica. In turn, these hospitals use medical tourism facilitators who can arrange every aspect of your trip from beginning to end.\n\n==Contact==\n\nThe international calling code/country code for Costa Rica is 506.<br>\nA postage stamp to Europe is 125 Colones (around 21 US cents).\n\nThe primary means of outside contact are through email and public pay telephones. \n\nInternet cafes are fairly easy to find in tourist areas, with prices all over the place. Some of these offer long distance calls over the internet.\n\nPublic phones are accessed with calling cards (tarjetas telefonicas) which can be purchased at most shops, even in outlying areas. \n\nThere are four different types of pay-phones:\n\n* Coin phones (very rare). Note that these only accept the older silver-colored coins.\n\n* Chip phones. These phones allow you to insert a chip-type calling card into them and make your calls. \n\n* Colibri phones. These phones have a small swipe bar for a scratch off type calling card referred to as a Colibri calling card which are available from 500 colones and up. The swipes often don't work--you always have to enter the calling card access code on the keypad. Despite this, the Colibri calling card is the recommended one to buy as you can use it any of the types of phones whereas with a chip card you must search for a chip phone. \n\n* Multipago (multi-pay) phones. These phones accept coins, chip cards and colibri cards. Most public phones around the country have been changed for this type of phones. They also allow you to send SMS messages and emails as well.\n\nBoth types of calling cards are typically available in pharmacies and other locations where you see the sticker on the door. \n\nDomestic calls are quite cheap and the price is the same wherever you call. Calls to cellular phones are charged significantly more though.\n\nInternational calls are fairly expensive. The cheapest way to make them is over the internet using a service such as Skype at an Internet café. But making short calls using the domestic calling cards (you can make international calls using these but the denominations of the calling cards are quite small so your call will be short!) or the international calling cards available within Costa Rica is the next best deal. Certainly better than credit card calls or using a US calling card generally. \n\nCell service in Costa Rica is provided using GSM technology at 1800 MHz and 3G data operating at 850MHz.  Note that the GSM phone systems in the United States and Canada use different frequencies and that travelers from there will need a \"world\" handset, such as a tri-band or quad-band phone, if you want to use your existing cell phone.  Most of the country has very good GSM coverage (including most of the capital).   Roaming is possible with a GSM handset (i.e. using your regular cell number that you use in your home country) but can be extremely expensive.\n\nIf you want to use a local Costa Rica number, you can rent cell phone service, and of course anyone can buy a cell phone.  You used to have to be a documented resident of the Costa Rica to own your own cell phone number, and even then you only got one if there are numbers available.  You still have to be a resident if you want monthly billed service to an address (such as in the U.S.).  But since the passage of the CAFTA treaty in 2009, the government cell phone monopoly has been broken and service is now provided by many operators, including Grupo ICE [http://www.grupoice.com] under the Kölbi brand, TuYo Movil (reselling the ICE service), Movistar and Claro (the latter two also providing service throughout Latin America).  Currently coverage on Kölbi is best because the network is the oldest and most built out (e.g. there is no Movistar service in Monteverde. Update: 2014-11-2 There is now HSPA+ Movistar service in Monteverde).  \n\nIf you have an unlocked cell phone (either one from home or bought in Costa Rica -- all cell phones sold in Costa Rica must be unlocked), prepaid (''prepago'') SIM cards can provide a local number and service can be purchased throughout the country by anyone with a passport from any country, or a ''cedula'' (Costa Rican ID card).  At the baggage claim at the San José airport is a Kölbi kiosk, and you will also see signs Kölbi, Movistar, Claro, and others throughout the country where service is for sale.  Rates are set by the government and you can get a SIM for as little as USD2 (Movistart 2014-11-1) and 3G (or sometimes just EDGE) data service is also available by the day, week, or month for ¢300 or less a day.  To add value you buy a ''recarga'' (recharge card), scratch off the card to get a PIN, and text the PIN from your phone to a special number.  To keep the card active, it must be recharged at least once in a 120 day period.  If it is not charged within a 120 days, you have a 30 day grace period before your SIM chip is deactivated and you lose your phone number.  Also keep in mind that you may have trouble getting your SIM activated on Sunday, because like many things in Costa Rica, the SIM activation system may be shut down on Sundays.  Also not all shops sell SIMs -- many just sell the recharge cards.  Get your SIM at the airport if you can.\n\nMost tourist areas (hotels, coffee shops, bars, restaurants) have Wi-Fi access for free.  Just ask someone for the password.  You can bring your smart phone loaded with skype or google phone and make calls to your home country. It is an easy way to stay connected with email and social media.\n\n[[Category: Countries]]\n[[Category: Costa Rica]]\n\n[[ca:Costa Rica]]\n[[de:Costa Rica]]\n[[eo:Kostariko]]\n[[es:Costa Rica]]\n[[fi:Costa Rica]]\n[[fr:Costa Rica]]\n[[he:קוסטה ריקה]]\n[[hu:Costa Rica]]\n[[it:Costa Rica]]\n[[ja:コスタリカ]]\n[[nl:Costa Rica]]\n[[pl:Kostaryka]]\n[[pt:Costa Rica]]\n[[ru:Коста-Рика]]\n[[sv:Costa Rica]]\n[[zh:哥斯大黎加]]\n[[wts:Category:Costa Rica]]\n\n[[WikiPedia:Costa Rica]]\n[[Dmoz:Central America/Costa Rica/]]\n[[World66:centralamericathecaribbean/costarica]]\n\n{{IsPartOf|Central America}}\n{{outline}}\n{{countryguide}}\n{{title-icons|dotm-icon}}"
        }
    }
}