{
    "parse": {
        "title": "Czech Republic",
        "pageid": 373,
        "wikitext": {
            "*": "{{pagebanner|Prag altstaedter ring 02.jpg}}{{quickbar\n| image=České Budějovice - náměstí z Černé veže.jpg\n| caption=Přemysl Otakar II Square in [[České Budějovice]]\n| location=Czech Republic in its region.svg\n| flag=Flag of the Czech Republic.svg\n| capital=[[Prague]]\n| government=parliamentary democracy\n| currency=Koruna (CZK)\n| area=''total:'' 78,866&nbsp;km² \n| population=10,553,443 (2015 est.)\n| language=[[Czech phrasebook|Czech]]\t\n| religion=undeclared 45.2% <br> atheist 34.2% <br> Roman Catholic 10.3% <br> Protestant 0.9% <br> other 2.7% <br> unspecified 6.7% \n| electricity=230V/50Hz (European plug)\n| callingcode=420\n| tld=.cz\n| timezone=UTC + 1 (winter time) UTC+2 (summer time)\n}}\nThe [http://www.czechtourism.com '''Czech Republic'''] (officially known by its short name, [http://en.wikipedia.org/wiki/Czechia#Etymology '''Czechia''']) is a small landlocked country in [[Central Europe]], situated southeast of [[Germany]] and bordering [[Austria]] to the south, [[Poland]] to the north and [[Slovakia]] to the southeast.\n\n==Understand==\nThe Czech Republic is not a geographically large country, but it has a rich and eventful history. From time immemorial, Czechs, Germans, Jews and Slovaks, as well as Italian stonemasons and stucco workers, French tradesmen and deserters from Napoleon’s army, have all lived and worked here, all influencing one another. For centuries they jointly cultivated their land, creating works that still command respect and admiration today. It is thanks to their inventiveness and skill that this small country is graced with hundreds of ancient castles, monasteries and stately mansions, and even entire towns that give the impression of being comprehensive artifacts. The Czech Republic contains a vast amount of architectural treasure, as well as beautiful forests and mountains to match.\n\n===History===\nThe contemporary Czech lands were originally inhabited by the Boii, a Celtic tribe for the first four centuries of the common era. After the fall of the Roman Empire, the Celts gave way to Germanic tribes. Another four centuries later, Slavs arrived from the east, and by the 9th century, had established the Great Moravian Empire, stretching from modern-day Germany to [[Ukraine]]. After the fall of Great Moravia, the Lands of the Bohemian Crown was formed, whose borders for most of its history remain nearly identical to contemporary Czech borders. From the 11th to the 14th century, massive ethnic German colonization, known in German as the ''Ostsiedlung'', occurred in the then-underpopulated borders of the kingdom. \n\nUnder the reign of Emperor Charles IV in the second half of the 14th century, the Bohemian Kingdom became the center of the Holy Roman Empire, with [[Prague]] as its capital, ushering in the kingdom's golden era. Under his enlightened and largely peaceful reign, royal investment into Czech institutions, culture, education, and infrastructure received royal patronage. Among some of those gifted with Charles IV's personal and financial support (many of which today bear the emperor's name) were Prague's Charles Bridge, Charles University, its New Town, St. Vitus Cathedral, Karlštejn Castle, and the foundation of the city of [[Karlovy Vary]]. Bohemia's golden era came to an end with Charles' death in 1378. \n\nFollowing Charles' death, the kingdom slowly slid into religious anarchy. The rise of Jan Hus and his Hussite followers in the 1410s violently rejected the supremacy of the Roman Catholic Church, sparking a series of Hussite Wars that lasted until the 1430s, placing Czech proto-Protestant peasants and sympathetic lords against crusading Catholic armies. Divided into various factions that often fought amongst themselves as they did against Catholics, Hussite Bohemia won a degree of autonomy from the Catholic Church during the 15th century, helped in part by an uneasy peace held between Hussite King George of Poděbrady and Rome. His successor, the Catholic Vladislaus II, caused many Hussite areas of the kingdom to revolt, which successfully forced the monarch to acknowledge the Hussites' religious freedom. \n\nThe Bohemian Kingdom was inherited by the Habsburg-led Austrian Empire after King Louis II was killed fighting the Turks at the Battle of Mohács in 1526, an event that would have tremendous repercussions for the next four hundred years. In 1618, the kingdom revolted against its Catholic Habsburg administrators, sparking the tumultuous Thirty Years' War. Defeated and humiliated at the Battle of White Mountain in 1620, the Czechs endured a strong Habsburg imperial occupation and forced Catholicization for decades to come. Despite the occupation, the Czech lands prospered under Austria, with Baroque palaces and buildings spreading across the kingdom throughout the 17th and 18th centuries. The Czech lands became one of the first to industrialize by the 19th century, rising to one of the most economically advanced parts of the empire. At the same time, the Czech National Revival spurred nationalist and pan-Slavic feelings among the populace, which resulted in a cultural backlash against Austrian Germanization.  \n\n[[Image:Night view of the Castle and Charles Bridge, Prague - 8034.jpg|thumb|Prague Castle and the Charles Bridge.]]Shortly before the end of World War I and the collapse of the Austro-Hungarian Empire, the closely-related Slavic nations of Czechs and Slovaks declared their independence, merging together to form the new state of Czechoslovakia on 28 October 1918. With Tomáš Garrigue Masaryk, a highly-esteemed philosopher and sociologist (who remains well-regarded to the current day) as head of state, the First Republic—as it became known—managed to remain as the only democracy in Central Europe throughout the 1920s and '30s. Highly industrialized and pragmatic, the First Republic acted as an island of stability, facing off threats from a revanchist [[Poland]] to the north, politically unstable [[Austria]] and [[Germany|Weimar Germany]] to the south and west, and an irredentist [[Hungary]] to the southeast. The First Republic culturally and economically flourished during this period, and is often considered as another golden era by many modern Czechs. However, the state's strong centralization resulted in a poor relationship with its Sudeten German population, who accounted for 20% of the overall population—more than the state's total amount of Slovaks—as well as with its smaller Hungarian and Polish minorities. Combined with the rise of fascism and ethnic nationalism, this situation was exploited by Hitler, Hungary's Horthy and Poland's Śmigły-Rydz as a pretext to annex large swaths of Czechoslovakia in 1938 during the Sudetenland Crisis, effectively ending the First Republic. A year later in March 1939, Nazi Germany occupied the remaining rump Czech lands and declared it a protectorate of the Third Reich, while Slovakia was forced to secede as a puppet state. This resulted in a brutal occupation that lasted until 1945, marked by mass arrests, torture, and the genocide of much of Czechoslovakia's Jewish and Romani population. A major event during the occupation was the complete destruction of the village of Lidice, located 22 km (14 mi) northwest of Prague, in reprisal for the assassination of Reich Protector Reinhard Heydrich by British-trained Czechoslovak paratroopers. \n\nAfter World War II, the newly-reunited Czechoslovakia expelled nearly the entirety of its ethnic German population, as well as tens of thousands of Hungarians by force with the Beneš Decrees, an act of mass revenge that remains controversial to this day. The country miraculously emerged from the conflict more or less intact as it avoided the air bombardments and pitched battles that reduced its neighbouring states to ruins. However, the country fell within the Soviet sphere of influence, with the Czechoslovak Communist Party staging a coup in February 1948, toppling its democratic government. \n\nAt the beginning of the Stalinist 1950s, massive and numerous Soviet-inspired show trials, purging “subversive conspiratorial elements” took place; the most commonly known was the death sentence of anti-fascist social democrat Milada Horáková. Following Stalin's death and the subsequent de-Stalinization of the country, more moderate forces gradually took control of the Communist Party, which included party leader Alexander Dubček, who wished to liberalize Czechoslovakia and create “socialism with a human face.” In a brief period known as the Prague Spring (''Pražské jaro''), travel, media and speech restrictions were greatly loosened, and the country would be federalized. By August 1968, a Soviet-led Warsaw Pact invasion force militarily deposed Czechoslovakia's liberal leadership and ended its new freedoms. Mass anti-Soviet demonstrations in the following year ushered in the Normalization era (''Normalizace''), a period of harsh repression and conservatism. In November 1989, in the wake of elections in [[Poland]], protests in [[Hungary]], and the collapse of the Berlin Wall nearby in [[Germany]], the totalitarian lid could no longer be held. Growing popular discontent and the brutal actions of the state police spilled over into mass demonstrations that helped topple the communists peacefully, in an event known as the Velvet Revolution. A democratic federal government was quickly installed.\n\nAt the stroke of midnight on 1 January 1993, Czechoslovakia peacefully dissolved upon an agreement between Czech bureaucrats and Slovak nationalists in the Velvet Divorce, becoming the new states of the Czech Republic and [[Slovakia]]. Joining NATO in 1999 and the EU in 2004, the contemporary Czech Republic is a stable, democratic parliamentary republic. \n\nThe Czech flag is the same one formerly used by Czechoslovakia, originally adopted in 1920.\n\n===Holidays===\n[[Image:Fájl- Karlovy Vary.jpg|thumb|Spas and apartments in [[Karlovy Vary]].]]\n*'''New Year's Day, Restoration Day of the Independent Czech State''' (''Nový rok, Den obnovy samostatného českého státu''), 1 January: Celebration of the New Year and the 1993 splitting of Czechoslovakia. Most businesses are closed, with most staying indoors with their families.\n*'''Good Friday''' (''Velký pátek''), the Friday before Easter: A day of church services for the faithful, although most Czechs take the opportunity to start a four-day Easter weekend. Some businesses will be closed or with irregular hours. \n*'''Easter''' (''Velikonoce''), Easter Monday: It is customary for guys to (slightly) spank girls and women with a wicker stick with colourful ribbons at the end (''pomlázka'') to grant them fertility and good health, and in return girls and women will give the men coloured eggs, candy or drinks. In areas close to the Slovak border in Moravia, it also common to douse women with cold water. Obviously tourists are often (but not always) exempt. \n*'''Witch Burning''' (''Pálení čarodějnic'') or '''Night of Witches''' (''Čarodějnice''), 30 April. On the last April evening, bonfires are lit around the country. \"Witch\" effigies, as a symbol of evil, are made and burned in the fire. This is the reinterpretation of the old pagan festival Beltane, influenced by the Catholic inquisition. As some Czechs prefer witches over the inquisitors, in many fires no witches are burnt, and the feast is celebrated in a more original pagan way - witches are those who should celebrate the night, not be burnt. It doesn't stop jokes like \"Honey, hide or you will be burnt tonight!\". This is a cultural holiday, and not a public one.  \n*'''May Day''' (''Svátek práce''), 1 May: Celebration of workers rights and struggles. Once an enormous affair during communism, since the collapse of the Eastern Bloc, May Day is now largely a quiet day of rest and barbeques, with only some small political gatherings by social democrats or unrepentant communists. A public holiday with most businesses closed.  \n*'''Liberation Day''' (''Den vítězství''), 8 May: Commemoration of the defeat of Nazi Germany. A public holiday with most businesses closed.\n*'''Last Ringing''' (''Poslední zvonění''), late April to mid May: Traditional celebration of the end of the last year at high school, usually a week or more before ''maturita'' (the final exam) takes place. Students get a free day and usually do silly things in costumes, sometimes going into the streets to collect money from people passing by, sometimes threatening them with water, writing on their faces with lipstick, or spraying them with perfume. The collected money is used for parties after the exams. \n*'''St. Cyril and St. Methodius Day''' (''Den slovanských věrozvěstů Cyrila a Metoděje''), 5 July: Celebration of the Christian saints' arrival in the Slavic lands of Great Moravia. A public holiday with most businesses closed.\n*'''Jan Hus Day''' (''Den upálení mistra Jana Husa''), 6 July: Celebration of proto-Protestant religious agitator Jan Hus. A public holiday with most businesses closed. \n[[Image:opa.JPG|thumb|The Czech Silesian city of [[Opava]] during Christmas.]]\n* '''Czechoslovak Independence Day''' (''Den vzniku samostatného československého státu''), 28 October: Commemoration of Czechoslovakia's independence declaration from the Austro-Hungarian Empire in 1918, marked usually by political speeches and flag displays. A public holiday with many businesses closed.\n*'''Day of Struggle for Freedom and Democracy''' (''Den boje za svobodu a demokracii''), 17 November: Commemoration of the start of the 1989 Velvet Revolution and the collapse of the Czechoslovak communist state, marked normally by political speeches and marches. A public holiday with most businesses closed. \n*'''Feast of St. Mikuláš (St. Nicholas, Santa Claus)''', 5 December: St. Mikuláš roams about with his consorts, an angel and a devil across the country. Mikuláš gives small presents and candy to children to reward good behaviour, while the devil chastises children for wrongdoings over the course of the year and gives them potatoes, coal (or sometimes spankings) as a punishment. Old Town Square in Prague is a great place to watch the festivities. Strictly a cultural holiday. \n*'''Christmas''' (''Vánoce''), 24-25 December: Czechs begin celebrating this holiday on Christmas Eve and continue to celebrate until the 26th (the Feast of Stephen). Presents are placed under a Christmas tree by ''Ježíšek'' (Baby Jesus), as little children believe, and taken after dinner on Christmas Eve. Potato salad with carp is the traditional Christmas meal, and for this reason one can see live carp being sold out of huge tanks throughout the streets of Czech cities and towns just before Christmas.\n\n===Historic regions===\n====Bohemia====\nAlthough the modern adjective ''bohemian'' refers to Bohemia, its usage was based on a broad stereotype and also a poor grasp of geography, so don't expect the Bohemians you meet to be nomadic or anti-conventional artistic/literary ''bohemians'', or to see anything out of Puccini's \"La Bohème\". And no, ''Bohemian Rhapsody'' (its lyrics sprinkled with Italian and Arabic) is not a local anthem!\n\nThe words ''Bohemia'' and ''Bohemian'' originate from the Boii Celtic tribe. The term ''Bohemian'' had ended up meaning more or less ''Czech'' by the end of the 19th century with the awakening of pan-Slavic nationalism. However, it was also used to refer to any inhabitant of Bohemia, including the vast number of Sudeten Germans that used to inhabit the region until 1945. Bohemia (''Čechy'') today strictly refers to the larger western half of the country, and is its political, economic and population centre.\n\n====Moravia and Czech Silesia====\n[[Image:ArionOlomouc.JPG|thumb|[[Olomouc]], the historic capital of Moravia.]]\nMoravia, along with Bohemia, was among the first regions of continental Europe to undergo the Industrial Revolution, as evidenced by its extensive rail system, and historic factories such as Zbrojovka (weapons) in Brno and Baťa (shoes) in [[Zlín]]. Despite this history, Moravia did not experience the process of mass urbanisation as in neighboring Bohemia. As a result, Moravia is still home to gorgeous vineyards, orchards, fields of organic produce, scenic mountain vistas, and a landscape dotted with sleepy villages. Even the regional capital and its largest city, [[Brno]], remains known for its small town atmosphere. The region's strategic location at the Moravian Gate (a pass through the imposing mountain ranges of Central Europe) has led to a confluence of a great amount of history.  Culturally, Moravians prefer a slower pace of life than Bohemians, with some Moravians confessing to have stronger affinities with [[Slovakia]] than with Bohemia. \n\nThe dialects of Czech spoken in Moravia are slightly different from those spoken in neighboring Bohemia, particularly in Prague. Moravians pride themselves on their dialect and learning a few stereotypical regionalisms will go down well with the locals (for example, for the word \"tram,\" say ''šalina'' (SHAL-lin-NUH) instead of the Bohemian ''tramvaj'').\n\nCzech Silesia to the very east is often regarded as the heavy industrial center of the republic, known extensively for its coal mines and steel mills, with [[Ostrava]] as its largest city and cultural center, and [[Opava]] as its historical capital. The region is known also for its extensive cross-border cultural connections with [[Silesian Voivodeship|Polish Silesia]], whose industrial economy and historical experience is similar, along with many families split by the border. There is also a fairly significant Polish minority near the border, although they have, for all intents and purposes, fully integrated into Czech society. \n\nSilesian dialects are also markedly different from those found elsewhere in the country, often being characterized as being short, gruff, and to the point according to Bohemians and Moravians.\n\n==Regions==\nThe Czech Republic has 14 political regions (''kraj'') which can be grouped together into eight general regions:\n\n{{Regionlist\n\n| regionmap=Czech-regions.png\n| regionmaptext=Regions of Czech Republic\n| regionmapsize=440px\n\n| region1name=[[Central Bohemia]]\n| region1color=#6698bb\n| region1items=[[Prague]], [[Kutná Hora]], [[Karlštejn]]\n| region1description=The metropolitan centre of the Czech Republic with its capital city, known for its river valleys, extinct volcanic mounds, and green pastures.\n\n| region2name=[[West Bohemia]]\n| region2color=#c5995c\n| region2items=[[Pilsen]], [[Karlovy Vary]], [[Mariánské Lázně]], [[Františkovy Lázně]]\n| region2description=A forested and mountainous region, home of the pilsner beer, numerous spas towns, and the Bohemian Forest (''Šumava'').\n\n| region3name=[[North Bohemia]]\n| region3color=#608860\n| region3items=[[Liberec]], [[Ústí nad Labem]], [[Děčín]], [[Bohemian Paradise]]\n| region3description=A mountainous and coal mining region with a strong industrial past, and the location of the Ore Mountains (''Krušné hory'') and parts of the Giant Mountains (''Krkonoše''). Site to numerous winter resorts.\n\n| region4name=[[East Bohemia]]\n| region4color=#c8b7b7\n| region4items=[[Hradec Králové]], [[Pardubice]], [[Litomyšl]], [[Špindlerův Mlýn]]\n| region4description=Main location of the highly-popular Giant Mountains (''Krkonoše'') and the Czech Republic's highest peak, Sněžka. \n\n| region5name=[[South Bohemia]]\n| region5color=#dde58b\n| region5items=[[České Budějovice]], [[Český Krumlov]], [[Třeboň]]\n| region5description=Hilly, forested landscapes, and the source of the Vltava River. A highly popular area for rafters in the summer.\n\n| region6name=[[Bohemian-Moravian Highlands]]\n| region6color=#608860\n| region6items=[[Telč]], [[Třebíč]], [[Žďár nad Sázavou]]\n| region6description=A very green and uneven region, considered the geographic heart of the country.\n\n| region7name=[[North Moravia]]\n| region7color=#a4c28d\n| region7items=[[Ostrava]], [[Olomouc]], [[Opava]], [[Litovel]]\n| region7description=A highly industrial region which includes Czech Silesia, although dotted with beautiful hills and mountains. \n\n| region8name=[[South Moravia]]\n| region8color=#b383b3\n| region8items=[[Brno]], [[Znojmo]], [[Zlín]], [[Lednice-Valtice]]\n| region8description=Well-known for its rural and slow pace of life, warm summers, rolling vineyards, and its potent plum brandy (''slivovice'').\n\n}}\n\n==Cities==\n[[Image:Catedral de San Pedro y San Pablo - Brno - República Checa (7139907551).jpg|thumb|The Cathedral of St. Peter and Paul is a prominent site in [[Brno]], the country's second largest city.]]\n*[[Prague]] (''Praha'') — the country's capital and largest city, and one of Europe's premier tourist destinations. Its large and beautiful historical core is listed as a [http://whc.unesco.org/en/list/616 UNESCO World Heritage Site].\n*[[Brno]] — the largest city in Moravia and the republic's second city, with several excellent museums, an accessible old town, a stunning cathedral, and the annual Grand Prix.\n*[[České Budějovice]] – known also as Budweis, an attractive city in [[South Bohemia]] with an impressive old town square.\n*[[Český Krumlov]] — a stunning medieval and Renaissance town in [[South Bohemia]], home to the country's second largest palace, and is a [http://whc.unesco.org/en/list/617 UNESCO World Heritage Site]. \n*[[Karlovy Vary]] — a historic spa resort and the republic's largest, especially popular with German and Russian tourists, and the site of the country's most prestigious film festival. \n*[[Kutná Hora]] — a historical medieval town in [[Central Bohemia]], home to St. Barbara's Church, old silver mines, and the Sedlec Ossuary, decorated with tens of thousands of human remains. Its attractions are listed as a [http://whc.unesco.org/en/list/732 UNESCO World Heritage Site]. \n*[[Olomouc]] — a riverside university town with a thousand-year history, and the second largest historical centre in the Czech Republic after Prague. \n*[[Ostrava]] — a vibrant and sometimes gritty blue collar city with a strong subculture, and a long history of coal mining and steel production.\n*[[Opava]] — the former capital of Silesia.\n*[[Pilsen]] (''Plzeň'') — home of the original Pilsner Urquell beer and the Škoda Works, and the largest city in [[West Bohemia]].\n*[[Telč]] — a perfectly preserved Renaissance town centre surrounded by shallow man-made lakes. The town is a [http://whc.unesco.org/en/list/621 UNESCO World Heritage Site].\n*[[Zlín]] - Beautiful example of functionalistic architecture inspired by garden cities of Le Corbusier and rebuilt by Baťa shoemaker family. The town is set in small hills, nature, zoo and spa literally behind a hill.\n\n==Other destinations==\n[[Image:Hrad Trosky, letecký snímek.jpg|thumb|Trosky Castle near the [[Bohemian Paradise]].]]\n*[[Bohemian Paradise]] (''Český Ráj'') — a region of towering rock formations and isolated castles located north-east of [[Prague]]. The gateway city of Jičín is an interesting destination in its own right, but Turnov is closer to most of the castles and rock formations. The twin towers of the ruined Trosky Castle  are a symbol of the area and can be climbed for stunning views.\n*[[Dvůr Králové nad Labem]] — a small town 20 km west of Trutnov in [[East Bohemia]] with a large outdoor zoo and safari park.\n*[[Františkovy Lázně]] — a traditional spa town in [[West Bohemia]].\n*[[Jaroměřice nad Rokytnou]] — a small town 50 km south of Jihlava, home to Jaroměřice Castle, known as the Moravian [[Versailles]], and the Church of St. Margaret.\n*[[Karlštejn|Karlštejn Castle and St. John Monastery]] — an exquisite medieval castle dating to Charles IV, as well as an off the beaten track monastery.\n*[[Krkonose|Krkonoše]] (''Giant Mountains'') — the highest mountains in the Czech Republic along the Polish border, home to the most popular Czech skiing resorts, such as [[Špindlerův Mlýn]], however considered overpriced by locals.\n[[Image:Litomysl.JPG|thumb|Litomyšl monastery gardens]]\n*[[Litomysl|Litomyšl]] — a beautiful small town in [[East Bohemia]]. The renaissance main square and castle are among the country's prettiest, and the town has been home to many important and influential artists, including composer Bedřich Smetana, sculptor Olbram Zoubek and painter Josef Váchal. There are two international opera festivals at the castle each year. The castle is a [http://whc.unesco.org/en/list/901 UNESCO World Heritage Site].\n*[[Luhačovice]] — one of the best known Moravian spa towns.\n*[[Mariánské Lázně]] — a popular spa town in [[West Bohemia]].\n*[[Moravian Karst|Moravský Kras]] — an extensive karst area between [[Brno]] and [[Olomouc]] with the deepest abyss in the country. In its Punkva Caves, visitors not bothered by claustrophobia have the opportunity to take a boat ride along an underground river. \n*[[Mutenice Wine Region|Mutěnice Wine Region]] — located in [[South Moravia]], this region contains some of the best vineyards in the Czech Republic, and remains off the well-beaten path for most international tourists.\n*[[Nové Město na Moravě]] — a cross country skiing resort, and home of the Tour de Ski race.\n*[[Terezín]] — a red-brick 18th baroque fortress 70 km north of Prague in [[Central Bohemia]] beside the Ohře river, used during WWII as a Jewish ghetto, transit center, and concentration camp.\n*[[Znojmo]] — a medieval town close to the [[Austria|Austrian]] border in [[South Moravia]], site of the Rotunda of the Virgin Mary and St Catherine, containing the oldest frescoes in the republic.\n*[[Chomutov]] — an industrial city with a historical center, a zoo specializing in Eurasian fauna and Kamencové Lake, the only alum lake in the world.\n\n==Get in==\n{{infobox|Maximum length of stay on a visa exemption|* As a Schengen state, ''in general'', non-[[EEA]] citizens who qualify for a visa exemption can only stay for a maximum of 90 days in a 180 day period within the Schengen zone (including the Czech Republic) '''''as a whole'''''.\n* '''''However''''', for non-EU/EFTA citizens whose home country/territory had an existing '''bi'''lateral visa exemption agreement with the Czech Republic before it fully implemented the Schengen ''acquis'', the maximum length of stay on a visa exemption as stipulated in the bilateral agreement continues to apply, rather than Schengen regulations. In effect, this means that for these non-EU/EFTA citizens, they can spend up to 90 days in the Czech Republic visa-free and are '''not''' limited by the Schengen limit of 90 days in a 180 day period.\n* Non-EU/EFTA citizens whose home country/territory had an existing bilateral visa exemption agreement with the Czech Republic before joining the EU are: Andorra, Argentina, Brazil, Brunei, Costa Rica, Chile, Croatia, El Salvador, Guatemala, Honduras, Hong Kong SAR, Israel, Japan, Macao SAR, Malaysia, Mexico, Monaco, New Zealand, Nicaragua, Panama, San Marino, Serbia, Singapore, South Korea, Uruguay, the Vatican and Venezuela - but '''not''' Australia, Canada or the United States.\n* More information about these bilateral visa exemption agreements is available with the [http://www.mvcr.cz/mvcren/article/entry-stay-and-permanent-residence-in-the-czech-republic-third-country-nationals.aspx Ministry of the Interior] (under the 'Conditions for a short-term stay' section) as well as this [http://prague.tv/articles/relocation/schengen article]. [http://www.unece.org/env/lrtap/ExpertGroups/aa/XG.AMMONIA.Visa%20waiver%20for%20CZ.doc This document] also provides a comprehensive list of visa waiver agreements with the Czech Republic (some countries have unilateral, rather than '''bi'''lateral visa agreements).}}\n===Visa requirements===\n====Travel document requirements====\nFor EU, EEA and Swiss nationals, passports and national identity cards only need to be valid for the period of their stay in the Czech Republic. For all other nationals, passports/travel documents must be valid for a period of '''at least 90 days''' beyond the expected length of stay in the Czech Republic or the Schengen Area.\n\nEU nationals whose stay in the Czech Republic will exceed 30 days are required to register within 30 days of their arrival in the Czech Republic with the [http://www.mvcr.cz/mvcren/article/contacts-alien-police-alien-police.aspx Foreign Police]; other foreigners must register within 3 working days. In case you stay in a hotel or a similar institution, the accommodation provider should arrange this registration for you.\n\nChildren inscribed in their parents´ passports are allowed to travel with their parents up to the age of 15. Once the child has reached the age of 15, a separate passport is necessary.\n\nThe [http://www.mzv.cz/jnp/en/information_for_aliens/general_visa_information/travel_document.html Ministry of Foreign Affairs] offers more information on what constitutes as a valid and acceptable travel document for the purpose of entering the Czech Republic.\n\n===By plane===\nAll of Europe's major airlines fly to the Czech Republic. The country's flag carrier is [http://www.csa.cz/ ČSA Czech Airlines], a SkyTeam member. Many of Europe's [[Discount airlines in Europe|low cost airlines]] also fly to the country, including [http://easyjet.com EasyJet], [http://wizzair.com WizzAir], [http://www.ryanair.com Ryanair], [http://www.germanwings.com Germanwings], [http://www.norwegian.no/sw22123.asp Norwegian], [http://www.jet2.com/ Jet2.com], and [http://www.smartwings.com/en/ SmartWings].\n\nApart from direct air connections from many European cities, ČSA and [https://www.koreanair.com/global/en.html Korean Air] operate direct Asian flights to and from [[Seoul]], while [http://www.emirates.com Emirates] and [https://www.flydubai.com/en/ Flydubai] operate from [[Dubai]], [http://www.delta.com/ Delta] from [[New York]], [http://flyrouge.com/ Air Canada Rouge] from [[Toronto]], [http://www.aeroflot.ru/ru-en Aeroflot] from [[Moscow]], [https://www.hainanairlines.com/ Hainan Airlines] from [[Beijing]], and [http://global.ceair.com/ China Eastern Airlines] with [[Shanghai]], just to name several major routes.\n\n[[Prague|Prague’s]] [http://www.prg.aero/en/ Vaclav Havel Airport (PRG)], located about 10km west of the city centre, is the largest and busiest airport in the republic, as well as its most common entrance by airplane. Havel Airport is also the hub of ČSA. Other commericial international airports in the Czech Republic include [http://www.brno-airport.cz/en/ Brno (BRQ)], [http://www.airport-ostrava.cz/en/ Ostrava (OSR)], [http://www.airport-pardubice.cz/ Pardubice (PED)], and [http://www.airport-k-vary.cz/en/ Karlovy Vary (KLV)]. Many of the republic's smaller airports outside of Prague are served by discount or seasonal charter airlines to a variety of destinations around [[Europe]].\n\n===By train===\nInternational train service runs from most points in [[Europe]] to [[Prague]], with some offering direct connections. In general, there are direct rail connections (without train changes) with [[Germany]], [[Austria]], [[Poland]], [[Slovakia]], [[Hungary]], [[Belarus]] and [[Russia]]. Information about travelling to Czech Republic by train simply: https://www.cd.cz/en/typy-jizdenek/jedu-do-zahranici/default.htm. Always check your connections on [https://jizdnirady.idnes.cz/vlaky/spojeni/ '''IDOS'''].\n\n====From Germany====\nBetween Germany and Czech Republic are 3 long-distance train lines and many regional train lines in operation by [https://www.cd.cz/en/default.htm ČD], [https://www.bahn.de/p/view/index.shtml DB] and [http://www.laenderbahn.com/ Die Länderbahn]. All long-distance trains and most regional train are modern and comfortable. Connection of capital cities, Berlin and Prague, is fast and reliable and it is served by Eurocity trains.\n\n=====Long-distance train lines=====\n*'''Ex3: Hamburg - Berlin - Dresden - Ústí n.L. - Prague - Pardubice - Brno - Austria/Slovakia'''\nThis line connects capital cities - Prague and Berlin, it is operated by ČD and DB. On line Berlin - Prague EC trains run every two hours. Some trains on this line run through whole republic to Austria or Slovakia, but most of them ends in Prague. This connection is fast, comfortable and reliable. In Ústí n.L. is possible to change a train to ''[[Karlovy Vary|Carlsbad]]'' (line R5). In Prague is possible to change a train to all directions. All stops of this line in CZ: [[Děčín]] hl.n., [[Ústí nad Labem|Ústí n.L.]] hl.n., Praha-Holešovice, [[Prague|Praha]] hl.n., Kolín, [[Pardubice]] hl.n., Česká Třebová, [[Brno]] hl.n. and Břeclav. Connections, prices and durations: <br /> <br />\n''Kiel - Prague'': once a day, duration 7h 53min, prices from 1153 CZK. <br />\n''Hamburg - Prague'': 4 times a day, duration 6h 44min, prices from 498 CZK. <br />\n''Berlin - Prague'': 6 times a day, duration 4h 16min, prices from 367 CZK. <br />\n''Dresden - Prague'': 7 times a day, duration 2h 13min, prices from 236 CZK. <br />\n''Leipzig - Prague'': once a day, duration 3h 29min, prices from 367 CZK. <br />\n''Berlin - Ústí n.L.'': 6 times a day, duration 3h 5min, prices from 367 CZK. <br />\n''Berlin - Pardubice'': once a day, duration 5h 30min, prices from 760 CZK. <br />\n''Berlin - Brno'': once a day, duration 7h 3min, prices from 891 CZK. <br />\n\n*'''Ex6: Munich - Regensburg - Pilsen - Prague (\"West Express\")'''\nOn this line operate ALX / Ex (Alex / Express) trains every two hours, it is operated by ČD and Die Länderbahn. This connection is not that fast, because of the mountain terrain and slow (although picturesque) railway across the border. In Pilsen is possible to change a train to ''[[České Budějovice]]'' and ''Jihlava'' (line R11). In Prague is possible to change a train to all directions. All stops of this line in CZ: Domažlice, Holýšov, [[Plzeň]] hl.n., Praha-Smíchov and [[Praha]] hl.n. Connections, prices and durations: <br /> <br />\n''Munich - Prague'': 7 times a day, duration 5h 48min, prices from 367 CZK. <br />\n''Regensburg - Prague'': 7 times a day, duration 4h 17min, prices from 314 CZK. <br />\n''Munich - Pilsen'': 7 times a day, duration 4h 7min, prices from 288 CZK. <br /> <br />\nBetween Regensburg and Pilsen can be used [https://www.bahn.de/p/view/angebot/regio/regionale-tickets/bayern/bayern-boehmen-ticket.shtml Bayern-Böhmen-Ticket], prices from 28 EUR.\n\n*'''R29: Nuremberg - Cheb'''\nThis line connects the largest city of Franconia - Nuremberg and historic west-bohemian city Cheb. Cheb is also important train hub in Carlsbad Region. In operation are RE / Sp (RegioExpress / Spěšný vlak) trains by DB and ČD. This connection is comfortable, reliable and quite fast. In Cheb is possible to change a train to ''[[Plzeň|Pilsen]]'' and ''[[Praha|Prague]]'' (line Ex6/SCP) or to ''[[Karlovy Vary|Carlsbad]]'' and ''[[Ústí nad Labem|Ústí n.L.]]'' (line R5). The only one stop of this line in CZ is Cheb. Connections, prices and durations: <br /> <br />\n''Nuremberg - Cheb'': 5 times a day, duration 1h 45min, prices from 234 CZK. <br /> <br />\nBetween Nuremberg, Cheb and Pilsen [https://www.bahn.de/p/view/angebot/regio/regionale-tickets/bayern/bayern-boehmen-ticket.shtml Bayern-Böhmen-Ticket] can be used, prices from 28 EUR. Between Pegnitz, Cheb and Planá u Mariánských Lázní, [http://egronet.de/de.html Egronet Ticket] can be used, prices from 20 EUR.  \n\n=====Regional train lines=====\nBetween Germany and Czech Republic many regional railways are in operation. Trains on these railways are usually quite slow because of mountains around the border. However these connections through mountains provide great views. On many of these trains can be used special tickets, for example: [https://www.bahn.de/p/view/angebot/regio/regionale-tickets/bayern/bayern-boehmen-ticket.shtml Bayern-Böhmen-Ticket], [http://egronet.de/de.html Egronet Ticket], [https://www.bahn.de/p/view/angebot/regio/regionale-tickets/sachsen/sachsen-boehmen-ticket.shtml Sachsen-Böhmen-Ticket], [https://www.vvo-online.de/en/tariff-tickets/tickets/elbe-labe-129.cshtml Elbe-Labe-Ticket] or [http://www.zvon.de ZVON]. <br /> <br />\n''Dresden - Liberec'': TLX trains, 5 times a day, duration 2h 7min. <br />\n''Zittau - Liberec'': TLX and TL trains, 18 times a day, duration 37min. <br />\n''Zittau - Varnsdorf'': TL trains, 16 times a day, duration 16min. <br />\n''Bad Schandau - Rumburk'': Os trains, 9 times a day, duration 1h 8min. <br />\n''Bad Schandau - Děčín'': EC and Os trains, 17 times a day, duration 28min. <br />\n''Annaberg-Buchholz - Chomutov'': RB and R trains, twice a day, 1 change (in Cranzahl), in operation in summer saison on weekends only, duration 1h 55min. <br />\n''Johanngeorgenstadt - Carlsbad'': R trains, 4 times a day, duration 1h 13min. <br />\n''Zwickau - Sokolov'': R trains, 5 times a day, duration 2h 15min. <br />\n''Plauen - Sokolov'': R trains, 4 times a day, duration 2h 8min. <br />\n''Plauen - Cheb'': R trains, 4 times a day, duration 1h 22min. <br />\n''Hof - Cheb'': R trains, 8 times a day, duration 1h 12min. <br />\n''Marktredwitz - Cheb'': RE and R trains, 13 times a day, duration 25min. <br />\n''Furth i.W. - Domažlice'': ALX and R trains, 9 times a day, duration 22min. <br />\n''Plattling - Železná Ruda'': WBA trains, 16 times a day, duration 1h 7min. <br />\n\n====From Poland====\nBetween Poland and Czech Republic are in operation 2 long-distance train lines connecting capital cities and many regional train lines. These trains are operated by [https://www.cd.cz/en/default.htm ČD], [https://www.intercity.pl/en/ PKP IC], [http://kolejeslaskie.com/en/ KS], [https://www.kolejedolnoslaskie.eu/en KD] and [http://www.gwtr.cz/ GWTR]. The connection between the capital cities - Warsaw and Prague is comfortable, but not so fast. It is served by IC/EC and EN trains.\n\n=====Long-distance train lines=====\n*'''Ex1: Warsaw - Katowice - / Krakow - Ostrava - Olomouc - Pardubice - Prague''' \nThis line connects capital cities - Warsaw and Prague, it is operated by ČD and PKP IC. It is runned by IC / EC (Intercity / Eurocity) trains with compulsory seat reservation (only when travelling across Polish border). In Hranice n.M. is possible to change a train to ''[[Brno]]'' (line R8). In Olomouc is also possible to change a train to ''Brno'' (line R12). In Pardubice is possible to change a train to ''[[Hradec Králové]]'' and ''[[Liberec]]'' (line R14). In Prague is possible to change a train to all directions. All stops of this line in CZ: Bohumín, [[Ostrava]], Hranice n.M., [[Olomouc]], Zábřeh n.M., Česká Třebová, Ústí n.O., [[Pardubice]] and [[Praha|Prague]]. Connections, prices and durations:  <br/> <br/> \n\n''Warsaw - Prague'': twice a day, duration 7h 51min, prices from 524 CZK. <br/> \n''Katowice - Prague'': twice a day, duration 5h 13min. <br/>\n''Krakow - Prague'': once a day, duration 6h 52min. <br/>\n''Warsaw - Ostrava'': 6 times a day, duration 4h 27min, prices from 386 CZK. <br/>\n''Warsaw - Olomouc'': twice a day, duration 5h 31min. <br/>\n''Warsaw - Pardubice'': twice a day, duration 6h 51min. <br/>\n\n*'''Ex4: Warsaw - Katowice - Ostrava - Břeclav - Austria / - Slovakia - Hungary'''\nThis line connects capital of Poland with Silesia and Moravia, but trains of this line continues to Vienna or Bratislava and Budapest. It is operated by ČD and PKP IC and it is runned by EC / IC / EIC (Eurocity / Intercity / Express Intercity) trains with compulsory seat reservation (only when travelling across Polish border). When travelling to ''[[Prague]]'', \n''[[Olomouc]]'' and ''[[Pardubice]]'' you can change a train in Ostrava (lines Ex1 and SCP) or in Hranice n.M. (line Ex2). In Přerov is possible to change a train to ''[[Brno]]'' (line R8). In Otrokovice is possible to change a train to ''[[Zlín]]'' (line R18). All stops of this line in CZ: Bohumín, [[Ostrava]], Hranice n.M., Přerov, Otrokovice, Staré Město u U.H., Hodonín and Břeclav. Connections, prices and durations:  <br/> <br/>\n\n''Warsaw - Ostrava'': 6 times a day, duration 4h 13min, prices from 386 CZK. <br/>\n''Warsaw - Břeclav'': 3 times a day, duration 6h. <br/>\n''Katowice - Ostrava'': 7 times a day, duration 1h 35min. <br/>\n\n*'''Overnight trains'''\nCzech Republic and Poland are connected by some sleeping trains too. They are runned by EN (Euronight) or R / TLK (Rychlík / Twoje Linie Kolejowe) trains. Night trains usually have sleeper coaches, couchette coaches and 2nd class coaches. Price consists of normal 1st or 2nd class (depends on type of coupe and type of coach) ticket, bed/couchette supplement and bed/couchette reservation (included in supplement). Connections, prices and durations:  <br/> <br/>\n\n''Krakow - Prague'': EN train (407/442), departure from Kraków Gł. in 22:41, arrival to Praha hl.n. in 8:41, supplements: couchette coach - couchette in \"Bc 6\" coupe: 9,40 EUR; couchette in \"Bc 4\" type coupe: 14 EUR; sleeper coach - bed in \"Triple Economy\" coupe: 14 EUR; bed in \"Double Economy\" coupe: 21 EUR; bed in \"Single Economy\" coupe: 49 EUR; bed in \"Double Deluxe\" coupe: 28 EUR; bed in \"Single Deluxe\" coupe: 56 EUR. <br/>\n''Warsaw - Prague'': EN train (407/442), departure from Warszawa Centr. in 19:50, arrival to Praha hl.n. in 8:41, ticket from 524 CZK, supplements: couchette coach - couchette in \"Bc 6\" coupe: 9,40 EUR; couchette in \"Bc 4\" type coupe: 14 EUR; sleeper coach - bed in \"Triple Economy\" coupe: 14 EUR; bed in \"Double Economy\" coupe: 21 EUR; bed in \"Single Economy\" coupe: 49 EUR; bed in \"Double Deluxe\" coupe: 28 EUR; bed in \"Single Deluxe\" coupe: 56 EUR. <br/> \n''Łeba / Hel - Bohumín'': TLK train (403), departure from Łeba in 20:18, departure from Hel in 19:47, arrival to Bohumín to 9:58, runs 23./24.VI. - 2./3.IX., supplements: sleeper coach - bed in \"Triple Economy\" coupe: 14 EUR; bed in \"Double Economy\" coupe: 21 EUR; bed in \"Single Economy\" coupe: 49 EUR. <br/> <br/> \n\n-<br/>\n(article in gradual reconstruction)<br/>\n-<br/> <br/>\n\nApart from these long-distance trains there are a few local trains offering cross border connections, including direct connections from '''[[Kłodzko]]''' to '''Ústí nad Orlicí''', '''Międzylesie''' to '''Lichkov''', and '''[[Szklarska Poręba]]''' to '''[[Liberec]]'''. For these local trains (not IC or EC), it is possible to buy a special '''cross-border ticket''' ([[Polish]]: ''bilet przechodowy'') which is valid between Czech and Polish (or vice versa) border stations and costs only 15CZK or 2PLN. You can buy it from the conductor on the train (or completely ignore it if the conductor does not emerge before you reach the other border station, which does happen) and combine it with domestic tickets of the two countries. In the vicinity of the Czech-German-Polish three-way border, you may profit from the unified fare of the '''[http://www.zvon.de/ ZVON]''' transport system.\n\nPolish regional rail operator '''[https://polregio.pl/en/ PolRegio]''' also offers [https://www.przewozyregionalne.pl/jedziemy-do-czech Czechy + and Czechy + Max] tickets from Polish border rail stations to the rest of the Czech rail nework. Travel must be completed within 24 hours of the ticket's validity, with prices ranging from 19 to 49PLN.\n\n====From Slovakia====\n[[Image:State border tripoint - panoramio.jpg|thumb|The three-way border between the Czech Republic, Slovakia, and Austria.]]\nAs the former other half of Czechoslovakia, trains between the Czech Republic and [[Slovakia]] are frequent and reliable. EC trains operated by Slovak carrier '''[http://www.slovakrail.sk/en.html ZSSK]''' and '''[http://regiojet.com RegioJet]''' run every two hours from '''[[Bratislava]]''' to '''[[Brno]]''' and '''[[Prague]]''', with ZSSK also operating services from '''[[Žilina]]''', '''[[Zvolen]]''', and '''[[Košice]]''' to '''[[Prague]]''', '''[[Olomouc]]''', '''[[Pardubice]]''', and '''[[Ostrava]]'''. All these cities also have a direct overnight sleeper car connection to Prague.\n\nA regular one-way ticket to Prague can cost €27 from Bratislava and €42 from Košice. There is a return discount of (roughly) 30% called ''CityStar''. ZSSK also offers discounted online tickets in advance, with the day train from [[Bratislava]] to Prague costing €15, [[Košice]] to Prague €18, and the night train including a couchette reservation from [[Košice]] to Prague €27.\n\nPrivate rail operators '''[http://regiojet.com RegioJet]''' and '''[http://leoexpress.cz LEO Express]''' also provide daily connections from [[Košice]] to the Czech Republic via [[Žilina]] as well, with discounted online tickets starting at €9 and €12.\n\n====From Austria====\nČeské dráhy's Railjet trains from '''[[Vienna]]''' to '''[[Prague]]''' and '''[[Brno]]''' operate every two hours. Austrian rail carrier '''[http://www.oebb.at/en/ ÖBB]''' also frequently operates trains from '''[[Linz]]''' to '''[[České Budějovice]]''' and '''[[Prague]]''', with two direct connections and three more connections with a change of trains in [[České Budějovice]]. If booked well in advance, ÖBB offers prices beginning at €9 for Vienna to Brno, and €19 for Vienna to Prague, although when closer to the day of departure, tickets can become significantly expensive.\n\n===By car===\n[[Image:Zdice, Knihov a D5.jpg|thumb|The D5 motorway links [[Prague]] and [[Pilsen]] to the German autobahn network in [[Bavaria]].]]\nDrivers can enter the Czech Republic through a multitude of roads from its neighbouring states. Since the Czech Republic entered into the Schengen Agreement, all checkpoints on its border crossings have been removed, although the border police does from time to time flag down cars or buses for random searches near border towns. Due to its Central European location, all of the Czech Republic's neighbors provide good road access to the country. \n\n===By bus===\nBeing in the centre of Europe, the Czech Republic is often a destination for a variety of bus services. Among some of the best-known and reliable international bus companies providing service to the country include: \n* '''[http://www.eurolines.com/en/ Eurolines]''' — one of the most comprehensive bus companies found throughout Europe, offering travel from nearly every major European state.\n* '''[http://regiojet.com RegioJet]''' — Czech-based carrier, offering affordable and comfortable travel from [[Slovakia]], [[Hungary]], [[Poland]], [[Austria]], [[Germany]], [[Italy]], [[Switzerland]], [[Luxembourg]], [[The Netherlands]], [[France]], [[Belgium]], [[Denmark]], [[Norway]], [[Sweden]], and the [[UK]].\n* '''[https://www.leoexpress.cz LEO Express]''' — Czech-based carrier, with bus travel to [[Slovakia]], [[Poland]], [[Austria]], [[Germany]], [[Italy]], [[Switzerland]], and [[Ukraine]].\n* '''[https://www.flixbus.com Flixbus]''' — German-based carrier with a hub in Prague, connecting to various cities across most of Central Europe.\n* '''[http://www.luxexpress.eu/en Lux Express]''' — Estonian-based carrier, connecting the [[Baltic states]] and [[Poland]] to [[Prague]].\n* '''[http://www.ecolines.net Ecolines]''' — Latvian-based carrier, provides routes from [[Poland]], the [[Baltic states]], and [[Russia]], with stops in [[Prague]] and [[Hradec Králové]].\n* '''[http://www.orangeways.com/en Orangeways]''' — Hungarian-based carrier, connecting several Hungarian and Slovak cities to [[Prague]].\n\n==Get around==\n===By plane===\nThere are domestic flights between [[Prague]] and [[Ostrava]], operated by [http://www.csa.cz/ ČSA Czech Airlines]. However, these flights can be expensive considering the distance, and are seldom used by locals, although it is surely the fastest way to cross the country.\nAs of january 2019, all national flights operated by CSA was terminated [https://www.novinky.cz/clanek/csa-zrusi-linky-do-ostravy-i-tu-nejstarsi-do-bratislavy-40262927].\n\n===By train===\n[[Image:CD-RJ als EC 73.jpg|thumb|One of ČD's modern Railjets.]]\n[[File:Long distance lines cd.png|thumb|Schematic of ČD long-distance train lines.]]\nThe Czech Republic has a highly dense railway network, most of it operated by national rail carrier '''[http://cd.cz České dráhy (ČD)]'''. České dráhy's services are widespread across the country, with major hubs in [[Prague]], [[Brno]], [[Pilsen]], [[Pardubice]], [[České Budějovice]], and [[Ostrava]]. In both Prague and [[Ostrava]], the company also operates a fleet of urban Esko (commuter rail) trains, connecting these cities' various train stations with their outside suburbs.\n\nSince the 2000s, ČD no longer has an exclusive monopoly on passenger rail travel, with other companies competing for passengers. Private rail service '''[http://regiojet.com RegioJet]''' operates distinctive yellow-coloured high-speed trains on the [[Prague]]-[[Brno]]-[[Bratislava]] and the [[Prague]]-[[Pardubice]]-[[Olomouc]]-[[Ostrava]] lines, with some rail services continuing onward into central and eastern [[Slovakia]]. Another private rail company, '''[http://leoexpress.cz LEO Express]''', also operates on the same Prague-Ostrava line, with limited rail and bus services continuing into Slovakia and [[Poland]]. \n\nČeské dráhy's trains tend to widely vary with age and quality. The carrier operates high-speed Pendolinos between [[Františkovy Lázně]] near the [[Germany|German]] border, [[Prague]], and [[Ostrava]], as well modern Railjets between [[Prague]], [[Brno]] and [[Vienna]]. Other rolling stock, however, varies from the modern to the rusty 1970s. Trains going to remote locations, such as provincial towns or villages away from the main rail corridors, tend to be old with longer traveling times. RegioJet and LEO Express, however, operate with modern trains and carriages, offering affordable food, drinks, and free wi-fi, yet their domestic routes are presently limited only between Prague and Ostrava. \n\nWhen choosing which carrier to use, bear in mind that '''there is no universal train ticket''', as České dráhy, RegioJet, and LEO Express are '''three entirely separate companies''', with separate offices and tickets to purchase, meaning '''you can only use a specific ticket with the company it was purchased from'''.\n\nSince 10th December 2017 a new train operator '''GW Train (GWTR)''' takes over all regional trains from České Budějovice to Český Krumlov. Tickets of Czech Railways (ČD) are not valid on these trains. Only one direct train from Prague to Český Krumlov operated by ČD remains. You can find more information about GW Train here (only in Czech): http://gwtr.cz/cs/sumava\n\nBe careful, as often two trains may share the same platform. If the platform is positioned in North-South direction, note that if the train's departure is indicated as \"7S\", it does actually mean that the train departs from Northern (''sever'') section and not from the Southern, this is indicated as \"7J\" (''jih'').\n\n\n====Train categories====\nThe following train categories are recognized and shown in timetables such as '''[http://jizdnirady.idnes.cz/vlaky/spojeni/?lng=E Idos]''' and with this [http://provoz.szdc.cz/Tabule/ real-time departure and arrival database]:\n[[Image:RegioJet, vlak s lokomotivou 162.112.jpg|thumb|RegioJet, a popular private train service.]]\n* '''Osobní vlak (Os)''' – (= local train) regional stopping train, stopping in all stations, usually 2nd class only, operated by '''ČD''', '''GWTR''' and '''JHMD'''.\n* '''Spěšný vlak (Sp)''' – (= fast train) regional fast train, not stopping in all stations, usually 2nd class only, operated by '''ČD''' and '''Arriva'''.\n* '''Rychlík (R)''' – (= express train) interregional fast train, stopping in major towns and cities, usually 1st and 2nd class, operated by '''ČD''' and '''GWTR'''.\n* '''Rychlík vyšší kvality (Rx)''' – (= higher quality express train) higher quality interregional fast train, stopping in major towns and cities, 1st and 2nd class, operated by '''ČD'''.\n* '''Expres (Ex)''' – (= express) highest quality interregional fast train, stopping in major cities only, 1st and 2nd class, sometimes with restaurant or bistro coach, operated by '''ČD'''.\n* '''Intercity (IC)''' – highest quality interregional express train, stopping in major cities only, 1st and 2nd class, usually with restaurant or bistro coach, with compulsory seat reservation, operated by '''ČD'''.\n* '''Eurocity (EC)''' – highest quality international express train, stopping in major cities only, 1st and 2nd class, with restaurant or bistro coach, operated by '''ČD'''.\n* '''Railjet (rj)''' – highest quality high-speed international train, stopping in major cities only, 1st+, 1st and 2nd class, with bistro coach, operated by '''ČD'''.  \n* '''Supercity (SC)''' – highest quality high-speed interregional train, stopping in major cities only, 1st and 2nd class, with bistro coach, with compulsory seat reservation, operated by '''ČD'''.\n* '''Euronight (EN)''' - higher quality overnight international train, stopping in major cities only, usually 2nd class, with sleeper and couchette coaches, with compulsory seat/bed/couchette reservation in international transport, operated by '''ČD'''. \n* '''LEO Express (LE)''' – higher quality interregional express train, stopping in major towns and cities, 1st+, 1st and 2nd class, with compulsory seat reservation, operated by '''LEO Express'''.\n* '''Regiojet (RJ)''' – higher quality interregional express train, stopping in major towns and cities, 1st, 2nd and low-cost class, usually with bistro coach, with compulsory seat reservation, operated by '''RegioJet'''.\n* '''Arriva Express (AEx)''' - interregional express train, stopping in major towns and cities, 2nd class only, operated by '''Arriva'''.\n* '''Trilex (TL)''' - international stopping train, stopping in all stations, 2nd class only, operated by '''Die Länderbahn'''.\n* '''Trilex Express (TLX)''' - international fast train, stopping in major towns and cities, 2nd class only, operated by '''Die Länderbahn'''.\n\n====Train tickets====\nCompared to Western European standards, Czech rail travel is cheap, highly affordable, and largely reliable. Tickets from all three of the republic's rail companies can be purchased online, and can be printed either at home or shown on tablets and smartphones to the conductor once aboard. Tickets can also often be bought in person at the station from window agents. RegioJet and LEO Express ticket agents near universally speak English, while České dráhy's agents outside of the main cities often cannot. In order to avoid any potential language confusion, travellers can write the destination name and the desired time of their journey, which will be universally understood by the ČD agent. Smaller ČD stations or stops without an active agent window or office will usually have conductors on their passing trains to purchase tickets from once you board. \n\nFrequent users of České dráhy can register online for its [https://www.cd.cz/eshop/customer/loyaltyprogram.aspx Loyalty Programme], earning points for every trip taken under their name. With more points accumulated, users can receive significant discounts off of future rail travel, as well as discounts for attractions or for other activities listed online. Similarly, users of LEO Express can also join its [http://leoexpress.cz/cms/rewards-1221.htm Smile Club] to collect kilometers as points for future travel discounts. RegioJet offers [https://bustickets.regiojet.com/CreateAccount?1 registration] for discounted travel, although it does not have a rewards programme. \n\nIf you are buying in person, travellers on ČD going on a roundtrip journey can receive a 5% discount, and when travelling in a group (even two travellers are considered as a \"group\"), the first person pays full price, while the second gets a 25% discount, and others get a 50% discount. Therefore ask for group discount (''skupinová sleva'') and/or return discount (''zpáteční sleva'') to the agent.\n[[Image:14-06-04-praha-hlavní nádraží-02.jpg|thumb|LEO Express is another private rail company and popular alternative to ČD.]]\nFor journeys between larger cities with ČD, you can buy a discounted [https://www.cd.cz/eshop/sporotiket_cesko.aspx First Minute Czech Republic] ticket, which is generally at the same price or even cheaper than buses. The earlier you buy it, the cheaper it is. The ticket isn't bound to any particular train, only to a specific day and route, and is available to buy online (it is bound to your name) and print it yourself (or present it on your smartphone or tablet, or tell the conductor the 6-digit ticket number). You can buy these tickets also directly at station counters too, but at least one day in advance. A group discount does not apply with these tickets.\n\nOn weekends, instead of the standard Czech domestic ticket, ČD offers an online [https://www.cd.cz/eshop/netticket.aspx?type=1 Group Weekend Ticket] for 679CZK for a nationwide ticket, or between 229-279CZK depending on which specific region you are traveling in (valid up to 2 adults and 3 children for one weekend day).\n\nFrequent ČD travellers can purchase an [http://www.cd.cz/en/vyhody-pro-cestujici/default.htm In-karta Card], offering 25%, 50%, or 100% discounts. For the IN 25, the most common card (with a 25% discount), prices start from 150-190CZK (3 months), 250-400CZK (1 year) or 490-990CZK (3 years). Its price pays for itself quickly. Fill in an application form at the ticket counter and provide a photograph, and you will receive a temporary paper card immediately to start using the discount. After three weeks, a plastic chip card will arrive by post. \n\nČeské dráhy also offers [https://www.cd.cz/en/mezinarodni-cestovani/jizdenka/slevy-evropa/-9070/ First Minute Europe] online tickets for international travel, which are often much cheaper (sometimes more than 10 times cheaper) than tickets purchased at a train station. However, the number tickets is limited and the ticket is bound to the specific train and passenger name. When travelling to Poland and Hungary, there are more limitations - the ticket must be printed beforehand and stamped by a Czech conductor, purchased at least 3 days in advance.\n\nThe complete list of discounts can be found on the company's [http://www.cd.cz/en/vnitrostatni-cestovani/jizdenka/default.htm travel discount page]. Idos also hosts a '''[http://jizdenka.idos.cz/NT.aspx domestic fare calculator]''' for prices between cities.\n\n====Taking bikes or pets====\nBasic ČD tickets for a bike costs between 25 to 75CZK depending on the distance. You load and unload your bike by yourself onto the train. Trains with such possibilities are marked with a bike symbol in the timetable, as well as on carriages suitable for bike transport. Some trains with a square-framed bike/suitcase symbol in the timetable require compulsory reservation for bikes for 20CZK. Some long-distance trains (with a suitcase symbol in the timetable) have a luggage car, where the train staff will care for your bike for an extra charge of 10CZK, payable on the train. For more on bike transport, visit the company's [http://www.cd.cz/vnitrostatni-cestovani/zavazadla-a-zvirata/preprava-kol/-8893/ bike policy page].\n\nUnfortunately, bicycles are not permitted aboard RegioJet nor LEO Express trains. \n\nPets travelling with ČD are allowed in cages or hard bottom bags, and can travel for free. Bigger dogs must have a muzzle and be on a leash. The basic price ranges from 15 to  50CZK depending on the distance. For more information on dog transport, visit the company's [http://www.cd.cz/vnitrostatni-cestovani/zavazadla-a-zvirata/-8897/ dog and small animal policy page].\n\nDogs are allowed on LEO Express trains for free, and must be in cages or hard bottom bags (with the exception of guide or assistance dogs). Only small dogs in hard bottomed bags are allowed aboard RegioJet, with large dogs largely forbidden.\n\n===By bus===\n[[Image:14-09-30-praha-florenc-RalfR-16.jpg|thumb|RegioJet is one of the country's most recognized brands.]]\nThe Czech Republic is blessed with a highly complex and integrated bus network, providing service to all corners of the republic, from its largest cities to often tiny villages. Many locals prefer using buses over trains due to cost, comfort, and reliability. Perhaps the best-known bus carrier is '''[http://regiojet.com RegioJet]'''. Formerly known as '''Student Agency''' for many years, RegioJet's yellow buses are easy to spot on many roads and highways throughout the country, and are known for their comfort, entertainment options, wi-fi, and free coffee, water and tea for travellers. \n\nA number of smaller bus companies also operate throughout the Czech Republic. Local travel between smaller towns or surrounding villages is usually operated by companies named '''ČSAD (''district name'')''', a remnant of the state-run '''''Č'''esko'''s'''lovenská '''A'''utobusová '''D'''oprava'' from communist times. On local buses, simply tell the driver where you're going, or hold up a sign if you can't pronounce the location. Be aware that most bus drivers cannot speak English. Afterwards, you will receive a paper ticket from a small machine showing the price and destination, and will pay the driver the fare printed. An excellent database to search for all connections is through '''[http://jizdnirady.idnes.cz/vlakyautobusymhdvse/spojeni/ Idos]''', a highly comprehensive timetable for bus connections. Online bus tickets for these smaller companies can often be purchased via Idos.  \n\n===By car===\n[[Image:CZ traffic sign IS16a - D1.svg|150px|thumb|A motorway-level road sign.]]\n[[Image:SilniceI2.svg|150px|thumb|A first class road sign.]]\n[[Image:SilniceII368.svg|150px|thumb|A second class-level road sign.]]\nThere are nearly 1,200 km (745 mi) of motorways in the Czech Republic, with most of the major cities connected together through a spiderweb-like ring of roads originating from Prague. However, much is still missing from the map, blocked by government mismanagement and corruption, though there are plans to connect the entire country with high-speed motorways by 2030. Until then, drivers can sometimes expect detours on smaller roads with high vehicle capacity and many areas of construction. \n\n'''Motorways''' are demarcated by red and white signs with only a number on it. Below motorways are '''first class roads''', with blue and white signs and a one or two-digit number. Many first-class roads are two or sometimes four-laned, and are generally considered to connect medium-sized municipalities together. Next are '''second class roads''', also blue and white, with a three-digit number. These roads are smaller and located in the countryside, though still provide a degree of traffic between locations. Finally are the '''third class roads''', with four-digits, which are countryside roads used for rural traffic. The condition of many smaller state and local roads is continually improving, yet to be economical (and fast), use motorways as much as possible, although if you want to get to more remote parts of the country you cannot avoid second or third class roads whose conditionals could be subpar.\n\nIn order to use motorways, drivers need to purchase a '''[http://www.sfdi.cz/en/vignettes/ vignette]'''. These cost 310CZK (12‎€) for ten days, 440CZK (16.50€) for a month, and 1500CZK (56.50€) for a year. Vignettes can be purchased at petrol stations or vignette offices close to the border, or in [https://www.ceskaposta.cz/en/sluzby/prodej-a-eshop Česká pošta] offices around the country. If you do not have a vignette on your car when driving on motorways, the fine can be very steep (5000CZK minimum). Vehicles over 3.5 tonnes in weight must use an on-board unit (''premid'') to pay tolls based on distance; this is required also on primary roads (marked with a '''M''' in a circle). Drivers can also easily obtain pre-paid ''premids'' at most petrol stations.\n\nThe use of headlights or day-time lights is mandatory at all times (day-time lights are allowed between dawn and dusk and in good visibility only). Failure to comply with this may result in a fine of up to 2000CZK. If other cars are flashing their high beam at you, it might be a friendly warning that your headlights are off.\n\nSpeed limits in the Czech Republic are '''130 km/h (81 mph) on motorways''', '''90 km/h (56 mph) on rural first class roads''' and '''50 km/h (31 mph) through towns'''. Petrol is inexpensive compared to the rest of Europe, yet remains expensive compared to North America due to taxes. Speeding is common but so are speed traps and speeding cameras, especially if you do not know the area. Many drivers use the [https://www.waze.com/ Waze mobile app] to warn fellow motorists about speed traps, hazards on road etc., so if you purchased a local SIM card with a good data plan (or if you have good roaming data plan on your own), try it out.\n{{disclaimerbox|Unlike most of the motorway network, the '''D1 motorway''' between [[Prague]] and [[Brno]] is in a bad shape. Although reconstruction is slowly underway, there are still long sections of misaligned concrete blocks which cause a bumpy ride. Combined with heavy traffic, reckless driving styles, rapidly changing weather due to the higher elevation (as the motorway crosses the [[Bohemian-Moravian Highlands]]) and virtually no detour routes, it makes the D1 notorious for mind-bogglingly long traffic, little patience, and car crashes. '''Drive carefully'''; the 130 km/h speed limit is in many places too fast for this route, especially if you don't know the terrain well.}}\n\nThe Czech Republic is a '''zero tolerance''' country. It is illegal to drive any vehicle (including bicycles and kick scooters) under the influence of any amount of alcohol, and violations over .03% are heavily punished. However up to .02 % is usually tolerated as it can be naturally occurring. Traffic fines for small offences can be paid on the spot. Large offences (drunk driving, more than 40 (town)/50 (rural) km/h over limit, etc.) require an administrative hearing and you may be required to pay a large deposit and/or your driving license can be suspended. In criminal offences which would result in a trial (eg. heavily drunk or drugged driving, car chase, etc.), your car can be seized. Some police cars (mostly on highways) accept payment by cards yet most don't.\n\n===By bicycle===\nThe Czech Republic is an excellent place for cycling. There are lots of pleasant country roads, cycling marked paths and picturesque villages along these paths (always with a pub). It's easy to find the way, with trains and some buses having bicycle racks in the baggage section for when you get tired. Try cycling in [[South Moravia]] (close to the Austrian border) where you can find dozens of well-marked paths that will lead you through beautiful countryside full of vineyards, wine cellars and colourful villages.\n\nThe border mountain ranges (Krkonoše, Šumava, Jeseníky etc.) are growing in popularity among mountain-bikers. There are usually no fences along the trails but always keep to the roads or marked cycling paths here as these mountains are national parks or reserves and you can be fined if you cycle \"off the beaten track\".\n\nBeware that drunk cycling is illegal and, although quite common, the police do routine checks (especially on paved cycling paths). See [[#By_car|By car]] for more information.\n\n===On foot===\n[[Image:Národní park Podyjí Dyje Nationalpark Thayatal 2013 10 a.jpg|thumb|[[Podyjí National Park]].]]\nIn addition to urban walking, there are a great number of hiking paths and scenery-rich trails going through the Czech Republic's forests and protected areas, and the [http://www.kct.cz/cms/ Czech Tourist Club] has mapped and marked these trails so walkers can easily locate and navigate thousands of kilometres of scenic paths, perhaps one of the best maintained system of marking in Europe. You can buy maps of their paths on their website, or in most bookstores, tobacco shops, or museums (green maps, marked with the organization's symbol and the words ''EDICE TURISTICKÝCH MAP KČT 1:50000'' at the top. These maps are based on military maps and are very accurate. It's also possible to go by train to a small village at the edge of a forest and find the onsite map of the surrounding area, and four possible paths will be visible, marked in red, yellow, green, and blue on tourist maps. These coloured directing signs are posted on trees, displaying three short horizontal bars, the outer two are white and the innermost the colour of the path you're on, pointing the direction of any of the coloured paths. This symbol at times will appear as an arrow, indicating a turn. Bus and train stops will also be indicated on signs. Visitors can register as a member of the Czech Tourist Club, where you can camp for as low as 50CZK a night in their cottages around the country.\n\n===By hitchhiking===\nHitchhiking is common among young people, with some drivers stopping even in places where they shouldn't. Hitchhiking is strictly '''illegal on motorways''', with the exception of service areas and at on ramps. Normally, first and second class roads are the best places to hitchhike. \n\nTake care to use very a clear gesture with the thumb pointing upwards. A gesture looking like you are pointing to the ground could be mistaken for prostitution.\n\nTry a letter-sized (A4) piece of paper with the destination (or one of former license plate codes) written on it to be clearly visible where you would like to go. See some other [[Tips for hitchhiking]].\n\n====By thumb with pet====\nIt is possible to hitchhike with smaller dogs, although \"waiting time\" will be longer. Expect another dog in the car.\n\n==Talk==\n[[Image:Telc.JPG|thumb|Main Square of [[Telč]].]]\nThe country's official language is '''[[Czech phrasebook|Czech]]''', a Slavic tongue spoken by over 10 million. The '''[[Slovak phrasebook|Slovak]]''' language can also frequently be heard, especially in larger Czech cities, as there is a sizable Slovak minority within the republic, and both languages are mostly mutually intelligible to each other. Czechs are proud of their language, and thus, even in Prague, you will not find many signs written in English outside of the main tourist areas. Many older people, especially outside the larger cities, are unable to converse in English, so it's good to learn some Czech words or phrases before your arrival. However, most young people speak at least some English, as it has been taught in schools since 1990.\n\nMany Czechs speak a second and often a third language. English is the most widely known, especially among younger people. German is arguably the second most widely spoken language among older people. Russian was taught extensively under communist rule, meaning most people born before 1975 speak, read, or understand at least some Russian (and often pretty well). However, the connection with the communist era and the Soviet-led invasion of 1968 (as well as with contemporary Russian mafia gangs) have given the language some negative connotations. Russian is also not very useful with younger people, as it is not, despite the common misconception, mutually intelligible with Czech beyond some similar words and phrases. Other languages, like French and Spanish, are also taught in some schools, yet you should not count on them being widely understood. Czechs also understand basic words or simple sentences in other related Slavic languages, including Polish, Ukrainian, Serbo-Croatian, and Slovenian.\n\nCzech can be extremely difficult for English-speakers to grasp, as it's not an easy language to learn, and takes extreme patience and practice to master, especially if one is unfamiliar with other Slavic languages. However, if you can learn the alphabet and its corresponding letters with accents, then pronunciation is easy, as Czech is a highly phonetic language, with the stress falling on the first syllable. The concentration of consonants in many words could seem mind-bogglingly hard to pronounce at first, but it is worth the effort! Czechs highly appreciate foreigners who try to learn their language, even if it is only a few phrases or simple words.\n\nCzech has many local dialects and accents, especially in Moravia and parts of Czech Silesia. Some dialects are so different that they can be sometimes misunderstood even by native Czechs from a different region. However, all Czechs understand Common Czech (as spoken on TV, radio, newspapers, and taught in schools) and should be able to speak it (but some remain too proud to stop using their local accent). Some are even unable to speak Common Czech, but still can write it correctly.\n\nCompared to Czech, [[Slovak phrasebook|Slovak]] uses softer pronunciation with different accents and letters. While Czech and Slovak grammar and vocabulary retain many similarities, there are occasional words that have different meanings. To the bemoaning of older generations, many young Czechs and Slovaks born after the 1993 dissolution of Czechoslovakia have difficulties understanding each other.\n\nIn cities like Prague and [[Karlovy Vary]], [[Russian phrasebook|Russian]] is also sometimes overheard, due to the fairly significant Russian diaspora living in both cities. More recent arrivals by Ukrainian immigrants have also brought [[Ukrainian phrasebook|their language]], and it can frequently be heard in the larger Bohemian and Moravian cities. [[Polish phrasebook|Polish]] is sometimes heard in the Zaolzie border region in [[North Moravia]], particularly around [[Karvina]] and Český Těšín, where bilingual street, building, and road signs are commonplace. One of the country's most prolific immigrant groups, the Vietnamese, own many small grocery stores and corner shops (''potraviny'') across the country, as well as many Chinese, Japanese, and Vietnamese restaurants. This group commonly speaks [[Vietnamese phrasebook|Vietnamese]] to each other in their stores or on the street, although many also speak heavily-accented Czech. Younger Vietnamese have completely integrated into Czech society, and are often bi or trilingual with Czech, Vietnamese, and English.\n\n==Buy==\n[[Image:CZK Banknotes 2014.png|thumb|Czech koruna banknotes.]]\nThe currency of the Czech Republic is the '''koruna''' (crown), plural '''koruny''' or '''korun'''. The currency code '''CZK''' is often used internationally, but the local symbol is '''Kč''' (for ''koruna česká''). \n\nCoins are issued in 1 Kč, 2 Kč, 5 Kč (all stainless steel), 10 Kč (copper-colored), 20 Kč (brass-colored) and 50 Kč (copper-colored ring, brass-colored center). Notes are issued in 100 Kč (aqua), 200 Kč (orange), 500 Kč (red), 1000 Kč (purple), 2000 Kč (olive green) and 5000 Kč (green-purple). See some banknote samples [http://www.cnb.cz/en/czech_legal_tender/banknotes/index.html]. Be aware that all 50 Kč and 20 Kč banknotes, older haléř coins, and older-style 1000 Kč and 5000 Kč banknotes before 1993 are no longer legal tender.\n\nSome major stores (mainly bigger chains) will accept euros, and it's also fairly common for accommodation providers to also quote in euros. In shopping areas along the Austrian border and petrol stations in the whole country, change can be given in euros, but supermarkets and similar stores in downtown Prague (and other cities) will return only koruna, even though they may accept euros.\n\nMoney exchange offices (''směnárna'') are commonly found across the country, mostly in larger towns and cities. However, '''never exchange money on the street''', as it is illegal and usually a scam (and you may easily end up with counterfeit or foreign banknotes). It is possible to exchange money in banks, although commission charges are often attached. Be very careful when you are exchanging money at small exchange kiosks. Some of them try to use tricks in order to give you a bad exchange rate (eg. the displayed very good exchange rates are valid for transactions over 50,000CZK / 2000€ only). Ask for the total amount you will get and recompute it by yourself. Beware that once you hand over your money, it is legally a binding offer and it is very hard to cancel the transaction if you don't have strong arguments that they cheated. Do not trust \"0% commission\" in big letters signs either, as often there is an \"only when selling CZK\" amendment in small letters, and buying CZK still includes a commision. [http://www.exchange.cz/ Exchange] and [http://www.xe.com/ XE.com] offer up to date exchange rates for nearly all currencies.\n\nGenerally, exchange offices at the airport, rail stations and main tourist areas do not offer good rates. Local people exchange money in exchange offices in less frequented places away from prominent tourist locations. In some cases, one can get a better rate by using ATMs (''bankomat'') instead of changing cash.\n\nMajor stores and petrol stations throughout the country accept chip+PIN or contactless Visa and EC/MC, as well as most shops and restaurants throughout the country. Stripe cards are usually fine to use but their acceptance is declining.\n\nCompared with other [[Western Europe|Western European]] countries, the Czech Republic is often considered as an affordable location that does not destroy your account balance.\n\n==See==\nThanks to its prime location in the center of Europe, the end of communism, and its entrance into the European Union, the Czech Republic has rapidly grown in popularity with international tourists, especially the capital [[Prague]], which has become one of Europe's most visited cities. Many tourists tend to be Prague-centric and stay only in or around the capital, leaving many other sites across the country undiscovered. By all means, discover the rest of the republic, which has a variety of other picturesque cities and towns to discover, as well as rich breathtaking landscapes of villages, forests, mountains, and rivers that are waiting to be explored.\n\n===Cities===\n[[Image:Masarykovo namesti.jpg|thumb|Masaryk Square in [[Ostrava]].]]\nAs the country's primate city, '''[[Prague]]''' naturally dominates most visitors' itineraries, and for good reason. A mix of the Gothic, Renaissance, Baroque, Classical, Art Nouveau, Art Deco, Brutalist, and Socialist, the capital is arguably one of Europe's most photogenic cities. Visitors should enjoy the '''Old Town''' and gawk at its medieval buildings, stroll across the '''Charles Bridge''', and make their way through the ''' Malá Strana''' up to the dominating '''Prague Castle''' for fantastic views of the city. Outside of the capital, visitors can easily explore '''[[Kutná Hora]]''', home to impressive churches like '''St. Barbara's''', and the morbidly fascinating '''Sedlec Ossuary'''. In the northwest of the country is '''[[Karlovy Vary]]''', a stately and imperial spa town on the banks of the Ohře and Teplá rivers, which conjures feelings of a narrow [[Paris]] or [[Vienna]] in miniature. The city's annual [http://www.kviff.com/en film festival], held normally at the beginning of July, draws in actors, directors, papparazzi, fans and film enthusiasts alike. \n\nThe city of '''[[Pilsen]]''', home to its famous style of beer, is a blue-collar city, although its city centre is a mix of old and new, pleasant and unpretentious. Pilsen's Gothic '''St. Bartholomew Cathedral''' presents fantastic views of the entire city and surrounding countryside. Following the Vltava south is the beautiful town of '''[[Český Krumlov]]''', whose impressive '''castle''' dominates the Gothic and Renaissance river valley town below. Largely overlooked by tourists, nearby '''[[České Budějovice]]''' presents an enjoyable old town with its '''Ottokar II Square''' a centrepoint, surrounded by buildings from the last 600 years. Fiercely proud '''[[Brno]]''', the country's second largest city, often culturally and economically competes with Prague in a rivalry spanning centuries. Home to many students and with an active nightlife, Brno presents a compact and explorable old city centre, overlooked by both its impressive '''Špilberk Castle''' and the Gothic '''St. Peter and Paul Cathedral'''. Despite being metropolitan, Brno possesses a more relaxed atmosphere than Prague does, and is known throughout the republic for its high quality of life. \n\n'''[[Olomouc]]''', the historical capital of Moravia, remains as one of the Czech Republic's best kept secrets, site of one of the '''largest old towns outside of Prague''' and the '''Holy Trinity Column''', a [http://whc.unesco.org/en/list/859 UNESCO World Heritage Site] in its own right. The city's medieval '''astronomical clock''', destroyed by the Germans in World War II, was remade as a Socialist Realist clock during communism; instead of parading saints and religious allegories are peasants, scientists and workers. Olomouc's impressive '''medieval walls''' mixed with parkland also makes for a pleasant trip. The city of '''[[Ostrava]]''' in Czech Silesia, often characterized as working-class, to the point, and industrial, is home to '''Lower Vítkovice''', a massive former steel mill that now functions as a popular museum. The city also hosts the [https://www.colours.cz/?lang=en-us Colours of Ostrava], one of the country's largest music festivals. \n\n===Natural attractions===\n[[Image:Kralicky-Sneznik-03.jpg|thumb|Foothills outside of Králický Sněžník in the eastern Sudetes in [[North Moravia]].]]\nThe Czech Republic is ringed by a series of mountain ranges, creating the country's distinctive borders that haven't changed much in nearly a thousand years. Mountainous ranges include the '''Bohemian Forest''' to the west, and the '''Sudetes''' to the north and east, which the Krkonoše, Jeseníky, and Soví mountain ranges are a part of. \n\nWithin the country are 4 national parks, each containing rich natural beauty. [[Krkonoše National Park]] is one of the most famous and popular. Within Krkonoše close to the state border is '''Sněžka''', the republic's highest peak at 1,602 m (5,255 ft), where Czech and Polish hikers ascend from opposite ends of the mountain to meet at its summit. To the west near the German border is [[Šumava National Park]], encompassing a large area of the Bohemian Forest. Often calculated as one of the coldest areas of the country, Šumava is home to gentle mountains, raised peat bogs, glacial lakes, and the remnants of primeval forests. With the area's German inhabitants expelled in at the end of World War II, as well as being part of the Czechoslovak-West German border exclusion zone during the Cold War, Šumava has had little human interference since the 1940s. The park shares a common border with the German [[Bavarian Forest National Park]], and forms together a UNESCO-protected biosphere. In the republic's south, nestled against the Austrian border is [[Podyjí National Park]], a forested land running along the deep Dyje River valley.\n \nNear Brno is the '''Macocha Abyss''', a massive sinkhole in the Moravian Karst, home to a narrow river gorge, an underground river and a large cave system. \nUnusual rock formations are also a major attraction in different parts of the country. The impressive '''Rock Theatre''' near [[Broumov]] is one such place to see these formations. Another is [[České Švýcarsko National Park]], home to the Pravčická brána, the largest natural arch in Europe.\n\n===Castles & other rural monuments===\n[[Image:057 Zámek červená Lhota.Okres JIndřichův Hradec.Česko..jpg|thumb|Červená Lhota in [[South Bohemia]].]]\nThe Czech Republic is a treasure trove of castles, palaces, monasteries, and other places of historical significance. A complete listing of the country's castles and palaces is simply impossible. '''[[Karlštejn|Karlštejn Castle]]''', just outside of Prague, is a huge pull for curious tourists, attracted by its Gothic architecture perched above the banks of the Vltava River. The '''[[Lednice-Valtice]]''' palaces and gardens near the Slovak and Austrian borders are the massive former residences of the princes of Liechtenstein, and is today a combined [http://whc.unesco.org/en/list/763 UNESCO World Heritage Site]. '''Lednice''' is known for its especially massive English gardens, while  '''Valtice''',  for its fanciful faux-Roman architecture. Not far from these palaces in the town of Slavkov u Brna is the '''Austerlitz Battlefield''', where Napoleon decidedly crushed the Austrian and Russian armies in 1805. To the west in [[South Bohemia]] near the town of Jindřichův Hradec is the '''Červená Lhota''' château, an iconic Renaissance palace starkly painted red, standing in the middle of a pond and linked only by a stone bridge. '''Hluboká Castle''', not far from [[České Budějovice]], is another massive palace, dating from the Middle Ages but heavily redesigned in the 19th century. To the very north of the country are the impressive ruins of '''Trosky Castle''', whose Gothic ruins give dramatic vistas to the [[Bohemian Paradise]]. '''Kašperk Castle''', located near the Bohemian Forest, is another Gothic legacy of Emperor Charles IV's reign. \n\n==Do==\n[[Image:Podzim na Kašperku.jpg|thumb|Kašperk Castle overlooking the Bohemian Forest.]]\n===Hiking===\nThe Czech Republic has an excellent and sophisticated system for trail blazing, with marked pathways located just about everywhere in the countryside. Choose an area, buy a hiking map for the area (the best brand is the Czech Tourist Club's (''Klub českých turistů'') 1:50000 military-based maps, covering the whole country, available in most large bookstores.\n\n===Swimming===\nMany places in the Czech Republic are great for swimming, and there are many designated public swimming areas (''koupaliště''). A list of places suitable for swimming is available here: [http://www.plavcik.cz/ Plavcik.cz].  However, be aware that in hot weather, the quality of the water in some places can fall below EU standard regulations.\n\n===Nudism/[[Naturism]]===\nCzech culture is rather impartial to topless sunbathing and nudism in general, with most locals not batting an eye. Although the country is landlocked, there are many nudist and naturist beaches near lakes. A full list is available at [http://www.naturista.cz/lokality/fcfkk.htm at Naturista.cz]. Full nudity on other beaches is legal, but rare, and usually only happens in non-crowded places.\n\n==Learn==\nThe Czech Republic has a strong history of higher learning, and remains relatively inexpensive to learn in compared to other nations. The country's most prestigious centre for public education, '''[http://www.cuni.cz/UKENG-1.html Charles University in Prague]''', is a member of the '''Coimbra Group''' and the '''Europaeum'''. Founded in 1348, it is among one of the world's oldest universities. Other well-regarded universities in the country include '''Film and TV School of the Academy of Performing Arts''' in Prague, '''[http://www.muni.cz/ Masaryk University]''' in [[Brno]], '''[http://www.upol.cz/en/ Palacký University]''' in [[Olomouc]], and the '''[https://www.cvut.cz/en Czech Technical University]''' in [[Prague]]. \n\nThere are a number of private universities in operation around the country, although their numbers are small and have still yet to reach universal acceptance.\n\n==Work==\n[[Image:Znojmo - panorama od jihu obr1.jpg|thumb|The South Moravian town of [[Znojmo]].]]\nEU citizens can work in the Czech Republic without a work permit. Citizens from non-EU states will need a work visa or a business license. The easiest way to live and work in the Czech Republic as an English speaking person is to teach English. Various institutions offer English teaching certificates across the country. The [http://www.teflcoursereview.com/courses/location/czech-republic/ TEFL Course Review] displays a good list of where you can obtain a TEFL certificate around the country.\n\nFinding a job at a school should not be difficult as knowledge of English is in high demand. Depending on the school and the amount of work they offer you, people can earn between 35,000 to 20,000CZK, with work and salaries usually highest in [[Prague]], [[Brno]], and [[Pilsen]], and decreasing once you go into smaller cities and towns. This is more than enough to live comfortably with, depending on your living situation or lifestyle.\n\nIn order to work in the Czech Republic, you must either obtain a work visa or a trade certificate (''živnostenský list''). A work visa, usually sponsored by your company, allows you to work for one business and normally requires a university degree. A trade certificate, however, does not require a degree, but does requires an initial bank account balance in excess of 110,000CZK ($5,100 roughly), a valid ID or passport, a recent criminal record from your home country, and a small fee to purchase. After obtaining it, a ''živnostenský list'' allows you to work as a freelancer, doing whatever you wish. In order to apply for a trade license, you must go to a city office (''městský úřad''), where there will typically be a trade license office (''živnostenský odbor''). In order to research where the closest one will be to you, [http://www.statnisprava.cz/rstsp/ciselniky.nsf/i/d0056 Statnisprava.cz] has a list of all locations of where to obtain a trade certficate.   \n\nOther work in the tourism industry is possible.  Hostels, hotels, restaurants, city tours, and others are always looking for English-speaking staff.\n\nPrague is probably the best place to foreigners to look for a job because of the number of multinational and English-speaking companies located there. Brno is also a good location to research.\n\nThe most popular websites to search for a job are [http://www.jobs.cz Jobs.cz] and [http://www.prace.cz Prace.cz]. Interesting job offers are also on [http://www.kdejeprace.cz/ KdeJePrace.cz]. These websites are generally free to use.\n\nThere are many flexible office solutions in Prague and other large cities that enable you to rent short term office space, with [http://www.regus.cz Regus.cz] a good place to research. There are also coworking spaces in every large city, with [http://navolnenoze.cz/blog/coworkingy/ Navolnenoze.cz] providing a database for coworking spaces.\n\n==Eat==\n'''Tipping''' is a standard 10%, and is not normally added to the bill.  Don't be confused by the percentage figures listed at the bottom of the bill, by Czech law, a receipt must show the VAT paid (21% in most cases) and the VAT is already included in the final amount, and you should add about 10% to this (or more if you were really satisfied). '''It is normal practice to give the waiter the tip ''before'' you leave the table by adding your tip to the price of the meal.''' Tipping is ''not'' obligatory so if you weren't satisfied with services offered, don't bother tipping.\n\nIn a vast majority of better restaurants located in major cities, you can pay by credit card (EC/MC, VISA) but don't be surprised if a few will not accept them. Make sure to check the door for respective card logos when entering the restaurant or ask the waiter before ordering. Beware that as in the rest of Europe, displaying the card logo means the restaurant accepts chip+PIN cards but still may refuse stripe-only cards. \n\nCzechs sometimes use special meal tickets (''stravenky'') to pay in some restaurants, these are subsided by and tax-deductible for employers. You won't get these tickets unless you get a job in the Czech Republic, so don't be surprised when you see them.\n\n===Traditional local food===\n[[Image:Praha 2005-09-25 svíčková na smetaně-00.jpg|thumb|''Svíčková na smetaně'' (beef sirloin with cream) is one of the country's most well-known meals.]]\nTraditional Czech food is hearty and suitable after a hard day in the fields, being heavy and quite fatty, and is excellent in the winter months. In recent times there has been a tendency towards lighter food with more vegetables. today, traditional food is not usually eaten every day, with some locals avoiding it altogether. However, nothing goes as well with an excellent Czech beer as some of the best examples of traditional Czech cuisine, like pork, duck, or goose with dumplings and sauerkraut.\n\nA traditional main meal for a day (usually lunch) consists of two or three dishes. The first dish is hot soup. The second dish is the most important part, very often based on some meat and side-dish (both served on the same plate). The third, optional part is either something sweet (and coffee) or a small vegetable salad.\n\nCzech cuisine offers many different kinds of soup (''polévka''). The most common are '''bramboračka''' (potato soup, sometimes with forest mushrooms), '''hovězí vývar''' (a clear beef soup, sometimes with liver dumplings—''játrovými knedlíčky''), '''gulášovka''' (thick goulash soup), '''zelňačka''' (thick and sour cabbage soup), '''česnečka''' (strong garlic soup, very healthy and tasty, but do not eat this before kissing),  '''kulajda''' (thick soup with forest mushrooms and milk), '''hrášková polévka''' (made of young green peas),  '''čočková polévka''' (made of lentils), '''fazolačka''' (made of beans), '''rajská polévka''' (tomato soup), and many others. A special case not to everyone's tastes is '''dršťková polévka''' (tripe soup). '''Rybí polévka''' - thick fish soup made of carps (including its head, some innards, roe and sperm) is the traditional soup of Christmas. \n\nSome soups are eaten with bread; sometimes small croutons are also put inside just before eating it. Soup can be also eaten as the only dish, especially for a smaller dinner.\n\nThe second dish (main course, ''hlavní jídlo'') of a meal is (in the traditional cuisine) often the famous heavy and fatty part, very often based on '''pork''' but also '''beef''', '''chicken''', '''duck''', or other meat. The important part of most main courses is the side-dish (the whole dish including the side-dish is served on one plate) which are usually boiled or baked potatoes, fries, rice, pasta or the most typical side-dish of the Czech cuisine—'''knedlíky'''.\n[[Image:VeproKnedloZelo-00.jpg|thumb|''Vepřo-knedlo-zelo'' (roast pork, dumplings and sauerkraut).]]\n''Knedlíky''  (usually translated as ''dumplings'') come in many different kinds. Most kinds are used as a side-dish, however some kinds with filling are used as a dish in itself. The most common type, always used as side-dish, is '''houskové knedlíky''' (bread dumplings). These are boiled in a shape of a cylinder which is then cut into round slices about 8 cm in diameter remotely resembling white bread. Houskové knedlíky are served with Czech classics such as '''guláš''', similar to Hungarian goulash but with a thinner sauce and less spicy; '''Svíčková na smetaně''', beef sirloin with a creamy root vegetable (carrot, celeriac, parsnip) sauce, served with a tablespoon of cranberry sauce, a slice of orange and whipped cream; '''Vepřová pečeně se zelím a knedlíkem''' (colloquially '''Vepřo-knedlo-zelo'''), a combination of roast pork, dumplings and sauerkraut. The latter combines very well with a world-famous Czech beer which include Pilsner Urquell, Gambrinus, Budvar (known as ''Czechvar'' in the US), Staropramen, Velkopopovický Kozel and Krušovice. If you are lucky enough to enter a pub serving Svijany, you should definitely order it as it is believed to be one of the most delicious brands worldwide.\n\nOther common dumplings are '''bramborové knedlíky''' (potato dumplings). The slices are smaller, more yellow in color, and are always served as a side-dish. Typical combinations with potato dumplings are roasted meat (pork or lamb for example) with spinach, or duck with sauerkraut (with a combination of ''bramborové'' and ''houskové knedlíky''). Less common are '''chlupaté knedlíky''' (literally hairy dumplings but there is no hair on it, don't panic) which are not sliced but boiled in the shape of balls. They are also usually served with roasted meat and either sauerkraut or spinach.\n\nOther Czech dishes include '''pečená kachna''', roast duck again served with bread or potato dumplings, and red and white sauerkraut; '''moravský vrabec''' (lit. Moravian sparrow) which is in fact pork cooked in garlic and onions; '''smažený kapr''', fried carp breaded and served with a very rich potato salad and eaten on Christmas Eve; '''pečené vepřové koleno''', roast pork knee, served with mustard and fresh horseradish; '''bramborák''', garlicky potato pancakes; '''smažený sýr''', breaded deep-fried Eidam (Edammer; the most popular cheese in the Czech Republic) served with boiled potatoes or french fries and tartar sauce; '''párek v rohlíku''', long, thin hot dogs with crusty rolls and mustard or ketchup.  If you must, you can always get '''hranolky''' - french fries.  And of course, the ubiquitous '''zelí''' (raw cabbage or sauerkraut) which is served with absolutely everything.  Game is also very good, and includes dishes such as '''kančí''', wild boar, '''bažant''', pheasant, and '''srnčí''', '''jelení''' or '''daňčí''', all species of deer.  These are almost always served either with dumplings and red and white cabbage, or as guláš.\n\nDon't expect a wide selection of '''zelenina''', vegetables, unless in the countryside; peppers, tomatoes, and cabbage are the most commonly-seen side dishes, often served as a small garnish.\n\nVisitors may be surprised when they find '''Americké brambory'''—literally American potatoes on the menu. These are actually potato wedges, usually spiced and served very hot.\n\n===Meals atypical for restaurants===\nGenerally, the best place try Czech cuisine is to be invited for such a meal at someone's house. However, it is not so easy as contemporary Czechs tend to prepare simpler and more international foods. Traditional Czech cuisine is often reserved for Sundays, holidays, or prepared by grandma (''babička'') when her children visit. This isn't a rule but a common situation. In normal restaurants—even the better ones—traditional Czech staples can't match what grandma serves. This doesn't mean that the food is bad or not tasty, but it is missing something that home preparation can provide. In luxurious restaurants specialized with Czech cuisine, food can be excellent, but the luxurious style and creative improvements by the chef often only mimics traditional folk cuisine. Again, this is not a hard rule. Sometimes you can compliment the food in a restaurant that is  \"like what my grandma makes.\"\n\nThere are some dishes that are usually not served in any restaurants or pubs, but are made at home and worth trying if you have the opportunity. '''Brambory na loupačku''' (potatoes to be peeled) is a cheap and simple meal usually made in the countryside. Whole unpeeled potatoes are boiled in a big pot and put in the pot itself or a bowl on the table. You just take a hot potato from the pot, peel it yourself, put some salt, butter, and/or curd (''tvaroh'') on it and eat it. Drink it down with lots of cold milk. For such a simple meal, it can be incredibly tasty, especially when eaten in the countryside after a day spent outside.\n\nMushroom-picking in forests is a very popular activity among Czechs. Unsurprisingly, collected mushrooms are eaten afterwards. In restaurants, usually only cultivated mushrooms are used. If forest mushrooms are served in a restaurant, it is usually only as a minor addition to a meal. Homemade mushroom meals are a completely different story. A classic example is '''smaženice''' (fried dish), also known as '''míchanice''' (mixed dish)—forest mushrooms, the more kinds the better, are sliced into small pieces, mixed and stewed with some fat, onion, and caraway. Later, eggs are added to the mixture. Smaženice is served with bread. '''Smažené bedly''' are whole caps of parasol mushrooms coated in breadcrumbs and cumin and fried. '''Černý kuba''' (black Jimmy) is a traditional Christmas fasting meal made from dried mushrooms and peeled barley. '''Houbová omáčka''' (mushroom sauce), served with meat and bread dumplings is also popular. Fresh or dried mushrooms make also a nice addition to '''bramboračka s houbami''' (potato soup with mushrooms). '''Kulajda''' is a soup from mushrooms and cream. Soups and sauces are the most likely forest mushroom meals to find in a restaurant, because they contain a relatively small amount of mushrooms.\n\nIf you want to pick mushrooms by yourself, be careful. There are hundreds of species, some of them tasty, some merely edible, but some poisonous or even deadly. You can also find psilocybin, which are hallucinogenic (although it is very hard to guess a safe dosage and therefore dangerous). A tasty and edible species may look very similar to bitter or deadly species. If you do not know mushrooms very well, you should be accompanied by an experienced mushroom-picker.\n\n===Snacks===\nAlso try a traditional snack, often the only food served in some pubs (''hospoda'', ''pivnice''), or can be found in bread shops (''pekárna''). Many can be washed down with a good beer:\n[[Image:Chlebicky.JPG|thumb|''Obložené chlebíčky'', a popular snack.]]\n* '''Utopenec''' (\"drowned man\") — a pickled sausage with onion, garlic and other vegetables and spices.\n* '''Zavináč''' (rollmop; also used as name of the at-sign in Czech) - a slice of pickled fish, most often herring or mackerel, rolled-up and filled with various pickled vegetables (sauerkraut, onion, sometimes carrot or pepper). \n* '''Tlačenka s cibulí''' (brawn with onion) — a slice of haggis-like meat pudding, sprinkled with vinegar and garnished with fresh onion slices. Beware, can be rather acidic due to vinegar.\n* '''Nakládaný Hermelín''' (pickled camembert) — pickled camembert-like cheese, often marinated with garlic and chilli.\n* '''Pivní sýr''' (beer cheese) — a soft cheese with a strong, Cheddar-like flavour.  You should add a splash of beer to the cheese, and then mash it all together and serve it on traditional Czech bread. ''Šumava''-style bread is the most common, a very tasty dense loaf made from rye and caraway seeds.\n* '''Tvarůžky''' (small curd pieces) or '''syrečky''' (small cheese pieces) — traditional cheese with a very strong aroma, and very much an acquired taste. Often served deep-fried but if you can handle the smell, it can be eaten alone, just with some chopped onion, mustard and bread. Sometimes also marinated in beer ('''syrečky v pivu'''). This cheese naturally contains almost no fat (less than 1%). Also can be served as '''pivní pes''' (lit. beer dog) - a plate of cheese on butter bread, with slice of onion, hot pepper and mustard.\n* '''Romadur''' — traditional cheese with strong aroma. Aroma is similar to tvarůžky but Romadur is a different type of cheese.\n* '''Matesy s cibulí''' (soused herring) — cold fish served with onions.\n* '''Obložené chlebíčky''' (garnished breads) — an open sandwich usually served as a snack or appetizer, with ham, salami of sausage, a sliced hard-boiled egg, cheeses, cream cheese, a cucumber,  tomato, fish paste, or lettuce. This is highly popular to get from bakeries or bread shops. \n\nIf you want a warm, bigger, and more complicated meal which goes excellently with beer, get some of the typical Czech meals based on fatty meat (pork, duck, or goose) with sauerkraut and knedlíky (dumplings). Another excellent option is a whole pork knee with horseradish and bread ('''ovarové koleno s křenem''' or simply '''ovar''').\n\n===Sweets===\n[[Image:Makovy frgal.jpg|thumb|A typical ''koláče'', found in many pastry shops.]]\nCzechs make no secret that they have a serious sweet tooth, yet pastry patterns are different compared to France, the US or the UK. As everywhere, some traditional treats have become a mass-market production for tourists, while others are difficult to find.\n\n====On the street====\n* '''Lázeňské oplatky''' (spa wafers) — wafers from [[Mariánské Lázně]] and [[Karlovy Vary]]  are meant to be eaten while \"taking the waters\" at a spa, but they're also entirely good on their own. Have them either out of the box, on your own, or heated and iced with sugar, cinnamon, etc..\n* '''Trdlo''' (pestle; this is in fact the roller, not the sweet) or '''trdelník''' — available in dedicated sell-points in most major cities. It is a Central European Medieval-style sweet roll made from eggs and flour.\n\n====In restaurants====\n* '''Jablkový závin'''  or '''štrůdl''' — an apple roll pastry related to the Austrian ''strudel'', served warm with whipped cream.\n* '''Medovník''' — a newcomer having quickly spread in most restaurants. A brown high cake made of gingerbread, honey and walnuts.\n* '''Ovocné knedlíky''' (fruit dumplings) — fruit-stuffed dumplings served either as main course or a filling dessert. The smaller ones (''tvarohové'' curd) come with plum, apple or apricot filling; the bigger ones (''kynuté'', yeast) come with strawberries, blueberries, ''povidla'' (plum jam) or other fruits. These dumplings are served with melted butter, iced with curd and sugar, and topped with whipped cream.\n* '''Palačinka''' — a distant cousin of French ''crêpes'', these pancakes are usually thicker and served with a wide choice of fillings, including chocolate, ice cream, fruit and whipped cream.\n\n====Cukrárna====\nTry also the wide variety of rich cream cakes usually found in a '''Kavárna''' (cafe) or a '''Cukrárna''' (sweet shop).  Czech cakes are similar to their Viennese cousins due to the shared history of both countries under the Austro-Hungarian empire.  Sample also '''Vídeňská káva''' (Viennese coffee), coffee served with a mountain of whipped cream.\n* '''Rakvička''' (\"little coffin\") — a light crispy biscuit with cream.\n* '''Větrník''' (\"windmill\") — a round French ''éclair''-style cream cake.\n* '''Punčák''' (\"the rum-punch-filled one\") — a rum soaked yellow/pink sugar-glazed cake.\n* '''Laskonka''' — a coconut and cream-based sandwich cake.\n\n====Home made====\n* '''Bábovka''' — a traditional cake, similar to marble cake, fairly dry, and usually served dusted with icing sugar. Known as ''gugelhupf'' in neighboring [[Austria]].\n* '''Buchty''' — traditional buns filled with tvaroh (curd cheese), mák (poppy seeds), or povidla (plum jam)\n* '''Koláče''' — a rather popular flat tart topped with various sweet fillings like ''tvaroh'', ''povidla'', poppy seeds, fruit jams, chopped apples and nuts. Their size ranges from bite-sized (''svatební koláčky'', \"little wedding cakes\") to pizza-sized (''chodský koláč'' or ''frgál''), often containing several fillings combined into an elaborate pattern .\n\n===Vegetarian food===\n[[Image:Czech fried cheese.jpg|thumb|Fried cheese (''smažený sýr'') is a staple for many restaurants.]]\nFinding a vegan or vegetarian meal in the Czech Republic is not as difficult now as it once was, especially in the larger cities. In tourist areas at least, such as Prague, Brno, or any city with a major university, there is an amount of vegan restaurants (actually Czech republic have highest number of vegetarian/vegan restaurants in the Europe comparing to the population) and most of the other restaurant menus contain a vegetarian section (''bezmasá jídla'' or ''vegetariánská jídla'') with two or three options. However people may have their own interpretation of what constitutes as ''vegetarian'', and it is not uncommon to find dishes such as broccoli bacon or prawns listed under ''vegetarian meals''. Don't mind to ask the waitor about your meal.\n\nIf you are interested in vegan cousine, you have to try out the \"ROBI\" meat (meat like vegetable protein, \"czech invent\" made in factory near Brno), served in many variations.\n\nIn traditional restaurants, the choice in vegetarian food is usually limited to fried cheese (''smažený sýr''), although sometimes containing ham or salami, dumplings (knedlíky), omelette, potatoes (boiled, baked, fried or as 'potato pancakes') and sometimes a Greek salad or cooked vegetables. Be advised that vegetables practically always have to be ordered separately, even if they appear to be part of the dish: e.g. the vegetables listed in a menu option called \"potato pancakes with vegetables\" are most likely a garniture consisting of a few leaves of lettuce and a slice of tomato. It can be suprising, but soya meals are also quite common.\n\nBigger towns have foreign cuisine restaurants, mostly Italian, Vietnamese, and Chinese, which can serve you meat-free dishes such as vegetarian pasta.\n\n==Drink==\n===Beer===\nWhen Germans or Belgians will boast their beers as being the best, Czechs often roll their eyes and will proudly respond that it was in ''their'' country where modern beer (''pivo'') was invented. Czechs are the heaviest beer drinkers on Earth, consuming about 160 litres per capita a year. Going to a cosy Czech pub for dinner and a few beers is a must! Some well-known brands include:\n[[Image:Prague Praha 2014 Holmstad Czech beer - Tsjekkisk øl - 4.JPG|thumb|Some of the Czech Republic's most famous beers.]]\n* '''Pilsner Urquell (Plzeňský Prazdroj)''' — perhaps the country's most famous export, made in [[Pilsen]]. A pilsner type blond lager that has inspired beers across the world.\n* '''Budějovický Budvar (Budweiser Budvar)''' — not to be confused with the American Budweiser, Budějovický Budvar (or Czechvar in North America) originates from [[České Budějovice]] and its brewery is still nationalized by the Czech government.\n* '''Staropramen''' — translating as \"old spring,\" made in [[Prague]]. \n* '''Gambrinus''' — lager beer also made at the Pilsner Urquell brewery in [[Pilsen]].\n* '''Velkopopovický Kozel''' (''Coe-ZELL'') — known for its iconic goat emblem (that so-happens to be its Czech translation), made in [[Central Bohemia]].\n* '''Bernard'''  — an old, traditional beer from the [[Bohemian-Moravian Highlands]], known for being non-pasteurized. \n* '''Radegast''' — a beer originating from [[North Moravia]].\n* '''Svijany''' (''SVE-yawn-ne'') — a highly-popular independent beer brewed in a tiny village of the same name in [[North Bohemia]].\n* '''Starobrno''' — translated as \"Old Brno,\" a beer that is popularly found in [[Brno]]. \n* '''Krušovice''' (''Crew-sho-VEE-sa'') — a historical beer brewed since the 1500s for the Austrian emperors, in the village of the same name in [[Central Bohemia]].\n* '''Dobřanská Hvězda''' (''DOB-zruhn-SKAH Hv-YEZ-duh'') — an independent beer in [[West Bohemia]]. \nAlthough many Czechs tend to be very selective about their beer brands, tourists usually don't find a significant difference. Remember, real Czech beer is only served on tap; bottled beer is a completely different experience. High-quality beer can almost certainly be found in a ''hospoda'' or ''hostinec'', very basic pubs which serve only beer and light snacks. Take a seat and order your drinks when the waiter comes to you. But beware, the handling of the beer is even more important than its brand. A bad bartender can completely ruin even excellent beer. The best bet is to ask local beer connoisseurs about a good pub or just join them.\n\nBeers are sometimes listed by their original sugar content, which is measured in degrees Plato (P/°). The difference is generally apparent in the final alcohol content. Normal beer is about 10° (such as Gambrinus and Staropramen, which results in 4% ABV), lager 12° (such as Pilsner Urquell, results in about 4.75% ABV). The latter is stronger and more expensive, so you should specify which one you want when you order.\n\nCzech lager is nothing like the fizzy lagers found in many other countries. Instead, it has a very strong, hoppy, almost bitter flavour, and goes very well with heavy dishes like duck or pork and dumplings or strong cheeses. It always has a thick head on the top when it is served, but do not be afraid to drink \"through\" it, it is fun and it slowly disappears anyway, nevertheless do not drink the beer too slowly as the fresh cold taste (especially in hot summers) quickly fades &ndash; the \"true\" Czech connoisseurs do not even finish this \"tepid goat,\" as they call it.\n\nDon't be surprised if the waiter, especially in typical pub, puts the next beer before you, but you have not ordered it and also you have not finished your previous beer. It is purely and simply because you shouldn't sit in a pub with empty glass. If you don't want another beer, say ''ne, děkuji'' (\"no, thanks\") to the waiter, or ''zaplatim prosím'' (\"i will pay, please\") if you want to pay and leave.\n\n===Wine===\nWhat might come as a surprise to beer-loving outsiders, wine (''víno'') is also highly popular in the Czech Republic, particularly in [[South Moravia]], where the climate is suited for vineyards. White wines tend to be the best, as the growing conditions are more favourable for them. For white wines, try '''Veltlínské zelené''' (Green Veltliner), '''Muškát moravský''' (Moravian Muscatel), '''Ryzlink rýnský''' (Rhine Riesling) or '''Tramín''' (Traminer), or red wines such as '''Frankovka''' (Blaufrankisch), '''Modrý Portugal''' (Blue Portugal, named after the grape, not the country), or '''Svatovavřinecké''' (Saint Lawrence). Also try ice wine (''ledové víno'') made when the grapes are harvested after they have frozen on the vines, or straw wine (''slámové víno'') made by leaving the grapes to ripen on straw) &ndash; these wines are more expensive and are similar to dessert wines.  '''Bohemia Sekt''' is also popular with Czechs, and is an inexpensive sweet, fizzy wine, similar to Lambrusco, and drunk at celebrations. The best places for wine are either a wine bar (''vinárna''), or a wine shop (''vinotéka'') which sometimes has a small bar area too.\n\n===Spirits===\n[[Image:Slivovice R. JELÍNEK.jpg|thumb|''Slivovice'' is a common spirit (and often made at home), especially in rural Moravia.]]\nFor spirits, try '''Becherovka''' (world-famous herb liqueur produced exclusively in [[Karlovy Vary]], similar to Jagermeister, tastes of a mixtures of cloves and cinnamon, and drunk as a digestive), '''slivovice''' (plum brandy, very popular in Moravia and can be used as a pick-me-up), '''hruškovice''' (pear brandy, less fiery than slivovice), and so on. Many of these brandies are made out of almost every kind of fruit (plums, peaches, cherries, etc.), and are often made at home in the countryside. The unique '''tuzemský rum''' (made from sugar beet, not from sugar cane as Cuban rum is, sold under brands like '''Tuzemák''' to conform with EU market rules). Be careful as all are about 40% alcohol.\n\n===Non-alcoholic===\nFor non-alcoholic drinks, mineral waters are popular, but tend to have a strong mineral taste. Try '''Mattoni''', or '''Magnesia''', both of which taste like normal water and still claim to be good for your health. If you want sparkling water, ask for ''perlivá''. If you want it non-carbonated, ask for ''neperlivá''. Light sparkling water (but not overwhelming is called ''jemně perlivá''.  '''Kofola''', a coke-like drink, is also very popular, with many Czechs agreeing it is the best thing to originate from the communist era. Many restaurants don't make any difference between \"sparkling water\" and \"sparkling mineral water\". \n\n===Others===\nRestaurants and pubs do not offer water for free. Unsurprisingly, as beer is the national drink, it is usually the cheapest thing on the menu, with prices ranging from 15 to 60CZK (0.50&ndash;2€) per half litre, depending on the attractiveness or location the pub. Pubs closer to well-known tourist centres often have more expensive beer. Drinks are brought to your table, and often each drink is marked on a small slip of paper which is kept on the table in front of you, so you can keep count of what you have had. When you are ready to leave, ask the waiter for the bill &ndash; he or she will calculate the bill according to the number of marks on the paper.  It is common to share tables in busy pubs, with most Czechs asking ''Je tu volno?'' (\"Is this seat free?\") before sitting down.\n\nTry also '''svařák''', a hot mulled wine served in all pubs and outdoors at Christmas markets, and is the Slavic cousin to the German ''glühwein''. '''Grog''', hot rum and water served with a slice of lemon (add sugar to taste), and '''medovina''' (mead) are both usually served hot and are particularly good for warming up at a cold winter market. Finally, if you are heading into Moravia, try '''burčák''', a speciality found only around the end of the summer or early autumn. It is extremely young wine, usually white, and is in a cloudy, still fermenting stage of production when the wine is very sweet and smooth to drink. It continues to ferment in the stomach, so the alcoholic content at the time of serving is unknown, but it's usually high and can creep up on its drinkers due to its sweetness hiding its potency. Czechs say that it should only be drunk fresh from the vineyard, and many small private winemakers are passionate about it, waiting up into the night for the moment when the wine reaches the ''\"burčák\"'' stage. Visitors will often spot it being sold at wine festivals (''vinobrani'') around the country, as well as sometimes in markets or wine bars (''vinoteka'').\n\n==Stay safe==\nLaw enforcement is carried out by the [http://www.policie.cz/clanek/Police-of-the-Czech-Republic.aspx Policie České republiky]. Many of the larger cities and towns have city or municipal police, although their powers are strictly restricted to mainly misdemeanors and traffic violations. Police officers are largely respected, and will be mainly helpful to tourists in need.\n\nThe European '''unified emergency number 112''' functions in the Czech Republic and will work for all land or mobile lines. The \"old\" emergency numbers are still in use, which include:\n\n* Ambulance: 155 \n* Firefighters: 150 ('''Hasičský záchranný sbor''')\n* Police: 158 ('''Policie''')\n* Municipal Police: 156 ('''Městská policie''')\n\nViolent crime and assaults in the Czech Republic are highly rare, and visitors will likely encounter no issues on their journey. The country is remarkably safe and free of personal crime. However, there are several nuisances that travellers should be aware of:\n\n;Taxi drivers\n:Negotiate the price before you use taxi or use a reputable company (e.g. in Prague AAA taxi, Profi Taxi, City Taxi). Prague taxi drivers are notorious known for taking the longest possible way to earn more money or to use so-called “turbos” which speeds the meter up (the control is usually hidden under the gear stick gaiter). The Prague City Council has introduced new regulations which will see all legitimate taxis painted yellow. Public transportation in most major cities is often reliable and inexpensive, many of them with night services.\n\n;Pickpockets\n:Watch your pockets, especially if there is a crowd, particularly in [[Prague]]. Watch out for large groups of people jostling you. Beware of a particular pickpocket gangs operating in Prague: they are mainly male, although sometimes there are women too; all are extremely overweight and rely on their sheer size and number to disorientate tourists. They tend to operate on the 9, 10 and 22 trams as well as the central metro stations, usually just as people are getting on and off, or on the escalators. Don't pull out your tickets unless you are specifically asked to do so. Keep your wallet and money securely locked and separate from each other at all time. Don't challenge them as they can become aggressive but keep your eyes open. Prosecutions for pickpocketing are rare as the police usually have to catch the pickpocket in the middle of a crime, otherwise the gang members just blame each other and it is impossible to prove who did it.\n\n;Prostitution\n:Prostitution is not a legal business but not illegal either. This means prostitutes do not pay taxes and prostitution is not regulated by the state. Therefore the health risk may be very high, especially in cheap brothels (often spotted with red lights on their windows) or on the street. There also have been cases of prostitutes offering a drink with sleeping pills to their customers and then stealing everything. Pay attention to the age of the prostitute, as paying a person under 18 years for sex is a criminal offense (otherwise the age of consent is 15).\n\n;Marijuana\n:Marijuana is illegal in the Czech Republic but it is quite popular, especially among young people. In case the police catches you smoking or possessing marijuana, be very polite with them. The reason is that by the current law, punishable is only possession of a “larger than small” amount of marijuana (defined as 15 g) but if you are rude, they may detain and interrogate you, asking for your source.\n\n==Stay healthy==\nGrocery stores do not sell what many Americans consider '''over-the-counter drugs''', such as aspirin. You will need to go to a pharmacy (''lékárna''), which is usually open between 8AM and 7PM, Mondays to Fridays. There are 24-hour pharmacies in the bigger cities, and you should find an address for the closest one to you listed in the window of the nearest pharmacy to you. If you are in Prague, the most central 24-hour one is in Prague 2, on the corner of Belgická and Rumunská streets. These pharmacies dispense both prescription and non-prescription drugs from a small window on Rumunská out of hour. Ring the bell if there is no-one there.\n\n'''Tap water''' is good and perfectly safe across the country, although in some small towns, the chlorine can be quite strong.\n\nA reputable hospital in Prague is '''Nemocnice na Homolce'''. There is a foreigner's clinic (''cizinecké oddělení''') with English-speaking receptionists who can make appointments for you. Most doctors speak some English, and the level of care is of a very high standard.\n\nCentral Europe and parts of the Czech Republic have '''ticks''' (''Ixodes ricinus'') which can carry Encephalitis or Lyme Borreliosis. Ticks hide in grass and bushes, so try to stay on trails and inspect exposed areas of skin after a hike. Vaccination against Encephalitis is available and recommended. If you want to bushwhack, make sure you have the vaccination and wear long trousers. A good insect repellent (which contains DEET), might be helpful, too.\nTicks like to cling to any soft, warm, well-perfused areas of your body (undersides of knees and elbows, skin around ankles, groins, neck area, behind your ears etc.) and if not removed, they'll suck your blood until they grow about 1 cm big. Never try to scratch a tick off or pull it out, because damaging it can cause you a serious infection. The sooner the tick is removed, the smaller the chance of infection. Either ask a physician to remove a tick for you, or try to remove it by yourself: lubricate your finger with any greasy lotion and gently wag a tick from side to side until it wobbles free. Then flush it down the drain - never crush or burn it to avoid infection. Watch the affected spot: if you see a growing red spot developing there anytime during next several months, immediately visit your physician and tell him about that - you might have contracted Borreliosis. It is dangerous, but it can be easily treated with antibiotics during early stage. Be wary that American vaccination against Borreliosis most probably won't work against European strains (''B. afzelii'' and ''B. garini''). Note that ticks are sometimes present even in city parks, including Prague.\n\n==Respect==\n[[Image:Hanacky kroj.jpg|thumb|Moravians in traditional costumes.]]\nThe Czech Republic, along with its neighbours [[Slovakia]], [[Austria]], [[Poland]] and [[Germany]], is part of [[Central Europe]]. Throughout [[Western Europe]] and in [[North America]], the country is often incorrectly referred to as an [[Eastern Europe|Eastern European]] state, and many Czechs are sensitive about this; many will even pre-empt the ignorance of some foreigners by asking, \"what part of Europe would you say the Czech Republic is in?\" Get on their good side by answering \"Central Europe,\" not Eastern!\n\nForeigners commenting about how \"everything is quite cheap here\" is considered a condescending remark about the country's economic status. \n \nEnglish-speaking Czechs remain divided with the shortening of the name of their country as ''Czechia'', some are not bothered by it, while others dislike the name. The name still has yet to universally be accepted or agreed upon.    \n\nCzechs don't appreciate foreigners who incorrectly assume their country was historically part of the Soviet Union or the Russian Empire—both entirely false—although it was part of the Soviet-led Eastern Bloc, and was until 1918 a part of Austro-Hungarian Empire. Czechs also don't appreciate it when foreigners confuse their country's name with the turbulent Russian republic of [[Chechnya]]. Additionally, calling the country \"Czechoslovakia\" still will not cause any offence to most locals but rather laughs, as Czechoslovakia has not existed for decades. \n\nIf you are knowledgeable about the Czechoslovak communist regime following World War II, bear in mind that this is still a sensitive issue for many. Most readily admit the positive social programmes of the era, yet a majority of Czechs born after 1960 and 1970 have otherwise few romantic views of Communism due to the experience of Normalisation. Although many complain about the state of the Czech Republic's affairs today, there is little nostalgia with younger generations to return to the old days. However, unlike neighbouring former Eastern Bloc states like [[Poland]], [[Hungary]], or the [[Baltic states|Baltics]], where Communism is near universally reviled, a relatively strong number of elderly Czechs still retain fond memories of the old order, partially explaining the continual popularity of the KSČM, the country's successor Communist party, which has maintained 10 to 15% of parliament throughout various elections since 1990. Dogmatically Marxist, fiercely conservative and viewed as a protest party, the KSČM and its members hold largely anti-Western (and sometimes outright xenophobic) views, although few of it's members speak English, it is doubtful you will have any contact with them unless you are interested in left-wing politics.    \n\nCenturies of religious skepticism, forced Catholicisation, and the most recent experience of Communism have made Czechs some the most atheistic people in the world, and will often not hesitate to say that they don't believe in any God. This is true especially in large Bohemian cities. Don't assume that anyone you do not know believes in God or has a passion for Christianity. Many Czechs find Mormon missionaries, Jehovah's Witnesses, and street preaching in general as a disrespectful and foreign presence in their country. Respect people's disbelief in religion and your religion will also be respected. Despite the country's largely atheist views, nearly 10% of the Czech Republic remains Catholic (although their numbers are declining), with another 1% Protestant. There are also small Jewish, Buddhist and Islamic minorities, mostly located in Prague. Despite religious disbelief being a majority, holidays such as Easter, Jan Hus Day, St. Cyril and Methodius Day, and Christmas are still widely celebrated, although most Czechs confess they do so for strictly cultural reasons and not for religious ones. \n\nAlways say hello (''dobrý den'') and goodbye (''na shledanou'', half-formally ''nashle'') when you enter and leave a small shop, restaurant or pub as it is polite.\n\nWhile dining at a restaurant with a host family, it is customary for THEM to pick up the bill, the opposite of most Western standards. However, don't assume they will, but also don't be surprised if they do.\n[[Image:Tabor CZ aerial old town from north B1.jpg|thumb|The historic town of [[Tábor]].]]\nWhen entering a Czech household, always remove your shoes unless said otherwise. Czechs usually wear slippers or sandals when indoors and never their outdoor shoes. Depending on how traditional the host family are, they may insist you change immediately into house shoes as a hygiene precaution, though this is rare. At the very least, they will offer you some to keep your feet warm.\n\nIt is advised not to mention Czech towns and places with their former German names, when asking for directions (e.g. referring to ''Karlsbad'' instead of Karlovy Vary etc.) or while chatting with the locals. Czechs will be offended and they will regard it as ignorance and a lack of respect towards themselves. Many older Czechs are particularly sensitive about the latter while the younger usually won't know the differences. As a rule of thumb, try using the Czech names. You should avoid using the word \"Sudeten\" or \"Sudetenland,\" especially when visiting that region, unless a Czech person will say it first.\n\n===Moravia===\nThe vast majority of Moravians will take no offence to being called Czechs, and consider themselves to be both. If you are attempting to speak Czech, beware of the complexities and slight differences between the terms ''Čechy'' (Bohemia) and ''Česko'' (Czechia). Much like a Welshman or a Scot would raise an eyebrow over his country being called England, using the term ''Čechy'' to refer to the entire Czech Republic may not be appreciated by a Moravian (or Silesians). Since there are no mainstream separatist movements in Moravia, and there is definitely no ethnic conflict, it is infinitely more likely you'll be showered with kisses and plied with alcohol for simply making an attempt to speak Czech.\n\n==Contact==\nThere are three main mobile phone operators using the '''GSM standard'''; their coverage is very good (except in some remote, mostly uninhabited areas). If you find using roaming with your own operator too expensive or you want to have a Czech phone number, you can buy an '''anonymous prepaid card''' from any of the three main operators. However, the pricing schemes are usually quite complicated and some investigation may be necessary to find the ideal solution (even with the prepaid cards, operators offer various schemes including various additional 'packages'). GPRS and EDGE is widely supported, first 3G networks are being shut in 2018 and scheduled to be completely off in 2021. 4G (LTE) support is in every bigger city (provided by O2, Vodafone and T-mobile). The fourth operator (U:fon) uses some custom standards and you have to buy special hardware from them. Also there are lots of virtual providers (Mobil.cz, Blesk Mobile, Kaktus, Tesco supermarket)\n\nThere are still some '''telephone boxes''' available, but they are gradually vanishing since the advent of mobile phones. Some still accept coins, but most of them require a special prepaid telephone card.\n\n'''Wi-Fi''' (often pronounced as ''wee-fee'') is widely available in many restaurants and most cafés, especially in larger cities. In particular, all branches of Starbucks, McDonald's, KFC, Costa Coffee offer free access. For other restaurants and cafes, you may need to ask your waiter for the password. There are also some hotspots available on the streets, and some city quarters and trams (for example in Prague) offer free Wi-Fi coverage for everyone. However such coverage is usually very slow and unreliable and you may need to create an account (using a web browser and the page it is automatically redirected to) to be able to use it. In most larger cities, there are some internet cafés available, although their numbers are dwindling with the advent of public wi-fi, tablets, and the smartphone. For any European students (Czech included) most of universities are covered with Eduroam wifi network, which has usually stable and quick access interoperable even between universities.\n\n==Cope==\n===News===\nThe Czech Republic has a strong and highly-independent media scene, with a number of television channels, newspapers, and magazines catering to the masses. Unfortunately it is nearly entirely inaccessible for non-Czech speakers. However, visitors who wish to know what's happening in the country with current events and cultural happenings can stay abreast with a few useful sources.\n\n* '''[http://www.radio.cz/en Radio Praha]''' — English language arm of public radio broadcaster Český rozhlas. Offers news, interviews and commentary for national and European news, as well as listings for cultural events. Also broadcast in Spanish, French, German, and Russian.\n* '''[http://praguemonitor.com/ Prague Daily Monitor]''' — daily updated news website, translating stories, reviews, and commentary from Czech media outlets. \n* '''[http://www.expats.cz/ Expats.cz]''' — a popular website maintained by the country's expatriate community, with news, cultural events listings, and a job board.  \n \n{{isPartOf|Central_Europe}}\n{{outline}}\n{{countryguide}}\n\n[[WikiPedia:Czech Republic]]\n[[Dmoz:Europe/Czech Republic/]]\n[[World66:europe/czechrepublic]]\n\n[[ca:Txèquia]]\n[[de:Tschechien]]\n[[eo:Ĉeĥio]]\n[[es:República Checa]]\n[[fi:Tšekki]]\n[[fr:République Tchèque]]\n[[hi:चेक गणाज्य]]\n[[hu:Csehország]]\n[[it:Repubblica Ceca]]\n[[ja:チェコ]]\n[[nl:Tsjechië]]\n[[pl:Czechy]]\n[[pt:República Tcheca]]\n[[ro:Cehia]]\n[[ru:Чехия]]\n[[sv:Tjeckien]]\n[[wts:Category:Czech Republic]]"
        }
    }
}