{
    "parse": {
        "title": "East Timor",
        "pageid": 834,
        "wikitext": {
            "*": "{{pagebanner|East Timor Banner.jpg}}\n\n\n{{quickbar\n| image=Dili_beach1.jpg\n| caption=Avenida Portugal, Dili\n| location=East Timor in its region.svg\n| flag=Flag of East Timor.svg\n| capital=[[Dili]]\n| government=Republic\n| currency=US dollar (USD)<br>East Timor Centavo coins(U.S. coins are not used)\n| area=15,007 km<sup>2</sup>\n| population=1,066,582 (2010 Census)\n| language=[[Tetum phrasebook|Tetum]] (official), [[Portuguese phrasebook|Portuguese]] (official), [[Indonesian phrasebook|Indonesian]], English, 37 indigenous languages\n| religion=Roman Catholic 90%, Muslim 4%, Protestant 3%, Hindu 0.5%, Buddhist, Animist (1992 est.)\n| electricity=220V/50Hz (Shuko Euro plug)\n| callingcode=670\n| tld=.tl\n| timezone=UTC+9\n}}\nThe '''Democratic Republic of Timor-Leste''', commonly known as '''East Timor''' ([[Tetum]]: '''Timór Lorosa'e'''), is a country in [[Southeast Asia]]. It lies northwest of [[Australia]] in the [[Lesser Sunda Islands]] at the eastern end of the [[Indonesia]]n archipelago. Timor-Leste includes the eastern half of the island of [[Timor]], the Oecussi (Ambeno) region on the northwest portion of the island of Timor, and the small islands of [[Atauro]] and [[Jaco (island)|Jaco]].\n\n\n==Understand==\n\nThe eastern half of the island of Timor, '''East Timor''', is a former [[Portugal|Portuguese]] colony that declared itself independent from Portugal on 28 November 1975. Nine days later, [[Indonesia]]n forces invaded and occupied the former colony, with the tacit approval of the [[United States]] and [[Australia]]. By July 1976 the colony had been annexed as the province of '''Timor Timur'''.\n\nOver the next two decades, Indonesia integrated the colony, with many significant positions of authority being occupied by Indonesians rather than the East Timorese. An estimated 100,000 to 250,000 individuals are believed to have lost their lives during a campaign of ''pacification'' during this time. \n\nThe United Nations supervised a popular referendum on 30 August 1999, in which the people of East Timor voted for independence from Indonesia. After the results were announced, gangs of independence opponents, supported by the Indonesian military, terrorised the population in a civil war that destroyed much of the country's infrastructure. A United Nations peacekeeping force led by [[Australia]]n forces was sent in to re-establish a civil society and reconstruct the nation.\n\nOn 20 May 2002, Timo-Leste was internationally recognized as an independent state under the official name of the '''Democratic Republic of Timor-Leste'''.\n\nUN peacekeeping forces remained and a large number of Non-Government Organizations (NGOs) began operating.\n\nIn 2012, UN troops were officially withdrawn and east Timorese police and army took over any military installations. Although there are still NGOs working within the country,  their numbers have been steadily declining over 2012.\n\n===Climate===\n\nTimor-Leste has a hot and humid climate (tropical). November to May is the wet season with the temperatures averaging 30ºC the year round, with temperatures far cooler in higher altitude areas. \n\nThe dry season lasts for about 6 months during June to October. \n\nThe wet season can damage the roads in East Timor, making travel difficult to remote district areas during this time.\n\n==Cities==\n\n[[Image:East Timor map.png|thumb|450px]]\n\n* [[Dili]]\n<!-- capital top, alphabetise the rest -->\n* [[Ainaro]]\n* [[Aileu]]\n* [[Balibo]]\n* [[Baucau]]\n* [[Ermera]]\n* [[Gleno]]\n* [[Liquica]]\n* [[Lospalos]]\n* [[Maliana]]\n* [[Manatuto]]\n* [[Maubisse]]\n* [[Suai]]\n* [[Tutuala]]\n* [[Viqueque]]\n\n==Get in== \n\n===Visas===\n'''Visa free'''  Nationals of all [[European Union]] countries may enter Timor-Leste visa-free for up to 90 days in a 180-day period when travelling for tourism purposes. Indonesian nationals may apply on arrival at any border post, including land border crossings as well as Dili International airport and Dili Sea Port.\n\n'''Visa on Arrival'''  All other nationals may obtain a visa on arrival, provided that they arrive through the Dili Airport or Dili Sea Port. A single entry visa valid for up to 30 days is granted for a fee of US$30. Transit visas are available for stays of less than 3 days for a fee of US$20. There is no transit without a visa option in Timor-Leste. Visitors are advised to hold cash in US Dollars upon arrival. There are ATM and credit card facilities inside the airport or at border posts.  Note however that '''\"visa on arrival\" is not available at the land border''', except for nationals of [[Indonesia]]. Those intending to pass through the land border must apply in advance for a Visa Application Authorization, which is then presented to an immigration official at the border. If other conditions are met, a single or multiple entry visa valid for up to 90 days is granted for a fee of US$30. European Union countries that are part of Schengen no longer require a Visa Application Authorisation letter can simply pass through the land border [http://data.consilium.europa.eu/doc/document/ST-7125-2015-INIT/en/pdf EU- Timor-Leste Agreement]\n\n'''General conditions''' Aside from holding a passport valid for not less than 6 months from the date of entry, all travellers also should meet these conditions to be allowed entry to East Timor. \n\n* Demonstrate intention of a genuine visit (as tourist or business trip).\n* Provide evidence of accommodation arrangements and a return or onward ticket.\n* Provide evidence of sufficient funds: **US$150 per day for tourist or business visas. **US$100 plus US$50 per day for transit visas.\n\nHowever if you are holding a passport from a wealthy country, and look presentable, the immigration officials will not ask for any of this, and will simply take your $30 and pass you a visa sticker. You then queue up at passport control, who will put the sticker in your passport.\n\n'''Visa extensions'''  Extension after arrival is possible – at a cost of US$35 for each extension of 30 days, or US$75 for extension of 60 days. Extension of a tourist visa beyond 30 days requires a sponsor, East Timorese citizen or work-permit holder, to complete a Termo de Responsabilidade, guaranteeing your conduct and compliance with East Timorese laws for the duration of your stay. Many choose to avoid this hassle and fly round-trip to Bali to get a new visa-on-arrival.\n\nApart from Tourist & Business Visas, other visas that are available include the Transit Visa, Work Visa, Study Visa, Cultural, Scientific, Sport & Media Visa and Residence Visa. \n\nCheck out the '''Immigration Department of East Timor''' [http://migracao.gov.tl/], and specifically the link to the Tourist Visa [http://migracao.gov.tl/?page_id=32] for details on visa requirements, and for details on how to apply for a \"visa application authorisation\" (which may be obtained via email before you travel), or how to apply for a visa at an Embassy or Consulate should you want to enter at a land border crossing.\n\n===By plane ===  \n\n''Presidente Nicolau Lobato International Airport''' ({{IATA|DIL}} {{ICAO|WPDL}}), formerly known as '''Comoro Airport''', is the main international airport of [[Dili]]. \n\nMajor international airlines that serve Dili directly include:\n* '''Airnorth''' [http://www.airnorth.com.au/] from [[Darwin]], Australia\n* '''Air Timor''' [http://www.air-timor.com/] from Singapore. Chartered '''Silkair''' [http://www.silkair.com/] flights. \n* '''Sriwijaya Air and its sister company NAM Air''' [http://www.sriwijayaair.co.id/] from [[Bali]] (Denpasar), Indonesia.\n* '''Citilink''' [http://www.citilink.co.id] from from [[Bali]] (Denpasar), Indonesia.\n\nIt is cheaper to book separate tickets from your origin to Bali / Singapore / Darwin and then purchase separate tickets to/ from Dili, rather than book a through ticket (which may show up as Hahn Air or similar on booking websites). Return tickets are usually the same price as two singles, so don't feel you need to book a return flight. For the Indonesian airlines you can try Nusatrip or Tiket.com to ease the booking process (there is less chance of your credit card being declined using these services). For tickets originating in Dili, it can be a little cheaper to buy from one of the many travel agents in Dili, paying in USD, than to book on the internet. You will also be helping Timor's small businesses this way. \n\nWhilst you can check baggage through Singapore to a connecting flight, you will need to collect and re-check baggage through Bali or Darwin, unless perhaps if you are connecting with the same airline to another destination in Indonesia / Austrailia.\n\nCurrently International flight details in and out of Dili are as follows:\n\n* '''Airnorth''' - 6 flights per week. Flight Time - approx 1 hour in Embraer 170 Jet, at the following times:\n\nMorning Services (Mon,Wed,Thu,Fri,Sat): Depart Darwin 0630, arrive in Dili 0715. Depart Dili 0800, arrive Darwin 0945. \nAfternoon Service (Mon): Depart Darwin 1500, arrive in Dili 1615. Depart Dili 1700, arrive Darwin 1845.\n\n* '''Air Timor''' from [[Singapore]]. Three times a week full service chartered '''SilkAir''' flights every Tue, Thur and Sat as follows:\n\nDepart Singapore 0920, Arrive Dili 1400. Depart Dili 1515, Arrive Singapore 1800.\n\n* '''Sriwijaya Air and its sister company NAM Air''' from [[Bali]] (Denpasar), Indonesia. Both airlines have one Daily return flights from Bali.\n\n===By land === \n[[Image:Timor-indo border.jpg|thumb|250px|right|Timor-Leste border post]]\n\nThe main land border crossing with Indonesia is at [[Mota'ain]] (or Motain), 115km west of Dili. The nearest Timor-Leste town is [[Batugade]], 3km to 4km away. The nearest Indonesian town of consequence is the West Timorese town of [[Atambua]]. There are also land border crossings at Salele (near Suai) on the south coast, and into Oecussi at Bobometo (north of Kefamenanu on the Indonesian side) and Wini on the north-east coast of Oecussi. \n\nVisa on arrival is not available at the land border for most visitors apart from Indonesian and Citizens of Schengen countries. See the Immigration Department's Tourist Visa link  [http://migracao.gov.tl/?page_id=32] for details on how to apply for a \"visa application authorisation\" (which may be obtained via email before travel) or how to apply for a visa at an Embassy or Consulate should you want to enter at a land border crossing.  If you have a valid Timor-Leste work permit / exemption certificate you can enter Timor Leste freely at the land border.\n\nThere is an Timor-Leste Consulate in both Bali and Kupang where you should be able to purchase visas. \n\n*'''Consulate General Denpasar''', ☎ +62 8133 855 8950, Mr. Manuel Serrano, Consul General, ☎ +62 812 831 9741, (''[[mailto:manser_tl@yahoo.com manser_tl@yahoo.com]]''), Mr. Paulo Ximenes, Second Secretary  \n \n*'''Consulate Kupang''', Office Address: Jl. Eltari II,  Kupang, NTT, Indonesia, ☎+ 62 8133 9367 558, +62 8133 9137 755, Mr. Caetano Guterres, Consul General, (''[[mailto:caetanoguterres@hotmail.com caetanoguterres@hotmail.com]]'')  ☎ Mobile:+62 813 392 434 13, Mr. Manuel Matos, Staff of Consulate, ☎+62 813 539 435 34  \n\nThe same problem can exist in the other direction -- although as of 2016 the Indonesian authorities, in a bid to promote tourism, allow free visa-on-arrival at land borders, including with Timor Leste.  Rules and policies can change however, so it is best to check the current situation when you are in Timor Leste.  Getting a visa at the Indonesian Embassy in Dili is possible; it takes one week to issue a 60 day tourist visa (return flight not needed!) and it costs US$35. Travelers have reported problems doing a visa-run to Indonesia from Timor Leste (so to get a new Timor Leste tourist visa), you may need to stay overnight in Indonesia to keep the Indonesian border guards happy.\n\n===By bus===\n\n* '''Cross-border buses'''\n\nThere is a direct bus service daily between Dili and [[Kupang]] in West Timor, Indonesia. Journey takes 12 hours. There are many land travel minibus services to cater for individuals or groups travel from Dili to Kupang (West Timor) and return. Timor Travel, Paradise Travel, Leste Oeste Travel are few of the minibus companies that provide travel services to several different destinations along the Dili-Kupang route at a very affordable prices.\n\n* '''Non-direct buses'''\n\n'''From Dili''', catch a bus to the border (US$3, three hours). Once you get off the bus, go through East Timorese customs and immigration, walk across the border into Indonesia, go through Indonesian immigration and catch another bus for your onward journey to [[Atambua]] or [[Kupang]].\n\n'''From Atambua''', regular mikrolets (vans) or ojeks (motorcycle taxis) run to the border at [[Mota'ain]].\n\nCheck the current situation on getting an Indonesian visa-on-arrival for your nationality before you leave Dili for the border.  The Indonesian embassy only processes a small amount of visa applications each day, on a first-come, first-served basis.  You may need to queue at the embassy in Dili at 3am to have a chance of getting a visa.\n\n===By boat===\n\nTimor Leste is on a handful of '''cruise ship''' itineraries, [https://www.pocruises.com.au/ P&O Cruises], [https://www.hollandamerica.com/ Holland America Line], [https://www.noble-caledonia.co.uk/ Noble Caledonia] and [http://www.pgcruises.com/ Paul Gauguin Cruises] have Timor Leste on their itineraries.\n\nThere are no regular international passenger ferries servicing East Timor. \n\nThere are regular barge services from Darwin - Australia, Surabaya and Bali for vehicles and goods.\n\nRecreational vessels often stop into Dili harbour.\n\n==Get around==\n\n===By bus===\n\nBuses, mostly of the small variety found on remote Indonesian islands, run to most parts of the country and main cities like Dili, Baucau, Maliana, Los Palos and Suai are quite well linked. Indonesian-style ''bemos'' (vans) and ''mikrolets'' (minibuses) - legacies from its 24-year rule - run from these cities to nearby villages.\n\nIn Dili, you can hail a ride on a mikrolet for 25c to get around.  The mikrolets are numbered, and each number goes on a set route.  To get off, simply tap your coin on the metal handrail and the driver will stop for you. You pay the driver when you get off.\n\nMikrolets, buses and \"angunna\" (truck with open-air back for passengers) are your main means for getting from one district to another one. Most of these departures take place very early in the morning and drivers have a tendency of doing ''keliling'' (Indonesian for \"going round\") where they spend considerable time combing the streets and scouting for passengers before actually departing.\n\n'''From Dili to other Districts.'''\n\n*To travel '''westward''', take transportation from Tasi Tolu \"bus terminal\" (it's not really a terminal with a shelter but all the buses and mikrolets gather here to travel westward). e.g. of area in the West: Liquica, Bobonaro\n\n*To travel '''eastward''', take transportation from Becora bus terminal. e.g. of area in the East: Baucau, Los Palos\n\n*To travel '''southward''', take transportation from Taibessi bus terminal near the Taibessi market. e.g. of area in the South: Ermera, Maubisse  \n\nFares range from US$3 - US$10 depending on distance.\n\n===By car===\n\nTaxis are one of the best means of transport in and around Dili. There is two types of taxis in Dili. Yellow ones are typically old ones and have no meters. Fares are not very steep ($1-3) and there are lots of them! However, you do need to negotiate the price with the driver first before hopping on. There are few taxis in the evening so do expect an extra $1-$3 more on your trip, especially if it's really late and your destination is far. In night time women should not use Yellow taxis alone because of risk of harassment. \n\nSince 2016 there is also a few blue taxis. They are run by Corotrans. These taxis are newer cars and they charge by meter. In general blue ones are more safe. Blue ones are harder to find, but you can try to call them. Number is 7742 7777 / 331 1110 / 7724 1156. It helps if you talk Tetun or Bahasa Indonesia. \n\n\nYou can hire a vehicle (Saloon or 4WD) in Dili for around $85-$120 a day from Rentlo[http://www.rentlocarhire.com/] or other companies [http://www.easttimor-timorleste.com/Vehicle_Car_Boat_Rentals_East_Timor_Leste_Dili.htm]. However, do be prepared for adventure - besides the tricky roads there is the lack of road signs to contend with. It is possible that you will get so caught up with driving that you miss out the great scenery around you.\n\nWhile in Dili you will need to confine yourself to a speed limit of 40 kph. On open roads you may rev up and touch 50-60 kph. Tourists from the west might find the going slow but that is the maximum speed that can be achieved on Dili roads.\n\nEnsure that you are carrying a valid driving license or permit with you. This can be either from your country or you can have it issued in East Timor. Your license should specify the kind of vehicle you are allowed to drive. Do drive carefully and remember that there is no provision here for third-party motor insurance.\n\n===By boat===\n\nThe Oekusi (Oecussi) Enclave, Ataúru (Ataúro) Island and Dili are well connected by ferry. A boat ride to Jaku (Jaco) Island will prove to be a memorable experience. An added attraction here is that the fishermen also cook fish for you on request!\n\n===By plane===\n\nRegular domestic air services now exist to/ from Dili to Oecusse, and Dili to Suai.  There are no regular flights to Baucau. \"STAT\" (below Burger King at Dili Airport) operates these routes, it is best to check with them in person on flight schedules / costs / bookings. There is also the possibility of flying to Atauro with small MAF planes that can be chartered.\n\n===By motorcycle===\nMotorcycles/scooters are a great way to see the country: you'll be afforded the freedom of traveling wherever you want at any time, and will have a rather small responsibility in terms of a bike to park over night. Bungee cords may be purchased from Star Moto in Baucau to fasten your luggage to the bike.\n\nMotorcycles can be rented from Dili Central Backpackers for $25/day.\n\n==Talk== \n\n[[Tetum phrasebook|Tetum]] and [[Portuguese phrasebook|Portuguese]] are the official languages, but [[Indonesian phrasebook|Indonesian]] which is widely spoken, and English which is very limited, are working languages according to the constitution. There are also about 37 indigenous languages, of which Tetum, Galole, Mambae, and Kemak are spoken by significant numbers of people.\n\nA person who is proficient in Indonesian and Portuguese can get around quite easily. Don't expect to understand locals' conversations though.\n\n==See==\n\nCarnival de Timor is the annual festival held in Dili in middle of April (sometimes in May, depending on rain season). Initiated by the Ministry of Tourism [http://www.mtci-timorleste.com/en/] in 2010, Carnival de Timor is all about fun, music and multiculturalism. Both modern and traditional costumes, East Timorese and foreign minorities, even embassies also participate in this annual festival. The parade start in a landmark and end in Palacio do Governo, greeted by bands and award for best dressed group. The crowd continued to dance into the night with live music and other carnival attractions.\n\nTourists in Timor-Leste are a rare breed. Simply traveling from village to village, you're likely to hear choruses of \"malae\" (the Timor-Leste word for foreigner) and folks will want to engage you in conversation. One could spend several days just enjoying the feeling of being a very welcome stranger.\nTimor-Leste is located at the end of the Indonesian archipelago, north of Darwin, Australia and at the base of the Coral Triangle, which hosts the highest diversity of coral and reef fish species on earth.\n\nTimor-Leste offers a rich cultural heritage spun from tens of thousands of years of human habitation, the Portuguese and Indonesian colonial periods, and from the depths of a society which has cultural traditions as the fabric of that bonds society together.\n\nTimor-Leste is well positioned for community-based ecotourism, which has been written into the nation’s tourism strategic plan. The Nino Konis National Park (situated in the eastern part of the country) is a well protected area and considered as some of the last surviving zones of tropical lowland rainforest in the world with rich coastal environment. The national park accommodates bird-watching, diving, trekking and pre-historic archeological sites.\n\nAtauro Island and Jaco Island in Tutuala attract divers, snorkelers and green tourism enthusiasts. Both destinations provide eco-lodge facilities with some support from local NGOs in the region. A must-see attraction is the local divers and fishermen in Atauro, who fish using only traditionally made goggles and spear guns. Atauro is also well known for its distinctive wooden sculptures and is an excellent place to buy variety handicrafts.\n\nFor more adventurous tourists, Timor-Leste offers what is simply world class trekking, which can be experienced near places such as Mount Ramelau (± 3000 above sea level), Ainaro, Mt. Matebian (Baucau) and Mt. Kablaki (in Same district), to name a few. \n\nWhile trekking Timor-Leste, you can keep busy by looking for some of the 260 species of birds on offer (the entire continent of Australia has some 650 resident species), 32 of which are endemic and 8 of which are exclusive to the island of Timor and found nowhere  else in the world.\n\nFor example, the Timor Bush Warbler was recognized as a distinct species as recently as 2001 and it is likely that the elusive montane species can be found in the hills of East Timor. The Bush Warbler is one of the many endemic birds that will be the focus for intrepid birdwatchers coming to TL.\n\nPortuguese fortresses, churches and other monuments are scattered throughout the nation. For history enthusiasts, Timor-Leste's resistance tourism which worth exploring are the Xanana Gusmao’s (current Prime Minister of Timor-Leste) hiding place, Balibo (known for the killing of 5 journalists by the Indonesian soldiers), Santa Cruz (known for a massacre in 1991), Japanese caves in Baucau and many more.\n\nCoffee had been the main export commodity for East Timor since the colonial period. To visit East Timor is to taste its coffee grown in several regions such as Ermera, Maubisse, Manufahi and Liquisa. Travel to the coffee plantations takes you through winding mountainous roads, until over 1,000m above sea level altitude, cool climate (as low as 15C), and greeted by smiling farmers who are more than willing to welcome you to their homes. Other alternative is to contact one of the organizations dealing with coffee for a field visit to their cooperative farmer member's coffee plantation. They are: CCT/NCBA, ELSAA Cafe, Timor Global, Timor Corp, Peace Winds[http://www.peace-winds.org/en/], PARC-IC[http://www.parcic.org/en/index.html] and Alter Trade Timor.\n\nTimor's coffee is now well known across the world and amongst organic coffee drinkers. It is now even sold in Starbucks Seattle as 'Arabia Timor' brand. Several organizations are promoting East Timorese coffee as Fair Trade Coffee in U.S., Japan and South Korea. One Japanese coffee expert praised about Timor's coffee as, 'one of the remaining original species in the world today.' (Horiguchi-san, 2005).\n\n\nTimor-Leste also produces various types of weaved textiles and products for export and unique souvenir. High end and expensive ''tais'' ( Timor-Leste traditional hand-weaved textile) are made from nature-produced colors, while more economical textiles use chemical dye. 13 districts in the nation produce distinct design and colors to another. Tais markets are available in Dili; however, for antique collections, one must visit the districts.\n\n==Do==\n\n===Scuba diving===\nTimor-Leste has some of the best [[scuba diving]] in the world, and this is a major draw for tourists with East Timor shore diving becoming known worldwide amongst the diving community. Pristine beaches and coral reefs stand in stark contrast to one of the poorest populations on Earth. \n\n====General Diving Information====\n\n'''Dili''' offers the diver some great close dives. Only 5 min from the center of town is Pertamina Pier. One of East Timors best dives for critters, octopus and schooling Barracudas.\n\n10 min west of Dili is Dili Rock (east & west). This is one of Timor's most dived sites as it acts as the main training dive site. Known for it's easy access and great conditions Dili East also offers great opportunities to see Leaf Scorpion fish, Angler fish and Ghost pipe fish.\n\nAs you head further West towards Liquica you come to such dive sites as Bubble beach (known for its amazing bubble fields and spectacular deep dive) the gravel pit and devil ray point.\n\n'''East of Dili''' divers can experience shore diving at its best. Easy access along the coast allows divers safe entry to great wall dives. Secret garden, K41, Bob's Rock and Lone Tree are some of the amazing dives that can be done within an hour of Dili. Approximately 40 min East of Dili the diving starts and continues as far as Com some 200km away.\n\nThe variety of dives along this stretch of road is endless yet K41 and shark point are among the favourites of the local divers.\n\nWithout a doubt, '''Atauro Island''' is East Timor's most pristine diving area. Around the island is a large variety of dives suitable for every level! Visibility is always excellent, and the abundancy of fish life and coral is simply overwhelming. For beginner divers, The East Coast of '''Atauro Island''' sports sheltered inner reefs and gently sloping outer reefs in which to explore some of the worlds most diverse and densely packed marine life. Intermediate divers will revel in the sandy bays and densely packed walls of the West Coast. For the more adventurous, diving opportunities include dramatic walls on the West, big pelagic encounters in the South, Deep slopes on the East, critters all around and some of the regions best drift diving.\n\nThere are 2 dive companies in Dili that specialize mainly in local and East Coast shore diving: '''Dive Timor Lorosae''' and '''Aquatica Dive Resort.''' There is 1 dive company who specialize in the above as well as dive, snorkel, and whale/dolphin watching trips to nearby '''Atauro Island''' and further afield to '''Jaco Island''': '''Compass Charters & Ocean Adventures.'''\n\nIn general all dive operators in Timor-Leste operate to a high standard. However, it pays to check the quality of rental equipment and also enquire about the qualification and experience of the guides that you will be diving with.\n\n===Detailed Dive Site Information===\n\n[[Dive Sites of Timor-Leste]] contains detailed descriptions of most popular dive sites, with links to maps and scuba resources, provided by long-time divers in the country.\n\n===Marine Life of East Timor===\n\n[http://commons.wikimedia.org/wiki/Main_Page Wikimedia Commons] has pictures of some of the stunning marine life at [http://commons.wikimedia.org/wiki/Category:Marine_animals_of_East_Timor marine animals of East Timor]\n\n==Buy==\n\nThe '''US dollar ($)''' is the legal tender in East Timor - all transactions are in dollars. Banks and ATMs can be found in [[Dili]]. East Timor issues coins denominated in centavos and are not the same size as U.S coins, although U.S. coins are widely accepted. If you are from a country or territory with the US dollar as a official currency, you will not need to worry about understanding prices and currency transferring. Also if you are from [[Bermuda]], [[Panama]], or [[Bahamas]], the official currency(ies) of the mentioned countries and territories have fixed exchange rates to the US Dollar. Meaning what price is said in East Timor will be understood with your country's/territory's official currency. Example; $150 US Dollars will equal $150 Bermudian dollars, but you will still have to exchange currencies.\n\n===What to buy===\n\n[[Image:TimoreseJewelry.jpeg|thumb|200px|right|Traditional East Timorese silver jewellery]]\n\nAromatic coffee beans and colourful hand-woven cloth called Tais are the two items that should be on your must-buy list when shopping in East Timor. All convenience stores and even some roadside stalls sell excellent coffee. Just as Scottish clans have specific patterns for their tartans, families in East Timor have Tais in specific patterns and colours.\n\nRoasted coffee beans will be a great gift item. Note, some countries have strict rules about importing any food item.\n\n'''Coffee'''\n\nTimor-Leste coffee is grown organically and tastes fabulous. Coffee was introduced in East Timor by the Portuguese. The local way of making coffee is to roast the coffee beans till they turn black and let out a great aroma. Low acidity levels ensure the excellent taste of East Timorese coffee.\n\nA few of the coffee varieties like robusta have very high levels of caffeine. A late night cuppa might keep you up for hours, which might put you in a fix, as East Timor doesn't have nightlife options outside of Dili.\n\nBe sure to buy your coffee in a traditional market rather than Dili's grocery stores, where the product will often be pre-ground and very stale.\n\n'''Tais'''\n\nTais come in different designs and colours, depending on the region they are from, and they represent a distinct family. In Dili you should visit the Tais market to buy Tais and local silver jewellery. Tais can also be bought from street vendors.\n\n'''Local Handicrafts'''\n\nThe other items that will interest you are ethnic woodcarvings, batik cloth and embroidered fabrics sporting regional patterns. The ethnic woodcarvings available here are somewhat like the ones you might get in Africa.\n\n'''Markets'''\n\nA market can be found in every main town on the island. You may not find the huge array of shops in East Timor that you are accustomed to. These markets, however, cater amply to local needs. The marketplaces give the locals a chance to meet and interact with others on a daily basis. A walk through an East Timorese market will help you learn about the local produce of the region. Tourists attract a lot of attention so be prepared to be stared at. Also expect to be overcharged as many tourists before you have paid exorbitant prices willingly.\n\n'''Dili Waterfront'''\n\nAlong the waterfront, you will find many fruit stalls. These stalls are mostly run by women and are stocked with delicious local fruits. The papayas, mangoes and bananas are really tempting; make it a point to try out any unfamiliar local variety.\n\n==Eat== \nTimor-Leste, like the Indonesians, have a staple diet of rice and spices. The East Timorese palate includes a taste for several international cuisines in addition to the traditional Timor-Leste cuisine. Portuguese, Indonesian, Chinese, Italian, Western, Japanese and Thai cuisine have made their presence felt in Timor-Leste. Significant numbers of foreigners living and working in East Timor ensure a loyal clientele for these restaurants.\n\nThe staple food in East Timor is rice. Commonly grown food crops include taro, cassava, sweet potatoes and maize. Beans, cabbage, cowpeas, onions, tomatoes and spinach are well-liked vegetables. People also rear poultry, goats and pigs. Fish forms an important part of the diet and acts as a supplement to any meal. Most traditional East Timorese recipes use a generous dose of spices. Mangoes, watermelons, papayas, bananas and coconuts are the most commonly cultivated fruits here. Carbohydrates like sago or other grains form the main dish for many a East Timorese meal.\n\n'''National specialties'''\n\nFried fish is a very popular dish, with prawns being considered a delicacy. Curries are a standard dish, with chicken curry topping the list as a favourite. Several authentic Indonesian, Japanese, Portuguese and Chinese dishes find favour with many Timor-Leste.\n\n'''National drinks'''\n\nCoffee is grown organically in Timor-Leste and the level of caffeine in this variety is very high. Those looking for something other than coffee can have beer, which is widely available in both pubs and restaurants in East Timor.\n\n'''Tipping '''  \n\nBills presented in East Timorese restaurants do not have a service charge added to them and tipping is not mandatory. If you feel like tipping, you can tip 10% as a guide.\n\n\n'''Explore the flavours of East Timorese cuisine'''\n\nRestaurants in East Timor and local food joints around this new nation offer the traditional Asian curries with their fragrant spice pastes and fried accompaniments. The East Timorese local restaurants specialise in fresh grilled fish and excellent curries, and also provide a chance to fully experience local cuisine and hospitality. Local food also lends itself to Papuan influences, so you will find yam and sweet potato on the menu when you stop at rural food stalls.\n\n==Drink==\n\nNumerous beachfront bars and nightclubs provide the nightlife in Dili. Both food and drinks are served and the bars/nightclubs are kept open till late. Some very nice inner city restaurants include Nautilaus, Diya, Ocean View Hotel and Gion Japanese Restaurant. In the Meti Aut area is the newly renovated Atlantic Bar and Grill which is arguably amongst the best service and quality in Timor. Another is the Caz Bar where kayaks can be hired late in the night and a barbeque serves fried fish and all the beach side meals such as sizzling garlic prawns, hamburgers and a large range of cold beer.\n\n\n\n==Sleep==\n<!-- Individual listings should go in their respective region/district/city/town/village articles -->\n\n[[Dili]] has a wide range of hotels at every price level.\n\nDili Central Backpackers offers the best value accommodation in the capital with a wide variety of rooms to suit all budgets. The starting rate for a room in a dorm with a fan is $10/night.\n\nOutside of Dili, hotel options are limited but can there is usually at least one in each of the more visited areas. The Island of Atauro has many hotels to chose from. There are plenty of creative options if you don't insist on luxury, and these range from guesthouses to convents to camping.\n\n==Stay safe==\n\nEast Timor continues to face sporadic internal ethnic &amp; political tension and related violence may occur. This may not be targeted at foreigners or tourists, but follow the guidelines below. During periods where this is not an issue, remember you are travelling in a very poor country, and crimes such as assault and theft do occur: There is still a considerable international presence in East Timor, including a United Nations mission and international police and military (mostly conducting capacity building and training for national security forces). \n\nThe Canadian Foreign Affairs department warned on June 22, 2010: \"Violence or demonstrations may affect transportation routes and land border crossings as well as flights in and out of Dili’s airport. Disturbances have occurred in the vicinity of Dili’s Comoro airport, areas surrounding internally displaced persons camps, and at food storage warehouses. There has been continuing gang-related violence, arson, robbery, and vandalism. Gangs in Dili have attacked cars with stones and darts fired from slingshots, particularly during the early evening and at night. Local taxis should not be used. Travellers should avoid armed irregular groups, including martial arts groups that may be resident throughout the country. Travellers are advised to avoid unnecessary local travel and exercise extreme caution.\"\n\nForeigners or tourists have been the target for violence in Timor-Leste, travelers should be responsible and adhere to standard precautions as in any developing country. Remember you are traveling in a poor country, and crimes such as assault and theft do occur. The key to avoid such crime is to apply common sense and reduce your exposure to possible opportunity crime such as: \n\n* Avoid large gatherings (demonstrations have had the potential to escalate with little or no warning in the past).\n* Remove any visible valuables from your car if leaving it unattended.\n* Women should avoid traveling alone in taxis at night.\n* Women should avoid walking alone at night in quiet streets. \n\n===Timor-Leste Travel advisories===\n\n* Bangladeshi Goverment Travel Advisory [http://www.tourismboard.gov.bd/][www.sktradelinks.com][http://www.tourismboard.gov.bd/]\n* Australian Government Travel Advisory [http://www.smarttraveller.gov.au/zw-cgi/view/Advice/East_Timor]\n* Canadian Government Travel Advice [http://www.voyage.gc.ca/countries_pays/report_rapport-eng.asp?id=344000]\n* US Consular Information on Timor Leste [http://travel.state.gov/travel/cis_pa_tw/cis/cis_1105.html]\n* UK Government Travel Advice [http://www.fco.gov.uk/en/travelling-and-living-overseas/travel-advice-by-country/asia-oceania/east-timor]\n* Finnish Foreing Ministry Tracel advice (in Finnish) [http://www.formin.finland.fi/public/default.aspx?contentid=341102&nodeid=15735&contentlan=1&culture=fi-FI]\n\n==Stay healthy==\n\n'''Hospitals and Doctors'''\n\nThere are hospitals in main centers, and clinics in many sub-districts elsewhere but medical care is not up to dealing with sustained or complex medical emergencies. Medical evacuation is often the only option in the case of complex surgery, trauma, or major illness. Travellers are strongly advised not to enter East Timor without some form of medical insurance which will cover medivac by air ambulance, be this travellers insurance from your travel agent or an employer if you are entering for professional reasons. \n\n'''Dili''' - Dili National Hospital, located in Bidau Santana.\n\n'''Pante Makassar, Oecussi''' - located in town near the port\n\n==Respect==\n\nTimor-Leste was devastated by the Indonesian occupation that may have killed up to 200,000 East Timorese (or 1/5th of the population). Many East Timorese were forced to abandon their traditional animist beliefs for Roman Catholicism to integrate as part of Indonesia, as Indonesia does not recognize traditional beliefs. Remember this sad fact when dealing with the East Timorese as the occupation will probably not be a distant memory for those who hold it. Speaking well of Suharto's Orde Baru or of the idea of East Timor becoming part of Indonesia may not be well received by the Timor-Leste people. Many East Timorese are sympathetic or even outright nostalgic about the period of Portuguese rule over Timor-Leste, where they were generally left to their own devices by the Portuguese colonial government. As with discussing politics abroad in all places, if you aren't sure a discussion about sensitive topics will go over well, don't bring it up.\n\n==Learn== \n\n==Work==\nThere may be possibility of work related to agriculture. A good starting point may be to find and contact NGOs working in the country.\n\n==Contact== \n\n===By phone===\nTimor Telecom [http://www.timortelecom.tl/] had a monopoly on landline phone services in East Timor. With mobile phones there is three operators: Timor Telecom, Telemor and Telkomcel. All mobile operators offers packets where phone calls to same operator are cheap or even free. For example Timor Telecom gives you 300 MB internet, unlimited phone calls and SMS to another Timor Telecom numbers for $1 USD per day (October 2017). You activate packets by SMS or by USSD codes. Phone calls between operators are relatively expensive.  \n\nIt is recommended that you buy a local prepaid sim card for US$1 on arrival from any Timor-Telecom store (there is one in Timor Plaza [http://www.timorplaza.com/] on way into town from the airport).  Local prepaid SIM cards can also be purchased from street peddlers but sometimes at a higher price. Once the prepaid sim card is activated, you can top up the credit by purchasing \"Pulsa\" top-up strips from street peddlers. Please remember that whilst international phones work in Timor-Leste, the global roaming fees are very hefty, hence the recommendation to purchase a cheap phone package, even for a short visit.\t\n\nOn 31st July 2012 the National Numbering Plan (NNP) was changed and all mobile phone numbers now require an additional '7' be added to the front of the number making a total of eight digits. Land lines remain unchanged. \n\n====Emergency Contact Numbers====\n\nEmergency (Police Emergency): ☎ 112 or 7723 0635\nSOS Emergency Medivac: ☎  +61 2 93722468\nDili National Hospital: ☎  3311008\nBombeiros Fire Rescue: ☎  3312210 ext 203 / 3324019\nTimor Ambulance:☎  7723 6662, 3311044\nDili National Ambulance, Emergency: ☎ 3310541\n\n===By internet===\n\nInternet in Timor-Leste is changing rapidly. Internet used to be extremely expensive and some services - such as VoIP phone calls - was blocked by operator. Since new operators - Telkomcel and Telemor - entered to the market prices have come to reasonable levels. You can get 1 GB internet package for $5 USD or unlimited internet usage for 24 hours for $1 USD. Typically unlimited packages are very slow and unusable for VoIP or video streaming. First 4G networks are build in 2017 in Dili. \n\n\nInternet cafes are available throughout Dili, Baucau, and some other smaller cities: look for Timor Telecom outlets.\n\n==Get out==\n\n{{isPartOf|Southeast Asia}}\n{{outline}}\n{{countryguide}}\n\n[[de:Osttimor]]\n[[eo:Orienta Timoro]]\n[[es:Timor Leste]]\n[[fi:Itä-Timor]]\n[[fr:Timor Leste]]\n[[hu:Kelet-Timor]]\n[[it:Timor Est]]\n[[ja:東ティモール]]\n[[nl:Oost-Timor]]\n[[pl:Timor Wschodni]]\n[[pt:Timor Leste]]\n[[ro:Timorul de Est]]\n[[ru:Восточный Тимор]]\n[[sv:Östtimor]]\n[[wts:Category:East Timor]]\n\n[[WikiPedia:East Timor]]\n[[Dmoz:Asia/East Timor/]]\n[[World66:asia/southeastasia/easttimor]]"
        }
    }
}