{
    "parse": {
        "title": "Finland",
        "pageid": 379,
        "wikitext": {
            "*": "{{pagebanner|Finland Banner.jpg}}\n\n{{quickbar\n|image=111-1151_IMG.JPG\n|caption=a lake in Finland\n|location=Finland in its region.svg\n|flag=Flag of Finland.svg\n|capital=[[Helsinki]] (moved from [[Turku]] in 1812 and [[Vaasa]] in 1918)\n|government=republic\n|currency=euro (€)\n|area=337,030km²\n|population=5,427,000 (2012 est.)\n|language=[[Finnish phrasebook|Finnish]] 90.67% (official), [[Swedish phrasebook|Swedish]] 5.43% (official), small Sámi- and Russian-speaking minorities\n|religion=Evangelical Lutheran 76.4%, Finnish Orthodox 1.1%, other 1.4%, none 21.0%[http://tilastokeskus.fi/tup/suoluk/suoluk_vaesto_en.html]\n|electricity=230V/50Hz (European plug)\n|tld=.fi\n|timezone=UTC +2\n|callingcode=+358\n}}\n[http://www.visitfinland.com/ '''Finland'''] (Finnish: ''Suomi'', Swedish: ''Finland'')  is in [[Scandinavia|Northern Europe]] and has borders with [[Russia]] to the east, [[Norway]] to the north, and [[Sweden]] to the west. \n\nFinland is a thoroughly modern welfare state with well-planned and comfortable small towns and cities, but still offers vast areas of unspoiled nature. Finland has approximately 188,000 lakes (about 10% of the country) and a similar number of islands. In the northernmost part of the country the [[Northern Lights]] can be seen in the winter and midnight sun in the summer.  Finns also claim the mythical mountain of ''Korvatunturi'' as the home of Santa Claus, and a burgeoning tourist industry in Lapland caters to Santa fans. \n\nDespite living in one of the most technologically developed countries in the world, Finns love to head to their summer cottages in the warmer months to enjoy all manner of relaxing pastimes including sauna, swimming, fishing and barbecuing. Today, Finland has a distinctive language and culture that sets it apart from the rest of Nordic Europe.\n\n==Understand==\n\n===History===\n[[Image:Savonlinna heinäkuu 2002 IMG 1635.JPG|thumb|upright=1.8|Saint Olaf's Castle, the world's northernmost medieval castle, built in [[Savonlinna]] by Sweden in 1475]]\n\nNot much is known about Finland's early history, with archaeologists still debating to the present day when and where a tribe of Finno-Ugric speakers cropped up. Roman historian Tacitus mentions a tribe primitive and savage ''Fenni'' in 100AD and even the Vikings chose not to settle, trading and plundering along the coasts.\n\nIn the mid-1150s, Sweden started out to conquer and Christianise the Finnish pagans in earnest, with Birger Jarl incorporating most of the country into Sweden in 1249. Finland stayed an integral part of [[Sweden]] until the nineteenth century, although there was near-constant warfare with Russia on the eastern border and two brief occupations. After Sweden's final disastrous defeat in the Finnish War of 1808-1809, Finland became an autonomous grand duchy under [[Russia]]n rule in 1809.\n\nRussian rule alternated between tolerance and repression and there was already a significant independence movement when Russia plunged into revolutionary chaos in 1917. Parliament seized the chance and declared independence in December, quickly gaining Soviet assent, but the country promptly plunged into a brief but bitter '''civil war''' between the conservative Whites and the communist Reds, eventually won by the Whites.\n\nDuring World War II, Finland was attacked by the Soviet Union in the '''Winter War''', but fought them to a standstill that saw the USSR conquer 12% of Finnish territory.  Finland then allied with Germany in an unsuccessful attempt to repel the Soviets and regain the lost territory, was defeated and, as a condition for peace, had to turn against Germany instead. Thus Finland fought three separate wars during World War II.  In the end, Finland lost much of Karelia and Finland's second-largest city [[Vyborg]], but Soviets paid a heavy price for them with over 300,000 soldiers killed.\n\nAfter the war, Finland lay in the grey zone between the Western countries and the Soviet Union. The Finno-Soviet Pact of Friendship, Cooperation and Mutual Assistance committed Finland to resist armed attacks by \"Germany or its allies\" (read: the West), but also allowed Finland to stay neutral in the Cold War and avoid a Communist government or Warsaw Pact membership.  In politics, there was a tendency of avoiding any policies and statements that could be interpreted as anti-Soviet. This balancing act of '''Finlandization''' was humorously defined as \"the art of bowing to the East without mooning the West\". Despite close relations with the Soviet Union, Finland managed to be a democracy and remained a Western European market economy, building close ties with it's Nordic neighbours. While there were some tense moments, Finland pulled it off: in the subsequent half century, the country made a remarkable transformation from an agrarian economy to a diversified modern industrial economy featuring high-tech giants like Nokia, and per capita income is now in the top 15 countries in the world. \n\nAfter the collapse of the USSR, Finland joined the [[European Union]] on 1 January 1995, and was the only Nordic state to adopt the euro currency at its initiation on 1 January 2002.\n\n===Geography===\nUnlike craggy Norway and Sweden, Finland consists mostly of low, flat to rolling plains interspersed with lakes and low hills, with mountains (of a sort) only in the extreme north, while Finland's highest point, Fell Halti, rises only to a modest 1,328m. Finland has 187,888 lakes according to the Geological Survey of Finland, making the moniker '''Land of a Thousand Lakes''' actually an underestimation. Along the coast and in the lakes are&mdash;according to another estimate&mdash;179,584 islands, making the country an excellent boating destination as well.\n\nFinland is not located on the Scandinavian peninsula, so despite many cultural and historical links, it is technically ''not'' a part of Scandinavia. Even Finns rarely bother to make the distinction, but a more correct term that includes Finland is the \"Nordic countries\"  (''Pohjoismaat''). Still, the capital, Helsinki, has a lot of features typical of Scandinavian cities; especially when it comes to the architecture of the downtown, and another Scandinavian language, Swedish, is one of the two official languages of the country.\n\n===Climate===\n: ''See also [[Winter in Scandinavia]].''\n\nFinland has a cold but temperate climate, which is actually comparatively mild for the latitude because of the moderating influence of the Gulf Stream. Winter, however, is just as dark as everywhere in these latitudes, and temperatures can (very rarely) reach -30°C in the south and even dip below -40°C in the north. The brief Finnish summer is considerably more pleasant, with temperatures around 20-23°C on sunny days (rarely closer to 30°C), and is generally the best time of year to visit. July is the warmest month. Early spring (March-April) is when the snow starts to melt and Finns like to head north for skiing and winter sports, while the transition from fall to winter in October-December &mdash; wet and dark&mdash; is the least pleasant time to visit. The southern coast where [[Helsinki]] and [[Turku]] are located is not really a winter destination, because there is no guarantee of snow even in January or February.\n\nDue to the extreme latitude, northern parts of Finland experiences the famous '''Midnight Sun''' near the summer solstice, when (if above the Arctic Circle) the sun never sets during the night and even in southern Finland it never really gets dark. The flip side of the coin is the '''Arctic Night''' (''kaamos'') in the winter, when the sun never comes up at all in the North. In the South, daylight is limited to a few pitiful hours with the sun just barely climbing over the trees before it heads down again.\n\n=== Culture===\n[[Image:Gallen-Kallela The defence of the Sampo.jpg|thumb|upright=1.3|Väinämöinen defending the ''Sampo'', by Akseli Gallen-Kallela (1896)]]\n\nBuffeted by it's neighbours for centuries and absorbing influences from west, east and south, Finnish culture as a distinct identity was only born in the nineteenth century: \"we are not Swedes, and we do not wish to become Russian, so let us be Finns.\"\n\nThe Finnish founding myth and national epic is the '''''Kalevala''''', a collection of old Karelian stories and poems collated in 1835 that recounts the creation of the world and the adventures of '''Väinämöinen''', a shamanistic hero with magical powers.  Kalevalan themes such as the '''Sampo''', a mythical cornucopia, have been a major inspiration for Finnish artists, and figures, scenes, and concepts from the epic continue to colour their works.\n\nWhile one of the essential preconditions for having full civil rights in the land of Finland used to be a membership in the Evangelical Lutheran Church (in which most Catholic traditions have been preserved, doctrines are pronouncedly Christocentric and still formally based on the Book of Concord only), Finland's constitution has guaranteed full freedom of religion since 1923. Today, the everyday observance of the great majority is lax at best or virtually non-existent (even among some of the ministry) and the membership of the Lutheran church has been in a sharp decline since the 1960s. Consequently, tourists and visitors do wisely by exercising a certain tact and being conscious of the fact that topics concerning religious practice and personal faith are considered a strictly private matter by most Finns. There is every likelihood that faith-related questions are found either intrusive or baffling in most cases. Politics and religion are differentiated in the Finnish debate to the extent that any participant is expected not to highlight their personal beliefs.\n\nFinns share most virtues and downsides of their Scandinavian neighbours. These include uncompromising '''work ethic''' and an inclusive notion of '''equality'''. It became the second country in the world to give women the right to vote in 1906, after New Zealand; that granted universal suffrage in 1893. (Note: this is a common misconception. Finland was the first country to grant women full eligibility to the Parliament in 1907, Norway in 1917 and New Zealand as late as 1919.)\n\nLikewise, Finland is regularly top-ranked in the list of the least corrupted countries of Transparency International. By courtesy of its internationally vaunted tuitionless education system as well as comprehensive public health care and welfare system, Finland has acquired a worldwide reputation for one of the most advanced countries in the world. Meanwhile, the country is plagued by similar problems peculiar to Nordic welfare states that include the homogeneity of the ageing population and comparatively high rates of alcoholism, depression, social exclusion and suicide. However, the distinctive character of the Finns is often summed up with the word '''''sisu''''', a mixture of admirable perseverance and pig-headed stubbornness in the face of adversity.\n\nThe foundation of the Finnish music culture and music education has been built mainly on the life work of a classical composer '''Jean Sibelius''' whose symphonies are regularly played by the most esteemed symphony orchestras of the world and whose name is borne by Sibelius Academy, Finland's top music institution. Composers of the modern classical music ('''Kaija Saariaho''', '''Magnus Lindberg''', '''Esa-Pekka Salonen''' etc.) and the Finnish electronic music ('''Pan Sonic''', '''Darude''', '''Rinneradio''', '''Jimi Tenor''', '''Jori Hulkkonen''' etc.) are held in great reverence among experts and enthusiasts. Additionally, some Finnish mainstream heavy metal and pop ('''Children of Bodom''', '''Nightwish''', '''HIM''', '''The Rasmus''', '''Bomfunk MCs''') have garnered global acclaim. Conspicuous metal band '''Lordi''' known for it's latex monster outfit became an international sensation overnight by winning the Eurovision Song Contest in Athens in  2006. \n\nIn the other arts, Finland has produced noted architect and designer '''Alvar Aalto''', authors '''Mika Waltari''' (''The Egyptian''), '''Väinö Linna''' (''The Unknown Soldier'') and Tove Jansson (''The Moomins'') and painter '''Akseli Gallen-Kallela''', known for his ''Kalevala'' illustrations.\n\n=== Bilingualism ===\n<div style=\"float:right; margin-left:15px; margin-right:15px; text-align:center\">\n{| border=\"1\" cellpadding=\"5\" cellspacing=\"0\"\n|+ '''Street reference chart'''\n|-\n! Finnish !! Swedish !! English\n|-\n| ''-katu'' || ''-gata'' || street\n|-\n| ''-tie'' || ''-väg'' || road\n|-\n| ''-kuja'' || ''-gränd'' || alley\n|-\n| ''-väylä'' || ''-led'' || passage\n|-\n| ''-polku'' || ''-stig'' || path\n|-\n| ''-tori'' || ''-torg'' || market\n|-\n| ''-kaari'' || ''-båg'' || arc\n|-\n| ''-puisto'' || ''-park'' || park\n|-\n| ''-laituri'' || ''-kaj'' || quay\n|- \n| ''-rinne'' || ''-brink'' || bank (hill)\n|- \n| ''-aukio'' || ''-plats'' || square\n|}\n</div>\n\nFinland has a Swedish-speaking minority and is officially a bilingual country, so maps nearly always bear both Finnish and Swedish names for cities and towns. For example, [[Turku]] and ''Åbo'' are the same city, even though the names are both completely different. Roads can be especially confusing: what first appears on a map to be a road that changes its name is, in most cases, one road with two names. This is common in the Swedish-speaking areas on the southern and western coasts, whereas inland Swedish names are far less common. In anywhere outside bilingual areas and the far north [[Finnish Lapland|Lapland]] of Finland you'll never see Swedish, and a bilingual sign is extremely rare; you will, occasionally, see signage in Sámi instead. Google Maps, in particular, seems to select the language randomly, even though the Swedish names are extremely rarely used in practice in most places.\n\n===Holidays===\nFinns aren't typically very hot on big public carnivals; most holidays are spent at home with family. The most notable exception is ''Vappu'' on 1 May, as thousands of people (mostly the young ones) fill the streets. Important holidays and similar happenings include:\n\n* '''New Year's Day''' (''Uudenvuodenpäivä''), 1 January.\n* '''Epiphany''' (''Loppiainen''), 6 January.\n* '''Easter''' (''Pääsiäinen''), variable dates, Good Friday and Easter Monday are public holidays. Tied to this are ''laskiainen'' 40 days before Easter, nominally a holy day that kicks off Lent, practically a time for children and university students to go sliding down snowy slopes, and '''Ascension Day''' (''helatorstai'') 40 days after, just another day for the shops to be closed.\n* '''Walpurgis Night''' or more often '''Vappu''', 1 May, although festivities start the day before (''Vappuaatto''). A spring festival that coincides with '''May Day'''. Originally a pagan tradition that coincides with the more recent workers' celebration, it has become a giant festival for students, who wear colourful signature overalls and roam the streets. Many people also use their white student caps between 18:00 on 30 April and the end of 1 May. The following day, people gather to nurse their hangovers at open-air picnics, even if it's raining sleet.\n* '''Midsummer Festival''' (''Juhannus''), the Saturday in the period 20-26 June.  Held to celebrate the summer solstice, with plenty of bonfires, drinking and general merrymaking. Cities become almost empty as people rush to their summer cottages. It might be a good idea to visit one of the bigger cities just for the eerie feeling of an empty city.\n* '''Independence Day''' (''Itsenäisyyspäivä''), 6 December.  A fairly sombre celebration of Finland's independence from Russia. The President holds a ball for the important people (e.g. MPs, diplomats, and merited Finnish sportspeople and artists).\n* '''Little Christmas''' (''Pikkujoulu''), people go pub crawling with their workmates throughout December.  Not an official holiday, just a Viking-strength version of an office Christmas party.\n* '''Christmas''' (''Joulu''), 24-26 December. The biggest holiday of the year, when pretty much everything closes for three days. Santa (''Joulupukki'') comes on Christmas Eve on 24 December, ham is eaten and everyone goes to sauna.\n* '''New Year's Eve''' (''Uudenvuodenaatto''), 31 December. Fireworks time!\n\nTypical holiday time is in July, unlike elsewhere in Europe, where it is in August. People generally start their summer holidays around Midsummer. During these days, cities are likely to be less busy, as Finns head for their summer cottages. Schoolchildren start their summer holidays at the beginning of June.\n\n==Regions==\n{{Regionlist|\nregionmap=Finland regions.png |\nregionmapsize=400px |\nregionmaptext=Regions of Finland | \n\nregion1name=[[Southern Finland]] |\nregion1color=#d09440 |\nregion1items= |\nregion1description=The southern stretch of coastline up to the Russian border, including the capital [[Helsinki]] and the historical province of Uusimaa (''Nyland'')|\n\nregion2name=[[Western Finland]]  |\nregion2color=#578e86  |\nregion2items= |\nregion2description=The Southwest coastal areas, the old capital [[Turku]], the historical province of [[Central Finland]] with its capital [[Jyväskylä]], inland hub city [[Tampere]], the southern parts of the historical province of Ostrobothnia (''Pohjanmaa'', ''Österbotten'') and [[Seinäjoki]], the fastest growing city of Finland |\n\nregion3name=[[Eastern Finland]] |\nregion3color=#71b37b |\nregion3items= |\nregion3description=Forests and lakes by the Russian border, including Savonia (''Savo'') and the Finnish side of Karelia (''Karjala'')|\n\nregion4name=[[Oulu (province)|Oulu]]  |\nregion4color=#8a84a3  |\nregion4items= Northern Finland | \nregion4description=Kajanaland (''Kainuu'') and northern Ostrobothnia, named after the technology city of [[Oulu]].  |\n\nregion5name=[[Finnish Lapland]]  |\nregion5color=#69999f |\nregion5items= |\nregion5description=Tundra, reindeer and the biggest skiing resorts above the Arctic Circle. |\n\nregion6name=[[Åland]]  |\nregion6color=#b383b3  |\nregion6items= |\nregion6description=an autonomous and monolingually [[Swedish phrasebook|Swedish]] group of islands off the southwestern coast of Finland |\n}}\n\n<!-- don't repeat the regions already mentioned above -->\nWhile a convenient and unambiguous bureaucratic division, the provinces &mdash; now formally known as Regional State Administrative Agencies &mdash; do not really correspond to geographical or cultural boundaries very well.  Other terms you may hear include '''Tavastia''' (''Häme''), covering a large area of central Finland around Tampere, and '''Karelia''' (''Karjala'') to the far east, the bulk of which was lost to the Soviet Union in World War II (still a sore topic in some circles).  In 2010, Western Finland was formally split into \"Western and Inner Finland\" (for [[Tampere]] and the coast near [[Vaasa]]) and \"Southwest Finland\" (the area near [[Turku]]).\n\n==Cities and towns==\n<!-- This is only intended to be a representative sample of NINE cities; please list other cities on the appropriate region pages -->\n*[[Helsinki]] &mdash; the \"Daughter of the Baltic\", Finland's capital and its only real city\n*[[Hämeenlinna]] &mdash; a small lakeside town with a medieval castle and Aulanko park\n*[[Jyväskylä]] &mdash; a university town located in Central Finland\n*[[Kuopio]] &mdash; a university town in central Finland, lakeland area.\n*[[Lappeenranta]] &mdash; a university town near the Russian border in South East Finland, by lake [[Saimaa]].\n*[[Oulu]] &mdash; a technology town at the end of the Gulf of Bothnia\n*[[Rovaniemi]] &mdash; gateway to [[Finnish Lapland|Lapland]]\n*[[Savonlinna]] &mdash; a small lakeside town with a big castle and a popular opera festival.\n*[[Seinäjoki]] &mdash; Finland's fastest growing small town, host of many important festivals every year.\n*[[Tampere]] &mdash; the largest industrial town in Finland, home of culture, music, art and museums, in the middle of other big cities in Southern Finland. Perhaps the best music scene in Finland.\n*[[Turku]] &mdash; the former capital on the western coast. Medieval castle and cathedral.\n*[[Vaasa]] &mdash; a town with strong Swedish influences on the west coast located near the UNESCO world natural site [[Kvarken Archipelago]]\n<!-- only 7 to 9 of the biggest and most important for the traveller, please -->\n\n==Other destinations==\n* [[Kauhava]] ; Finland's biggest amusement park\n* [[Lappajärvi]] ; Unique crater lake\n* [[Levi]] - The most popular ski resort in Finland\n* [[Hyvinkää]] - Home of the Finnish Railway Museum\n* [[Nuuksio National Park]]\n* [[Pallas-Yllästunturi National Park]]\n* [[Riisitunturi National Park]]\n* [[Saariselkä]]\n* [[Salamajärvi National Park]]\n* [[Ylläs]]\n\n==Get in==\n{{Schengen}}\n\n===By plane===\nFinland's main international hub is '''Helsinki-Vantaa Airport''' near [[Helsinki]]. [http://www.finnair.com/ Finnair], and [http://fi-en.flybe.com/ Flybe Nordic] are based there.  Around 30 foreign airlines fly to Helsinki-Vantaa.\n\n[[Ryanair]]'s Finland hubs are [[Tampere]] in central Finland and [[Lappeenranta]] in the east near the Russian border, while Wizz Air is decreasing its hub at [[Turku]] in the southwest.  Other airlines have limited regional services to other cities, mostly just to Sweden, and, in the winter high season, occasional direct charters (especially in December) and seasonal scheduled flights (Dec-Mar) to [[Finnish Lapland|Lapland]]. \n\n[http://www.airbaltic.com/public/index.html Air Baltic] connects many provincial Finnish towns conveniently to Europe via [[Riga]]. It may also be worth your while to get a cheap flight to [[Tallinn]] and follow the boat instructions below to get to Finland.\n\nStarting in early 2011, [http://www.norwegian.com/en/ Norwegian Air Shuttle] established Helsinki as one of its bases, and now offers both domestic and international flights.\n\n===By train===\n'''VR''' [http://www.vr.fi] and Russian Railways jointly operate services between [[Saint Petersburg]] and Helsinki, stopping at [[Vyborg]], [[Kouvola]] and [[Lahti]] along the way.  The line was upgraded in 2010 and the slick new ''Allegro''-branded trains glide between the two cities in three and a half hours at up to 220km/h.  Currently the route is served four times per day, returning to two daily from November 2011. This is certainly the most expensive method of getting to Helsinki from Saint Petersburg, with prices of €92 during summer and €84 rest of the year for a one-way ticket. However, tickets for the first train in the morning, which departures at 6:12 am, can be bought for a price as low as €39 in the summer months. There is also a traditional slow overnight sleeper from [[Moscow]], which takes around 15 hours.\n\nThere are no direct trains between [[Sweden]] or [[Norway]] and Finland (the rail gauge is different), but the bus over the gap from [[Boden]]/[[Luleå]] (Sweden) to [[Kemi]] (Finland) is free with an [[Eurail]]/[[Inter Rail]] pass, and you can also get a 50% discount from most ferries with these passes.\n\n===By bus===\nBuses are the cheapest but also the slowest and least comfortable way of travelling between Russia and Finland.\n\n* Regular scheduled buses run between [[St. Petersburg]], [[Vyborg]] and major southern Finnish towns like [[Helsinki]], [[Lappeenranta]], [[Jyväskylä]] and all the way west to [[Turku]], check [http://www.matkahuolto.fi/ Matkahuolto] for schedules.  Helsinki-St. Petersburg is served three times daily, costs €38 and takes 9 hours during the day, 8 hours at night.\n\n* Various direct '''minibuses''' run between St. Petersburg's Oktyabrskaya Hotel (opp Moskovsky train station) and Helsinki's Tennispalatsi (Eteläinen Rautatiekatu 8, one block away from Kamppi). At €15 one-way, this is the cheapest option, but the minibuses leave only when full.  Departures from Helsinki are most frequent in the morning (around 10:00), while departures from St. Petersburg usually overnight (around 22:00).\n\nYou can also use a bus from Sweden or Norway to Finland.\n\n* [[Haparanda]] in Norrbotnia area of Sweden has bus connections to [[Tornio]], [[Kemi]] and [[Oulu]]. See more from [http://www.matkahuolto.fi Matkahuolto].\n* Eskelisen Lapinlinjat offers bus connections from northern parts of Norway, for example [[Tromsø]]. See more from [http://www.eskelisen-lapinlinjat.com Eskelisen Lapinlinjat].\n\n===By boat===\n[[Image:Silja interior 297435026 fd7bbe7c5a o.jpg|thumb|Inside a Silja passenger ferry]]\n\nOne of the best ways to travel to and from Finland is by sea.  The boats to [[Estonia]] and [[Sweden]], in particular, are giant, multi-story floating palaces and department stores, with cheap prices subsidized by sales of tax-free booze: a return trip to Tallinn including a cabin for up to four people can go as low as €50.  If travelling by [[Inter Rail]], you can get 50% off deck fares.  The best way to arrive in Helsinki is standing on the outside deck with a view ahead.\n\n====Estonia and the Baltic states====\n[[Helsinki]] and [[Tallinn]] are only 80km apart. [http://www.vikingline.fi/ Viking line], [http://www.eckeroline.fi/en/ Eckerö line] and [http://www.tallinksilja.com/ Tallink Silja] operate full-service car ferries all year round. Depending on the ferry type travel times are from slightly over two hours (Viking Line and Tallink Silja's Star, Superstar and Superfasts) to three and a half hours (Eckerö and Tallink Silja's biggest cruise ships). Some services travel overnight and park outside the harbor until morning. [http://www.lindaliini.ee/ Linda Line] offers fast services that complete the trip in 1.5 hours, but charge quite a bit more, have comparatively little to entertain you on board and suspend services in bad weather and during the winter. If the weather is looking dodgy and you're prone to sea sickness, it's best to opt for the big slow boats.\n\nThere is an additional ferry connection between [[Hanko]] and [[Paldiski]], operated by [http://navirail.com NaviRail].\n\nThere are no scheduled services to [[Latvia]] or [[Lithuania]], but some of the operators above offer semi-regular cruises in the summer, with [[Riga]] being the most popular destination.\n\n====Germany====\nFinnlines [http://www.finnlines.com/ferry-trips/routes_fares] operates from [[Helsinki]] to [[Travemünde]] (near [[Lübeck]] and [[Hamburg]]) and from Helsinki to [[Rostock]]. Helsinki-Travemünde trip takes about 27 hours while Helsinki-Rostock takes about 34 hours. The Travemünde line is run by fast and large ''Star-class'' ships while a single, significantly smaller ''Hansa-class'' ship operates in the Rostock line. The latter is considered to be more luxurious and comfortable even though the trip takes much longer.\n\n====Russia====\nFor years scheduled ferry services to Russia have been stop-and-go. Starting in April 2010 [http://www.stpeterline.com/en/ St Peter Line] offers regular ferry service from Saint Petersburg to Helsinki for as low as \n€30 one way. [http://www.kristinacruises.com/list.php?&listname=risteilyt&lang=en  Kristina Cruises] also offers occasional cruises from [[Helsinki]].\n\n====Sweden====\n[[Image:Silja_Serenade.jpg|thumb|upright=1.3|Silja Serenade leaving [[Helsinki]]]]\n\nBoth [http://www.siljaline.fi '''Silja'''] and [http://www.vikingline.fi '''Viking'''] offer overnight cruises from [[Helsinki]] and overnight as well as daytime cruises from [[Turku]] to [[Stockholm]], usually stopping in the [[Åland]] islands along the way. These are some of the largest and most luxurious passenger ferries in the world, with as many as 14 floors and a whole slew of restaurants, bars, discos, pool and spa facilities, etc. The cheaper cabin classes below the car decks are rather spartan, but the higher sea view cabins can be very nice indeed.\n\nNote that, due to crowds of rowdy youngsters aiming to get thoroughly hammered on cheap tax-free booze, both Silja and Viking do not allow '''unaccompanied youth under 23''' to cruise on Fridays or Saturdays. (The age limit is 20 on other nights, and only 18 for travellers not on same-day-return cruise packages.) In addition, Silja does not offer deck class on its overnight services, while Viking does.\n\nNote also that with Viking Line it often is cheaper to book a cruise instead of \"route traffic\". The cruise includes both ways with one day in between. If you want to stay longer you simply do not go back - it might still be cheaper than booking a one-way \"route traffic\" ticket. This accounts especially to last minute tickets (you could, e.g., get from Stockholm to Turku for around €10 overnight - \"route traffic\" would be over €30 for a cabin with lower quality).\n\nIn addition to the big two, [http://www.finnlink.fi FinnLink] offers the cheapest car ferry connection of all from [[Naantali]] to [[Kapellskär]] (from €60 for a car with driver).\n\nCar ferries usually stop for a few minutes at [[Mariehamn]] in the [[Åland Islands]], which are outside the EU tax area and thus allow the ferries to operate duty-free sales.\n\nBetween [[Vaasa]] and [[Umeå]] there is a ferry operated by [http://www.wasaline.com Wasaline].\n\n===By car===\nFinland has a comprehensive road network that connects and runs through all of the major cities.  Driving through Finland during anytime of the year is a treat with winding roads and gentle hills framed by pine and birch forests with agricultural farm lands here and there.  Summertime evening drives with the midnight sun providing gentle light are particularly scenic and enjoyable.  During summer months road repairs are in full swing so some minor delays may be experienced.  Road patrol cameras are utilized extensively to monitor traffic and enforce speed limits.\n\n====Sweden====\nAs mentioned above, one of the easiest ways to get by car from Sweden to Finland is a car ferry. The European Route E12 (Finnish national highway 3) includes a ferry line between [[Umeå]] and [[Vaasa]]. Another route that includes a car ferry is E18, from Stockholm to Turku.\n\nThere are also land border crossings up in Lapland at [[Tornio]], [[Ylitornio]], [[Pello]], [[Kolari]], [[Muonio]] and [[Kaaresuvanto]].\n\n====Norway====\nEuropean Routes E8 and E75 connect Finland and Norway.  There are border crossings at [[Kilpisjärvi]], [[Kivilompolo]], [[Karigasniemi]], [[Utsjoki]], [[Nuorgam]] and [[Näätämö]]. \n\n====Russia====\nEuropean route E18, as Russian route M10, goes from [[St. Petersburg]] via [[Vyborg]] to Vaalimaa/Torfyanovka border station near [[Hamina]]. From there, E18 continues as Finnish national highway 7 to Helsinki, and from there, along the coast as highway 1 to Turku. In Vaalimaa, trucks will have to wait in a persistent truck queue. This queue does not directly affect other vehicles. There are border control and customs checks in Vaalimaa and passports and Schengen visas if applicable will be needed.\n\nFrom south to north, other border crossings can be found at Nuijamaa/Brusnichnoye ([[Lappeenranta]]), Vaalimaa/Torfyanovka, Imatra/Svetogorsk, Niirala ([[Tohmajärvi]]), Vartius ([[Kuhmo]]) Kelloselkä ([[Salla]]) and Raja-Jooseppi ([[Sodankylä]]).  All except the first are very remote.\n\n====Estonia====\nAs mentioned above, there is a car ferry between Tallinn and Helsinki. It forms a part of European route E67 [[Via Baltica]] that runs from the Estonian capital Tallinn, crosses [[Riga]] in [[Latvia]] and [[Kaunas]] in [[Lithuania]] to the Polish capital [[Warsaw]]. The distance from Tallinn to Warsaw is about 970km, not including any detours.\n\n==Get around==\n[[Image:Suomen_rataverkko_2006_en.png|thumb|print=fullpage|The Finnish rail network (passenger lines in green)]]\n\nFinland's a large country and travelling is relatively expensive. Public transportation is well organized and the equipment is always comfortable and often new, and advance bookings are rarely necessary outside the biggest holiday periods. The domestic [http://opas.matka.fi/ Journey Planner] offers an useful website with integrated timetables for inter-city trains, local transport and airplanes, but not long-distance buses.\n\n===By plane===\nFlights are the fastest but generally also the most expensive way of getting around.  Finnair and some smaller airlines operate regional flights from Helsinki to all over the country, including [[Kuopio]], [[Pori]], [[Rovaniemi]] and [[Ivalo]]. It's worth booking in advance if possible: on the [[Helsinki]]-[[Oulu]] sector, the country's busiest, a fully flexible return economy ticket costs a whopping €251 but an advance-purchase non-changeable one-way ticket can go as low as €39, less than a train ticket. You may also be able to get discounted domestic tickets if you fly into Finland on Finnair. Another possibility is Air Baltic which also flies the sector Turku-Oulu for very competitive prices, far less than the train. Additionally, in 2011 [http://www.norwegian.com/en/ Norwegian Air Shuttle] started flying from Helsinki to Oulu and Rovaniemi.\nA shuttle bus (Finnair city bus) operates between Helsinki-Vantaa airport and Helsinki central railway station in approx. 20 minute intervals (30 min trip duration, €6.30); bus line 615 (at day)/620 (at night) is a slightly cheaper alternative (36 minute trip duration, €5 day, €7 night, 10/2015 prices). There is also train connection at the airport and it takes you in 45 minutes (access to the new train terminal will be opened late 2015 and travel time will be approx. 35 minutes. There's a free shuttle bus to nearest train station at the moment) to Helsinki central railway station. Prices are €5 day, €7 night. Check out [http://www.reittiopas.fi/en/ Helsinki Region transport journey planner] for timetables and other information. \n\nThere are three major airlines selling domestic flights:\n*[http://www.finnair.com '''Finnair'''], the national flagship airline. Serves nearly all of the country, with some flights operated by their subsidiary [http://flynorra.com/ '''Nordic Regional Airlines'''].\n*[http://norwegian.com '''Norwegian'''] flies to the cities in the north, such as Rovaniemi, Oulu, Ivalo, and Kittilä.\n\nIn addition, [http://www.baseairlines.fi/ BASe Airlines] and [http://www.air100.fi/ Air100] fill in a few gaps.\n\n===By train===\n[[Image:Pendolino Helsinki.jpg|thumb|240px|print=inline|A ''Pendolino'' train, the fastest in VR's fleet (220 km/h)]]\n\n'''VR''' [https://www.vr.fi/cs/vr/en/frontpage] (Finnish Railways) operates the fairly extensive railroad network. The train is the method of choice for travel from [[Helsinki]] to [[Tampere]], [[Turku]] and [[Lahti]], with departures at least once per hour and faster speeds than the bus. The following classes of service are available, with example prices and durations for the popular [[Helsinki]]-[[Tampere]] service in parenthesis.\n\n* '''Pendolino''' tilting trains (code '''S'''), the fastest option (&euro;9-25, 1:26)\n* '''InterCity''' ('''IC''')  express trains (&euro;9-25, 1:46)\n* Ordinary '''express''' (''pikajuna'', '''P'''), only slow night trains for this connection (&euro;9-25, 2:12-2:16)\n* '''Local''' and '''regional''' trains (''lähiliikennejuna'', ''lähijuna'' or ''taajamajuna''), no surcharge, quite slow (&euro;18, 2:03) \n\nThe trains are generally very comfortable, especially the express services.  Pendolino and IC trains have restaurant cars, family cars (IC only, with a playpen for children) and power sockets; Pendolinos and Intercity trains even offer free (though often very slow) Wi-Fi connectivity. Additional surcharges apply for travel in first class, branded \"Ekstra\" on some trains, which gets you more spacious seating, newspapers and coffee.\n\nOvernight sleepers are available for long-haul routes and very good value at &euro;11/21/43 for a bed in a three/two/one-bed compartment, but one-bed compartments are only available in first class.\n\nOne child under 4 can travel for free with each fare-paying adult, and seniors over 65 years old and students with '''Finnish''' student ID (''ISIC cards etc not accepted'') get 50% off.  Groups of 3 or more get 15% off.\n\nFinland participates in the [[Inter Rail]] and [[Eurail]] systems.  Residents of Europe can buy InterRail Finland passes offering 3-8 days of unlimited travel in one month for &euro;109-229 (adult 2nd class), while the Eurail Finland pass for non-residents is &euro;178-320 for 3-10 days.  VR's own Holiday Pass (''LomaPassi''), at &euro;145 for 3 days including up to 4 free seat reservations, is available to all but only valid in summer.  You would have to travel a lot to make any of these pay off though; by comparison, a full-fare InterCity return ticket across the entire country from Helsinki to Rovaniemi and back is &euro;162.\n\nGenerally, the trains are most crowded at the beginning and end of the weekend, and that means Friday and Sunday evening. Shortly before and at the end of major holidays like Christmas/New Year and Easter, trains are usually very busy. If you try booking for these days at a late time, you may find the seat you reserve may be among the least desirable, that is, facing backwards, without recline, and facing towards and sharing the legroom with other passengers.\n\nFinns general opinion is that VR's trains are always late, but VR is actually one of the most reliable rail company of EU.  As in the rest of the EU, you'll get a 25% refund if the train is 1-2 hours late and 50% if more.\n\n===By bus===\n'''Matkahuolto''' [http://www.matkahuolto.fi/en/] offers long-distance coach connections to practically all parts of Finland.   Bus is also the only way to travel in Lapland, since the rail network doesn't extend to the extreme north.\n\nBuses are generally slightly higher priced than trains, although on routes with direct train competition they can be cheaper.  Speeds are usually slower than trains, sometimes very slow (from Helsinki to Oulu), sometimes even faster (from Helsinki to Kotka and Pori).  On many routes, though, buses are more frequent, so you may still get to your destination faster than if you wait for the next train.\n\nUnlike the trains, student discounts are available also for foreign students by showing a valid ISIC card at Matkahuolto offices (in every bus station) and getting a Matkahuolto student discount card (€5). There is also ''BusPass'' travel pass from Matkahuolto [http://www.matkahuolto.fi/en/travel_services/ticket_products/bus_pass/], which offers unlimited travel in specified time, priced at €149  for 7 days and €249 for 14 days.\n\n'''Onnibus''' [http://www.onnibus.fi/en/] offers a cheaper alternative (ticket prices beginning from €1 on all routes when bought online) for long-distance coaches. Routes coverages almost whole country.\n\nLocal transport networks are well-developed in Greater Helsinki, Tampere and Turku. In smaller cities public transport networks are usable on weekdays, but sparse on weekends and during the summer.  There are easy-to-use high-tech English route planners with maps to find out how to use local bus services provided by Finnish Transportation Agency [https://opas.matka.fi].\n\n====Demand responsive transport====\nDemand responsive transport (DRT) is a form of public transport, in which the routes are determined based on the customers' needs. You can find the zones where DRT services are available by using the map or address search services[http://kutsujoukkoliikenne.matka.fi/en/].\n\n===By ferry===\nIn summertime, lake cruises are a great way to see the scenery of Finland, although most of them only do circular sightseeing loops and aren't thus particularly useful for getting from point A to point B.  Most cruise ships carry 100-200 passengers (book ahead on weekends!), and many are historical steam boats.  Popular routes include [[Turku]]-[[Naantali]] and various routes in and around [[Saimaa]].\n\n===By car===\n[[Image:Moose-warning-155.png|thumb|print=inline|Moose on the loose]]\n[[Image:Easter in Sörnäinen Helsinki Finland 31 March 2013.JPG|thumb|print=inline|The use of sand instead of potassium formate and salt leads to a dirty environment. In Spring, the breathing air is often polluted by dust and thus can result in respiratory malfunctions. Sörnäinen, Helsinki.]]\n\nHiring a car is possible in Finland but generally expensive, with rates generally upwards of €80 a day, although rates go down for longer rentals. Foreign-registered cars can only be used in Finland for a limited time and registering it locally involves paying a substantial tax to equalise the price to Finnish levels. If you opt to buy a car in Finland instead, make sure it has all annual taxes paid and when it's next annual inspection is due: the deadline is the same day as the car's first date of use unless the registration form says 00.00.xx in first date of use. In that case the inspection date is determined by the last number of the license plate. All cars must pass emissions testing and precise tests of brakes etc. Police may remove the plates of vehicles that have not passed their annual inspections in time and give you a fine. \n\nTraffic drives on the right, and there are no toll roads in Finnish cities or highways so far. Main roads are usually fairly well maintained and extensive, although expressways are limited to the south of the country except a few shorter stretches in or around a few cities (Kuopio, Oulu, Vaasa). Note that '''headlights''' or daytime running lights must be kept on ''at all times'' when driving. It is worth noting that many cars with automated headlight switches '''do not''' recognise rain or snowfall and thus do not turn on the rear lights which is vital especially in poor visibility. Drivers must stay very alert, particularly at dawn and dusk, for wild animals. Collisions with '''moose''' (frequently lethal) are common countrywide, '''deer''' (mostly survivable) cause numerous collisions in South and South West parts of the country, and semi-domesticated '''reindeer''' are a common cause of accidents in [[Finnish Lapland|Lapland]]. '''Bear''' collisions happen sometimes in eastern parts of the country. VR's overnight car carrier trains [http://www.vr.fi/heo/eng/aika/fautojuna.htm] are popular for skipping the long slog from Helsinki up to Lapland and getting a good night's sleep instead: a [[Helsinki]]-[[Rovaniemi]] trip (one way) with car and cabin for 1-3 people starts from &euro;215.\n\nA few unusual or unobvious rules to beware of:\n* '''Headlights are mandatory''' even during daylight. Daytime running lights (DRL) are legal in daylight.\n* ''Always'' give way to the right, unless instructed otherwise. There is no concept of minor and major road, so this applies even to smaller roads on your right. Almost all intersections are explicitly signposted with yield signs (either the stop sign or an inverted triangle). There is no explicit sign on the road that has priority, instead watch out for the back of the yield sign on the other road. Main highways are usually signposted with a diamond shaped sign indicating the right of way.\n* Signs use the following shorthand: only numbers are for weekdays (eg. \"8-16\" means 08:00-16:00), numbers in parentheses apply on Saturdays and red numbers on Sundays and holidays.\n* In Helsinki, trams always have the right of way. Collisions do a \"surprising amount of damage\". Don't get into arguments with a vehicle that can't change direction and weighs as much as a small battle tank.\n* A vehicle is required by law to stop at a zebra crossing, if at least one other car has stopped, regardless of whether or not there is a pedestrian (in a similar manner as if there were a stop sign).\n* A car is obliged to stop at a zebra crossing, if the pedestrian intends to cross the road. Many pedestrians intend to cross the road only when there is a sufficiently large gap in the traffic.\n* When crossing the road as a pedestrian at a zebra crossing, do not leave a shadow of a doubt that you will cross the road, and cars will stop. With some practice, this works out smoothly, efficiently and without taking undue risks. By default, drivers will assume that the pedestrian \"does not intend to cross the road right now\", in other words, cars will ''not'' stop. \n* A car horn may only be used to prevent a collision or a similar hazardous situation. Using the horn for other purposes such as expressing frustration in surrounding traffic is unlawful and quite strongly frowned upon.\n* Circular traffic can be rather complex. For example, in one spot, two new lanes are created while the outer lane is suddenly forced to exit. This creates a difficult situation, when the lines are covered by snow.\n* Pedestrians walking on unlighted roads without sidewalk or cycle tracks in the dark are required by law to use safety reflectors. Their use is generally recommended, since the visibility of pedestrians with reflector improves greatly.\n* Finland, as well as Sweden, allows longer vehicles than other European countries on its '''entire''' road network. The current maximum for goods vehicles is 25,25 meters and weighing 76 metric tons. A new law is due in late-2018 to allow road trains of up to 34,50 meters. Currently there are some 40 different trials with longer and heavier vehicles. The ones that exceed 25,25 m in length are marked by \"PITKÄ KULJETUS\" in the rear. It is worth keeping in mind that there are almost twice the length of \"regular\" European semi-trucks and it takes a few seconds longer to overtake.\n\n[[Winter driving]] can be somewhat hazardous, especially for drivers unused to cold weather conditions. In fact '''during the late-2010s, there has been a number of lethal car accidents caused by foreign drivers that are not used to driving in winter conditions'''. Winter tyres (M+S) are mandatory from 1 December through the end of February. The most dangerous weather is in fact around the zero degree mark (C), when slippery but near-invisible '''black ice''' forms on the roads.  Finnish cars often come equipped with an engine block heater (''lohkolämmitin'') used to preheat the engine and possibly the interior of the car beforehand, and many parking places have electric outlets to recharge them.  ''Liikenneturva'', the Finnish road safety agency, maintains a [http://www.liikenneturva.fi/en/safety_info/tips_for_winter_driving.php Tips for winter driving page] in English as well as [https://www.liikenneturva.fi/en/road-safety/finland-car Finland by car] multi-language brochure.\n\nNote that especially in the Helsinki area, the majority of cars are equipped with steel-studded tyres that allow more dynamic driving and shorter braking distances on frozen surfaces than conventional traction tires (M+S), as used in other European countries.\n\nSoftware for GPS navigators that warns of fixed safety cameras is legal and installed by default in many mobile phones. Warning signs before fixed cameras are required by law. Possessing a radar detector is illegal and having one in your car will cause serious consequences.\n\nA blood alcohol level of over 0.05% is considered drink driving and 0.12% as aggrevated drink driving, so think twice before drinking that second beer. Finnish police strictly enforce this by random roadblocks and sobriety tests.\n\nIf you are driving at night when filling stations are closed (they usually close at 21:00), '''always remember to bring some money for fuel'''. Some self-service petrol pumps in Finland rarely do not accept foreign visa/credit cards, but you can pay with Euro notes. In the sparsely-populated areas of the country, distances of 50 km (31.07 miles) and more between filling stations are not unheard of, so don't gamble unnecessarily with those last litres of fuel.\n\nIf you enter Finland in your own car, note that '''all petrol in Finland contains ethanol'''. If your car should not be run on ethanol-containing petrol or you are in doubt, use the 98 octane petrol. This contains residual ethanol from the pump station up to a maximum of 5% and can be used in all cars that run on petrol.\n\n==== Penalties ====\nFinnish '''speeding tickets''' are based on your income, so be careful: a Nokia VP who'd cashed in some stock options the previous year was once charged for US$204,000!  Fortunately, the police have no access to tax records outside Finland and will just fine non-residents a flat €100-200 instead. Speed limits are 50 km/h in towns, 80-100 km/h outside towns and usually 120 km/h on freeways. From around mid-October to April, speed limits on freeways are lowered to 100 km/h and most 100 km/h limits are lowered to 80 km/h.\n\nIn case the driver gets caught for speeding three times within a year or four times within two years, the '''driving licence will be seized''' four weeks being the minimum. In case of aggravated speeding or drink driving the licence may be seized immediately. Usage of a mobile phone while driving is illegal, and you can expect to be punished similar to how a driver charged with a speeding offence would be.\n\n=== By taxi ===\n'''NOTICE! The taxi system in Finland will change significantly as the government regulation stops at July 1st 2018. After that date some of the following information may be misleading or even false.'''\n\nFinnish taxis are heavily regulated by the government, so they're comfortable, safe and expensive.  No matter where you go in the country, the starting fee is fixed at €5.90, rising up to €9.00 at night and on Sundays.  The per-kilometer charge starts at €1.52/km for 1 or 2 passengers, rising up to €2,13/km for 7 or 8 passenger minivans. A 20-25 km journey (say, airport to central Helsinki) can thus easily cost €40-50.\n\nTaxis can come in any color or shape, but they will always have a yellow \"TAXI\" sign (sometimes spelled \"TAKSI\") on the roof. Hailing cabs off the street is difficult to impossible, so either find a taxi rank or order by phone (any pub or restaurant will help you on this, expect to pay 2 euros for the call). Taxi companies around the country can be found at the Taksiliitto [http://www.taksiliitto.fi] site.\n\nIn the Helsinki city center, long lines at the taxi stops can be expected on Friday and Saturday nights. It is not uncommon to share a taxi with strangers if going towards the same general direction.\n\nUsing of unofficial \"taxis\" is illegal and to be avoided. You might lose your wallet/purse/phone, despite Helsinki being maybe one of the safest capitals in Europe.\n\nThe Uber service is illegal in Finland and the driver may face a notable penalty. If you decide to use Uber and your driver gets caught by the police, you're on your own.\n\n===By thumb===\n[[Hitchhiking]] is possible, albeit unusual, in Finland, as the harsh climate and sparse traffic don't exactly encourage standing around and waiting for cars.  The most difficult task is getting out of [[Helsinki]].  Summer offers long light hours, but in the fall/spring you should plan your time.  The highway between [[Helsinki]] and [[Saint Petersburg]] has a very high percentage of Russian drivers.  See Hitchhiking Club Finland liftari.org [http://www.liftari.org] or the Finland article [http://hitchwiki.org/en/Finland] on Hitchwiki for further details if interested.\n\n===By bicycle===\nMost Finnish cities have good cycle paths especially outside the centres, and riding a bike is a quick, healthy and environmentally-friendly method of getting around locally. '''A white headlight is mandatory''' when riding a bicycle in the dark, even in urban areas. You can receive a €40 fine if you don't display a headlight. Use of safety helmet is advised.\n\nThe roads are generally paved well, although gravel roads are sometimes unavoidable. As long as you don't go off-road, you will not need suspension or grooved tyres.\n\nBecause of the long distances, bicycle tourists are advised to plan well and be prepared to use public transport for the less interesting stretches. Long-distance coaches are well-equipped to take bicycles on board, trains can take bicycles if there is enough space. Ferries take bicycles for free or for a small fee.\n\nDue to the relatively gentle topographic relief, too hilly terrain is rarely a problem, but in the cold months, windchill requires more protection against cold than in walking.\n\n==Talk==\n{{seealso|Finnish phrasebook}}\n\n[[Image:Finnish_language_map,_detailed_areas.png|thumb|Finnish language map. Finnish is a Official Language (dark blue) and Finnish spoken by a minority (aruba blue)]] \n\nFinland is officially bilingual in [[Finnish phrasebook|Finnish]] (spoken by 90% of the population) and [[Swedish phrasebook|Swedish]] (spoken by 5,6 of the population), and both languages are compulsory in all schools, but in practice most of the population is monolingual in Finnish. Finnish is spoken everywhere in the country except Åland islands and Finnish is the main language of Finland. Finnish is not related to the Scandinavian languages (Danish, Swedish, Norwegian, Icelandic and Faroese), Russian, or English. In fact, it is not even an Indo-European language, instead belonging in the Uralic group of languages which includes Hungarian and Estonian, making it hard for speakers of most other European languages to learn.  Reading signboards can also be difficult as Finnish has relatively few loan words from common European languages, and as a result it is very hard to guess what words in Finnish mean. \n\nSwedish is the mother tongue for 5.6% of Finns. There are no large towns with a Swedish majority, and the Swedish-speaking communities are mainly smaller rural communities along the Southwest coast. Many towns and road signs on the coast use alternate Finnish and Swedish names, so road signs can be confusing, but bilingual signs outside bilingual areas never appear. The small autonomous province of [[Åland]] and the municipalities of Närpes, Korsnäs and Larsmo are exclusively Swedish-speaking, and people there typically speak little or no Finnish at all, so English is a better bet. Swedish is a mandatory subject in Finnish-speaking schools (and Finnish in Swedish-speaking schools), so everyone is supposed to speak and understand it; in reality, though, only 41% of the Finnish-speaking population is conversant in it, and most of these people live in coastal areas and in predominantly Swedish-speaking areas. Even this varies: for example, in Helsinki and Turku most people can speak Swedish enough to deal with important conversations you engage in as a tourist and often somewhat beyond, but living would be impossible without knowledge of Finnish, whereas towns like Vaasa and Porvoo have significant Swedish-speaking minorities and are more genuinely bilingual (i.e. it would be possible to live there with Swedish only). Most hotels and restaurants, especially in areas where Swedish is widely spoken, do have some Swedish-proficient staff.\n\nRussian is best understood near the Russian border, such as in Lappeenranta, Imatra and Joensuu, which are areas frequented by Russian tourists. Tourist destinations which are popular among Russians in Eastern and Northern Finland have some Russian-speaking staff. Elsewhere, knowledge of Russian is often far rarer.\n\nIn bigger towns, with the exception of the elderly, many people you would meet as a tourist speak good English, and even in the countryside younger people will nearly always know enough to communicate. In fact, outside of the Swedish-speaking communities, '''English is usually far better understood than Swedish'''. Conversely, within the Swedish-speaking communities, English is often better understood than Finnish. 73 % of the population in Finland can speak English. Don't hesitate to ask for help: Finns can be shy but will help you out in need. Besides English and Swedish, some Finns can speak German (18 %) or French (3 %), other secondary languages (Spanish, Russian) being rare.\n\nForeign TV series and movies are nearly always subtitled.  Only children's fare gets dubbed into Finnish.\n\nThe grammar of Finnish language has relatively few exceptions but quite many rules (where some rules might be considered cleverly disguised exceptions). There are about 17 different cases for \"getting ''some'' coffee and getting ''the'' coffee, going ''into'' a pub, being ''in'' a pub (or ''in'' a state of drunkenness), getting ''out of'' the pub, being ''on'' the roof, getting ''onto'' the roof, getting ''off'' the roof, using something ''as'' a roof\" and so on that are encoded into the word endings. In ''written'' text, the plethora of cases makes it a challenging exercise to even look up a single word from the dictionary. The conjugation of verbs is unfortunately somewhat more complex.\n\n==See==\n[[File:Auringonlasku2.jpg|thumb|300px|Sunset with reflections on a lake in Finland.]]\nA selection of top sights in Finland:\n\n* Central [[Helsinki]], the '''Daughter of the Baltic''', on a warm and sunny summer day\n* The [[Suomenlinna]] Sea Fortress, 15-minute ferry trip from Downtown Helsinki. A Unesco World Heritage Site.\n* The '''historical sites''' of [[Turku]] and the '''vast archipelago''' around it, best viewed from the deck of a giant car ferry.\n* Pottering around the '''picturesque wooden houses''' of [[Porvoo]], Finland's second-oldest town\n* Renting a car and exploring the Lake Land of Eastern Finland, an area dotted with around 60 000 lakes with a similar number of islands, which in turn have their own lakes...\n* '''Olavinlinna Castle''' in [[Savonlinna]], Finland's most atmospheric castle, especially during the yearly Opera Festival\n*'''Hämeenlinna Castle''' in [[Hämeenlinna]] is Finland's oldest castle. Built in 13th century.\n* Relaxing at a sauna-equipped '''cottage''' in the lake country of [[Eastern Finland]]\n* '''Icebreaker cruising''' and the '''world's biggest snow castle''' in [[Kemi]]\n* Seeing the '''Northern Lights''' and trying your hand '''sledding down a mile-long track''' at [[Saariselkä]]\n* A ride on the historical \"Linnanmäki\" wooden roller coaster (Helsinki). Unlike modern designs, only gravity keeps it on the track, and it requires a driver on each train to operate the brakes.\n\n==Do==\n===Sports===\nNotably lacking in craggy mountains or crenellated fjords, Finland is ''not'' the adrenalin-laden winter sports paradise you might expect: the traditional Finnish pastime is '''cross-country skiing''' through more or less flat terrain.  If you're looking for downhill skiing, snowboarding etc, you'll need to head up to [[Finnish Lapland|Lapland]] and resorts like [[Levi]] and [[Saariselkä]].\n\nDuring the short summer you can swim, fish or canoe in the lakes. They are usually warmest around 20th July. Local newspapers usually have the current surface temperatures, and a map of the surface temperatures can also be found from the Environment Ministry website [http://wwwi2.ymparisto.fi/i2/90/twlx2/tanaan_fi.html]. During the warmest weeks, late at night or early in the morning the water can feel quite pleasant when the air temperature is lower than the water's. Most towns also have swimming halls with slightly warmer water, but these are often closed during the summer. Fishing permits, if needed, can be easily bought from any R-Kioski although they take a small surcharge for it.\n\nFor hikers, fishermen and hunters, the Ministry of Forestry maintains an online Excursion Map map [http://www.retkikartta.fi/?lang=en] with trails and huts marked.  The best season for hiking is early fall, after most mosquitoes have died off and the autumn colors have come out.\n\nAnd if you'd like to try your hand at something uniquely Finnish, don't miss the plethora of bizarre sports contests in the summer, including:\n\n* '''Air Guitar World Championships''' [http://www.airguitarworldchampionships.com/], August, [[Oulu]].\n* '''Mobile Phone Throwing Championship''' [http://www.mobilephonethrowing.fi/], August, [[Savonlinna]].  Recycle your Nokia!\n* '''Swamp Soccer World Championship''' [http://www.suopotkupallo.fi/index.php?c_la=en], July, [[Hyrynsalmi]]. Probably the messiest sporting event in the world.\n* '''Wife Carrying World Championship''' [http://www.eukonkanto.fi/en/], July, [[Sonkajärvi]]. The grand prize is the wife's weight in beer.\n* '''Sulkavan Suursoudut''' [http://www.suursoudut.fi/en], July, [[Sulkava]] Finland's biggest rowing event\n\n===Festivals===\nFinland hosts many '''music festivals''' (''festari'') during the summer. Some of the most notable include:\n<!-- no more than nine, order by date, discuss changes on Talk first -->\n\n* '''Provinssirock''' [http://www.provinssirock.fi] One of the biggest rock festivals in Finland in the middle of June in [[Seinäjoki]]. [http://en.wikipedia.org/wiki/Provinssirock]. \n* '''[[Tangomarkkinat]]''' [http://www.tangomarkkinat.fi/] World's oldest tango festival. It is held early every July in [[Seinäjoki]]. [http://en.wikipedia.org/wiki/Tangomarkkinat]\n* '''Vauhtiajot''' [http://www.vauhtiajot.fi/] Motorsport and rock festival in July in [[Seinäjoki]].\n* '''Nummirock''' [http://nummirock.fi], heavy metal, [[Nummijärvi]] (near [[Kauhajoki]]), late June (Midsummer)\n* '''Tuska Open Air''' [http://www.tuska-festival.fi] , heavy metal, [[Helsinki]], late June\n* '''Sauna Open Air''' [http://www.sauna-open-air.fi], heavy metal, [[Tampere]], early June\n* '''Ruisrock''' [http://ruisrock.fi], rock, [[Turku]], July\n* '''Pori Jazz''' [http://www.porijazz.fi/], jazz/world music, [[Pori]], mid-July\n* '''Flow''' [http://www.flowfestival.com], indie/electronic/urban, Helsinki, mid-August\n<!-- no more than nine, order by date, discuss changes on Talk first -->\n\nMost of the festivals last 2-4 days and are very well organized, with many different bands playing, with eg. Foo Fighters and Linkin Park headlining at Provinssi 2008. The normal full ticket (all days) price is about €60-100, which includes a camp site where you can sleep, eat and meet other festival guests. The atmosphere at festivals is great and probably you'll find new friends there. Of course drinking a lot of beer is a part of the experience.\n\nThere are also many more less-advertised underground festivals around the countryside every summer.\n\n===Northern Lights===\nSpotting the eerie '''Northern Lights''' (''aurora borealis'', or ''revontulet'' in Finnish) glowing in the sky is on the agenda of many visitors, but even in Finland it's not so easy.  During the summer, it's light all day along and the aurora become invisible, and they're rarely seen in the south.  The best place to spot them is during the winter in the far north, when the probability of occurrence is over 50% around the magnetic peak hour of 22:30 &mdash; if the sky is clear, that is.  The ski resort of [[Saariselkä]], easily accessible by plane and with plenty of facilities, is particularly popular among aurora hunters.\n\n==Buy==\n{{Euro}}\n\nFinland does not use the 1 and 2 cent coins; instead all sums are rounded to the nearest 5 cents. The coins are, however, still legal tender and there are even small quantities of Finnish 1c and 2c coins, highly valued by collectors. It is common to omit cents and the euro sign from prices, and use the comma as a decimal separator: \"5,50\" thus means five euros and fifty cents.\n\nGetting or exchanging money is rarely a problem, as ATMs (\"Otto\") are common and they can be operated with international credit and debit cards (Visa, Visa Electron, Mastercard, Maestro). Currencies other than the euro are generally ''not'' accepted, although the Swedish krona may be accepted in [[Åland]] and northern border towns like [[Tornio]]. Russian roubles are accepted in some select touristy shops, such as Stockmann in Helsinki. Money changers are common in the bigger cities (the Forex chain [http://forex.fi] is ubiquitous) and typically have longer opening hours and faster service than banks. Credit cards are widely accepted, and the payment is almost always accepted by your PIN code. Visa Electron and Visa Debit cardreaders are found in all major and most minor shops, so carrying large amounts of cash is not usually necessary.\n\nAs a rule, '''tipping''' is never necessary in Finland and restaurant bills already include service charges.  That said, taxi fares and other bills paid by cash are are occasionally rounded up to the next convenient number. Cloakrooms (''narikka''; actually a misspelling used by younger Finnish people in as much the original word is \"narinkka\" = na rynke = on the market in Russian, stemming from the Russian time of Finland into the very peculiar \"stadin slangi\" = Helsinki slang) in nightclubs and better restaurants often have ''non-negotiable'' fees (usually clearly signposted, &euro;3 is standard), and &mdash; in the few hotels that employ them &mdash; hotel porters will expect around the same per bag.\n\n===Costs===\nDeclared the world's most expensive country in 1990, prices have since abated somewhat but are still steep by most standards. Rock-bottom travelling if staying in hostel dorms and self-catering costs at least €25/day and it's well worth doubling that amount. The cheapest hotels cost about €50 per night and more regular hotels closer to €100. Instead of hotels or hostels, look for holiday cottages, especially when travelling in a group and off-season, you can find a full-equipped cottage for €10-15 per person a night. Campsites typically cost between €10 and €20 per tent.\n\nMuseums and tourist attractions have an entrance fee in the range of €5-25. Using public transport costs a few euros per day and depends on the city. One-way travel between major cities by train or by bus costs between €20-100, depending on the distance.\n\nNote that a VAT of 24% is charged for nearly everything, but by law this must be included in the displayed price. Non-EU residents can get a tax refund for purchases above €40 at participating outlets, just look for the Tax-Free Shopping logo.\n\n===Shopping===\nAs you might expect given the general price level, souvenir shopping in Finland isn't exactly cheap. Traditional buys include Finnish ''puukko'' knives, handwoven ''ryijy'' rugs and every conceivable part of a reindeer. For any [[Finnish Lapland|Lappish]] handicrafts, look for the \"Sámi Duodji\" label that certifies it as authentic.\n\nPopular brands for modern (or timeless) Finnish design include Marimekko [http://www.marimekko.fi] clothing, Iittala [http://www.iittala.fi] glass, Arabia [http://www.arabia.fi] ceramics, Kalevala Koru [http://www.kalevalakoru.fi] jewelry, Pentik [http://www.pentik.fi/] interior design and, if you don't mind the shipping costs, Artek [http://www.artek.fi] furniture by renowned architect and designer Alvar Aalto. Kids and not a few adults love Moomin [http://www.moomin.fi/] characters, which fill up souvenir store shelves throughout the country. In case one prefers souvenirs that are made in Finland and do not just appear Finn Made, caution is advised. Many wooden products are actually imported and Marimekko, for instance, manufactures most of its products outside Finland. Safe bets for truly Finnish souvenirs are products made by Lapuan Kankurit [http://www.lapuankankurit.fi/en] and Aarikka [http://www.aarikka.com/en/], for example.\n\nShopping hours for specialty stores vary significantly by size and location, with many smaller ones closing around 17:00 and large department stores open until around 21:00 or 22:00. Note that opening hours are often reduced considerably around national holidays, such as Christmas, Easter or Midsummer.\n\nWhile shopkeepers may vehemently deny this to a foreigner, prices in smaller stores are by no means fixed. When buying hobby equipment, it is not uncommon to get 30 % discount (hint: Find the international price level from a web shop and print it out). The more specialized the goods, the higher the gap between Finnish and international prices, and mail order may save a lot of money. When a package is intercepted by customs (which is quite rate for physically small items), the buyer is notified and can pick it up from customs. VAT and possibly import duty are charged, bring a copy of the order that is then signed by the buyer and archived.\n\nWhen buying consumer electronics, one should be aware that the shelf life of products can be rather long, especially if the shop isn't specialized in consumer electronics. There is a risk to buy an overpriced product that has already been discontinued by the manufacturer or replaced with a newer model.\n\n===Grocery Shopping===\nThe range of products in Finnish grocery stores tends to be a little bit more limited than in Europe overall. Many products need to be imported, and this is unfortunately one reason why prices are high - prepare to pay about a fifth to a quarter more for food than in Europe on average.\n\nThere is usually at least one supermarket in all localities, often two. Finnish food markets are mainly dominated by two large groups: S-Group [https://www.s-kanava.fi/web/s/en/mista-bonusta] (supermarket chains '''Sale''', '''Alepa''', '''S-Market''' and hypermarket chain '''Prisma'''), and the K-Group [http://www.kesko.fi/en/customer/stores/#grocery_trade] (supermarket chains '''K-Extra''', '''K-Market''', '''K-Supermarket''' and hypermarket chain '''K-Citymarket'''. In addition to these chains, the international discount store chain '''Lidl''' [https://www.lidl.fi] operates around 150 stores in Finland, mainly in cities and towns with population over 5,000. Some independent grocery stores also exist (such as in some rural communities), although these are becoming quite rare.\n\nOne noteworthy thing to remember when shopping for groceries in Finland is that virtually all grocery stores require you to '''use a self-service scale when buying fresh fruits and produce''', and the cashier will not be able to do this for you. If you don't weigh these products yourself before you proceed to pay, you will end up holding up the line for several minutes and possibly causing irritation in other customers.\n\nPrevious restrictions on '''shopping hours''' were recently lifted, and now vary significantly by shop and location. For many smaller shops in large towns, normal weekday opening hours are around 08:00-22:00, but may be closed or have reduced hours during weekends. Larger grocery stores in central locations are sometimes open later, some shops in Central [[Helsinki]] are open 24/7 or until 22:00 every day of the year. When off the beaten path, grocery store hours are often much shorter, but gas station convenience stores are usually open later. Most notable 24/7 gas station-chains are \"ABC\" and Shell. \n\nConvenience stores like the ubiquitous '''R-Kioski''' [http://www.rkioski.fi/] tend to have long hours, but are usually not open around the clock. These are usually found in busy, central locations.\n\n==== Alcohol ====\n'''Finnish grocery stores do not sell alcoholic beverages with above 5.5% volume''', and no alcoholic beverages above 2.8% volume are sold between 21:00 and 09:00. The sole provider of wine and spirits is the government-run '''Alko''', which has limited hours, especially on weekends and public holidays. When buying alcohol, almost all grocery stores will usually '''require you or anyone in your company who the clerk deems look below the age of 30 to provide proof of age''' - only a government-issued ID card, drivers' license or passport is acceptable. You will also not be sold alcohol if you are visibly intoxicated or act in a disturbing manner. \n\nAge limit for buying alcohol in grocery stores and Alkos is 18 for under 21%-vol. beverages and 20 for over 21%-vol. beverages. In bars and nightclubs 18 years old can buy also strong alcohol.\n\n==Eat==\n[[Image:Finland_SmokedSalmonPlate.JPG|thumb|A typical Finnish meal. Clockwise from bottom: warm smoked salmon, boiled potatoes, cream sauce with chantarelles, lightly pickled cucumbers with dill]]\n\nFinnish cuisine is heavily influenced by its neighbors, the main staples being '''potatoes''' and '''bread''' with various fish and meat dishes on the side. Milk or cream is traditionally considered an important part of the diet and is often an ingredient in foods and a drink, even for adults. Various milk products such as cheeses are also produced. While traditional Finnish food is famously bland, the culinary revolution that followed joining the EU has seen a boom in classy restaurants experimenting with local ingredients, often with excellent results.\n\n===Seafood===\nWith tens of thousands of lakes and a long coastline, fish is a Finnish staple, and there's a lot more on that menu than just salmon (''lohi'').  Specialities include:\n\n* '''Baltic herring''' (''silakka''), a small, fatty and quite tasty fish available pickled, marinated, smoked, grilled and in countless other varieties\n* '''Gravlax''' (\"graavilohi\"), a pan-Scandinavian appetizer of raw salted salmon\n* '''Smoked salmon''' (''savulohi''), not just the cold, thinly sliced, semi-raw kind but also fully cooked \"warm\" smoked salmon\n* '''Vendace''' (''muikku''), a speciality in eastern Finland, a small fish served fried, heavily salted and typically with mashed potatoes\n\nOther local fish to look out for include zander (''kuha''), an expensive delicacy, pike (''hauki'') and perch (''ahven'').\n\n===Meat dishes===\n[[Image:Poronkaristys.jpg|thumb|Reindeer stew (''poronkäristys''), a [[Finnish Lapland|Lappish]] favorite]]\n[[Image:KahvilaSuomi Meatballs.JPG|thumb|Meatballs (''lihapullat''), served with mashed potatoes and lingonberry jam]]\n\n* '''Karelian stew''' (''karjalanpaisti''), a heavy stew usually made from beef and pork (and optionally, lamb), carrots and onions, usually served with potatoes\n* '''Liver casserole''' (''maksalaatikko''), consisting of chopped liver, rice and raisins cooked in an oven; it tastes rather different from what you'd expect (and not liver-y at all)\n* '''Loop sausage''' (''lenkkimakkara''), a large, mildly flavored sausage; best when grilled and topped with a dab of sweet Finnish mustard (''sinappi''), and beer\n* '''Meat balls''' (''lihapullat'', ''lihapyörykät'') are as popular and tasty as in neighboring Sweden\n* '''Reindeer''' (''poro'') dishes, especially sauteed reindeer shavings (''poronkäristys'', served with potato mash and lingonberries), not actually a part of the everyday Finnish diet but a tourist staple and common in the frigid North\n* '''Swedish hash''' (\"pyttipannu\"), (originally from [[Sweden]], Swedish: \"pytt i panna\") a hearty dish of potatoes, onions and any meaty leftovers on hand fried up in a pan and topped with an egg\n* '''Makkara''' traditional Finnish sausage. Affectionately called \"the Finnish man's vegetable\" since the actual meat content may be rather low.\n\n===Milk products===\nCheese and other milk products are very popular in Finland.  The most common varieties are mild hard cheeses like Edam and Emmental, but local specialities include:\n\n* '''Aura cheese''' (''aurajuusto''), a local variety of blue cheese, also used in soups, sauces and as a pizza topping.\n* '''Breadcheese''' (''leipäjuusto'' or ''juustoleipä''), a type of very mild-flavored grilled curd that squeaks when you eat it, best enjoyed warm with a dab of cloudberry jam\n* '''Piimä''', a type of buttermilk beverage, thick and sour\n* '''Viili''', a gelatinous, stretchy and sour variant of yoghurt\n\n===Other dishes===\n[[Image:Karjalanpiirakka-20060227.jpg|thumb|Karelian pie (''karjalanpiirakka''), a signature Finnish pastry]]\n\n* '''Pea soup''' (''hernekeitto''), usually but not always with ham, traditionally eaten with a dab of mustard and served on Thursdays; just watch out for the flatulence!\n* '''Karelian pies''' (''karjalanpiirakka''), an oval 7 by 10 cm baked pastry, traditionally baked with rye flour, containing rice porridge or mashed potato, ideally eaten topped with butter and chopped egg (''munavoi'')\n* '''Porridge''' (''puuro''), usually made from oats (''kaura''), barley (''ohra''), rice (''riisi'') or rye (''ruis'') and most often served for breakfast\n\n===Bread===\nBread (''leipä'') is served with every meal in Finland, and comes in a vast array of varieties. Rye bread is the most popular bread in Finland. Typically Finnish ones include:\n* ''hapankorppu'', dry, crispy and slightly sour flatbread, occasionally sold overseas as \"Finncrisp\"\n* ''limppu'', catch-all term for big loaves of fresh bread\n* ''näkkileipä'', another type of dark, dried, crispy rye flatbread\n* ''ruisleipä'' (rye bread), can be up to 100% rye and ''much'' darker, heavier and chewier than American-style rye bread; unlike in Swedish tradition, Finnish rye bread is typically unsweetened and thus sour and even bitter.\n* ''rieska'', unleavened bread made from wheat or potatoes, eaten fresh\n\n===Seasonal and regional specialities===\n{{infobox|Attack of the killer mushrooms|The '''false morel''' (''korvasieni'') has occasionally been dubbed the \"Finnish fugu\", as like the infamous Japanese pufferfish, an improperly prepared false morel ''can kill you''.  Fortunately, it's easily rendered safe by boiling (just don't breathe in the fumes!), and prepared mushrooms can be found in gourmet restaurants and even canned.}}\n \nFrom the end of July until early September it's worthwhile to ask for '''crayfish''' (''rapu'') menus and prices at better restaurants. It's not cheap, you don't get full from the crayfish alone and there are many rituals involved, most of which involve large quantities of ice-cold vodka, but it should be tried at least once. Or try to sneak onto a corporate crayfish party guestlist, places are extremely coveted at some.  Around Christmas, '''baked ham''' is the traditional star of the dinner table, with a constellation of casseroles around it.\n\nThere are also regional specialties, including [[Eastern Finland]]'s ''kalakukko'' (a type of giant '''fish pie''') and [[Tampere]]'s infamous '''blood sausage''' (''mustamakkara'').  Around Easter keep an eye out for ''mämmi'', a type of brown sweet '''rye pudding''' which is eaten with cream and sugar. It looks famously unpleasant but actually tastes quite good.\n\n===Desserts===\n[[Image:Pullia.jpg|thumb|An assortment of ''pulla'' straight from the oven]]\n\nFor dessert or just as a snack, '''Finnish pastries''' abound and are often taken with coffee (see [[#Drink|Drink]]) after a meal. Look for '''cardamom coffee bread''' (''pulla''), a wide variety of '''tarts''' (''torttu''), and '''donuts''' (''munkki'').  In summer, a wide range of fresh '''berries''' are available, including the delectable but expensive '''cloudberry''' (''lakka''), and berry products are available throughout the year as jam (''hillo''), soup (''keitto'') and a type of gooey clear pudding known as ''kiisseli''.\n\nFinnish chocolate is also rather good, with '''Fazer''' [http://www.fazermakeiset.fi/] products including their iconic '''Sininen''' (\"Blue\") bar exported around the world.  A more Finnish speciality is '''licorice''' (''lakritsi''), particularly the strong, salty kind known as ''salmiakki'', which gets its unique (and acquired) taste from ammonium chloride.\n\n===Places to eat===\n[[Image:Savonlinna Liekkilohi Buffet.JPG|thumb|Cold fish buffet at Liekkilohi, [[Savonlinna]]]]\n\nFinns tend to eat out only on special occasions, and restaurant prices are correspondingly expensive.  The one exception is '''lunchtime''', when thanks to a government-sponsored lunch coupon system company cafeterias and nearly every restaurant in town offers set lunches for around €8-9, usually consisting of a main course, salad bar, bread table and a drink.  University cafeterias, many of which are open to all, are particularly cheap with meals in the €2-4 range for students, although without local student ID you will usually need to pay about €5-7. There are also public cafeterias in office / administration areas that are open only during lunch hours on working days. While not particularly stylish and sometimes hard to find, those usually offer high-quality buffet lunch at a reasonable price (typically €8.40 in 2011).\n\nThe cafe scene has quickly developed, especially since the 1990s and above all in [[Helsinki]]. The array of cakes and pastries is not perhaps as vast as in [[Central Europe]], but the local special coffees (lattes, mochas etc.) are worth trying when it comes to the two big local coffee house chains: Wayne's Coffee (originated in Sweden) and Robert's Coffee (Finland). You can now also find ''Starbucks'' in Finland.\n\nFor dinner, you'll be limited to generic fast food (pizza, hamburgers, kebabs and such) in the €5-10 range, or you'll have to splurge over €20 for a meal in a \"nice\" restaurant. For eating on the move, look for '''grill''' kiosks (''grilli''), which serve sausages, hamburgers and other portable if not terribly health-conscious fare late into the night at reasonable prices.  In addition to the usual hamburgers and hot dogs, look for '''meat pies''' (''lihapiirakka''), akin to a giant savoury doughnut stuffed with minced meat and your choice of sausage, fried eggs and condiments.  '''Hesburger''' [http://www.hesburger.fi] is the local fast-food equivalent of McDonald's, with a similar menu. They have a \"Finnish\" interpretation of a few dishes, such as a sour-rye chicken sandwich. Of course most international fast food chains are present, especially McDonald's, which offers many of their sandwich buns substituted with a sour-rye bun on request.\n\nThe Finnish word for buffet is ''seisova pöytä'' (\"standing table\"), and while increasingly used to refer to all-you-can-eat Chinese or Italian restaurants, the traditional meaning is akin to Sweden's ''smörgåsbord'': a good-sized selection of sandwiches, fish, meats and pastries.  It's traditionally eaten in three rounds &mdash; first the fish, then the cold meats, and finally warm dishes &mdash; and it's usually the first that is the star of the show.  Though expensive and not very common in a restaurant setting, if you are fortunate enough to be formally invited to a Finn's home, they will likely have prepared a spread for their guest, along with plenty of coffee.  Breakfast at better hotels is also along these lines and it's easy to eat enough to cover lunch as well!\n\nIf you're really on a budget, you can save a considerable amount of money by '''self-catering'''.  Ready-to-eat casseroles and other basic fare that can be quickly prepared in a microwave can be bought for a few euros in any supermarket.  Note that you're usually expected to weigh and label any fruits or vegetables yourself (bag it, place it on the scale and press the numbered button. The correct number can be found from the price sign), and green signs mean possibly tastier but certainly more expensive organic (''luomu'') produce.\n\nOne should be aware that more often than not, cheap food contains disproportionate amounts of fat.\n\nAt restaurants, despite the high prices, portions tend to be quite small, at least when compared to [[USA]] and [[Canada]], and even many [[Europe]]an countries.\n\n===Dietary restrictions===\nTraditional Finnish cuisine relies heavily on meat and fish, but '''vegetarianism''' (''kasvissyönti'') is increasingly popular and well-understood, and will rarely pose a problem for travellers.  Practically all restaurants offer vegetarian options, often marked with a \"V\" on menus. Many restaurants in bigger cities also offer '''vegan''' (''vegaani'') food. It doesn't hurt to ask the waiters or cashiers if the restaurant has any vegan options, or if it's possible to adapt some of the vegetarian options to suit for a vegan. Fast food chains McDonalds and Hesburger also offer at least one vegan option.\n\nTwo ailments commonly found among Finns themselves are '''lactose intolerance''' (''laktoosi-intoleranssi'', inability to digest the milk sugar lactose) and '''coeliac disease''' (''keliakia'', inability to digest gluten). In restaurants, lactose-free selections are often tagged \"L\" (low-lactose products are sometimes called \"Hyla\" or marked with \"VL\"), while gluten-free options are marked with \"G\".  However, hydrolyzed lactose (HYLA brand) milk or lactose-free milk drink for the lactose intolerant is widely available, which also means that a lactose-free dish is not necessarily milk-free. Allergies are quite common among Finnish people, too, so restaurant workers are usually quite knowledgeable on what goes into each dish and often it is possible to get the dish without certain ingredients if specified. For people allergic to milk of animal origin, there is usually a wide selection of plant-based drinks in grocery stores and coffee shops.\n\nKosher and halal food are rare in Finland and generally not available outside very limited speciality shops and restaurants catering to the tiny Jewish and Islamic communities.  Watch out for minced meat dishes like meatballs, which very commonly use a mix of beef and pork. The Jewish Community of Helsinki [http://www.jchelsinki.fi/] runs a small kosher deli in [[Helsinki]], and there are Halal grocery stores and restaurants in some larger towns.\n\n==Drink==\nThanks to its thousands of lakes, Finland has plenty of water supplies and tap water is always potable (In fact, never buy bottled water if you can get tap water!).  The usual soft drinks and juices are widely available, but look out for a wide array of '''berry juices''' (''marjamehu''), especially in summer, as well as '''Pommac''', an unusual soda made from (according to the label) \"mixed fruits\", which you'll either love or hate.\n\n===Coffee and tea===\nFinns are the world's heaviest '''coffee''' (''kahvi'') drinkers, averaging 3-4 cups per day. Most Finns drink it strong and black, but sugar and milk for coffee are always available and the more European variants such as espresso and cappuccino are becoming more common especially in the bigger cities. The biggest towns have had French-style fancy cafés for quite some time and modern competitors, like Wayne's or Robert's Coffee, are springing up in the mix. For a quick caffeine fix, you can just pop into any convenience store, which will pour you a cuppa €2 or so. Tea hasn't quite caught on in quite the same way, although finding hot water and a bag of Lipton Yellow Label won't be a problem. For brewed tea, check out some of the finer downtown cafés or tearooms.\n\n===Dairy===\nIn Finland some people like to drink '''milk''' (''maito'') as an accompaniment to food at home or at the cafeteria at work or school. The most popular beverage is water, though. Another popular option is ''piimä'', or buttermilk. ''Viili'', a type of curd, acts like super-stretchy liquid bubble gum but is similar to plain yogurt in taste. It is traditionally eaten with cinnamon and sugar on top. Fermented dairy products help stabilize the digestion system, so if your system is upset, give them a try.\n\n===Alcohol===\n[[Image:Helsinki_IceBar_Packed2.JPG|thumb|240px|print=lead|Chilling out at the Arctic Icebar, [[Helsinki]]]]\n\n'''Alcohol''' is very expensive in Finland compared to most countries (though not to its Nordic neighbours [[Sweden]] and [[Norway]]), although low-cost [[Estonia]]'s entry to the EU has forced the government to cut alcohol taxes a little.  Still, a single beer will cost you closer to &euro;4-6 in any bar or pub, or &euro;1 and up in a supermarket. While beer and cider are available in any supermarket or convenience store (only from 9 AM until 9 PM), the state monopoly '''Alko''' [http://www.alko.fi/] is your sole choice for wine or anything stronger. The legal drinking age is 18 for milder drinks, while to buy hard liquor from Alko you need to be 20.  ID is usually requested from all young-looking clients. Some restaurants have higher age requirements, up to 30 years, but these are their own policies and are not always followed, especially at more quiet times.\n\nSurprisingly enough, the national drink is ''not'' Finlandia Vodka, but its local brand  '''Koskenkorva''' [http://www.kossu.org/eng/spirit/] or '''Kossu''' in common speech.  However, the two drinks are closely related: Kossu is 38% while Finlandia is 40%, and Kossu also has a small amount of added sugar, which makes the two drinks taste somewhat different.  There are also many other vodkas on the market, most of which taste pretty much the same, but look out for '''Ström''', \"The Spirit of Santa\", a Finnish attempt at a super-premium vodka. When looking the bottles in Alko store, difference between ''vodka'' and ''viina'' is based on the sugar content: vodka is dry while viinas contain added sugar.\n\nA local speciality is '''Salmiakki-Kossu''' or '''Salmari''', prepared by mixing in salty black ''salmiakki'' licorice, whose taste masks the alcohol behind it fearfully well. Salmari is often sold as a very cheap shot (€1-2) in the nightclubs. Add in some Fisherman's Friend menthol cough drops to get popular '''Fisu''' (\"Fish\") shots, which are even more lethal. In-the-know hipsters opt for '''Pantteri''' (\"Panther\"), which is half and half Salmari and Fisu. Other classic shots are '''Jaloviina''' (''Jallu'') cut brandy and '''Tervasnapsi''' \"tar schnapps\" with a distinctive smoke-like aroma.\n\n'''Beer''' (''olut'' or ''kalja'') is also very popular, but Finnish beers are mostly nearly identical, mild lagers: common brands are '''Lapin Kulta''', '''Karjala''', '''Olvi''', '''Koff''' and '''Karhu'''.  Pay attention to the label when buying: beers branded \"I\" are inexpensive but has low alcohol content, while \"III\" and \"IV\" are stronger and more expensive. In normal shops you will not find any drinks with more than 5.5% alcohol. You may also encounter ''kotikalja'' (lit. \"home beer\"), a dark brown beer-like but very low-alcohol beverage. Imported beers are available in bigger grocery stores, most pubs and bars, and Czech beers in particular are popular and only slightly more expensive. In recent years, some microbreweries ('''Laitila''', '''Stadin panimo''', '''Nokian panimo''' etc.) have been gaining foothold with their domestic dark lagers, wheat beers and ales.\n\nThe latest trend is '''ciders''' (''siideri''). Most of these are artificially flavored sweet concoctions which are quite different from the English or French kinds, although the more authentic varieties are gaining market share. The ever-popular '''gin long drink''' or ''lonkero'' (lit. \"tentacle\", but is a kind of deminutive form of \"long drink\"), a prebottled mix of gin and grapefruit soda is Finnish speciality which tastes better than it sounds, and has the additional useful property of glowing under ultraviolet light. At up to 610 kcal/liter it also allows to skip dinner, leaving more time for drinking. Different variations of '''lonkero''' have become quite popular as well, for example '''karpalolonkero''', which is made from gin and cranberry soda.\n\nFinnish wines are made of berries. '''Elysée N:o 1''' is very popular brand of sparkling wine made of white currant.\n\nDuring the winter don't miss '''glögi''', a type of spiced mulled wine served with almonds and raisins which can easily be made at home. The bottled stuff in stores is usually alcohol free, although it was originally made of old wine and Finns will very often mix in some wine or spirits. In restaurants, glögi is served either alcohol-free, or with 2 or 4cl vodka added.  Fresh, hot glögi can, for example, be found at the Helsinki Christmas market.\n\nQuite a few unusual liquors (''likööri'') made from berries are available, although they're uniformly very sweet and usually served with dessert.  Cloudberry liquor (''lakkalikööri'') is worth a short even if you don't like the berries fresh.\n\nHomemade spirits: you have been warned! More common in rural areas, illegal and frequently distilled on modified water purification plants - which are subject to import control laws nowadays - anecdotical evidence suggests that those are occasionally played as a prank on unsuspecting foreigners. Note that \"normal\" alcohol slows the metabolism of poisonous methanol and thus acts as an antidote. Politely decline the offer, ''especially'' if still sober.\n\nFinally, two traditional beverages worth looking for are '''mead''' (''sima''), an age-old wine-like brew made from brown sugar, lemon and yeast and consumed particularly around May's Vappu festival, and '''sahti''', a type of unfiltered, usually very strong beer often flavored with juniper berries (an acquired taste). Industrially manufactured mead is available in grocery stores around May Day and is usually alcohol free.\n\n==Sleep==\n[[Image:Benches and ladles in a Finnish sauna.jpg|thumb|240px|print=inline|Inside a Finnish sauna]]\n\n{{infobox|Sauna|The '''sauna''' is perhaps Finland's most significant contribution to the world (and the world's vocabulary).  The sauna is essentially a room heated to 70&ndash;120&deg;C; according to an oft-quoted statistic this nation of 5 million has no less than 2 million saunas, in apartments, offices, summer cottages and even Parliament.  In ancient times, saunas (being the cleanest places around) were the place to give birth and heal the sick, and the first building constructed when setting up a new household.<br><br>\nIf invited to visit a Finnish home, you may be invited to bathe in the sauna as well &mdash; this is an honour and should be treated as such, although Finns do understand that foreigners may not be keen about the idea. Enter the sauna nude after taking a shower, as wearing a bathing suit or any other clothing is considered a bit of a ''faux pas'', although if you are feeling shy, you can wrap yourself in a bath towel. (When there are guests, men and women usually bathe separately.)  The temperature is regulated by throwing water onto the stove (''kiuas''): the resulting rush of heat, known as ''löyly'', is considered the key to the sauna experience. Some sauna-goers also like to flagellate themselves with leafy branches of birch (''vihta'' in western Finland, ''vasta'' in eastern Finland), which creates an enjoyable aroma and improves blood circulation.<br><br>\nDepending on the occasion, the temperature in a Finnish sauna may start quite hot and gradually cool down over the hours, especially in a wood-heated sauna. The lower benches are cooler, the corner that is the furthest away from the stove is usually the hottest place.<br>\nIn work-related events, the actual decision-making frequently takes place in the sauna afterwards.<br>\nIn \"public\" saunas (hotels, gyms and the like), it is customary to sit on a paper towel (don't forget to take it out when leaving). The environment is rather hostile towards germs, so there is no need to worry about catching a disease from the sweaty wooden bench. If the heat is too much, cup your hands in front of your mouth or move down to a lower level to catch your breath.<br>\n\nIn winter, it is common to go for a swim in an ice hole in a nearby lake. The ground can be much colder than the water - use beach sandals or the like, if possible.<br>\nAfter you've had your fill of sauna, you can cool off by heading outside for a dip in the lake or, in winter, a roll in the snow &mdash; and then head back in for another round.  Repeat this a few times, then cork open a cold beer, roast a sausage over a fire, and enjoy total relaxation Finnish style.<br><br>\nThese days the most common type of sauna features an electrically heated stove, which is easy to control and maintain.  In the countryside you can still find wood-fired saunas, but purists prefer the (now very rare) traditional chimneyless '''smoke saunas''' (''savusauna''), where the sauna is heated by filling it with hot smoke and then ventilated well before entering.<br><br>\n'''Anyone elderly or with a medical condition (especially high blood pressure) should consult their physician before using a sauna.'''\n}}\n\nAccommodation in Finland is expensive, but many large hotels are cheaper during the weekends and summer.  In addition to the usual international suspects, check out local chains Cumulus [http://www.cumulus.fi/], Scandic [http://www.scandichotels.fi/], Finlandia [http://www.finlandiahotels.fi/] and Sokos [http://www.sokoshotels.fi/].  The small but fast-growing Omena [http://www.omena.com] chain offers cheap self-service hotels, where you book online and get a keycode for your room, with no check-in of any kind needed.\n\nOne of the few ways to limit the damage is to stay in youth [[hostels]] (''retkeilymaja''), as the Finnish Youth Hostel Association [http://www.hostellit.fi/] has a fairly comprehensive network throughout the country and and a dorm bed usually costs less than &euro;20 per night.  Many hostels also have private rooms for as little as &euro;30, which are a great deal if you want a little extra privacy.\n\nAn even cheaper option is to take advantage of Finland's [[right to access]], or '''Every Man's Right''' (''jokamiehenoikeus''), which allows camping, hiking, and berry and mushroom picking as well as simple (rod and hook) fishing on uncultivated land. Since this is occasionally mis-interpreted by visiting foreigners, it may be a good idea to discuss travel plans with a local - or simply ask - to avoid embarrassing situations. Note that making a fire requires landowner's permission. \n\nFor a taste of the Finnish countryside, an excellent option is to stay at a '''cottage''' (''mökki''), thousands of which dot the lake shores.  These are generally best in summer, but there are also many cottages around Lapland's ski resorts.  Prices vary widely based on facilities and location: simple cottages can go for as little as &euro;20/night, while luxurious multistory mansions can go for 10 times that.  Beware that, while all but the most basic ones will have electricity, it's very common for cottages to lack running water: instead, the cottage will have an outhouse (pit toilet) and you're expected to bathe in the sauna and lake.  Renting a car is practically obligatory since there are unlikely to be any facilities (shops, restaurants, etc) within walking distance.  The largest cottage rental services are '''Lomarengas''' [http://www.lomarengas.fi] and '''Nettimökki''' [http://www.nettimokki.com], both of which have English interfaces.\n\nVirtually every lodging in Finland includes a sauna (''see box'') for guests &mdash; don't miss it!  Check operating hours though, as they're often only heated in the evenings and there may be separate shifts of men and women.\n\n==Learn==\nFinland's universities are generally well-regarded and offer many exchange programs, but the high cost of living and the prospect of facing the long, cold Finnish winter mean that the country is not a particularly popular choice.  However, there are '''no tuition fees''' for regular degree students, including international exchange students from EU/EEA. While lectures are usually conducted in Finnish, most universities offer the option to complete all courses through assignments and exams in English. Many universities also offer the option to study Finnish at various levels.\n\nAfter long political debate, students originating outside EU/EEA area became subject to tuition fees in 2017. However, every university must have a 'tuition fee grants' available and actually there are no more than few tens of students in Finland paying their fee from their own pocket. To the numbers of foreign applicants this change, of course, affected negatively.\n\nA reasonable monthly budget (excluding rent!) would be €600 to €900. Rents vary depending on location such that in Greater Helsinki and particularly Helsinki proper prices may be two times that of cheaper locations or student housing. Many exchange programs fully or partly subsidize accommodation in student dorms. However, the state does not provide student accommodation and dorms are usually owned by foundations. \n\nStudent union membership at around €90-100/year is obligatory for students of 'proper' universities but not for students of universities of applied sciences. Student union membership includes unlimited access to student health services (YTHS). So far YTHS is available only for undergraduate students of 'proper' universities.\n\nEU citizens can simply enter the country and register as a student after arrival, while students from elsewhere will need to arrange their residence permit beforehand. CIMO [http://www.cimo.fi] (Centre for International Mobility) administers exchange programs and can arrange scholarships and traineeships in Finland, while the Finnish National Board of Education [http://www.edu.fi] offers basic information about study opportunities.\n\n==Work==\nThere is little informal work to be found and most jobs require at least a remedial level of Finnish.  Citizens of European Union countries can work freely in Finland, but acquiring a work permit from outside the EU means doing battle with the infamous Directorate of Immigration (''Maahanmuuttovirasto'') [http://www.migri.fi/netcomm/Default.asp?language=EN].  However, students permitted to study full-time in Finland ''are'' allowed work part-time (up to 25 h/week) or even full-time during holiday periods.\n\nFor jobs, you might want to check out the Ministry of Labour [http://www.mol.fi].  Most of the posted jobs are described in Finnish so you may need some help in translation, but some jobs are in English.\n\nA rapidly growing trend in Finland, especially for the younger generation, is to work for placement agencies. Although there has been a massive surge of public companies going private in the last ten years, this trend seems to be fueled by the increased demand for more flexible work schedules as well as the freedom to work seasonally or sporadically. Due to the nature of these types of agencies as well as the types of work they provide, it is common for them to hire non-Finns. Some agencies include Adecco, Staff Point, Manpower, Aaltovoima and Biisoni.\n\nIf you are invited to a job interview, remember that modesty is a virtue in Finland. Finns appreciate facts and directness, so stay on topic and be truthful. Exaggeration and bragging is usually associated with lying.  You can check expected salaries with the union for your field, as they usually have defined minimum wages.  Salaries range from €1,200 - €6,500 per month (2010).\n\n==Stay safe==\n{{infobox|[[Risks]] in Finland|\nCrime/violence: '''Low'''<br>\n<small>Most violence is alcohol-related and/or domestic – walking in the street is usually safe even in the night</small><br>\nAuthorities/corruption: '''Low'''<br>\n<small>The police are generally courteous and speak some English, offering bribes will get you into serious trouble.</small><br>\nTransportation: '''Low''' to '''Moderate'''<br>\n<small>Icy roads and sidewalks in the winter, mooses and other animals occasionally crossing the roads</small><br>\nHealth: '''Low'''<br>\n<small>Tick and mosquito bites</small><br>\nNature: '''Low''' to '''Moderate'''<br>\n<small>Blizzards in the winter, getting lost when hiking in the forests</small>\n}}\n===Crime===\nFinland enjoys a comparatively low crime rate and is, generally, a very safe place to travel. Use common sense at night, particularly on Friday and Saturday when the youth of Finland hit the streets to get drunk and in some unfortunate cases look for trouble. The easiest way to get beaten up is to pay a visit at a grill kiosk after bars and pubs have closed, and start arguing with drunk people. It is, anyway statistically more likely that your home country is less safe than Finland, so heed whatever warnings you would do in your own country and you will have no worries.  If you yourself having a run in with the law, remember that Finland is one of the world's least corrupt countries and you will not be able to buy yourself out of trouble. Finnish police never require a cash payment of fines which it gives. Do not ever give money to person who presents him/herself as a police officer. An obvious way to stay out of most kinds of trouble is to stay sober and act businesslike, when dealing with police, security or the like. \n\n'''Racism''' is a generally of minor concern, especially in the cosmopolitan major cities, but there have been a few rare but highly publicised incidents of Black, Romani & Arab people getting beaten up, attacks against immigrants and group fights with native Finns & immigrants. Sometimes there might be group fights where immigrants do their part as well, but that's very uncommon. The average visitor, though, is highly unlikely to encounter any problems.\n\n'''Pickpockets''' are rare, but not unheard of, especially in the busy tourist months in the summer and almost always done by foreigners.  Most Finns carry their wallets in their pockets or purses and feel quite safe while doing it.  Parents often leave their sleeping babies in their pram on the street while visiting a shop, and in the countryside; cars and front doors are often left unlocked. On the other hand, you have to be careful if you buy or rent a bicycle. Bicycle thieves are ubiquitous, never leave your bike unlocked even for a minute.\n\n===In case of emergency===\n'''112''' is the national phone number for all emergency services, including police, and it does not require an area code, regardless of what kind of phone you're using. The number works on any mobile phone, whether it is keylocked or not, and with or without a SIM card. If a cellphone challenges you with a PIN code, you can simply type in 112 as a PIN code - most phones will give a choice to call the number. This is not possible with all phones!\n\nFor inquiries about poisons or toxins (from mushrooms, plants, medicine or other chemicals) call the national Toxin Information Office at (09) 471 977.\n\nAt sea, the maritime search and rescue number is 0294 1000.\n\n==Stay healthy==\n{{infobox|Signs to watch out for|\n; vaara, vaarallinen : danger, dangerous\n; sortumisvaara : risk of avalanche/landslide/mudslide\n; hirvivaara : risk of moose/elks on the road\n; hengenvaara : life threatening danger\n; tulipalo : fire\n; kielletty : prohibited\n; pääsy kielletty or privat: no entry\n; hätäuloskäynti or hätäpoistumistie : emergency exit\n; lääkäri : doctor\n; poliisi : police\n; sairaala : hospital\n; apua! : help!\n}}\nYou're unlikely to have stomach troubles in Finland, since tap water is always drinkable (and generally quite tasty as well), and hygiene standards in restaurants are strict. If you have any sort of allergies, many restaurants often display in the menu the most common ingredients that people typically are allergic to. Examples: (L) = Lactose free, (VL) = Low Lactose, (G) = Gluten free, if you are unsure just ask the waitress or restaurant staff. \n\nThere are few serious health risks in Finland. Finland is a sparsely populated country and, if heading out into the wilderness, it is imperative that you register your travel plans with somebody who can inform rescue services if you fail to return. Always keep your mobile phone with you if you run into trouble. Always keep a printed map, a mechanical compass and preferably a GPS with you while trekking in the wilderness! Take extra precautions in Lapland, where it can be several days' hike to the nearest house or road.\n\nYour primary enemy especially in wintertime will be the '''cold''', particularly if in Lapland where temperatures close to -30°C ''are'' common. Dress warmly in layers. Windy weather makes exposed skin quickly prone to '''frostbites''' even if you are at downtown Helsinki. In the springtime if you plan to spend whole days outdoors bring along a good pair of sunglasses to prevent '''snow blindness''', a painful eye injury caused by the UV-light reflected from the snow. For the same reason '''sunburns''' may occur surprisingly early at spring. Weather can change rapidly, and even though the sun is shining now, you can have a medium sized blizzard on your hands (no joke!) an hour or two later.\n\nGiven the size of the Finnish population, a surprisingly high number of people drown in the lakes every year in summer. As pointed out by an annual public awareness campaign (partly Finnish black humor, partly the truth), the stereotypical accident involves an intoxicated fisherman who capsizes his boat while standing up to pee. If out on the lakes and sea, remember that wind and water will cool you faster than cold air, and keeping dry means keeping warm. A person that falls into cold water (close to zero °C) can die in a few minutes. Safety in '''small boats''': Don't drink alcohol, wear a life vest at all times, if your boat capsizes - keep clothes on to stay warm, cling to the boat if possible and swim only if shore is a few hundred meters away. Keep in mind that Finnish natural waters are never truly warm.\n\nIn winter, rivers, lakes and the sea are frozen. Walking, skating or even driving a car on the ice is commonly seen, but fatal accidents aren't unheard of either, so ask and heed local advice. If the ice fails, getting back out of the water is extremely difficult, as the ice will be slippery. If you wish to move on ice, small ice picks are sold as safety equipment in sport stores.\n\nFinland hosts a number of irritating insects, but if you are planning to stay in the centres of major cities, you are unlikely to encounter them. A serious nuisance in summer are '''[[mosquito]]es''' (''hyttynen''), hordes of which inhabit Finland (particularly Lapland) in summer.  While they carry no malaria or other nasty diseases, mosquitoes make a distinctive (and highly irritating) whining sound while tracking their prey, and their bites are very itchy.  As usual, mosquitoes are most active around dawn and sunset &ndash; which, in the land of the Midnight Sun, may mean most of the night in summer. There are many different types of mosquito repellents available which can be bought from almost any shop. \n\nAnother summer nuisance include '''gadflies''' (''paarma''), whose bites can leave a mark lasting even for a month and in the north '''blackflies''' (''mäkärä''), small blood thirsty flies that occur often in hordes of millions of individuals. Unlike mosquitoes or gadflies the blackflies tend to crawl under the clothing and the bite may cause local inflammation. A more recent introduction to Finnish summers are '''deer keds''' (''hirvikärpänen''), that can be particularly nasty if they manage to shed their wings and burrow into hair. The deer ked is a parasite of the moose and rarely bite humans but has become a nuisance in the forests in much of the country. Use mosquito repellent, ensure your tent has good mosquito netting and consider prophylaxis with ''cetirizine'' (brand names include ''Zyrtec'', ''Heinix'', ''Cetirizin Ratiopharm''), an anti-allergen that, if taken in advance, will neutralize your reaction to any bites. Topical anti-allergens in the form of gels and creams are also available as over-the-counter medication. A flea comb can be useful for removing deer keds.\n\n'''Ticks''' (''puutiainen'' or ''punkki'') are common in southern and central parts of the country, especially in [[Åland]], areas near [[Turku]]'s coast and archipelago, and the [[Lappeenranta]]-[[Parikkala]]-[[Imatra]]-axis. Ticks can transmit Lyme's disease (borreliosis) and viral encephalitis (TBE) through a bite. Although these incidents are relatively rare and not all ticks carry the disease, it's advisable to wear long trousers rather than shorts if you plan to walk through dense and/or tall grass areas. You can buy special tick tweezers from the pharmacy (''punkkipihdit'') which can be used to remove a tick safely if you happen to get bitten.  You should remove the tick from your skin as quickly as possible and preferably with the tick tweezers to reduce the risks of getting an infection. If the tick bite starts to form red rings on the skin around it or if you experience other symptoms relating to the bite, you should visit a doctor as soon as possible. In case of long-term stay (studying or working) on Åland, Turku archipelago or southeast coast anti-TBE vaccination is adviseable.\n\nMost important venomous insects in Finland include '''wasps''' (''ampiainen''), '''bees''' (''mehiläinen'') and '''bumblebees''' (''kimalainen''). Their stings can be painful, but are not dangerous, unless you receive several stings or if you are allergic to it.\n\nThe only venomous snake in Finland is the '''European adder''' (''kyy'' or ''kyykäärme''). It has a distinct zig-zag type of figure on its back, although some of them are almost completely black. Adder is common in rural areas and sometimes occur even on the streets like Kristianinkatu and Kamppi. The snake occurs across Finland all the way from the south to up north in Lapland. Although their bites are extremely rarely fatal (except for small children and allergic persons), one should be careful in the summertime especially when walking in the forests or on open fields at the countryside. Walk so that you make the ground vibrate and snakes will go away, they attack people only when somebody frightens them. If you are bitten by a snake, always get medical assistance. If you are planning to travel in the nature on summertime, it's advisable to buy a ''kyypakkaus'' (\"Adder pack\", a medicine set which contains a couple of hydrocortisone pills). It can be bought from any Finnish pharmacy. It is used to reduce the reactions after an adder bite, however it's still advisable to see a doctor even after you've taken the hydrocortisone pills. The ''kyypakkaus'' can also be used to relieve the pain, swelling and other allergic reactions caused by bee stings.\n\n'''Moose''' is by far the most dangerous animal in Finland as collisions between cars and mooses happen every day and cause several human fatalities every year. The risk is highest during the dusk and dawn. Encounters with '''brown bears''' (''karhu'') and '''grey wolves''' (''susi'') in the wilderness are extremely rare and both of these animals are listed as endangered species. The brown bear, which occurs across Finland, has been spotted on a few very exceptional occasions even in the edges of the largest Finnish cities, but normally bears try to avoid humans whenever possible. The brown bear hibernates during the winter. Packs of wolves occasionally attack domestic animals and hunting dogs on rural areas. The last recorded case of a human killed by a large predator in Finland was in the 1880's.\n\n==Respect==\n{{infobox|Fishing Finnish style|It was a beautiful summer day, and Virtanen and Lahtinen were in a little rowboat in the middle of a lake, fishing. Two hours passed, both men sitting quietly, and then Lahtinen said \"Nice weather today.\"  Virtanen grunted and stared intently at his fishing rod.<br><br>\nTwo more hours passed.  Lahtinen said, \"Gee, the fish aren't biting today.\"  Virtanen shot back: \"That's because you talk too much.\"<br><br>\n'''Drinking Finnish style'''<br>\nVirtanen and Lahtinen decided to go drinking at their lakeside cottage. For a couple hours, both men sat silently and emptied their bottles. After a few more hours, Lahtinen decided to break the ice: \"Isn't it nice to have some quality time?\" Virtanen glared at Lahtinen and answered: \"Are we here to drink or talk?\"}}\nFinns generally have a relaxed attitude towards manners, and a visitor is unlikely to offend them by accident. Common sense is quite enough in most situations, but there are a couple of things that one should keep in mind:\n\n* Finns are a famously '''taciturn''' people who have little time for small talk or social niceties, so don't expect to hear phrases like \"thank you\" or \"you're welcome\" too often. The Finnish language lacks a specific word for \"please\" so Finns sometimes forget to use it when speaking English, even when they don't mean to be rude. That being said, Finns are generally very helpful and polite, and glad to help confused tourists if asked.\n\n* The lack of niceties has more to do with the fact that in Finnish culture, '''honesty''' is highly regarded and that one should open one's mouth only to mean what one is about to say. Do not say \"maybe later\" when there is no later time to be expected. A visitor is unlikely to receive many compliments from Finns, but can be fairly sure that the compliments received are genuine. \n\n* Occasional silence is considered a part of the conversation, not a sign of hostility or irritation. '''Being loud''' in crowded places like public transport or a restaurant is considered rude. If you ever ended up to argue with someone, the social norm is to '''stay calm during an argument'''. Arguing loudly with a stranger is considered very rude.\n\n* '''Punctuality''' is a highly regarded virtue in Finland. A visitor should apologize even for being a few minutes late. Being late for longer usually requires a short explanation. 10 min is usually considered the threshold between being \"acceptably\" late and very late. Some will leave arranged meeting points after 15 min. With the advent of mobile phones, sending a text message even if you are only a few minutes late is nowadays a norm. Being late for a business meeting, even by 1 or 2 min, is considered rude.\n\n* The standard greeting is a '''handshake'''. Hugs are only exchanged between family members and close friends in some situations, kisses, even on the cheek, practically never. '''Personal space''' is important, and standing very near someone can make Finns feel uncomfortable.\n\n* If you are invited to a Finnish home, the only bad mistake visitors can make is not to '''remove their shoes'''. For much of the year, shoes will carry a lot of snow or mud. Therefore, it is customary to remove them, even during the summer, and not doing so is considered impolite. During the wet season you can ask to put your shoes somewhere to dry during your stay. Very formal occasions at private homes, such as baptisms (often conducted at home in Finland) or somebody's 50th birthday party, are exceptions to these rules. In the wintertime, this sometimes means that the guests bring separate clean shoes and put them on while leaving outdoor shoes to the hall. Bringing gifts such as pastry, wine, or flowers to the host is appreciated, but not required.\n\n* In Finland, there is little in the way of a '''dress code'''.  The general attire is casual and even in business meetings the attire is somewhat more relaxed than in some other countries.  Topless sunbathing is accepted but not very common on beaches in the summer, while going ''au naturel'' is common in lakeside saunas and dedicated nudist beaches.\n\n* Finnish society is '''egalitarian'''. Finnish women participate actively in the workforce and are well represented in leadership roles. Finnish language also does not distinguish between \"he\" and \"she\", which may lead to confusing errors. Signs of social rank such as official titles like ''Sir'' or ''Dr.'' are often not used, and it is very common for people to address their superiors like teachers or bosses informally, such as by first name. If you are someone's elder or superior and addressed in this fashion, it is not meant as a sign of disrespect.\n\n* Especially younger Finns usually speak excellent English, in part due to the policy of subtitling foreign language movies and TV series instead of dubbing them. However, picking up a few local words is also a good idea. Finnish is a hard language to master, but knowing a few words will definitely be received warmly. When interacting with Swedish-speaking Finns, knowing a few words of Swedish will be received very well.\n\n* The cultural region to which Finland belongs is correctly referred to as '''Nordic''' or '''North European'''. Finns do not generally consider themselves ''Scandinavian'' or ''East European'', and these usually refer to Finland's neighboring countries. While you won't really offend anyone if you use these terms, it might be considered ignorant or amusing if you do.\n\n* Finns are typically very interested in '''perceptions of Finland abroad''': an inside joke of sorts is the disproportionate feeling of pride when their small country is mentioned abroad, even for something minuscule (''Suomi mainittu, torille!'' or ''Finland's been mentioned, to the town square!''). It is good to keep in mind that Finns will often listen to your opinion of them ''very'' carefully.\n\n* Even though it is unlikely that you'll seriously offend anybody, '''certain topics of discussion''' can sometimes be slightly sensitive.  Although once a part of the Russian Empire, Finland fought against the Soviet Union in WWII and has remained unaligned since the Cold War, and referring to Finland as belonging to the Russian sphere of influence most likely won't be appreciated. A majority of Finnish men still serve for some time in the Finnish armed forces, and expressing strong views on the military or on wartime history can sometimes stir up emotions. Finnish war veterans from World War II are highly respected and considered honorary citizens in Finnish society.\n\n* '''Jokes''' about characteristic Finnish domestic problems should only be made only if you know they will be received well. Finns tend to have a pretty sarcastic and self-critical sense of humour, and jokes about high rates of depression, suicide and alcoholism may be common. However, it is nonetheless good to remember that these are serious social problems that cause misery to many people and their loved ones.\n\n==Contact==\n\n===By mail===\nFinland's mail service, run by [http://www.posti.fi/private/ Posti], is fast, reliable and pricy.  A postcard to Finland and anywhere in the world costs €1.\n\n===By phone===\n[[Image:02032008(022).jpg|thumb|Not many of these left]]\n\nAs you'd expect from Nokia's home country, mobile phones are ubiquitous in Finland.  GSM, WCDMA(3G) and LTE (4G) networks blanket all of the country, although it's still possible to find wilderness areas with poor signal, typically in Lapland and the outer archipelago. The largest operators are '''Telia''' [https://www.telia.fi/] and '''Elisa''' [http://www.elisa.fi], a Vodafone partner, but travellers who want a local number may wish to opt for '''DNA''''s [http://www.dna.fi/] Prepaid package, which can cost as little as €6. Ask at any convenience store/R-Kioski for a list of prices and special offers.\n\nPublic telephones are close to extinction in Finland, although a few can still be found at airports, major train/bus stations and the like. It's best to bring along a phone or buy one - a simple GSM model can cost less than €20.\n\n===By net===\n'''Internet cafes are sparse''' on the ground in this country where everybody logs on at home and in the office. In addition most Finnish mobile phone subscriptions include unlimited Internet access and therefore almost everyone has mobile Internet in their phone. However nearly every '''public library''' in the country has free Internet access, although you will often have to register for a time slot in advance or queue.  Wifi hotspots are also increasingly common in public places and bars. E.g. Elisa offers prepaid internet access.\n\n[[ar:فنلندا]]\n[[ca:Finlàndia]]\n[[de:Finnland]]\n[[eo:Finnlando]]\n[[es:Finlandia]]\n[[fi:Suomi]]\n[[fr:Finlande]]\n[[hu:Finnország]]\n[[it:Finlandia]]\n[[ja:フィンランド]]\n[[nl:Finland]]\n[[pl:Finlandia]]\n[[pt:Finlândia]]\n[[ro:Finlanda]]\n[[ru:Финляндия]]\n[[sv:Finland]]\n[[wts:Category:Finland]]\n\n\n[[World66:europe/finland]]\n[[wtp:Helsinki]]\n\n{{related|Finland_in_ten_days_by_car}}\n\n{{isPartOf|Scandinavia}}\n{{guidecountry}}\n{{countryguide}}"
        }
    }
}