{
    "parse": {
        "title": "Germany",
        "pageid": 429,
        "wikitext": {
            "*": "{{pagebanner|Germany banner.jpg}}\n\n{{quickbar\n| location=Germany in its region.svg\n| flag=Flag of Germany.svg\n| capital=Berlin\n| government=Federal Republic\n| currency=Euro (€)\n| area=357,022km²<br>''water: 8,350km²<br>land: 348,672km²''\n| population= 82,670,000 (2016 estimate)\n| language=[[German]]\n| electricity=230V,50Hz (Europlug, Type F, & Schuko plugs) \n| callingcode=+49\n| tld=.de\n| timezone=UTC +1\n| emergencies=dial '''112'''\n}}\n   \n[http://www.germany-tourism.de/ '''Germany'''], (officially: the Federal Republic of Germany; [[German]]: ''Bundesrepublik Deutschland'') is the largest country in [[Central Europe]]. It is bordered to the north by [[Denmark]], to the east by [[Poland]] and the [[Czech Republic]], to the south by [[Austria]] and [[Switzerland]], and to the west by [[France]], [[Luxembourg]], [[Belgium]] and the [[Netherlands]]. Germany is a federation of 16 states, roughly corresponding to regions with their own distinct and unique cultures. \n\nGermany is one of the most influential European nations culturally, and one of the world's main economic powers. Known around the world for its precision engineering and high-tech products, it is equally admired by visitors for its old-world charm and \"Gemütlichkeit\" (coziness). If you have perceptions of Germany as simply homogeneous, it will surprise you with its many historical regions and local diversity.\n\n==Understand==\n\n=== History ===\n[[Image:Burg_Eisenhardt.jpg|thumb|upright=1.3|Eisenhardt Castle in Belzig ([[Brandenburg]])]]\n[[Image:Berlin Brandenburger Tor Nacht.jpg|thumb|Brandenburger Tor]]\n====From the Holy Roman Empire to Imperial Germany====\nThe roots of German history and culture date back to the Germanic tribes and after that to the Holy Roman Empire. Since the early middle ages, Germany started to split into hundreds of small states. It was the Napoleonic wars that started the process of unification, which ended in 1871, when a large number of previously independent German kingdoms united under Prussian leadership to form the German Empire (Deutsches Kaiserreich). This incarnation of Germany reached eastward all the way to modern day [[Klaipeda]] (Memel) in [[Lithuania]] and also encompassed the regions of [[Alsace]] and [[Lorraine]] in modern day-France, a small portion of eastern Belgium (Eupen-Malmedy), a small border region in southern Denmark and over 40% of contemporary Poland. The empire ended in 1918 when Kaiser Wilhelm II was forced to abdicate at the time of Germany's defeat at the end of World War I (1914-1918) and was followed by the short-lived and ill-fated so called Weimar Republic, which tried in vain to completely establish a liberal, progressive and democratic nation. Due to the fact the young republic was plagued with massive economic problems stemming from the war, such as: the hyperinflation crisis from 1921-23, the reparations payments owed as a result of losing the war, along with the cultural disgrace of a humiliating defeat in World War I, political extremists from both the left and the right took advantage of the inherent organizational problems of the Weimar Constitution, leading to the Nazi Party led by Adolf Hitler seizing power in 1933.\n\n====Hitler and Nazi Germany====\nThe year 1933 witnessed the rise to power of the far-right nationalistic ''National Socialist German Workers' (Nazi) Party'' under the leadership of the Führer, Adolf Hitler. Under the Nazi dictatorship, democratic institutions were dismantled and a police state was installed. Jews, Slavs, Gypsies, homosexuals, disabled people, socialists, Communists, unionists and other groups not fitting into the Nazis' vision of a Greater Germany faced persecution, while the Jews and Gypsies were marked for total extermination. Hitler's militaristic ambitions to create a new German Empire in Central and Eastern Europe led to war, successively, with Poland, France, the United Kingdom, the Soviet Union and the United States - despite initial dazzling successes, Germany was unable to withstand the attacks of the Allies and Soviets on two fronts in addition to a smaller third front to the south of the Alps in Italy.\n\nIt was \"Stunde Null\" or zero hour. Germany and much of Europe was destroyed. By April of 1945, Germany was in ruins with most major cities bombed to the ground. The reputation of Germany as an intellectual land of freedom and high culture (''Land der Dichter und Denker'') had been decimated and tarnished for decades to come. At the end of the war, by losing 25% of its territory, east of the newly Allied imposed Oder-Neisse frontier with Poland the occupied country was faced with a major refugee crisis with well over 10,000,000 Germans flooding westward into what remained of Germany. Following the end of the war, at the Potsdam conference; the Allies decided the future of Germany's borders and taking a Soviet lead stripped her of the traditional eastern Prussian lands. Therefore, Germans living east of the rivers Oder and Neisse were forcibly expelled into the truncated Germany by the Soviet and Polish Governments. In response to Hitler's atrocities and those committed by Germans during the war, ethnic Germans were deported to Germany from the former eastern European territories and satellites of Nazi Germany in Hungary, Czechoslovakia, Romania and Yugoslavia.\n\n====Post-World War II====\nAfter the devastating defeat in World War II (1939-1945), Germany was divided into four sectors, controlled by the French, British, American and Soviet forces. The United Kingdom and the United States decided to merge their sectors, followed by the French. Silesia, Pomerania and the southern part of East Prussia came under Polish administration according to the international agreement of the allies. With the beginning of the Cold War, the remaining central and western parts of the country were divided into an eastern part under Soviet control, and a western part which was controlled directly by the Western Allies. The western part was transformed into the ''Federal Republic of Germany (FRG)'', also known as \"West Germany\", a democratic nation with [[Bonn]] as the provisional capital city, while the Soviet-controlled zone became the communist ''German Democratic Republic (GDR)''; also known as \"East Germany\". Berlin had a special status as it was divided among the Soviets and the West, with the eastern part featuring as the capital of the GDR. The western sectors of Berlin (West Berlin), was ''de facto'' an exclave of the FRG, but formally governed by the Western Allies. On 13 August 1961, the ''Berlin Wall'' was erected as part of a heavily guarded frontier system of border fortifications. As a result, between 100 and 200 Germans trying to escape from the Communist dictatorship were murdered here in the following years. \n\nIn the late-1960s, a sincere and strong desire to confront the Nazi past came into being. Students' protests beginning in 1968 successfully clamoured for a new Germany. The society became much more liberal, and the totalitarian past was dealt with more unconcealed than ever before since the establishment of the FRG in 1949. Post-war education had helped put Germany among countries in Europe with less people pursuing fascist beliefs or ideals. Willy Brandt became Chancellor in 1969. He made an important contribution towards reconciliation between Germany and the communist states including important peace gestures toward Poland.\n\n====Reunification and the Berlin Republic====\nGermany was reunited peacefully in 1990, a year after the fall and collapse of the Berlin Wall and the opening of the Iron Curtain that separated German families by the barrel of a gun for nearly three decades. The re-established eastern states joined the Federal Republic of Germany on 3 October 1990, a day which is since celebrated as the national holiday, German Unification Day (''Tag der Deutschen Einheit''). Together with the reunification, the last post-war limitations to Germany's sovereignty were removed and the US, UK, France and most importantly, the Soviet Union gave their approval. The German parliament, the ''Bundestag'', after much controversial debate, finally agreed to comply with the eastern border of the former GDR, also known as the \"Oder-Neisse-Line\", thus shaping FRG the way it can be found on Europe's map today.\n\n===Economy===\nGermany is an economic powerhouse boasting the largest economy of Europe, and is in spite of its relatively small population the second largest country of the world in terms of exports.\n\nThe financial centre of Germany and continental Europe is [[Frankfurt am Main]], and it can also be considered one of the most important air traffic hubs in Europe, with Germany's flag carrier Lufthansa known for being not just a carrier, but rather a prestigious brand, though its glamour has faded somewhat during recent years. Frankfurt features an impressive skyline with many high-rise buildings, quite unusual for [[Central Europe]]; this circumstance has led to the city being nicknamed \"Mainhattan\". It is also the home of the European Central Bank (ECB), making it the centre of the Euro, the supra-national currency used throughout the European Union. Frankfurt Rhein-Main International Airport is the largest airport of the country, while the Frankfurt Stock Exchange (FSE) is the most important stock exchange in Germany.\n\n===Politics===\n[[File:Reichstag Berlin-Tiergarten.jpg|thumb|Reichstag-building in Berlin-Tiergarten]]\nGermany is a federal republic, consisting of 16 states or German Federal Lands (''Bundesländer''). The federal parliament (''Bundestag'') is elected every four years in a fairly complicated system, involving both direct and proportional representation. A party will be represented in Parliament if it can gather at least 5% of all votes or at least 3 directly won seats. The parliament elects the Federal Chancellor (''Bundeskanzler'', currently Angela Merkel) in its first session, who serves as the head of the government. There is no restriction regarding re-election. The 'Bundesländer' are represented at the federal level through the Federal Council (''Bundesrat''). Many federal laws have to be approved by the council. This can lead to situations where Council and Parliament are blocking each other if they are dominated by different parties. On the other hand, if both are dominated by the same party with strong party discipline (which is usually the case), its leader has the opportunity to rule rather heavy handedly, the only federal power being allowed to intervene being the Federal Constitutional Court (''Bundesverfassungsgericht'').\n \nThe formal head of state is the Federal President (''Bundespräsident''), who is not involved in day-to-day politics and has mainly ceremonial and representative duties. He can also suspend the parliament, but all executive power is vested with the chancellor and the Federal Cabinet (''Bundesregierung''). The President of Germany is elected every five years by a specially convened national assembly, and is restricted to serving a maximum of two five year terms.\n\nThe two largest parties are centre right CDU ('Christlich Demokratische Union', Christian Democratic Party) and centre-left SPD ('Sozialdemokratische Partei Deutschlands', Social Democratic Party). Due to the proportional voting system, smaller parties are also represented in parliament. Medium-sized parties of importance are centre-right CSU ('Christlich Soziale Union', Christian Social Party, the most important party in Bavaria which collaborates at the federal level with the CDU), liberal FDP ('Freie Demokratische Partei', Free Democratic Party), the Green party ('B&uuml;ndnis 90/Die Gr&uuml;nen'), the Left Party ('Die Linke', a socialist party with significant strength in East Germany), and the Alternative for Germany ('Alternative für Deutschland', AfD), a Eurosceptic, right-wing German nationalist party. There have been some attempts by right-wing parties (NPD - National Democratic Party / REP - Republicans) to get into parliament, but so far they have failed the 5% requirement (except in Mecklenburg-Western Pomerania and Saxony); other far-left parties (MLPD - Marxist-Leninist Party / DKP - German Communist Party) virtually only have minimal influence on administrative levels below state parliaments.\n\n===Culture===\nBeing a federal republic, Germany is very much a decentralised country, which embraces the cultural differences between the regions. Some travellers will perhaps only think of beer, lederhosen and Oktoberfest when Germany is mentioned, but Germany's famous alpine and beer culture is mostly focused around [[Bavaria]] and [[Munich]]. Here the beer is traditionally served in 1 litre mugs (normally not in pubs and restaurants, though). The annual Oktoberfest is Europe's most visited festival and the world's largest fair. Germany's south-western regions, however, are well known for their wine growing areas (e.g. Rheinhessen and [[Rhineland-Palatinate|Palatinate]]) and Bad Dürkheim on the 'German Wine Route' (''Deutsche Weinstraße'') organises the biggest wine festival worldwide with over 600,000 visitors annually.\n\nThe fall of the Berlin Wall in 1989 and the subsequent German Reunification in 1990 are the most significant events of recent German history. Today, most Germans as well as their neighbours support the idea of a peaceful reunified Germany and while the eastern regions still suffer from social inequality, higher levels of unemployment and from brain drain, the reunification process is overall seen as a success. 3 October is celebrated as \"German Unification Day\".\n\nCars are a symbol of national pride and social status in Germany, like in many other countries. Certainly manufacturers such as Audi, BMW, Mercedes-Benz, Porsche and Volkswagen are internationally reknowned for their quality, safety, success and style. This quality is matched by Germany's excellent network of roadways including the renowned ''Autobahn'' network, which has many sections without speed limits that attract speed hungry drivers. There are actually speed tourists who come to Germany just to hire an exotic sports car and race down the autobahn. Amazingly for its size, Germany is home to the sixth-largest motorway network in the world. Germany also features an extensive network of high-speed trains - the InterCityExpress (''ICE'').\n\nMost cities have a vibrant gay and lesbian scene, especially [[Berlin]] and [[Cologne]]. The Berlin tourism agency and other tourism organisations have started campaigns to attract LGBT travellers to their cities. In fact, some politicians (e.g. a former governing mayor of Berlin and the former German federal foreign minister) and stars in Germany are either homosexual or bisexual.\n\nGermans are generally friendly people, although the stereotype that they can be stern and cold is sometimes true. Just be polite and proper and you'll be fine.\n\nGermany hosted the [[World Cup 2006|FIFA World Cup 2006]], and won the 2014 FIFA World Cup Final against Argentina in Rio De Janeiro, Brazil.\n\n===Electricity===\nThe power supply runs at 230V/50Hz. Almost all outlets use the [[:wikipedia:Schuko|Schuko]] plug, most appliances have a thinner but compatible [[:wikipedia:Europlug|Europlug]]. Adapters for other plugs are widely available in electronics stores.\n\n==Regions==\nGermany is a federal republic consisting of 16 states (called \"Bundesländer\" or shortened to \"Länder\" in German). Three of the ''Bundesländer'' are actually city-states: Berlin, Bremen, and Hamburg.  The states can be roughly grouped by geography as listed below.\n\n{{Regionlist\n| regionmap=Germany_Regions_02.png\n| regionmaptext=Regions of Germany\n| regionmapsize=350px\n\n| region1name=[[Northern Germany]]\n| region1color=#6ca26c\n| region1items=[[Bremen]], [[Hamburg]], [[Lower Saxony]], [[Mecklenburg-Western Pomerania]], [[Schleswig-Holstein]]\n| region1description=Wind-swept hills and the popular vacation destinations of the North Sea and Baltic Sea coasts.\n\n| region2name=[[Western Germany]]\n| region2color=#cbcc51\n| region2items=[[North Rhine-Westphalia]], [[Rhineland-Palatinate]], [[Saarland]]\n| region2description=Wine country, modern cities and a history of heavy industry sharply cut by the breathtaking [[Rhine Valley]] and Moselle valley.\n\n| region3name=[[Central Germany]]\n| region3color=#8e6c96\n| region3items=[[Hesse]], [[Thuringia]]\n| region3description=The green heart of Germany, with some of the most important historical and financial cities and the ancient Thuringian Forest.\n\n| region4name=[[Eastern Germany]]\n| region4color=#b17373\n| region4items=[[Berlin]], [[Brandenburg]], [[Saxony]], [[Saxony-Anhalt]]\n| region4description=highlighted by the eccentric and historic capital Berlin, and rebuilt historic Dresden, \"Florence on the Elbe\".\n\n| region5name=[[Southern Germany]]\n| region5color=#80afdc\n| region5items=[[Baden-Württemberg]], [[Bavaria]]\n| region5description=Black Forest, Franconian Switzerland, Franconian Lake District, Bavarian Forest, Bavarian Alps and Lake Constance.\n}}\n\n==Cities==\n[[Image:BrandenburgerTor.JPG|thumb|Brandenburg gate in Berlin]]\n[[Image:HBamPlatzl.jpg|thumb|Hofbräuhaus in Munich]]\n[[Image:Dresden-Semperoper.jpg|thumb|Semperoper in Dresden]]\n[[Image:Nürnberg_panorama.jpg|thumb|Nuremberg old town, view from west]] \n[[Image:Kölner Dom nachts 2013.jpg|thumb|Cathedral of Cologne]]\nGermany has numerous cities of interest to travellers; here are just '''ten''' of the most famous:\n<!-- IMPORTANT!!!!! Please do not add any German cities in this top listing without discussion on the talk page, smaller places go into the subdirectories in the country section -->\n*[[Berlin]] — the reunified and re-invigorated capital of Germany; known for its division during the Cold War by the Berlin Wall. Today, it's a metropolis of diversity with plenty of nightclubs, elegant shops, galleries and restaurants\n*[[Bremen]] — one of the most important cities in northern Germany, its old town is a slice of hanseatic history\n*[[Cologne]] — city founded by the Romans 2000 years ago with a huge cathedral, Romanesque churches, and archaeological sites\n*[[Dortmund]] — former Steel and Beer City is today famous for football, industry culture, shopping and the biggest Christmas market in Germany.\n*[[Dresden]] — once called 'Florence on the Elbe' and world-famous for its Frauenkirche and rebuilt historic centre destroyed during World War II \n*[[Düsseldorf]] — Germany's capital of fashion also offers fascinating new architecture and a vibrant nightlife\n*[[Frankfurt]] — seat of the European Central Bank (ECB), with a skyline reminiscent of Manhattan (''\"Mainhattan\"'') \n*[[Hamburg]] — Germany's second-largest city is famous for its harbour, its liberal and tolerant culture, and the Reeperbahn with its nightclubs and casinos \n*[[Munich]] — Bavaria's capital and economic powerhouse combines high tech with fine arts, world class shopping, a vibrant nightlife and the [[Munich#Festivals|Oktoberfest]], and is the gateway to the Alps\n*[[Nuremberg]]'s old town has been reconstructed, including the Gothic Kaiserburg Castle. Visit the Nazi party rally grounds, the Documentation Centre and Courtroom 600 (the venue of the Nuremberg Trials)\n\n==Other destinations==\n[[Image:Munster(GER) university.jpg|thumb|Castle of Münster (today used by the University)]]\n* [[Baltic Sea Coast]] ''(Ostseeküste)'' — miles of sandy beaches and resorts with picturesque islands such as Rügen.\n* [[Bavarian Alps]] ''(Bayerische Alpen)'' — home to the world famous [[Füssen#See|Neuschwanstein Castle]], and Germany's best skiing and snowboarding resorts. Endless hiking and mountain biking. Passion Play village Oberammergau.\n* [[Black Forest]] ''(Schwarzwald)'' — a region with wide mountain peaks, panoramic views, it is a heaven for tourists and hikers.\n* [[East Frisian Islands]] ''(Ostfriesische Inseln)'' — twelve islands in the Wadden Sea; Borkum is the largest island by both area and population.\n* [[Franconian Switzerland]] ''(Fränkische Schweiz)'' — one of the oldest travel destinations in Germany, it was called by Romantic artists who said its landscape was of the aesthetic beauty of Switzerland's. Although the scenery is similar like in Switzeland, the prices are the opposit. Because the \"Fränkische Schweiz\" is one of the most inexpensive parts of Germany.\n* [[Harz]] — a low mountain range in the Central Uplands of Germany, famous for its historic silver mines and for the scenic towns of [[Quedlinburg]], [[Goslar]] and [[Wernigerode]].\n* [[Lake Constance]] ''(Bodensee)'' — an extremely beautiful corner of Central Europe, it boasts water sports and beautiful towns and villages to be seen by the visitor.\n* [[Middle Rhine Valley]] ''(Mittelrheintal)'' — part of the [[Rhine]] River is a UNESCO Heritage Site between [[Bingen]] / [[Rüdesheim]] and [[Koblenz]] and famous for its wines.\n* [[Romantic Road]] ''(Romantische Straße)'' — a theme route over 400 km in length in southern Germany that passes by many historical castles, between [[Würzburg]] and [[Füssen]]. Old World Europe alive and well!\n\n==Get in==\n\n===Entry requirements===\n{{Schengen}}\nRecognised refugees and stateless persons in possession of a valid travel document issued by the government of any one of the above countries/territories (eg. Canada) are exempt from obtaining a visa for Germany (but '''not''' for any other Schengen country, except [[Hungary]] and, for refugees, [[Slovakia]]) for a maximum stay of 90 days in a 180-day period).\n\nCitizens of Australia, Canada, Israel, Japan, New Zealand, South Korea and the United States of America are eligible to obtain a residence permit, or ''Aufenthaltstitel'' (authorising a stay of more than 90 days and permission to work), from the ''Ausländerbehörde'' (Foreigners' Office) after arrival in Germany, but before the end of the initial 90-day period of visa-free entry. Before obtaining such a residence permit, they are not allowed to work, with the exception some specific occupations (like artists, etc.). Honduran, Monegasque, and Sanmarinese nationals can also obtain such a permit, but only if they will not work on the residence permit. Other foreign nationals will need to obtain a visa before if they intend to stay in Germany for longer than the 90 days period, even if they are visa-free for that period for a stay in the Schengen area, or if they intend to work. \n\nAuthorized members of the US military need to possess only a copy of their duty orders (NATO Travel Order) and their ID card to be authorized entry into Germany (EU citizens, this including soldiers, are allowed to enter the country in any case). The passport requirement, though, applies to spouses and dependents of military personnel, and they must obtain a stamp in their passports to show that they are sponsored by a person in Germany under the Status of Forces Agreement.\n\nThere are no land border controls, making travel between Germany and other Schengen states easier with the accession of Switzerland to the Schengen area in 2008. However, the German federal and state police is known to have plain-clothes officers asking travellers for their ID especially on the border between Bavaria and Austria and and Bavaria and the Czech Republic. Ethnic profiling is prohibited to those officers, but they are well allowed to pick persons they check on other circumstances (general apperance, age, mode and route of travel, type of baggage). Once you are legal, and cooperate, you normally would not expect more than a check of your personal data against a database, polite thanks, and some wish for a pleasant stay. If you feel discriminated, you have the possibility to report the incident to the [http://www.antidiskriminierungsstelle.de/EN/Home/home_node.html federal anti-discrimination agency].\n\nThere are a number of ways to get into Germany. From neighbouring European countries, a drive with the car or a train ride are feasible; visitors from further away will probably be using air travel.\n\n===By plane===\n\n====Major airlines and airports====\nThe most important airports are [[Frankfurt]] ({{IATA|FRA}}), [[Munich]] ({{IATA|MUC}}) and [[Düsseldorf]] ({{IATA|DUS}}). \n\nAlso sizeable one´s are [[Berlin]]-Tegel ({{IATA|TXL}}), [[Cologne]] ({{IATA|CGN}}), [[Hamburg]] ({{IATA|HAM}}) and [[Stuttgart]] ({{IATA|STR}}) they serve some international flights as well.\n\nFrankfurt is Germany's main hub - one of Europe's four major hubs - and the destination of most intercontinental flights. Munich is a growing secondary hub. Travellers can easily fly in from most places of the world and then connect with Germany's biggest and most respected airline [http://www.lufthansa.com Lufthansa], which is a member of the [[Star Alliance]].\n\nThe airports of Frankfurt, Düsseldorf and Köln/Bonn are connected to the '''InterCityExpress''' high speed rail lines. The others all feature either a commuter rail station or some sort of connection to the nearest rail station as well as public transport to the central station of the respective cities. Lufthansa's passengers travelling from Frankfurt Airport have the option to check-in their luggage in Cologne, Düsseldorf or Stuttgart train stations and connect to the airport by ICE (AIRrailservice). If doing so, be sure to book the train journey like a Lufthansa connecting flight (ie in advance together with the flight), otherwise '''you''' will be responsible for a missed connection.\n\n====Budget travel and minor airlines====\nFlying can be the cheapest way to get to Germany and from there to other European countries, especially if the flights are booked well in advance. Before booking a budget flight, compare carefully as their destinations are often a bit off the track and after adding all the (baggage) fees, taxes, additional bus tickets to get to their airports, you might end up at even higher prices than you would pay for a discounted Lufthansa or Air Berlin ticket.\n\nThe major airports for budget travel are Berlin-Schönefeld ({{IATA|SXF}}), Frankfurt-Hahn ({{IATA|HHN}}) (130&nbsp;km to Frankfurt) and Weeze ({{IATA|NRN}}) (85&nbsp;km to Düsseldorf) as well as smaller airports with fewer choice of destinations like Lübeck  ({{IATA|LBC}}) (70 km to Hamburg) or Memmingen ({{IATA|FMM}}) (110&nbsp;km to Munich).\n\nThere are budget flights to almost every city in Europe from Germany. The major budget airlines in Germany are [http://www.easyjet.com/ easyJet], [http://www.ryanair.com Ryanair], [http://www.germanwings.com germanwings] (for flights within Germany, too) and [http://wizzair.com Wizz Air] (for flights to Eastern Europe) which all offer several connections to many countries throughout Europe. The main hubs are Berlin-Schönefeld and Dortmund for easyJet, Frankfurt-Hahn and Weeze for Ryanair, Cologne/Bonn and Stuttgart for germanwings  - all of these airlines serve other airports within Germany as well, but with a smaller choice of destinations. \n\nFor (budget) flights to European holiday destinations, for example round the Mediterranean, Germany's major carriers besides Air Berlin are [http://www12.condor.com/tcf-eu/index.jsp Condor (Thomas Cook)] (also for main tourist destinations throughout the world) and [http://www.tuifly.com TUIfly].\n\n[http://www.flygermania.de/gmi/ Germania], [http://www.intersky.biz/ InterSky] and [http://www.olt.de/index.php?id=8&L=1 OLT] have also a limited number of international destinations.\n\n===By train===\nRegular train services connect Germany with all neighbouring countries - most operated by [http://www.bahn.com/i/view/GBR/en/prices/onlineticket/onlineticket.shtml Deutsche Bahn] (DB). Almost all neighbouring countries (especially [[Switzerland]], [[Poland]], [[Denmark]], [[Czech Republic]] and [[Austria]]) and even some non-neighbouring countries (eg: [[Italy]]) are quite well connected with \"EuroCity\" (EC} trains. They are a little bit slower and slightly less comfortable than the European high speed trains but nevertheless reach up to 200 km/h. They are a worthwhile way to travel - not only for budget travellers (although budget airlines might be cheaper) or landscape viewers (especially the Rhine valley lines from Cologne to Mainz via Koblenz).\n\nThere are also several European high speed trains to cross into or get out of Germany:\n* The ''ICE'' brings you at 300km/h top speed from Frankfurt (3.3h), Cologne (2.5h) or Düsseldorf (2.3h) to [[Amsterdam]]. The train journey from Frankfurt to Paris (320km/h) using the ''ICE'' will take about four hours; going from Hamburg to Paris can take eight and a half hours. \n* The [http://www.thalys.de/ ''Thalys''] brings you from Cologne (''Köln'') to [[Paris]] in approximately 4h and to [[Brussels]] in about 2 hr.\n* The ''TGV'' brings you from [[Marseille]], [[Lyon]] and [[Strasbourg]] to Frankfurt and from Paris to Stuttgart and Munich. \n\nStandard rail fares are quite high, but there are a number of special fares and discounts available - see the \"Get Around\" section for more information. In particular, the [http://www.bahn.de/i/view/GBR/en/prices/germany/bahncard.shtml Bahncard] reduction applies for the whole journey as long as it starts or ends in Germany.\n\n===By boat===\n[[Image:HelsinkiTravemunde.JPG|thumb|View to the rear of a Finnlines ferry from Helsinki to Travemünde]]\nInternational ferry services exist, notably to [[Scandinavia]]. Some of the most popular connections are listed below:\n\n*[[Lübeck]] and [[Sassnitz]] are connected to [[Russia]]'s [[Kaliningrad]] and [[Saint Petersburg]]. Sassnitz is also connected to [[Rønne]] ([[Denmark]]), [[Riga]] ([[Latvia]]) and [[Trelleborg]] ([[Sweden]]).\n*[[Kiel]] has connections to [[Gothenburg]] (Sweden), [[Klaipeda]] ([[Lithuania]]), and [[Oslo]] ([[Norway]]).\n*[[Rostock]] has connections to [[Helsinki]] ([[Finland]]), [[Trelleborg]] (Sweden), [[Liepaja]] (Latvia), and [[Gedser]] (Denmark). \n*[[Travemuende]] has connections to [[Helsinki]] (Finland), [[Malmo]] (Sweden) and [[Trelleborg]] (Sweden).\n*[[Puttgarden]] is connected to [[Rødby]] (Denmark).\n\n===By bus===\n*Depending on the country your are leaving from towards Germany, different companies offer tickets. Eurolines, a cooperation of European bus companies, sells tickets to and from almost any other European country. The German partner is called [http://www.touring.de/index.php?id=3&L=1 Touring]. All other companies can be found on the German search engines for long distance bus tickets [http://www.busliniensuche.de/ busliniensuche.de].\n*Due to the large number of immigrants from the former Yugoslavia, every major bus company from those countries serves routes to (mostly Southern) Germany. From [[Bosnia and Herzegovina]] these include [http://www.salinea.net/red_voznje.asp Salinea], [http://www.prosicbus.com/redvoznje.htm Prosic] and [http://www.globtour.com Globtour]; from [[Croatia]] you can come with [http://www.cazmatrans.hr/njem-zg.html Čazmatrans] and from [[Serbia]] you can choose [http://www.panonijabus.com/en/index.php Panonijabus], [http://www.nis-ekspres.rs/ Niš-ekspres] and others. See also [[bus travel in the former Yugoslavia]].\n\n==Get around==\nGerman transportation runs with German efficiency, and getting around the country is a snap &mdash; although you'll need to pay top price for top speed. The most popular options by far are to [[#By car| '''rent a car''']], or [[#By train|'''take the train''']]. If the train is too expensive for you, travelling by arranged [[#Ride-sharing| '''ride-sharing''']] is often a viable alternative in Germany.\n\n===By plane===\nDomestic flights are mainly used for business, with the train being a simpler and often (but not always) cheaper alternative for other travel. The boom of budget airlines and increased competition has made some flight prices competitive with trains to some major cities. However make sure that you get to the right destination. Low-cost airlines (in particular Ryanair) are known for naming small airports in the middle of nowhere by cities 100km away (e.g. \"Frankfurt-Hahn\" is actually in [[Hahn]], over two hours away by bus from Frankfurt city).\n\nThe following carriers offer domestic flights within Germany:\n\n*[http://www.lufthansa.com '''Lufthansa'''] Germany's traditional flag carrier has cut down domestic and inner-european routes - keeping only those that feed its international hubs at Frankfurt, Munich and Düsseldorf and turning the rest of the domestic network over to its low-cost subsidaries Germanwings/Eurowings. Lufhansa is a member of the \"Star Alliance\", and still offers a few anemities that the discount carriers don't have.\n*  [http://www.germanwings.com '''germanwings/eurowings'''] (germanwings' operations are currently being taken over by '''eurowings''' and being rebranded) is Lufthansa's low-cost subsidary with an extensive domestic and european network. The carrier is not part of an alliance, but is integrated with Lufthansa's \"Miles and More\" program. The airline also offers \"premium\" fares which include access to Lufthansa's lounges.\n* '''Cirrus Airlines''' [http://www.cirrus-world.de] Focus on smaller business traveller routes within Germany and Europe. Close cooperation with Lufthansa on selected routes.\n* '''OLT''' [http://www.olt.de] Selected niche routes in Germany with base in Bremen, serving eg: Borkum and Helgoland.\n* '''InterSky''' [http://www.intersky.biz] Small but well-kept airline with few routes in Germany and Europe, based in Friedrichshafen (near Lake of Constance).\n\n===By train===\nGermany offers a fast and, if booked in advance, affordable railway system that reaches most parts of the country. Unless you travel by car, rail is likely to be your major mode of transport. Crossing Germany from [[Munich]] in the south to [[Hamburg]] in the north will usually take around 6h, while driving by car will take around 8h.\n\nAlmost all long-distance and many regional trains are operated by '''Deutsche Bahn''' (\"German Rail\") , the formerly state-run railway company. [http://www.bahn.com/i/view/USA/en/index.shtml DB's website], available in many languages, is an excellent resource for working out transport options not only in Germany (generally all modes except air travel; bus, ship and branch line timetables being incomplete) but also pretty much anywhere in Europe (train and a few selected long-distance bus routes only). An interesting gimmick is the carbon dioxide emission comparisons for different train journeys.\n\n====Long distance====\n[[Image:ICE.JPG|thumb|Inter City Express (ICE).]]\nAll major cities are linked by DB's '''ICE''' (InterCity Express) and regular InterCity trains. ICE is a system of high speed trains going up to 300 km/h within Germany (the top speed of 320 km/h is only reached in France, when going to and from Paris). Top speeds are only reached on newly built or upgraded parts of the network; on \"old\" tracks the ICE will only go as fast as regular IC trains. On most main lines you will arrive significantly faster than by car. Full-fare tickets are a bit expensive, with a one hour trip ( [[Frankfurt]] to [[Cologne]], around 180km) costing around €67 one-way (normal price without any discount). However when you book the ticket on-line in advance, you can get a considerable discount (see [[#Discounts|Discounts]]). [[Rail travel in Europe#Inter Rail|Interrail]] or [[Rail travel in Europe#Eurail|Eurail]] pass holders can use domestic ICE trains without supplement (except for for international ICE trains).\n\nReservations are not mandatory, but are recommended at peak times like weekends or holidays.\n\nNext are the regular '''InterCity''' (IC) and '''EuroCity''' (EC) trains. The latter connect the larger European cities and are virtually identical to the regular ICs. These trains are also fairly comfortable, even if they lack the high-tech feeling of the ICE.\n\nOn the major lines, an ICE or IC train will run each hour or so during the day, and even certain minor cities of touristic importance like [[Tübingen]] or [[Heringsdorf]] are connected on a daily or weekly basis. Before you shell out the money for the ICE ticket, you may want to check if it actually makes a significant time difference. There are also long distance trains operated by other companies than Deutsche Bahn, usually running over secondary routes. These are usually comfortable enough and sometimes considerably cheaper, but most of them stop at almost every station en-route.\n\nIn addition to being fast, modern and highly profitable, German railways are not known for delays, trains usually do not wait for one another (most local trains normally do for up to 5min) so you should not rely on connecting times of less than 15min.\n\n====Regional travel====\nRegional and local trains in Germany come in several flavors:\n* '''IRE''' (InterRegioExpress). The same as RE, but goes between two regions (Bundesland).\n* '''RE''' (Regional-Express). Semi-express trains, skips some stations. On many routes, this is the highest available train category.\n* '''RB''' (Regional-Bahn). Stops everywhere except that it may skip some S-Bahn stops.\n* '''S-Bahn'''. Commuter network for a city or metropolitan area but can travel fairly long distances. Only very few older S-Bahn trains offer the comfort of a toilet, which, however, often does not work.\n\nUrban transportation systems are usually ran by local companies that are publicly held: these may include subways, city buses, light rail and even regional trains. In larger urban areas, the local companies will often form a '''Verkehrsverbund''' or '''VB''' (integrated public transport system): you will be able to travel in and between all participating cities using the same tickets and fares. These urban transport networks are often (but not always) integrated with the DB network and Verkehrsverbund tickets are valid in local trains.\n\n====Regular tickets====\n\n[[Image:DB-Bahnautomat.jpg|thumb|Old (keypad) and new (touchscreen) DB ticket machines]]\n\nThere are a few different locations where you can get your tickets:\n*'''On-line'''. The engine will automatically look up the fastest connections. It will automatically offer the cheapest possible fare, including any applicable early-booking discounts in addition to the regular fare. Note that the fastest connections are not necessarily the cheapest ones - but you can exclude types of trains (e.g. ICE) to check for better deals.\n\nDepending on the connection tickets can be obtained as a \"mobile\" ticket that can be downloaded to your smartphone app, \"online\" tickets that can be printed out at home and via mail. Since 2015 you can even show \"online\" tickets on a notebook or tablet screen if you didn't print them out, something that wasn't allowed before.\n*'''At a vending machine'''. If already at the station, find a '''new''' (touchscreen) '''ticket machine''', tap the British Union flag, and then navigate through the menus.  Like the on-line engine, they will automatically suggest the fastest routes, and credit cards are accepted. The machines sell all DB train tickets including some international tickets, [[#Network tickets|network tickets]] and tickets for local VB. The new touchscreen machines accept credit cards, but the old ones do not. Ticket machines for the local Verkehrsverbund are yellow, white or grey. They can be used on all local transport in the area, including DB trains, but are not valid outside it. On secondary routes, vending machines placed inside trains are becoming a common sight, usually leaving smaller stations without vending machines. If a station is not equipped with a vending machine, you are allowed to buy your ticket inside the train. If there is no vending machine either, you are obliged to ask staff what to do: the same applies if the ticket machine is not working.\n*'''At a manned ticket counter'''. Head to any major train station (''Hauptbahnhof'') and find the '''Reisezentrum'''. You will need to queue and some cheap on-line offers may not be available. It has become quite uncommon to buy tickets at the counter, because ticket machines are situated at every DB train stop - even at the smallest whistle stop. Still, if you need help buying a ticket, just go to the counter as staff there speak English and can be very helpful to new arriving visitors.\n*'''On the train'''. If in a hurry, just run onto a ICE, IC or EC train and grab any non-reserved seat, then buy a ticket from the conductor for about 10% extra. Almost all conductors speak English. However, tickets are ''not'' sold on regional and local trains so you need to buy them at the station. Signs on the platform or on the train itself saying ''Einstieg nur mit gültigem Fahrausweis'' mean that you have to have a ticket before you board or pay €40 extra. Drivers on buses and trams, though, usually do sell tickets, but the assortment may be limited .\n\nNow, if you're travelling on local trains, things can get ''confusing''. The basic unit of confusion is the '''Verkehrsverbund (VB), or \"tariff union\"''', which is basically a region around a large city or sometimes almost the whole Bundesland (federal state) that has a single tariff system. Those tariff systems can be totally different from city to city.\nExamples include [http://www.vbbonline.de VBB] around [[Berlin]] and [http://www.rmv.de RMV] around [[Frankfurt]]. Any travel ''within'' a single Verkehrsverbund is \"local\" and usually quite cheap; but any travel ''between'' Verkehrsverbunde requires either a special (within North Rhine-Westphalia) or the full DB fare and will usually be considerably more expensive. The catch is that DB trains often cross between Verkehrsverbunde with no warning at all, and your \"local\" ticket then stops being valid the instant you cross the invisible line.\n\nWith many local machines and old DB machines in the Frankfurt area, figure out the '''four-digit code''' for your destination, found on a panel of densely packed print nearby. Poke the flag button to switch to English, punch in the code for your destination station on the keypad, then hit the appropriate button in the left (\"adult\") row below to pick your ticket. The first button is always one-way single (''Einzelfahrausweis''). A price will be displayed: feed in your money (quickly, since the time-out is quite fast, and the machine will spit out your tickets and change. For new blue DB machines, select the local tariff union in the top menu, and the rest is easy.\n\nIf you buy a local VB ticket, you will usually have to validate it by time stamping it at the bright yellow punch machines located on platforms. If you have no valid ticket or an un-punched ticket, you will be fined as a fare dodger. Ticket validity varies randomly from one VB to another: usually, there is either a zone system (the further you travel, the more you pay), a time system (the longer you travel, the more you pay), or most commonly a combination of these two. Unlimited transfers between trains, buses, etc. are usually allowed as long as your ticket remains valid. Discounts may be given for return trips, and one-day tickets (''Tageskarte'') are usually cheaper and much less hassle that single tickets, although zone limits apply to them as well. You can often pick up brochures attempting to explain all this, usually with helpful maps, and occasionally even in English, at a local Reisezentrum (ticket office).\n\nRegional train tickets are point-to-point, with the destinations written on the ticket. They are valid only on trains (but in [[North Rhine-Westphalia]], they are also on certain other means of public transport), although for long-distance tickets, you may have the option to add on a local transport ticket at your destination for a few euro extra.\n\n====Discounts====\nAs standard fares are relatively expensive, there is a sometimes confusing set of special promotions and prices the rail companies offer at various times (tests showed that even many railway employees at ticket counters failed to find the best bargain). Your best course of action is to check their [http://www.bahn.de/i/view/GBR/en/prices/index.shtml website] or to ask at a train station or their telephone hotline for current details. If you search a connection with the [http://reiseauskunft.bahn.de/bin/query.exe/en on-line timetable], it offers you automatically a most favourable discount for desired journey. Try several departure times as discount tickets are limited and may be sold out for your initial choice. If you plan to travel a bit more extensively, a [[#BahnCard|BahnCard]] or [[Rail_travel_in_Europe#Passes|rail pass]] may be the better choice.\n\n*[http://www.bahn.de/i/view/GBR/en/prices/germany/savertickets.shtml  '''Sparpreis'''] are low-cost one-way tickets, that cost from €19 for journeys up to 250 km, or from €29 for longer journeys. The actual price varies according to the demand on various days and relations. You should purchase it on-line at least three days in advance. Use a [http://ps.bahn.de/preissuche/preissuche/psc_start.post '''Preis Finder'''] (in German) to find a cheapest Sparpreis variant for your journey. The international version of this is call [http://www.bahn.de/i/view/GBR/en/prices/europe/europaspezial.shtml '''Europa-Spezial'''], which is available for certain connections to and from neighboring countries. These tickets are valid '''only''' valid for the connection indicated on the ticket and have a special cancellation policy.\n*[http://www.bahn.de/i/view/GBR/en/prices/germany/group_discount.shtml  '''Gruppe&Spar'''] is a discount for groups of six or more people. Depending on the demand you can get 50-70% discount. For short journeys, the [[#Network tickets|network tickets]] can be cheaper.\n*Children up to fourteen years travel free when accompanied by at least one of their parents or grandparents.\n*[http://www.ltur.com/de/bahn.html?omnin=DB-DE L'Tur L'Tur] offers long distance tickets for €26 for off-peak trains. Note that like all other electronic tickets, for foreigners these L'Tur Tickets are only valid in combination with a credit card.\n*HKX, the [https://www.hkx.de/de/ Hamburg-Köln-Express] - a train pretty much as fast as IC trains run by an independent company is sometimes way cheaper than DB trains - but only available on its route between Hamburg and Cologne via Düsseldorf and several towns in the Ruhrgebiet. Note that HKX trains skip Bremen.\n\nIf you plan to travel a week or two around Germany, there is a trick with Europa-Spezial that allows you to travel to several places with one ticket for 29Euro or 39Euro, if you book it some days in advance. Because of international regulations the ''only on the train booked''-validity applies only to the train you cross the border with, but not for local trains used in Germany afterwards. The ticket itself is valid for two weeks, and you may interrupt your journey as often as you wish. So just find both a town close to the border in a neighbouring country to start, select a destination and book a discounted ticket that includes a stopover after the border and uses only local trains for the rest of the journey. After reaching that first stopover, you may freely travel on local trains as long as they go into the general direction of your final destination. Some conductors may be a bit suspicious, but the ticket will clearly indicate that it's valid for two weeks and that for the section where you use local trains the ''only on the train booked'' doesn't apply. Note that this only works when you travel into Germany from another country, not the other way round.\n\n==== BahnCard ====\n'''BahnCard''' [http://www.bahn.de/i/view/GBR/en/prices/germany/bahncard.shtml] is a good choice, if you plan to travel by train a lot. It's valid for one year from the date of purchase and gives you discounts on all standard tickets. Long-distance BahnCard tickets frequently do include one single journey on public transport in many destinations (look out for ''City ticket''). However, you have to keep in mind that once you sign a contract for the card, they will automatically renew your card at the end of its time period unless you cancel it in writing before the last three months of the card starts. The DB employees may not tell you about this stipulation when you buy the card, thus there's a petition against this practice online at [http://www.change.org/Petitionen/abofalle-bahncard change.org].\n\nThe BahnCard discount doesn't apply to [[#Network tickets|network tickets]], but some transportation networks do offer their own discounts for BahnCard holders.\n  \n* '''BahnCard 25''' costs €61 (reduces: €41) and gives you a 25% discount on all standard tickets. Spouses and kids of BahnCard 25-owners can get additional cards for €5. Bahncard 25 discount can be combined with the ''Sparpreis'' and ''Europa-Spezial''.\n* '''Jugend BahnCard 25''' costs €10 and gives children and teenagers up to 18 years of age a 25% discount on standard and discounted tickets in first and second class. Unlike regular BahnCards it is valid for three years or until the young person turns 19, whichever comes first. \n* '''BahnCard 50''' costs €249 and gives you a 50% discount on all standard tickets. You can get this card for €127 if you're a pupil or student in Germany (up to 26 years of age), a pensioner of more than 60 years or disabled. \n* '''BahnCard 100''' gives you unlimited travel on German Trains and [https://www.bahn.de/p_en/view/bahncard/overview/city-ticket.shtml all public transport services inside the designated areas of the participating cities.] Without having an \"Anmeldung\"/ local registration, there are two options for second class BahnCard100. A three month Bahncard100 for € 1.249,- or a yearly prepaid payment of € 4.090,-.   If you are officially registered in Germany, you can have additional monthly payment options ( be aware it requires 6 weeks of notice to cancel the contract )\n\nA '''Probe BahnCard 25''' is periodically introduced under varying names, and this entitles the bearer to the BahnCard 25 discount for themselves (and, on occasion, up to four accompanying riders) for four months and costs €29.\n\n====Network tickets====\nThe German network tickets are valid for one day in all DB local trains (S, RB, RE and IRE), local private trains and public city transport. They are often a cheaper alternative to single or return tickets, because on many shorter relations local trains are not much slower as long-distance trains (IC, EC, ICE). Check the travel time at the [http://reiseauskunft.bahn.de/bin/query.exe/en on-line timetable] and select the ''Only local transport'' button.\n\nIf you need a network ticket for long-distance trains, use some of [[european rail passes]] or [[#German Rail Pass|German Rail Pass]].  \n\n*[https://www.bahn.de/p/view/angebot/regio/schoenes_wochenende_ticket.shtml '''Schönes-Wochenende-Ticket'''] (translated as 'Lovely Weekend Ticket') lets you travel anywhere in Germany on a Saturday or Sunday until 03:00 the following day. If you have time on your hands, it is very inexpensive at just €42 for up to 5 people. The Schönes-Wochenende-Ticket is potentially an ultra-cheap form of long distance travel: You can get from [[Munich]] to [[Hamburg]] for as little as €8.40 per traveller, taking 12 or more hours, but still faster and more comfortable than taking the bus.\n*[http://www.bahn.de/regional/view/regionen/freizeit/quer-durchs-land.shtml '''Quer-durchs-Land-Ticket'''] is another one-day network ticket valid on working days 09:00-03:00 the following day. Ticket costs €44 for one person and €8 for every other up to 5 people.\n* If your travel is contained within a single ''Bundesland'' (state), then you can buy a [https://www.bahn.de/p/view/angebot/regio/laender_tickets.shtml  '''Länder-Ticket'''] valid in one state, plus, usually, a few short links across the border. Time validity is 09:00 to 03:00 on the following day on working days and 00:01 to 03:00 the following day on weekends. Tickets begin at €23 for 1 person and €29 - €38 for a group of up to five people.\n\nAll network tickets can be purchased on-line and at ticket machines at railway stations. You cannot buy them from the conductor.\n\nSome locals look for other people at stations to share a journey with to reduce costs (there is [http://www.ticket-mitfahrer.de a website for searching for a travelmate]). Some even sell their network ticket for a discount after arriving at their destination to recoup some of their funds. In response, the German Railway now requires you to write your name on the ticket in order to validate it, thus making it harder to sell the ticket to someone else once your journey is over. However the conductor hardly ever checks your identity.\n\n====German Rail Pass====\nGerman Rail Pass [http://www.bahn.de/i/view/GBR/en/prices/germany/germanrailpass.shtml] allows for unlimited travel throughout Germany in all trains on 3-10  days within 1 month. There is an interesting \"twin\" discount for two people travelling together. The pass is available only for residents outside Europe, Turkey and Russia and you can purchase it on-line at the website above or from travel agencies outside Germany.\n\nEurail offers a pass for 3-10 days of travel (does not have to be consecutive) throughout Germany [http://www.raileurope.com/rail-tickets-passes/german-rail-pass/index.html]\n\n====Carrying bikes====\nIn many ''Verkehrsverbünde'', you can carry a bike on a train with normal ticket without supplement at off-peak hours. For short journeys outside ''Verkehrverbund'' you can buy a bike supplement ticket for €4.50, valid on all local trains for one day. On long-distance trains the supplement costs €9 for a day (€6 with BahnCard). On international routes the supplement is €10 for one journey, €15 for CityNightLine to France and Belgium. \n\nOn local trains you can carry bike usually in the open area near doors, especially in the first/ last coach of a train - usually the side without the locomotive. Long-distance trains have special section with bike holders. Follow up the bike symbols near the car door. Bikes are not allowed on high-speed trains (ICE, Thalys, TGV).\n\n====Information for railway fans====\nThere are several railways of special interest in Germany.\n\n*Rasender Roland on Rügen\n*Mecklenburgische Bäderbahn Molli in Bad Doberan \n*Harzquerbahn\n*Harzer Schmalspurbahn \n*Lössnitz Valley Railroad \n*Wuppertaler Schwebebahn in [[Wuppertal]], the world's oldest monorail\n*H-Bahn in [[Dortmund]]\n*Schwebebahn [[Dresden]]\n*Transrapid [http://www.transrapid.de/] maglev test track in [[Emsland]]\n\nCog railways are in [[Stuttgart]], up Drachenfels, up the Zugspitze Mountain and up the Wendelstein Mountain.\n\nFor an almost complete list, see [[:de:Sehenswerte Eisenbahnen in Deutschland]].\n\n==== DB subsidiaries ====\n*Burgenlandbahn [http://www.burgenlandbahn.de] (Artern - Nebra - Naumburg, Zeitz - Teuchern - Weißenfels / Naumburg, Querfurt - Merseburg, Merseburg - Schafstädt)\n\n*Usedomer Bäderbahn (Usedom/ Baltic Sea)\n\n==== Other railway corporations ====\n\n* ABELLIO [http://www.abellio.de] (Bochum - Gelsenkirchen, Essen - Bochum - Letmathe - Iserlohn / Siegen)\n* Albtal-Verkehrs-Gesellschaft [http://www.avg.info] (Bad Wildbad - Pforzheim, Bruchsal - Bretten - Mühlacker, several lines through Karlsruhe)\n* Altona-Kaltenkirchen-Neumünster Eisenbahn [http://www.akn.de] (Eidelstedt / Norderstedt - Ulzburg - (Elmshorn - Altona / Hamburg) / Neumünster)\n* Bahnbetriebsgesellschaft Stauden [http://www.staudenbahn.de] (Gessertshausen - Fischach - Markt Wald, Günzburg - Krumbach)\n* Bayerische Oberlandbahn [http://www.bayerischeoberlandbahn.de] (München - Lenggries / Tegernsee / Bayrischzell)\n* Bayerische Zugspitzbahn [http://www.zugspitze.de] (Garmisch-Partenkirchen - Grainau - Schneefernerhaus/Zugspitzplatt)\n* Bodensee-Oberschwaben-Bahn [http://www.bob-fn.de] (Friedrichshafen Hafen - Aulendorf)\n* Borkumer Kleinbahn und Dampfschiffahrt [http://www.borkumer-kleinbahn.de] (on the North Sea island Borkum)\n* Breisgau-S-Bahn-Gesellschaft [http://www.breisgau-s-bahn.de] (Freiburg - Breisach, Riegel - Endingen - Breisach, Riegel - Gottenheim, Freiburg - Elzach)\n* Brohltal Schmalspur-Eisenbahn [http://www.vulkan-express.de] (Brohl - Engeln)\n* Busverkehr Ober- und Westerzgebirge Bahn [http://www.bvo.de/bahn] (Cranzahl - Oberwiesenthal, Radebeul Ost - Radeburg)\n* Chiemseebahn [http://www.chiemsee-schifffahrt.de] (Prien(DB) - Hafen Stock)\n* City Bahn Chemnitz [http://www.city-bahn.de] (Chemnitz - Stollberg, Stollberg - St. Egidien - Glauchau, Chemnitz - Burgstädt, Chemnitz - Hainichen)\n* Connex Sachsen [http://www.lausitzbahn.de] (Cottbus - Görlitz - Zittau, Leipzig - Bad Lausick - Geithain, Görlitz - Bischofswerda - Dresden)\n* Dessau-Wörlitzer Eisenbahn (Dessau / Ferropolis - Oranienbaum - Wörlitz)\n* Döllnitzbahn [http://www.doellnitzbahn.de] (Oschatz - Mügeln - Kemmlitz, Nebitzschen - Glossen)\n* HKX [https://www.hkx.de/de] (Hamburg - Köln)\n* InterConnex [http://www.interconnex.com/] (Leipzig - Berlin - Rostock Warnemünde)\n* Netinera Alex [http://www.mobil-mit-alex.de] (Hof / Praha - Schwandorf - München / Nürnberg, Lindau / Oberstdorf - Kempten - München)\n* NordWestBahn [http://www.nordwestbahn.de]\n\n====German Ticket inspectors/ Conductors====\nThe turnstiles known from underground rails in London, New York, Paris and many other big cities in the world do not exist in Germany. This means nothing and noone will tell you your ticket is not valid in the moment you get on the train. On most trains some kind of staff will come around more or less randomly to check you have a proper ticket.\n\nOn long distance trains they are easy to spot with their uniforms. On IC, EC and ICE trains it is possible to buy a ticket from the conductor for cash or Credit Card (but no other cards!).\n\nIn all other trains you are usually in deep trouble if you board with no ticket - unless there is one of the rare onboard ticket vending machines which have to be used immediately after boarding. '''Inform whether you have to validate (stamp) your ticket when boarding the first means of transport at a machine on board or at the platform, or if the ticket is already pre-validated.''' If you have to validate it, it is invalid without the validation stamp. If it is pre-validated on purchase, and you use it after the validity period (starting with the purchase) has elapsed, it will not be valid for your travel, even if you insert it into a validation machine and stamp it that way. Even more confusing might be that there are transportation companies which use both \"systems\" at once; whether your ticket is pre-stamped might depend on the machine where you bought it, or on your selection of the ticket type on the machine touchpad (e.g. \"use now\" vs. \"use later\"). Even Germans who travel in a city about which they do not know such details may get confused, so be advised to ask some official staff or at least a local in any case of doubt.\n\nOn local trains or S-Bahn anything is possible: There may be uniformed conductors (that usually do not sell tickets), inspectors that resemble doormen at a club (and also may throw you out) or they are simply \"stealth\" casually dressed \"passengers\". The 'stealth'-inspectors should show a ticket inspector ID before starting their checks.\n\nMake 100% sure you have the right ticket before you get on a train because some ticket inspectors are very strict in particular with foreign (looking) and youngster passengers.\n\nWhatever happens, in no case, any ticket inspector may expel unaccompanied kids below 18 from a train. This applies especially at remote stations during nighttime. If this happens to you(r kid) call the police!\n\n===By bus===\n\n====Long distance (City to City)====\nIn 2012 the Germany liberated the market for the long distance buses. A law, which was designed to protect the national railway, had previously restricted long distance buses mostly to services from and to Berlin.\n\nSince the law was repealed, lots of new bus services have been created and are fighting for their share of the market. This often means great deals for travellers, even though the pricing can be somewhat confusing at times. Only time will show which of the you companies survive and how prices will turn out in the long run. The major contenders, some of them just founded in 2013, include:\n\n* [http://www.flixbus.com/ FliXBUS] Connects most towns and cities in Germany, in addition to providing international services, 2015 merged with ''MeinFernbus''\n* [http://meinfernbus.de/ MeinFernbus] Those green-orange coaches which connect large cities and remote areas like Jever/Schortens/Wittmund (NW Germany), as well as holiday areas abroad (eg Merano in South Tyrol)\n* [http://www.adac-postbus.de/ ADAC Postbus] By the Deutsche Post in cooperation with the automobile club ADAC\n* [http://www.berlinlinienbus.de BerlinLinienBus] A company owned by DB, mostly going from & to Berlin\n* [http://www.onebus.de Onebus.de] Privately held company operating two routes across Germany\n* [http://www.eurolines.de/Buslinien-national.14.0.html EuroLines / Touring] Before 2013 this company already offered serious long haul connections (eg to England, Spain or Ukraine...). Now they also offer domestic bus routes.\n* Megabus now offers a sizeable domestic network in Germany in addition to its international services.\n\nThe major routes are connected by several companies, partly in a intense competition. Apart from the above mentioned companies, there are often regional operators as well. The prices tend to vary a lot, comparison websites help to identify the best offers, try [http://www.busliniensuche.de busliniensuche.de] or [http://www.busticket.de busticket.de]\n\nAs many companies are relatively new, they don't always have coaches with their own logos painted on them - they often charter buses from other (local) bus companies. Also, bus stop are partly in a bad condition or barely noticeable. Be sure to check the exact location of the bus stop in advance.\n\n====Regional (City to Village/ Inside a town)====\nApart from these, there is a very dense network of regional and local bus lines. In rural areas, though, many lines run only once per day. Regional and local express bus line designators usually contain the letter(s) CE (local), E (regional around Hamburg; in other areas, E is used for special runs), S (regional), SB (regional and local) or X (local within Berlin), city bus line designators may contain the letter(s) BB (\"Bürgerbus\", not integrated within tariff unions), C or O. '''Always check the departure boards carefully: sometimes, especially at night or in rural areas, you have to order your bus by phone.'''\n\n===By car===\nGermany has a world-famous network of excellent roads and Autobahnen (motorways) with no toll or fees for cars (trucks have to pay), but gasoline prices are kept high by taxation. As of November 2015 prices float around €1.30 per litre for petrol (91 and 95 octane), and around €1.10 per litre for diesel. Oddly, normal petrol and \"super\" is the same price in Germany. There are several smartphone apps for price comparison (search for ''Spritpreis Vergleich''). As a rule of thumb the price drops over the day until around 22:00. At petrol stations, you have the choice between Diesel, Benzin (91 octane, not very common), Super (95 octane), Super E10 (95 octane also, but higher share of biofuel; inquire with car rental or petrol station since it might damage your car) and SuperPlus (98 octane) or Ultimate (100 octane). Also, LPG (liquefied petroleum gas) is available with few problems on highways. Here and there, you might find \"Erdgas\"; this is compressed natural gas not gasoline. In Germany, you may first fill up your tank and pay afterwards (only if the petrol station is staffed, of course). Some stations will not release the fuel to pump unless you pay first or at least hand over a credit card in advance.\n\nFuel stations situated at the autobahn are quick and convenient and usally accepts international debit/credit cards, but as a rule, fuel is generally more expensive. Less expensive are stations announced as \"Autohof\" at Autobahn exits, which are situated a kilometer or less from the exit and often also provide cheap, mostly low-quality food for professional drivers. You may also save a few euros by filling up your car at fuel stations situated in smaller cities or on the countryside - just be aware that small petrol stations does not always accept international debit/credit cards, so keep some cash on hand!\n\n====Car Rental and Carpools====\nAll German airports offer car hire services and most of the main hire firms operate at desk locations\n\nCar hire and pool cars are also available in most cities, and one-way rentals (within Germany) are generally permitted with the larger chains without an additional fee. When renting a car, be aware that most cars in Germany have manual gearbox (stick-shift), so you might want to ask for a car with an automatic gearbox if you are used to that type. Drivers with an endorsement in their licence that restricts them to driving automatic transmission vehicles will not be allowed to rent a manual-transmission car.\n\nMost car rentals prohibit having their cars taken to eastern European countries, including [[Poland]] and the [[Czech Republic]]. If you plan to visit these countries as well, you might chose to rent your car there, as those limitations do not apply the other way round.\n\nAnother great way to get around without your own car is using one of the popular carpool services. You can arrange many connections over their respective websites if you speak some German or have a friend that can help you out. Making contact is free of charge and getting a lift is often the cheapest way to get around. The two most popular hosts are Mitfahrgelegenheit [http://www.mitfahrgelegenheit.de] and Mitfahrzentrale [http://www.mitfahrzentrale.de], for second one you have to pay an extra charge. If you have your own car, taking other people is also a great way of saving money and protecting the environment.\nAnother very good site is [http://www.verkehrsmittelvergleich.de] which compares different means of transportation.\n\n====Traffic rules====\n\nAll foreign licences are accepted for up to six months (or 12 months for a temporary stay only), but a translation may be necessary. If you want to continue driving after this period, you must obtain a German licence. These rules do not apply to driving licences issued in EU member states.\n\n*'''Traffic Lights''': Turning right on red is ''only'' permitted when there is a sign with a green right arrow on the traffic light. Traffic lights flashing yellow are out of operation. Driving through the lights at red carries a fine (up to €200).\n\n*'''Passing only on the left''': Outside urban areas, and on any Autobahn it's forbidden to pass on the right, except in slow-moving congested traffic. In cities, you may pass other cars on the right on multi-lane streets.\n\n*'''Passing public transportation''': Buses and trams stopping at a regular stop may only be passed at very low speed, and transportation users getting on or off have the right of way; cars on the road have to stop, if necessary. If buses flash emergency lights while at a stop, they may not at all be passed by cars heading into the same direction. If they flash left lights for leaving a regular marked stop, they enjoy the right of way for getting back onto the main lane. Trams (streetcars), also while not stopping, may only be passed on the right, except when there is not enough space available on their right side, or if they are about to be passed on a one-way street.\n\n* '''Winter''': If wintry driving conditions dominate (ice, snow, snow slush) you are obliged to use suitable winter tires on your vehicle. These tires are tagged with the M+S symbol on the tire flank. Tires produced since 2018 additionally have to be tagged with the NHTSA \"Alpine\" symbol (showing a mountain and a snow crystal). Make sure that your car windows are completely free of any ice before starting the car. Driving using only a small viewing area is dangerous and forbidden. Fine: €10. Make also sure to remove the snow from the roof of your vehicle (fine: €25) and from the license plates (fine: € 5)\n\n* '''Mobile phones''': Using, or even picking up, your mobile phone for any purpose while driving a car or bicycle is forbidden, unless you use a hands-free set. Fine: €100 (car), €55 (bicycle).\n\n* '''Children''': Children under 12 years of age, who are shorter than 150 cm (approx. 59 inches) have to use a child safety seat. The seat has to be appropriate to the child's height and weight and must be approved by the EU. For older children, booster seats are sufficient. Fine: €60\n\n*'''Cyclists and road markings''': Normal road markings are white. Yellow road markings invalidate any existing white markings, observe the yellow markings. Cyclists often have dedicated cycling lanes, either on the road or the sidewalk, and have the right of way when you are turning into their lane. Watch out for cyclists going in the \"wrong\" direction as well.\n\n*'''Pedestrian crossings''': Stopping at \"Zebrastreifen\" (literally \"zebra stripes\") is mandatory when there are people waiting to cross the street and German drivers virtually always stop. Accordingly, many pedestrians will not wait for the car to stop before they use the pedestrian crossing.\n\n*'''Traffic Police''': If you get pulled over, stay calm and friendly, and hand over the driving license and car papers when asked to. It is common in Germany (although not mandatory) to call the police for even minor accidents to have them fill out an accident report. This report is sometimes needed for insurance purposes, e.g. when using a rental car.\n\n* The '''alcohol'' limit is 0.05% (0.5‰ (permille)), and zero for anyone under 21 or holding their license for less than two years. Even below the limit, you may face severe fines if you ''seem unfit to drive''.\n\n*'''Speed limits''' are the following in Germany (unless otherwise shown):\n\n:* 5 km/h on \"Spielstraßen\" (marked by a blue/white sign showing playing kids, pedestrians have priority)\n:* 30 km/h in most residential areas within cities (marked with a \"30-Zone\" sign; 20-Zone and 10-Zone also exist)\n:* 50 km/h inside towns and cities (including \"Kraftfahrstraßen\" (marked by a sign showing a white car on a blue background), except where another speed is indicated)\n:* 100 km/h outside towns and cities\n:* Then, there is the famous ''Autobahn''. And yes, there is no general speed limit here, just a \"recommended\" speed of 130 km/h (the same goes for \"Kraftfahrstrassen\" with a barrier between the lanes). However, you still have to obey the posted speed limit, if there is one. Also, the lack of a speed limit is no excuse for reckless driving, and you will be held liable if you cause an accident by going too fast. Autobahn speed limits are the same for other roads with at least two lanes per direction and any road signed as a motor vehicle road only, also called expressways. \n\nVery often speed limits are enforced by automated speed cameras, and it is illegal to have any \"detection\" device with you, which includes GPS devices which warn you about static cameras. An exception to this is if the co-driver uses a GPS-based app (''blitzer warner''). While fines for severe infractions can be substantial, they are usually lower than in most neighboring countries.\n\nOnly vehicles with a maximum speed of '''more than 60 km/h''' are '''allowed''' on the \"Autobahn\" or \"Kraftfahrstraßen\".\n\n*'''Low emission zones''':  All cars driving into a low emission zone (''Umweltzone'') need a badge (''Feinstaubplakette'') indicating their pollution category. This also applies to cars which are not registered in Germany. Badges come in green, yellow, and red. Signs marking the zones--typically the central parts of a city--show the colours allowed into the zone. Entering without a badge is fined even if your vehicle is eligible for the badge. Unfortunately the police often have no qualms pulling out and fining foreign drivers who didn't know about that scheme. \n\nIf you rent a car, make sure it has a ''Feinstaubplakette''. If you travel in your own car, you can buy your badge for a small fee from vehicle registration offices, technical inspection organizations such as TÜV (you can request a badge [http://www.tuev-nord.de/SID-545571E1-8A4DC6EE/de/verkehr/Order_form_ENGLISH_8761.htm online]) or Dekra and many car repair shops.\n\n====Using the Autobahn====\n[[Image:Autobahn A9.JPG|thumb|Autobahn A9 near [[Ingolstadt]] in [[Bavaria]]]]\n*German drivers tend to drive faster and more aggressively than you might be used to, especially on the parts of the highway system without a speed limit, which is taken literally.\n*Some people will drive '''really''' fast and expect everyone else to accomodate them by getting out of the way. They may flash their headlights and aggressively drive up to you if you are \"in their way\". In that case, stay calm. Let them pass as soon as you can, but don't be bullied into unsafe maneuvers. You can set your right indicator to tell them that you are planning to leave the left lane as soon as you can.\n*While most passenger vehicles have only a recommended speed limit of 130 km/h (80 mph), some buses have a speed limit of 100 km/h (62 mph), and most vehicles towing a trailer, along with buses in general and non-passenger vehicles with a gross weight of greater than 3.5 t (3.8 short tons), are limited '''only to 80 km/h'''. Some newer trailers have a speed limit of 100 km/h.\n* Before switching to the left lane, make '''very''' sure no one is coming up from behind you. Remember, people there may be up to 100 km/h ''faster'' than you.\n*Road signs on the Autobahn show possible destinations (mostly city names). They do not show the direction of the road (east/west), unlike in some other countries. However every odd-numbered Autobahn will go north/south (e.g. A49), whereas the even-numbereds go west/eastwards. Furthermore single digit Autobahn numbers indicate a very long Autobahn such as the A7 which goes from the border to Denmark all the way down to the Austrian border.\n*An important phrase to know is '''bei Nässe''', which you will see written under some speed limit signs. This means that the speed limit indicated applies only when the road is wet. Some limits have '''Lärmschutz''' - meaning that the speed limit is in place, usually for a short distance, to reduce the noise pollution from the road.\n*You must not pass vehicles on the right side, except in a traffic jam. Also, you are supposed to use left lane only for passing other vehicles: The rules of the road state that you must return to the right lane when possible. However, if the Autobahn has three or more lanes, you can stay in the middle lane as long as there are a few slower vehicles on the right.\n*If suddenly a traffic jam occurs ahead of you, try to switch on the hazard light after hitting the brake to warn the vehicles driving behind you. \n*The emergency lane is to be used only for real emergencies. If you stop for \"avoidable\" reasons (including 'out of fuel'), the police may fine you when they find you. \n*In some areas, emergency tracks are used as extra lanes in times of heavy traffic (as on the A7 between Hannover and Hamburg as well as north of Hamburg). This is always announced by electronic light signs. In that case, the emergency track will be under video surveillance and will be closed as lane if an emergency occurs.\n*Drivers who got stuck in a traffic jam outside a town or a village on the Autobahn or a road with two or more lanes heading into the same direction are obliged to give way for emergency vehicles. On a two-lane road or autobahn, vehicles on the left lane have to move as left as possible. Vehicles on the right lane have to move to the edge of the right lane, so that emergency vehicles can pass between the vehicles on both lanes (\"Rettungsgasse\"). As a basic principle, the emergency lane on the right remains unused. On a three lane road or Autobahn, vehicles on the left lane drive again as left as possible, vehicles on the middle and right lane drive as right as possible, the emergency lane is left unused. Emergency vehicles pass between the left lane and the middle lane. On a four lane road or Autobahn, vehicles on the left lane drive again as left as possible, vehicles on the other lanes drive as right as possible, the emergency lane is again left unused. Misusing the emergency space by private vehicles is prohibited. Entries to the Autobahn or the road have of course to be kept clear.\n*If you notice an emergency operation on the other side of the Autobahn, keep your speed, don't slow down and don't rubberneck.\n\n====Case of breakdown or emergency====\nIf your car suffers a breakdown or if you are in an emergency: Make sure you are safe. Switch on the hazard flashers of your vehicle. After dark, additionally switch on the one-side parking lights if you are in a town or a village or the full parking lights if you are otside a town or on an Autobahn. By law you are obliged to put on a high-visibility vest before you set foot on the autobahn. Leave the vehicle and stay off the road (including the emergency lane). Then set up your emergency triangle. The triangle should be set up about 50 m behind the car inside towns or on roads with a maximum speed of 50 km/h. On roads with a higher speed limit or on autobahns it should be set up at least 100 m behind the car. The posts of roads outside of towns and cities have a distance of 50 m to each other, so you can use them to estimate the correct distance. On an Autobahn call help from the nearest orange emergency phone. The small arrows on the posts will guide you to the next orange phone (the distance between two orange phones on an Autobahn is 2 km). You may also use your mobile, but the emergency phone will transmit your position. Wait offroad next to the lane close to your vehicle for a towing service.\n\nMotorbikes which suffer a breakdown have to be moved off a road by hand. On the Autobahn stop your bike on the grass next to the emergency lane or on the emergency lane itself, switch on the hazard flashers, call a towing service and wait offroad/behind the guardrails close to your bike. \n\nIn case of a breakdown, you may also call the '''ADAC''', the world's largest automobile club. The number is +49 180 2222222 from fixed lines and 22 22 22 from mobile phones regardless of network. On the Autobahn, the ADAC must always come to you free of charge, and you don't have to become a member either. In other situations, there may be costs involved if you're not a member. If you're a member of a foreign AA or automobile club, you may want to check if the ADAC honours your membership.\n\nIf the car is only able to drive slowly due to other technical problems, switch on the hazard flashers to warn the vehicles behind you.\n\n===By recreational vehicle and campervans===\n\nGerman campgrounds (like most others in [[Western Europe]]) usually offer a full range of amenities. You always have your own electricity hookup, and water and sewer hookups for each are common,. Every campground has restrooms and showers as well as kitchens, washing-machines and a spin dryer.\n\nThe yellow pages of camping, or, if you like, the German camping bible, is the ''ADAC Campingführer'', a campground guide by Germany's largest automobile club ADAC. It lists almost all campgrounds along with prices, type of location, size, opening hours, amenities, you-name-it. Since the guide uses lots of symbols which are explained in a number of languages, it is suitable for travellers from abroad, too.\n\n===Ride-sharing===\nRide-sharing (or pre-arranged hitchiking - '''MFZ''') is popular in Germany and the fare for a ride is often much cheaper than the railway fare. \n\nThere are several websites which put drivers offering to share their vehicles in touch with passengers willing to share the costs of that journey. Popular websites are [http://www.mitfahrgelegenheit.de Mitfahrgelegenheit], [http://www.blablacar.de blablacar], [http://www.mitfahren.de mitfahren.de], [http://www.fahrgemeinschaft.de Fahrgemeinschaft], [http://www.mitfahrzentrale.de Mitfahrzentrale],  [http://www.bessermitfahren.de  bessermitfahren.de], [http://www.raumobil.de raumobil.de] or  [http://www.hitchhikers.de hitchhikers.de]. \n\nShared rides for trips by train can be arranged, too so as to take advantage of group discounts.\n\nOffline agencies like Citynetz [http://www.citynetz-mitfahrzentrale.de] or ADM [http://www.mitfahrzentralen.de] do have offices in major cities, mostly near the city centre or the main railway station. These offline agencies do charge a commission to the cost for fuel you need to pay for the driver. \n\n===By thumb===\nIt is possible to [[Hitchhiking|hitchhike]] in Germany and most Germans speak basic English, so you will be understood if you speak slowly.  Drivers rarely expect you to give them any money for the ride. The first letters of the German number plate (before the two seals) indicate the city in which the car is registered. If you know the code for your destination [http://de.wikipedia.org/wiki/Liste_der_Kfz-Kennzeichen_in_Deutschland], it will increase your chances of stopping the right vehicle.\n\nIt is illegal to stop on the ''Autobahn'' itself, but hitchhiking from service areas or petrol stations is a good way of getting long rides (100-200 km).  The hard part is getting onto the Autobahn, so it pays off to sleep near the gas stations if you are going far. At the gas stations, you can get a free booklet called ''Tanken und Rasten'' with a map of the Autobahn and its gas stations. When getting a lift, agree with the driver where to get off, and make sure there is a gas station. Try to avoid the ''Autohof''s.\n\nAnother form of [[hitchhiking]] available in Germany is to share group tickets on regional trains. To hitch a ride with other travelers, first figure out which regional transportation you will need to take in order to reach your destination, and which group discounts are available. Then you ask people seemingly doing nothing at the ticket machines around 20 minutes before regional trains between major stations depart, they may be willing to share a ticket with you.\n\nConsider finding a group through the \"Mitfahrzentrale\" or similar services mentioned above in advance, many people list their travel plans online.\n\n==Talk==\nThe official language of Germany is '''[[German phrasebook|German]]'''. The standard register of German is called \"Hochdeutsch\" (High German). This can be understood by all mother-tongue speakers of German and spoken by almost all when necessary. However, every region has its own dialect, which might pose a challenge sometimes to those who speak even good German and even to native speakers as well. This is usually noticeable only in the south (not too much in big cities such as Stuttgart or Munich though) and rural areas of the north and east. Thus, when travelling in Bavaria, Saxony and Baden, you are stepping foot in places where dialect remains a strong part of the local identity. The general rule is that south of the Main River divides north Germany from the south in both language and local culture.  \n\nIf you intend address the person you're speaking to in German, refer to the person as \"Sie\" if you aren't acquainted with that person yet. \"Du\" can be used if both of you are already close (the form of the verbs will also change).\n\nAll Germans learn '''English''' at school, so you should be able to get by with English in most places especially in the former West Germany. Many people--especially in the tourism industry and higher educated persons--also speak '''French''', '''Russian''' or '''Spanish''', but if you can't speak German, English remains your best bet. Even if one member of the staff doesn't speak English, you are likely to find someone who does and is more than willing to help you. In the southeastern part of that area, a small Slavic community of 50,000 also speak the Sorbian language, the least spoken modern Slavic language today, but widely protected from near-extinction since 1945. Also on the western coast of Germany there is a small ethnic group speaking its own language, the Frisian people. The dialect „North Frisian“ is still widely spoken on the islands Amrum, Föhr, Sylt and on several other small, undiked Island, as well as on the mainland in front of them.  In Lower Saxony (federal state) the East Frisians live on the East Frisian Islands and the mainland close by. There are also some other Frisian communities spread in the north of Lower Saxony for example in Saterland. The Frisian culture is protected by law, due to their status as minority.\n\nIf you address a German with English, always first ask \"Do you speak English?\" or maybe its German translation, \"Sprechen Sie Englisch?\", which will be considered polite, but probably not understood as you will pronounce it really wrong or sound strange.  \n\nGermans are less fluent in the English language and often answer questions very briefly (one or two words) because they feel uncertain how to create a complete English sentence. This might sometimes appear impolite but is not at all meant this way. Germans less fluent in English also often say \"become\" instead of \"get\" because the German word  \"bekommen\" (\"get\") is phonetically so close to \"become\". Since it's polite to reply \"Bitte\" if someone thanks you, Germans may literally translate this with \"please\" instead of \"here you are\" or \"you're welcome\". Another source of confusion is that Germans call mobile or cellular phones a \"Handy\" and many of them regard this as an English word. \n\nGermans (considering themselves) fluent in the English language will often offer to speak English with you if you try to speak German with them. It's considered by most as a sign of politeness even though it might be annoying for people who want to practice German. Pointing out that you'll want to try in German is perfectly fine and most people will react very positive (or apologize) if you do.\n\nIt is worth noting that English is in the same language family as the German language. Hence when you read German signs, there are a good number of words that may resemble their English counterparts.  \n\nWhile Germany uses the 24 hour format for written times, people very often use 12 hour times in conversations. There is no real suffix like \"AM/PM\", though you can add \"vormittags\" (before noon) and \"nachmittags\" (after noon) when it's not clear from the context.  Another difference is that when saying the time is 07:30, English speakers would say \"half (past) seven\" whereas Germans say \"halb acht\" (\"half eight\") in most regions. In addition, Germans say two-digit numbers \"backwards\":  instead of \"twenty-two\" they say \"two and twenty.\" Numbers below 20 are said the same way as in English. This becomes especially important when you inquire for prices, although most who speak English with you should use the correct form. It is still better to double-check what is really meant.\n\nSee also [[German phrasebook]].\n\n==See==\n\n===Cultural and historical attractions===\n[[Image:Rothenburg BW 4.jpg|thumb|Rothenburg ob der Tauber]]\nWhen thinking of Germany, beer, ''lederhosen'' and Alpine hats quickly come to mind, but these stereotypes mostly relate to [[Bavaria]]n culture and do not represent Germany as a whole. Germany is a vast and diverse country with 16 culturally unique states that have only formed a political union since 1871 in the modern era, and including the significant 1945-1989 parenthesis. \n\nIf you're still looking for the cliches, the [[Romantic Road]] is a famous scenic route along romantic castles and picturesque villages. With its fairy tale appearance, the [[Füssen|Neuschwanstein Castle]] could be considered the most iconic of German castles. The walled city of [[Rothenburg ob der Tauber]] has a beautiful mediaeval centre that seems untouched by the passage of time. Similar typical German towns can be found elsewhere in the country, like [[Görlitz]], [[Bamberg]], [[Celle]], [[Heidelberg]], [[Erfurt]], and [[Quedlinburg]]. Your picture postcard visit to Germany will be complete with a visit to the beer halls of [[Munich]] and a peek of the Alps at [[Garmisch-Partenkirchen]].\n\nGermany is a modern industrial nation, and the ''Wirtschaftswunder'' is best represented by the industrial heritage of the [[Ruhr]]. [[Hamburg]] is another economic powerhouse with the second busiest port of the continent. [[Frankfurt]] is the financial centre of Germany, and of Europe as a whole, as it is the base of the European Central Bank. Its skyline comes close to those found at the other side of the Atlantic. The fashion city of [[Düsseldorf]], media industry of [[Cologne]], and car companies in [[Stuttgart]] each represent a flourishing sector of the German economic miracle.\n\nA completely different experience can be found in [[Berlin]], a city unlikely to be found anywhere else on the planet. While architecturally an odd mismatch of sterilised apartment blocks, post-modernist glass and steel structures, and some historic left-overs, it has a laid-back atmosphere and a culture of internationalism that accepts everyone as a \"Berliner\". Its turbulent history gave rise to an enormous wealth of historical attractions, among them the Berlin Wall, Brandenburger Tor, Bundestag, Checkpoint Charlie, Fernsehturm, Holocaust Memorial, Rotes Rathaus, and the DDR Museum. If you want to see a perfect example of gentrification, visit the formally \"hip\", now very settled Prenzlauer Berg district. If you want to feel like a true Berliner, you might visit the  Charlottenburg district between Stuttgarter Platz and the Lietzensee lake, or the vivid and decently posh, and friendly neighbourhoods between Friedenau and the Schlossstraße in Steglitz, while you might meet a lot of party people, tourists to a large part, in Friedrichshain around Revaler Straße. If you want to get some impression of the areas where Berliners live which do not have the time and money for an upscale lifestyle, visit Tiergarten district around Beusselstraße, Wedding district around Müllerstraße, or Neukölln district around Karl-Marx-Straße - despite the social problems, those areas are still relatively safe, and if you take some caution (do not flash with money; do not look for a fight; do not speak extremely loud in your mother language - in particular in a group - so that you would appear to be a drunk party tourist), you are unlikely to get into any trouble there.\n\n[[Image:Markt.jpg|thumb|Schöningen : City of the Spears]]\nThe [[Schöningen]] Spears are 8 wooden throwing spears from the Palaeolithic Age, that were found between 1994 and 1998 in the open-cast lignite mine, [[Schöningen]], county [[Helmstedt]], Germany, together with approx. 16,000 animal bones. More than 300,000 years old they are the oldest completely preserved hunting weapons in the world and they are regarded as the first evidence of the active hunt by Homo heidelbergensis. These discoveries have permanently changed the picture of the cultural and social development of early man.\n\n===Natural attractions===\nDue to its size and location in Central Europe, Germany boasts a large variety of different landscapes. In the north, Germany has an extensive '''coastline''' along the North Sea and the Baltic Seas in a vast area known as the '''North German Plain'''. The landscape is very flat and the climate is rough with strong winds and mild, chilly temperatures. Due to the south-easterly winds that press water into the German Bight, tidal variations are exceptionally high, creating the '''Wadden Sea'''. Vast areas of the seabed are uncovered twice a day, allowing one to walk from one of the numerous islands to another. The [[East Frisian Islands]] just off the coast are very picturesque, although mostly visited by the Germans themselves. Favourite white sand resorts along the Baltic Sea include [[Rügen]] and [[Usedom]].\n\nThe central half of Germany is a patchwork of the '''Central Uplands''', hilly rural areas where fields and forests intermix with larger cities. Many of these hill ranges are tourist destinations, like the [[Bavarian Forest]], the [[Black Forest]], the [[Harz]], the [[Saxon Ore Mountains|Ore Mountains]], and [[Saxon Switzerland]]. The [[Rhine Valley]] has a very mild, amenable climate and fertile grounds, making it the country's most important area for wine and fruit growing.\n\nIn the extreme south, bordering Austria, Germany contains a small portion of the '''[[Alps]]''', Central Europe's highest elevation, rising as high as 4,000&nbsp;m (12,000&nbsp;ft) above sea level, with the highest summit in Germany being the ''Zugspitze'' at 2962&nbsp;m (9,717&nbsp;ft). While only a small part of the Alps lie in Germany, they are famous for their beauty and the unique Bavarian culture. Along the country's southwestern border with Switzerland and Austria lies [[Lake Constance]], Germany's largest fresh-water lake.\n\n===Itineraries===\n* [[Bertha Benz Memorial Route]] — follows the tracks of the world's first long-distance journey by automobile\n* [[Romantic Road]] — the most famous scenic route in Germany that starts in Würzburg and ends in Füssen\n\n==Do==\n[[Image:Kloster_St._Bartoloma.JPG|thumb|Königsee nearby Berchtesgaden, Bavaria St. Bartolomä]]\nGermany offers virtually every activity you can imagine. Most Germans are members of a sports club and visit cultural events less often. Due to the federal structure every region has its own specific activities.\n\n===Sports===\nGermany is crazy about football and the German Football Association '''DFB''' [http://www.dfb.de/index.php?id=104] is the biggest FA association in the world with 6.35 million members (8% of the German population) in more than 25,000 clubs. Every village has a club and the games are the main social event on weekends, with participation strongly encouraged. The German Football Museum in [[Dortmund]] presents the history of this.\n\nIn the winter, many people go skiing in the Alps in [[Bavaria]] close to [[Munich]].\n\nAlmost every middle-size German city has a spa (often called ''Therme'') with swimming pools, water slides, hot tubs, saunas, steam baths, sun roofs etc. The sauna areas are usually visited by both genders, and people are nude there. Wearing any kind of clothing; including swimsuits, is considered unhygienic and therefore not permitted.\n\n===Cultural events===\nGermany has world class opera houses (especially [[Berlin]], [[Bayreuth]], and [[Munich]]) and the Berlin Philharmonic Orchestra [http://www.berliner-philharmoniker.de/en/] is known as one of the top three orchestras in the world. Germany is considered to have the strongest classical music traditions in Europe, with many famous composers such as Bach, Beethoven, Brahms, Handel and Wagner originating from Germany. Several theatres in bigger cities play outstanding classical and contemporary plays. Germany prides itself in the wide variety of cultural events and every city works out a cultural agenda.\n\n====Musicals====\nMusicals are popular in Germany. Although there are some touring productions from time to time, most shows stay in a specific city for a few years. Most shows belong to the company called \"Stage Entertainment\". The main 'musical cities' are Hamburg (for example ''The Lion King''), Berlin (for example ''Blue Man Group''), Oberhausen (''Wicked''), Stuttgart (for example ''Dance of the Vampires''), Bochum (''Starlight Express'') and Cologne.\n\n====Shakespeare====\nRather interestingly, William Shakespeare is adored in Germany like almost nowhere else--the Anglosphere included. This can be attributed in large part to Goethe, who fell in love with the Bard's works. If your German is up to it or you can find a English performance, seeing a performance can be very interesting. According to some Germans, Shakespeare is actually ''improved'' in translation, as the language used is more contemporary. Judge for yourself.\n\n==Buy==\n\n===Currency===\n{{Euro}} \nIf you have Deutsche Marks (no matter if coins or notes) remaining from years ago, they can still be exchanged free of charge at all branches of the German national bank (Bundesbank) and sometimes at other banks (just ask). The Bundesbank operates 35 branches in nearly all major cities in Germany.\n\nDo not expect anybody to accept foreign currencies or to be willing to exchange currency. An exception are shops and restaurants at airports and also - more rarely; fast-food restaurants at major railway stations. These will generally accept US dollars at a slightly worse exchange rate. If you wish to exchange money, you can do so at most banks, where you can also cash in your Traveller's Cheques. Currency exchanges, once a common sight, have all but disappeared since the introduction of the euro. Again, international airports and railway stations are an exception to this rule. Swiss Francs can sometimes be accepted near the Swiss border. \n\nWhile German domestic debit cards - called ''girocard'', formerly ''EC-Karte'' - (and, to a lesser extent, international PIN-based Maestro and V PAY cards) enjoy almost universal acceptance, this is not true for credit cards (VISA, MasterCard, American Express) or foreign debit cards (VISA Debit/Electron, Debit MasterCard etc.), which are not as widely accepted as in other European countries or the [[United States]] but will be accepted in several major retail stores (department stores like Kaufhof and Karstadt, and mid-class supermarkets like REWE and Edeka, but not at every discount supermarket like Lidl, Aldi or Netto) and some fast food restaurants (such as many McDonalds).\n\nDon't be fooled by seeing card terminals in shops or other people paying with cards - these machines may not necessarily be programmed to accept foreign cards, so it is best to inquire or look out for acceptance decals before shopping or refuelling your car (all major brand filling stations will accept credit cards).\n\nHotels, larger retailers, big brand filling stations, nationwide companies, many supermarkets and some pharmacies accept credit cards; discount stores or small independent shops tend not to (with exceptions). Some places impose a minimum purchase amount (typically €5 to €10) for card payments. Most ATMs will allow you to withdraw money with your credit card or foreign debit card, but you'll need to know your card's PIN number for that.\n\n===Tipping===\nUnlike in some other countries, service staff are always paid by the hour (albeit not always that well). A tip is therefore mainly a matter of politeness and shows your appreciation. If you didn't appreciate the service (e.g. slow, impolite or just bad overall service) you don't have to tip at all and it will be accepted by the staff. The same applies when it is clear that you are on a business trip, and that you get reimbursed only for your expenses indicated on the bill, but not for tips.\n\nSince the introduction of the Euro, a tip (''Trinkgeld'', lit. \"drink money\") of about 5-10% is customary if you were satisfied with the service. Nonetheless, service charge is already included in an item's unit price so what you see is what you pay.\n\nTipping in Germany is usually done by mentioning the total while paying. For example, if a waiter tells you the bill amounts to \"€13.50\", just state \"€15\" and he will include a tip of €1.50.\n\nIf you pay by credit or debit card, it is perfectly acceptable to tip by card. However, the slips which German credit card terminals produce do not contain any extra space for manually writing a tip and a total onto it. Thus, indicate the total amount you want to pay, this including the tip, before staff type the total amount into the card machine.\n\nTipping in other situations (unless otherwise indicated):\n*Taxi driver: 5% (at least €1)\n*Housekeeping: €1-2 per day\n*Carrying luggage: €1 per bag/suitcase carried\n*Public toilet attendants: €0.10-0.50\n*Delivery Services: 5%-10% (at least €1)\n\n===Shopping===\nIn common with most other Western European languages, the meanings of points and commas are exactly inverse to the English custom; in German a comma is used to indicate a decimal. For example, 2,99€; is two euros and 99 cents. The \"&euro;\" symbol is not always used and may be placed either in front or after the price. A dot is used to \"group\" numbers (one dot for three digits), so \"1.000.000\" would be one million. So \"123.456.789,01\" in German is the same number as \"123,456,789.01\" in English speaking countries.\n\n====Taxes====\nRetail prices are reasonable and lower than in northern European countries but the value added tax, (VAT), \"Umsatzsteuer\" (official, but even politicians use this rather sparsely) or \"Mehrwertsteuer\" (most Germans use this word) has been increased to 19% from 2007 onwards and therefore prices have risen slightly. Fuel, sparkling wine, spirits and tobacco are subject to even higher taxes, the first of those excise taxes - the \"Branntweinsteuer\" (spirit tax) - first being imposed on Nordhäuser Branntwein (the ancestor of Nordhäuser Korn) in 1507, the most ridiculous of them - the sparkling wine tax; being introduced by Kaiser Wilhelm II to finance the Kiel Canal and his naval fleet. Still, some of these products are still priced considerably lower on the high street than prices charged at \"duty free stores\" at airports, or even in the country of origin. In particular, this applies to wine and whisky. Some German brands of high-end goods such as '''kitchen utensils''', '''stationery''', and '''hiking gear''' are considerably cheaper than abroad. VAT is always included by law in an item's price tag (except when goods are sold business-to-business only by vendors which only sell to businesses, which may reimburse the VAT paid). There exists a reduced VAT of 7% i.a. for hotels (but not for edibles consumed within), non-luxury edibles taken away or provided without further service (this is the reason why staff in fast-food restaurants will routinely ask whether you eat in or take away your meal - whatever you answer, the price will remain the same for you), print products, public transport (short-distance only) and admission prices for opera or theatre.\n\n====VAT refund====\nRemember that if you are from outside the EU, you may claim your VAT (Mehrwertsteuer, 19%) back when you leave the country. This usually requires you to get a certain \"tax-free\" certificate from the vendor participating in that scheme. Such participation is often indicated by a decal at the store entrance. You may not use the item you had bought within the EU before departing. You would have to present the merchandise together with the certificates to customs at the place (e.g. airport) where you will finally leave the EU (if you check baggage through another stopover EU airport, present the merchandise to customs at the place within the EU where you will hand over the baggage to the airline). You will not be harrassed by customs, but expect them to ask for some reasonable proof that you are about to export unused goods which are identical to the ones indicated on the certificates. Thus, officers might demand physical presentation of the merchandise, to check whether it shows signs of use. It helps to leave price tags on clothing, and not to remove any seals from electronic equipment packaging. Some proof of identity (passport) and of your residence outside the EU may also be demanded. If customs are satisfied that you fulfill the criteria, they will endorse your \"tax-free\" certificates with an export certificate stamp, and you can then follow instructions on the documents, telling how to send in the certificates and how to get the VAT transferred. Besides this certificate-based procedure, there also do exist other procedures to reimburse the VAT, but those are more complicated.\n\n====Supermarkets====\nMany Germans look for the best prices and do not like getting \"ripped off\" when shopping for food. As a result, the competition between '''food discounters''' (which might be the cause of this very specific behaviour) is exceptionally fierce (in fact, WalMart had to completely withdraw from the German market because it failed at competing on price) and results in very low food prices compared to other European countries. The chains \"Aldi\", \"Lidl\", \"Penny\" and \"Netto\" are a special type of supermarket (sometimes called \"Discounter\", but generally referred to as \"Supermarkt\", as well): Their range of products is limited to the necessities of daily life (like fruit, vegetables, pasta, milk, eggs, tinned foods, toiletries etc.), sold in rather simple packaging for tightly calculated prices. While quality is generally surprisingly high, do not expect delicatessen or local specialities when you go to shop there. Many Germans buy their daily needs there and go to the more \"standard\" supermarket (like the chains Rewe, Edeka, Real, Tengelmann/Kaisers, Globus or Famila) to get more special treats. The personnel in these shops is trained to be especially helpful and friendly and there are big cheese/meat and fish counters where fresh products are being sold. Don't blame discounter personnel for being somewhat harsh; although they are paid slightly better than usual, they have to cope with a rather grim working atmosphere and a significantly higher workload than colleagues in \"standard\" supermarkets and therefore are certainly not amused about being disturbed in getting their work done. Beside those major chains, Turkish supermarkets can be found in townships with a predominantly Turkish immigrant population can be a worthwhile alternative since they combine the characteristics of discounters (low price levels but limited assortment) with those of \"standard\" supermarkets ((Turkish) specialties and usually friendly personnel).\n:If you are looking for '''organic products''', your best bet is to visit a \"Bioladen\" or \"Biosupermarkt\".  There are also many farmers selling their products directly (\"Hofladen\"), most of them organised in the \"Bioland\" co-operative. They offer reasonable food at reasonable prices. \n:Similarly it applies to '''clothes'''; although competition on this market is not ''that'' fierce and quality varies, cheap clothing of sufficient quality might be bought at C&A, but don't expect designer clothes though. During the end-of-season sales, you should also compare prices of conventional stores since they may be even cheaper than the discounters. The Swedish brand H&M sells cheap, stylish clothing.\n:Be prepared to bag your own groceries and goods as well as '''provide your own shopping bags''' for doing so. While most stores provide plastic as well as canvas shopping bags at the checkout, you will be charged for them. It is more environmentally-friendly to re-use shopping bags rather than get a new one each time. It's a good reminder to also keep a euro coin handy for the shopping trolleys. They all require a euro to unlock them but you get it back once your shopping is done. At most supermarkets, you can spot a canister with lots of cardboard boxes in it; usually after the tills. You are allowed to take cardboard boxes from there! It is a service the markets offer and also a easy waste disposal for them. Just tell them you are getting yourself a box when the cashier starts to scan your goods, come back and start packing.\n\n:'''Sausage''' If you are into trying German Wurst, any decent butcher (\"Metzgerei\", also in supermarkets with non-prepackaged sausages and someone behind the counter) will be happy to let you try a anything before you buy it (for free) if you ask. Still, you will be considered rude if you do not buy anything after trying (even though you may just ignore that).\n\n:'''Factory Outlets''': Germany has only few Factory Outlet Centres, but approximately up to 1000 Factory Outlets called \"Fabrikverkauf\". \n:'''Local Products''': You can find local food products (not necessarily organic) in most places at the '''farmer's market''' (\"Wochenmarkt\" or simply \"Markt\"), usually once or twice a week. While you your chances on finding English-speaking sellers there may be somewhat reduced, it's nevertheless quite fun to shop there and mostly you will get fresh and good quality food for reasonable prices. Most winemakers sell their products either directly or in \"Winzergenossenschaften\" (winemaker cooperatives). These wines are almost always superior to the ones produced by German wine brands. Quality signs are \"VdP\" (\"Verband deutscher Prädikatsweingüter\", symbolized by an eagle) and \"Ecovin\" (German organic winemaker cooperative).\n\n====Souvenirs====\n:: German '''honey''' is a good souvenir, but only \"Echter Deutscher Honig\" is a guarantee for reliable quality. Look out for honey with a (the higher, the better) percentage of \"Nektar\".\n:: Along the German coasts, '''smoked eel''' is quite a common delicacy and a typical souvenir.\n:: '''Cheese''': If you head for a supermarket (even a \"standard\" one) to buy some cheese you certainly will discover its taste being as cheesy as the TV spot propagating it. What even many Germans do not know is that beside those \"Qualitätsprodukte\" (literally: quality produces – one of many quite cynical German legal terms), there actually exists an astonishing German cheese variety – you may find them in (one of the rare) cheese stores or in Bioläden.\n:: '''Chocolates & Sweets''': If you are not intending to visit Switzerland, Germany is one of the best places to find chocolades. Try \"Ritter Sport\" in a wide, inexpensive variety as a German variant to Swiss brands (Milka, Lindt, ...) and do not forget you are in the home country of gummy bears (by Haribo).\n:: '''Houseware''': Chances are good that you'll find excellent deals on quality kitchenware at any larger shopping area - \"Made in Germany\" got big for knives, pots and pans. Be aware of the quality, even name brands sell medium-quality products at certain outlets.\n\n====Recycling==== \n'''Deposit for beverage containers''': Germany has an elaborate and confusing beverage container deposit (\"'''Pfand'''\") system. Bottles usually cost between 8-25 cents ''Pfand'' per bottle depending on their type. Additional ''Pfand'' is due for special carrying baskets matching the bottle measures. The ''Pfand'' can be cashed in at any store which sells the type of container you wish to return, often by means of a high-tech bottle reader than spins the bottle, reads the ''Pfand'', and issues a ticket redeemable with the cashier. The ''Pfand'' is €0.08 for '''reusable crown capped''' bottles like most glass beer bottles or small glass soft drink bottles. It is €0.15 for '''reusable, re-closable''' bottles. The €0.25 ''Pfand'' is for '''non-reusable''' bottles. ''Pfand'' is also usually declared on the price tag of the product. Some contents like wine or drinks not containing carbonic acid do not have to be sold with ''Pfand''. They may or may not have a label saying ''pfandfrei'' (deposit-free) on them. Reusable bottles are always sold with ''Pfand'' because the bottler wants you to bring the bottle back for refilling. Reusable bottles are taken back, cleaned thoroughly and refilled up to 50 times. Non-reusable bottles are collected, shredded and remade into new products or used as substitute materials in electricity and/or heat generating processes. '''Non-reusable''' Bottles with a €0.25 ''Pfand'' are easy to identify as they have a special standardized [http://de.wikipedia.org/w/index.php?title=Datei:Dpgkennz.svg&filetimestamp=20070107080228& logo] on them. The label with the logo on it must remain on the bottle to reclaim your ''Pfand''. A '''reusable''' container that requires ''Pfand'' does not always explicitly state that. Instead it may have one of [http://de.wikipedia.org/w/index.php?title=Datei:Mehrweg_logo_at.svg&filetimestamp=20090114191734& these] [http://de.wikipedia.org/w/index.php?title=Datei:Mehrweg_logo.svg&filetimestamp=20090115164612& logos] or just read \"Mehrwegflasche\" (reusable bottle) or \"Mehrweg-Pfandflasche\" (reusable deposit bottle) on it. Reusable containers are recognized by other means which means the label does not have to stay on the container. There are also a few other instances where ''Pfand'' is due, for example for standardized gas containers. ''Pfand'' on glasses, bottles and crockery is also common at discotheques, self-service bars or public events, but usually not at a students' cafeteria. If you have a container you paid ''Pfand'' for and are not planning on taking it back, be a nice person and place it beside a waste bin so someone can take it and bring it back.\n\n====Cigarettes====\nAre easily available at most kiosks, supermarkets and newsagents. Cigarette machines are often dotted around towns and cities (be aware you will need an EU driving licence or a debit card with an electronic chip to \"unlock\" the machine; in restaurants you may ask the waiter for a identification card). As of November 2013, a pack of 19 cigarettes costs around €5.20. The legal age to buy tobacco and smoke publicly in Germany is 18. Some Germans buy rolling paper and rolling tobacco separately as this is significantly cheaper.\n\n===Opening hours===\nDue to a federal reform, opening hours are set by the states, therefore opening hours vary from state to state. Most states have no more strict opening hours from Monday to Saturday (however, you will rarely find 24 hours shops other than at petrol stations) the only exceptions are [[Saarland]] and [[Bavaria]] where stores are only allowed to open 6-20 and [[Sachsen]] 6-22. Sunday and national holidays is normally closed for shops everywhere in Germany, including pharmacies. However single pharmacies remain open for emergencies (every pharmacy will have a sign telling you which pharmacy is currently open for emergencies). Information can be obtained here [http://www.apotheken.de/aktuell/notdienste/]. Shops are allowed to open on Sundays on special occasions called \"Verkaufsoffener Sonntag\", information on open Sundays may be found here [http://www.verkaufsoffene-sonntage.de/] or here [http://www.verkaufsoffenesonntage.com/]. Every German city uses these days except [[Munich]].\n\nAs a rule of thumb:\n* Supermarkets: 08:00 or 09:00–20:00\n* big supermarkets 08:00-22:00\n* Rewe supermarkets 07:00-22:00 or 23:59\n*Shopping centres and large department stores: 10:00–20:00 \n*Department stores in small cities: 10:00–19:00\n*Small and medium shops: 09:00 or 10:00–18:30 (in big cities sometimes to 20:00)\n*Petrol stations: in cities and along the \"Autobahn\" usually 24 hours\n*Restaurants: 11.30-23:00 or 23:59, sometimes longer, many closed during the afternoon\n\nSmall shops are often closed 13:00-15:00. If necessary in many big cities you will find a few (sometimes more expensive) supermarkets with longer opening hours (often near the main station). Bakeries usually offer service on Sunday mornings (business hours vary) as well. Also most petrol stations have a small shopping area.\n\nIn some parts of Germany (like [[Berlin]], [[Cologne]], [[Düsseldorf]] and the [[Ruhr area]]) there are cornershops called \"Späti\" oder \"Spätkauf\" (\"latey\"), \"Kiosk\",  \"Trinkhalle\" (''drinking hall'') or \"Büdchen\" (''little hut'') that offer newspapers, drinks and at least basic food supplies. These shops are often run by Arab or Turkish immigrants and are, depending on the area, open till late night or even 24/7..\n\nBasic supplies can usually be bought around the clock at gas stations. Gas station owners work around opening hour restrictions by running 7-Eleven style mini marts on their gas station property. Be aware that prices are usually quite high. Another exception to this law are supermarkets located in touristy areas. Towns designated as a Kurort (health resort) are allowed to have their stores open all week during tourist season. Just ask a local for those well-kept secret stores.\n\nTrain stations are allowed to and frequently have their stores/shops open on Sundays, though usually for limited hours. In some larger cities such as [[Leipzig]] and [[Frankfurt]], this can include an entire shopping mall that happens to be attached to the train station.\n\n==Eat==\n[[Image:German Food Cuisine of the Month.jpg|thumb|250px|Brats on a Pretzel bun]]\n[[File:Currywurst & Pommes frites.jpg|thumb|250px|Currywurst & Pommes frites]]\nGerman food usually sticks to it's roots and a typical dish will consist of meat with some form of potatoes and gravy, accompanied by vegetables or salad. Modern German cuisine has been influenced by other neighbouring European countries such as [[Italy]] and [[France]] to become lighter. Dishes show a great local diversity which is interesting to discover.\n \nSince most large employers have a canteen for their employees, you will find relatively few sandwich shops and takeaways, and eating out culture in Germany is dominated by the Gasthaus/Gasthof and restaurants. Putting places to eat into 6 categories gives you a hint about the budget/taste. Starting from the lower end, these are:  \n\n===Imbiss===\n'Schnellimbiss' means 'quick snack', and is what you will see on the sign of German stalls and small shops that sell primarily sausage (Wurst) and fries (Pommes Frites). Sausages will include Bratwurst, which is fried and usually a boiled pork sausage. A very German variant is Currywurst: sausage chopped up and covered in spiced ketchup, dusted with curry powder. Beer and often even spirits are available in most Schnellimbisse.\n\n'Döner Kebab' is a Turkish dish of veal, chicken or sometimes lamb stuffed into bread, similar to Greek Gyros and Arab Schawarma. Even though considered Turkish, it's actually a speciality which originated in Germany. According to legend, it was invented by Turkish immigrants in West Berlin during the 1970s. In fact, the 'Döner' is Germany's favourite fast food dish. The sales of 'Döner' exceed those of McDonald's and Burger King products by far.\n\nNevertheless,  American fast food giants like McDonald's, Burger King and Pizza Hut can be found in most towns. Nordsee is a German seafood chain, which offers 'Rollmops' (pickled herrings) and many other fish and seafood snacks. However, many independent seafood snack bars (most common along the German coasts) offer slightly better and slightly cheaper seafood.\n\n===Bakeries and butchers===\nGermans have no tradition of sandwich shops but you will find that bakeries/butchers sell quite good takeaway food and are serious competition for the major fast food chains. Even the smallest bakeries will sell many varieties of bread or rolls, most of them darker (for example, using wholemeal or rye flour) than the white bread popular around the world and definitely worth a try. Even if they don't already have it prepared, almost all butchers will prepare a sandwich for you if you ask. Some butchers even prepare meals for you. This butcher 'imbiss' is mainly popular in southern Germany, and the quality and freshness of food is usually high.\n\n===Biergärten===\n[[File:Hofbraeukeller 5906.JPG|thumb|250px| A typical Biergarten]]\nHere you will get the obvious drink. In traditional beer gardens in [[Bavaria]], it is possible to bring your own food if you buy drinks, while in the northern parts of Germany, this behaviour would be considered inappropriate, so you had better courtously ask the waiter for the specific place's policy. Most places will offer simple meals. A very good place for beer and Bavarian food is the Biergarten of \"Kloster Andechs\" close to the Ammersee (round 40km southwest of Munich (take the Autobahn to the west (A96) or the S-Bahn).\n\n===Brauhaus===\nSmaller breweries sell their products straight to the customer and sometimes you will also find food there, among it usually \"Haxe\" or \"Schweinshaxe\" (pig's leg), a distinctively German specialty and probably the best dish in almost every establishment of that sort. In Frankonia, this is replaced by \"Schäuferla\" in different spellings. In other parts of Germany, you might find different traditional dishes being served. For example, in Cologne, where \"Halve Hahn\" (a rye roll with cheese) is considered typical. However, be aware of local customs. For example, in Cologne, it is usual that beer glasses that you have emptied will be replaced by a fresh, filled one, without any further enquiry; if you do not want to get it replaced any more, indicate this by putting a cardboard beer mat on top of your empty glass. Increasingly, new breweries, offering innovative beers, are opening in Germany, where you may order dishes which are down-to-earth and innovative at the same time. In some traditional breweries, and in pubs in the western part of Germany, your consumption is usually recorded on your beer mat, which is a small round piece of cardboard which is placed below your beer glass. And this leads to something which may be considered typically German: This pragmatic recording approach is supported by the legal order. Any manipulation of those records on beer mats, or the suppression of such beer mats, is considered \"forgery of documents\", or \"elimination of documents\", both being criminal offences. The fact that beer mats are associated with legal documents even got reflected in a campaign of a German politician, demanding that tax returns should be so easy that \"every citizen should be in a position to file the return on a beer mat\".\n\n===Gasthof/Gasthaus===\nProbably 50% of all eating places fall into this group. They are mainly family-run businesses that have been owned for generations, comparable to pubs in the UK. You can go there simply for a drink, or to try German food (often with a local flavour). Food is usually down-to-earth and may range from very basic dishes to local specialities.\n\nExcept from very simple places that try to feed people off with reheated convenience products, the quality of the food can be very good. If you spot a place that appears popular with the locals, it's usually worth giving it a try. When locals who appear to be quite well-off indicate a certain place and state that prices are appropriate, you should definitely give a try to such place: In formerly rural areas which are quite near to larger cities and which have turned into quite wealthy suburban spaces, formerly simple rural pubs have adopted to a quite wealthy, albeit price-aware and critical, new clientele. They might offer surprisingly elaborate food, a large variety of beverages, in particular selected wines, and food which conforms with specific dietary requirements. Usually, they do not need to advertise much, but rather rely on recommendations. And they know that their clientele knows the German proverb: \"You do not get rich from spending money, but from keeping it.\" This means: You have to pay some price for good quality of food and beverages, but not for more. Expect such places in particular around cities like Frankfurt, Düsseldorf, Munich, or Hamburg.\n\nEspecially in more rural areas, a traditional Gasthof may not cater for all dietary requirements (e.g. vegetarian/vegan). In that case, check the menu before entering.\n\n===Restaurants===\nGermany has a wide range of foreign cuisines available (e.g. German, Chinese, Japanese, Thai, Polish, Indian, Italian, French, Spanish, Greek, Turkish) and almost all styles of the world are represented.\n\nMost cities will also have speciality restaurants that cater for various dietary requirements. Berlin in particular, offers a lot of vegan and vegetarian options. Outside of the bigger cities, the situation may be more difficult but most restaurants will try to accomodate you and list at least some vegetarian options.\n\nFood at Turkish and Arab eateries will usually be halal, and most of the time they will also have vegetarian options. Kosher restaurants are rare and will only be found in cities with a notable Jewish population, such as Berlin.\n\nIn most restaurants in Germany you can choose your own table. You can make reservations (recommended for larger groups and haute cuisine on Saturday nights) and these are marked by reservation cards (\"Reserviert\"). In some more expensive restaurants in larger cities, you should have reservation and will be seated by the staff - in simpler restaurants you'll just pick a table and sit down.\n\nRestaurants in commercial areas often offer weekday lunch specials. These are cheap (starting at €5, sometimes including a beverage) options and a good way to sample local food. Specials tend to rotate on a daily or weekly basis, especially when fresh ingredients like fish are involved. \n\nSome restaurants offer all-you-can-eat-buffets where you pay around €10 and can eat as much as you want. Drinks are not included in this price.\n\nIf you cannot finish your meal, you can ask whether it is possible to wrap your leftovers for taking them home. Most restaurant staff are happy about this request, as it indicates that you indeed liked the food and simply could not finish. Legally, you bought the food served, are the owner of it, and are allowed to take it home, but the restaurant is not required to wrap it. As they will be happy to wrap it for you without formal surcharge, and as they will be providing you with a bag for comfortably taking it home, consider to add an additional euro to the tip for that service as a gesture of appreciation.\n\n\"XXL-Restaurants\" are rising in popularity in some areas. These restaurants offer mostly standardized meat dishes like Schnitzel or Bratwurst in big to inhumane sizes. It is common and encouraged to take leftover food home. Although such food will usually not contain any preservatives or other additives (as the turnaround is high), do not expect the food or the customers of such restaurants to be very healthy.\n\n=== Table manners ===\nAt ''very'' formal events and in high-end restaurants, a few deviations of German customs from western standards should be noted:\n* It is considered bad manners to eat with your elbows resting on the table. Keep only your wrists on the table. Note that most Germans will keep up this manner in everyday life since this is one of the most basic rules that parents will teach their children. If you go to a restaurant with your German friends, you may want to pay attention to do so, too.\n* When moving the fork to your mouth, the curved end should point upwards (not downwards as in the UK).\n* If you eat a piece of meat (e.g. a steak), do not cut it into pieces before you start eating it (as it is common in the United States). Rather leave the fork in your left hand, and the knive in your right hand, cut off a small piece, and eat just that piece using your fork (still in your left hand) without cutting anything else.\n* When you cheer, look straight into the eyes of the person you are cheering with at that moment. This is a universal rule which strictly applies in any setting, regardless whether you clink glasses with the Federal President or rather with some tramps you are crossing beer bottles with. According to a German legend, not keeping this rule leads to seven years of disgusting sex. Nobody in the country is willing to take that risk.\n* When eating soup or other food from your spoon, hold it with the tip towards your mouth (not parallel to your lips as in the UK). Small spoons used to stir coffee, should not be put in your mouth at all. \n* If you have to leave the table, it is fine to put your napkin (which should have rested, folded once along the centre, on your lap until then) on the table, to the left of your plate, in an elegant little pile -- unless it looks really dirty, in which case you might want to leave it on your chair.\n* Even among close friends, and even within families, it is considered rude to leave the table without due excuse, before the meal has been finished, and even small children are discouraged to do so. In formal settings, it is considered impolite to leave the table \"before the coffee\", which is usually served after dessert. This rule even applies for smoking breaks. However, it is, at all times, possible to leave the table to go to the toilet or for any similarly legitimate reason. In that case, it is required - even in extreme lower-class environments (!), and also towards children - to bring an excuse and to tell some people at the table where you just have to go to, and why. The wording of such excuse depends on the people you are eating or drinking with and, thus, might be extremely straightforward, or formalised. In any environment (highest to lowest class), women may explain that they need to \"powder their nose\", and men may say that \"need to vanish for a short while\", which would be understood without any ridicule or bad remark. Except for very formal settings, involving a protocol, the phrases that a woman has to leave \"for small girls\" or a man has to leave \"for small boys\" are considered appropriate.\n\n===Typical dishes===\n[[Image:Bavarian food.jpg|thumb|300px|Hearty [[Bavaria]]n food on a fancy plate.  Left to right: ''Schnitzel'', pork belly (''Schweinebauch'') with red cabbage (''Rotkohl'' or \"Blaukraut\"), ''Weißwurst'' with mashed potatoes (''Kartoffelpüree''), ''Bratwurst'' on sauerkraut]]\n\n'''Rinderroulade''' mit Rotkraut und Knödeln: this dish is quite unique to Germany. Very thin sliced beef rolled around a piece of bacon and pickled cucumber until it looks like a mini barrel (5cm diameter) flavoured with tiny pieces of onion, German mustard, ground black pepper and salt. The meat is quick-fried  and is then left to cook slowly for an hour, meanwhile red cabbage and potato dumplings are prepared and then the meat is removed from the frying pan and gravy is prepared in the frying pan. Knödel, Rotkraut and Rouladen are served together with the gravy in one dish. \n\n'''Schnitzel''' mit Pommes frites: there are probably as many different variations of Schnitzel as there are restaurants in Germany. They have in common a thin slice of pork often covered in egg and bread crumbs that is fried for a short period of time and it is often served with fries (that's the ''Pommes frites'' part). Variations of this are usually served with different types of gravy: such as Zigeunerschnitzel, Zwiebelschnitzel, Holzfäller Schnitzel and Wiener Schnitzel (as the name suggests, an Austrian dish – the genuine article must be veal instead of pork, which is why most restaurants offer a ''Schnitzel Wiener Art'', or ''Viennese-style schnitzel'' which is allowed to be pork). In the south, you can often get Spätzle (pasta that [[Swabia]] is famous for) instead of fries with it.  Spätzle are egg noodles typical of south Germany – most restaurants make them fresh. Due to the easiness of its preparation ordering it might be perceived as an insult to any business with a decent reputation (with the exception of Wiener Schnitzel perhaps), admittedly it is almost unavoidable to spot it on the menu of any German sleazy joint (and there were – and still are – so many that even Churchill's bombs couldn't hit 'em all...), if nothing else therefore it might even be the most common dish in German restaurants (yes, at least German government officials '''do''' call their taverns as well as the common fast food stalls restaurants!). \n\n[[File:Badische Maultaschen.jpg|thumb|250px|Badische Maultaschen]]\n'''Rehrücken''' mit Spätzle: Germany has maintained huge forests such as the famous Black Forest, Bayrischer Wald  and Odenwald. In and around these areas you can enjoy the best game in Germany. Rehrücken means venison tenderloin and it is often served with freshly made noodles such as Spätzle and a very nice gravy based on a dry red wine. \n\n'''Wurst''' “sausage”: there is no country in the world with a greater variety of sausages than Germany and it would take a while to mention them all. “Bratwurst“ is fried, other varieties such as the Bavarian “Weißwurst“ are boiled. Here is the shortlist version: “Rote” beef sausage, “Frankfurter Wurst” boiled pork sausage made in the Frankfurt style, “Pfälzer Bratwurst” sausage made in Palatine style , “Nürnberger Bratwurst” Nuremberg sausage – the smallest of all of them, but a serious contender for the best tasting German sausage, “grobe Bratwurst”, Landjäger, Thüringer Bratwurst, Currywurst, Weißwurst ... this could go on till tomorrow. If you spot a sausage on a menu this is often a good (and sometimes the only) choice. Often served with mashed potato, fries or potato salad. The most popular type of sausage probably is the Currywurst (Bratwurst cut into slices and served with ketchup and curry) and can be bought almost everywhere.\n\n[[File:Schweinebraten.wmt.jpg|thumb|250px|Schweinebraten.wmt]]\n'''Schweinebraten''': Roast pork, tradidtional the closer you get to (or into) Munich. Try the crust, which should be crispy. There sould be little visible (but tastible) fat. If you pass through Nuremberg, try '''Schäufele''', the local variant of pork shoulder in a restaurant that has it on the daily (not the regular) menu. Both are usually served with ''Klöße'', made from raw (or cooked) mashed potatoes and lots of gravy (feel free to order more).\n\n'''Königsberger Klopse''': Literally \"meatballs from Königsberg\", this is a typical dish in and around Berlin. The meatballs are made out of minced pork and anchovies and are cooked and served in a white sauce with capers and rice or potatoes.\n\n'''Matjesbrötchen''': Soussed herring  or \"roll mops\" in a bread roll, typical street snack.\n\n===Local specialities===\nStarting from the north of Germany going south you will find a tremendous variety of food and each region sticks to it origins.\nThe coastal regions are fond of seafood and famous dishes include “Finkenwerder Scholle”, going south to the region of Cologne you will find Sauerbraten (a roast marinated in vinegar), if made really traditionally it's from horse meat.\n\n'''Labskaus''' (although strictly speaking not a German invention) is a dish from the north and the opinions about this dish are divided, some love it, others hate it. It is a mash of potato, beetroot juice and cured meat decorated with rollmops and/or young herring and/or a fried egg and/or sour cucumber and/or beetroot slices on top. The north is also famous for its '''lamb dishes''', the best type of lamb probably being \"Rudenlamm\" (lamb from Ruden, a small island in the Baltic Sea; only a few restaurants in Mecklenburg-Western Pomerania serve this), the second best type being \"Salzwiesenlamm\" (salt meadow lamb). The Lueneburger Heide (Lueneburg Heath) is famous not only for its heath but also for its Heidschnucken, a special breed of sheep. Be aware that a lot of restaurants import their lamb from New Zealand though because it is cheaper. Crabs and mussels are also quite common along the German coasts, especially in North Frisia.\n\nA speciality of Hamburg is \"Aalsuppe\" which - despite the name (in this case \"Aal\" means \"everything\", not \"eel\") - originally contained almost everything - '''except eel''' (today many restaurants include eel within this soup, because the name led tourists into confusion). At the coast there's a variety of fish dishes. Beware: if a restaurant offers \"Edelfischplatte\" or any dish of similar name, the fish may be not fresh and even (this is quite ironical) of poor quality. Therefore, '''it is strongly recommended that, for eating fish, you visit specialised''' (or quality) '''restaurants only'''. A fast-food style restaurant chain serving standardized quality fish and other seafood at low prices all over Germany is \"Nordsee\", though you will rarely find authentic specialties there.\n\n'''Pfälzer Saumagen''': known for a long time in Palatinate, but difficult to find outside of this area. The dish became well known to the general public in Germany as then-Chancellor Helmut Kohl’s favourite dish, especially when this was enjoyed by him and the Russian president Mikhail Gorbatchev on a State visit in Germany in [[Deidesheim]]. Pictures of the feast are shown in the restaurant “ Deidesheimer Hof” in Deidesheim. Literally this is pig stomach filled with a mash of potato and meat, cooked for 2-3 hours and then cut in thick slices often served with sauerkraut.\n\n[[File:Spätzle-02.jpg|thumb|250px|Spätzle]]\nSwabia is famous for Spätzle (a kind of noodle), \"Maultaschen\" (noodles stuffed with spinach and mince meat, but lots of variations, even veggie ones, exist). \n\nIn Bavaria, this may be Schweinshaxe mit Knödeln (pork's leg with knödel, a form of potato dumplings), \"Leberkäs/Fleischkäse mit Kartoffelsalat\" (kind of meat pie and potato salad), \"Nürnberger Bratwurst\" (probably smallest sausage in Germany), Weißwurst (white sausages) and \"Obatzda\" (a spicy mix of several milk products).\n\nThe south is also famous for it's nice tarts such as the \"Schwarzwälder Kirschtorte\" (tart with lots of cream and spirit made from cherries).\n\nA delicacy in Saxony is '''Eierschecke''', a cake made of eggs and cream similar to cheese cake.\n\nA specialty of the East is \"Soljanka\" (originating from Ukraine, but probably the most common dish in the GDR), a sour soup containing vegetables and usually some kind of meat or sausages.\n\n===Seasonal specialities===\n[[Image:Spargel sauce hollandaise.jpg|thumb|250px|Typical serving of asparagus with Hollandaise sauce and potatoes]]\n\nWhite “Spargel” (asparagus) floods the restaurants from April to June all over Germany, especially in and around Baden-Baden and the small town of Schwetzingen (\"The Asparagus Capital\"), near Heidelberg, in an area north and north-east of Hannover (\"Lower Saxony's Asparagus Route\"),  as well as in the area southwest of Berlin, especially in the town of Beelitz and along the Lower Rhine (\"Walbecker Spargel\"). Many vegetables can be found all year round and are often imported from far away. Whereas asparagus can be found for only 2 months and is best enjoyed fresh after harvest, it stays nice for a couple of hours or until next day. The asparagus is treated very carefully and it is harvested before it is ever exposed to daylight, therefore it remains white. When exposed to daylight it changes its colour to green and might taste bitter. Therefore, white asparagus is considered to be better by most Germans. \n\nThe standard asparagus meal is the asparagus stalks, hollandaise sauce, boiled potatoes, and some form of meat. The most common meat is ham, preferably smoked; however you will also find it teamed with schnitzel (fried breaded pork), turkey, beef, or whatever is available in the kitchen.\n\nWhite asparagus soup is one of the hundreds of different recipes that can be found with white asparagus. Often it is made with cream and contains some of the thinner asparagus pieces. \n\nAnother example of a seasonal speciality is \"Grünkohl\" (kale). You can find that mainly in Lower Saxony, particularly around Oldenburg and the \"Ammerland\", Bremen, as well as the southern and south-western parts such as the \"Emsland\" or around the \"Wiehengebirge\" and the \"Teutoburger Wald\", but also everywhere else there and in the eastern parts of North-Rhine-Westphalia. It is usually served with a boiled rough sort of sausage (called \"Pinkel\" around Oldenburg) and roasted potatoes. If you are travelling in Lower-Saxony in fall, you should get it in every \"Gasthaus\". Usually the first \"Grünkohl\" is harvested after the first frost in autumn and is on the menu from November until March. \n\n'''Lebkuchen''' are some of Germany's many nice Christmas biscuits and gingerbread. The best known are produced in and around [[Nuremberg]].\n\n[[File:Stollen with candied fruits.jpg|thumb|250px|Stollen with candied fruits]]\n'''Stollen''' is a kind of cake eaten during the Advent season and Yuletide. Original Stollen is produced only in [[Dresden]], [[Saxony]], however you can buy Stollen everywhere in Germany (although Dresdner Stollen is reputed to be the best (and - due to the lower salaries in Eastern Germany - comparatively cheap)).\n\nAround St. Martin's day and Christmas, roasted geese (\"Martinsgans\" / \"Weihnachtsgans\") are quite common in German restaurants, accompanied by \"Rotkraut\" (red cabbage) and \"Knödeln\" (potato dumplings), preferably served as set menu, with the liver, accompanied by some kind of salad, as starter, goose soup, and a dessert.\n\n===Miscellaneous===\nGermans are very fond of their '''bread''', which they make in many variations. This is the food that Germans tend to miss most when away from home. Most people like their bread relatively dark and dense and scorn the soft loaves sold in other countries. Bakeries will rarely provide less than twenty different sorts of bread and it's worth trying a few of them. In fact, many Germans buy their lunch or small snacks in bakeries instead of takeaways or the like. Prices for a loaf of bread will range from 0.50 € to 4 €, depending on the size (real specialties might cost more). In bakeries it is possible and even common to buy half or even quarter of a loaf.\n\n=== Vegetarian ===\nMost restaurants have one or two vegetarian dishes, but there aren't many places which are particularly aimed at vegetarian or vegan customers, except a few places in big cities like Berlin. If the menu does not contain vegetarian dishes, do not hesitate to ask.\nVegetarian restaurant guides can be found at [http://www.vegan.de/guide/restaurants/] (german) or [http://www.fleischlos-geniessen.de] (VEBU restaurant list, the restaurants are not necessarily vegetarian in general). Be aware when ordering to ask whether the dish is suitable for vegetarians, as chicken stock and bacon cubes are a commonly \"undeclared\" ingredient on German menus.  \n\nHowever, there are usually organic food shops (\"Bioladen\", \"Naturkostladen\" or \"Reformhaus\") in every city, providing veg(etari)an bread, spreads, cheese, ice cream, vegan milk substitutes, tofu and seitan.  The diversity and quality of the products is great and you will find shop assistants that can answer special nutritional questions in great depth.\n\nVeganism and vegetarianism is on the rise in Germany so that many supermarkets (such as Edeka and Rewe) have a small selection of vegan products as well in their \"Feinkost\"-section such as seitan-sausages, tofu or soy milk at a reasonable price.\n\n===Allergy & Celiac Sufferers===\nWhen shopping for foods, the package labelling in Germany is generally reliable.  All food products must be properly labeled including additives and preservatives. Be on the look out for \"Weizen\" (wheat), \"Mehl\" (flour) or \"Malz\" (malt) and \"Stärke\" (starch). Be extra cautious for foods with \"Geschmacksverstärker\" (i.e. flavour enhancers) that may have gluten as ingredients.\n\n* '''Reformhaus''' [http://www.reformhaus.de/branche/reformhaeuser.htm] - a 3.000 strong network of health food stores in Germany and Austria that has dedicated gluten-free sections stocked with pasta, breads and treats.  Reformhaus stores are usually found in the lower level of shopping centres (i.e. PotsdamerArkaden, etc.)\n\n* '''DM Stores''' [http://www.dm-drogeriemarkt.de/dmDHomepage/generator/dmD/Homepage/Filialstandorte/Filialfinder/Filialfinder.html] - the CWS/Shopper's Drug Mart equivalent in Germany has dedicated wheat and gluten free sections\n\n* '''Alnatura''' [http://www.alnatura.de/] - natural foods store with a large dedicated gluten-free section\n\n===Smoking===\nThe German federal-states started banning smoking in public places and areas in early-2007, however the laws vary from state to state. Smoking is generally banned in all restaurants and cafes. Some places may provide separate smoking areas but it is best to enquire when booking. Smokers should be prepared to step outside if they want to light up. Smoking is banned on all forms of public transport including on railway platforms (except in designated smoking areas, which are clearly marked with the word \"Raucherbereich\" [smoking area]). The laws are strictly enforced, although when found smoking in a non-smoking area for the first time you will not usually be fined, but merely reminded not to smoke there.\n\nThe German smoking ban does not apply to e-cigarettes as was decided by the upper administrative court (Oberverwaltungsgericht) of North Rhine-Westphalia in 2014. Therefore, pubs and restaurants may allow their guests to use e-cigarettes. It is advisable to ask wether it is permitted or not. E-cigarettes may not be used on public transport, at railway stations and airports outside smoking areas. However, this ban is not by law, but rather by the house rule of the transport company or the airport.\n\n==Drink==\nLegal drinking age is 18 for spirits (drinks containing distilled alcohol) and 16 for everything else (e.g. beer and wine). Drinking in public is generally legal and accepted as long as you still know how to behave.\nA few cities tried to restrict drinking in public places/at certain times but the legal status of those laws is disputed and they were sometimes abolished some time later. \nConsuming alcoholic drinks might be prohibited in some (local) public transports. In case of an offence you might be expelled and fined (typically a sum around 40€).\nSometimes the restriction only mentions \"excessive\" drinking. \nViolations are always considered a civil and not criminal matter.\n\n===Beer===\n[[File:Weizenbier-ukko.jpg|thumb|150px||German wheat beer]]\n[[Image:Flaeschebier.jpg|thumb|250px|The various kinds of bottled Kölsch beer]]\n\nFor centuries, beer-making in Bavaria has been governed by the ''Reinheitsgebot'' (purity law) that was made national policy with the unification of Germany in 1871, which states that German beer may be made only from hops, malt, yeast and water. The Reinheitsgebot has come down with the European integration, but German breweries still have to stick to it since for them, national law applies.\n\nThe domestic beer market is not dominated by one or a only a few big breweries. Even though there are some big players, the regional diversity is enormous, and there are over 1200 breweries with most of them serving only local markets. Usually bars and restaurants serve the local varieties that differ from town to town. When sitting in a German ''Kneipe'', a local beer is always an option, and often the only option.\n\nSpecialities include ''Weizenbier'' (or Weissbier in Bavaria), a refreshing top-fermented beer which is popular in the south, ''Alt'', a kind of dark ale that is especially popular in and around [[Düsseldorf]], and ''Kölsch'', a special beer brewed in [[Cologne]]. \"Pils\", the German name for pilsner is a light-gold coloured beer that is extremely popular in Germany. There are also seasonal beers, which are made only at different times of the year (such as Bockbier in winter and Maibock in May, both containing a greater quantity of alcohol, sometimes double that of a normal Vollbier). \nIf you simply order a beer, it will typically be a Pilsener.\nBeer is usually served in 200 or 300ml glasses (in the northern part) or 500ml in the South. In Biergartens in Bavaria, 500ml is a small beer (\"Halbe\") and a liter is normal (\"Maß\" pronounced \"Mahss\"). Except for in Irish pubs, pints or pitchers are uncommon. \nFor Germans, a lot of foam is both a sign of freshness and quality; thus, beer is always served with a lot of head. (All glasses have volume marks for the critical souls.) \nAdditionally, Germans are not afraid to mix beer with other drinks (though the older generation may disagree). Beer is commonly mixed with carbonated lemonade (usually at 1:1 ratio) and called a \"Radler\" (or cyclist so named because it is commonly associated with a refreshing drink a cyclist might enjoy in spring or summer during a cycling excursion) (or \"Alsterwasser\"/\"Alster\" (after the river in [[Hamburg]]) in the north); \"Cocktails\" of Pilsener/Altbier and soft drinks like Fanta, a \"Krefelder\"/\"Colaweizen\" cola and dark wheat beer is another combination that can be found. Pils mixed witch Cola is very popular especially amongst younger Germans and goes different names - depending on your area - such as \"Diesel\", \"Schmutziges\" (dirty) or \"Schweinebier\" (pigs beer) to name a few. Another famous local delicacy is \"Berliner Weiße\", a cloudy, sour wheat beer of around 3% abv. that is mixed with syrups (traditionally raspberry) and is very refreshing in summer. These beer-based mixed drinks are widespread popular and can be bought as pre-mixed bottles (typically in six packs) wherever regular beer is sold.\n\nPubs are open in Germany until 2 in the morning or later. Food is generally available until midnight. Germans typically go out after 8PM (popular places already fill up at 6PM).\n\nThe American English word \"stein\", used for a large mug, is unknown in Germany, which might be surprising for many tourists. In German language, the word means \"stone\" and does not at all relate to any vessel. Except in places where many American tourists are present, staff might not understand any order for a \"stein\" of beer, as the word is usually not being taught in English lessons at German schools.\n\n===Cider=== \nUndisputed capital of \"Apfelwein\" cider in Germany is [[Frankfurt]]. Locals love their cider and it is very popular around there. There are even special bars (\"Apfelweinkneipe\") that will serve only \"Apfelwein\" and some gastronomic specialities. Cider is often served in a special jug called \"Bembel\". The taste is slightly different from Ciders in other countries and tends to be quite refreshing. In autumn when apples are turned into cider you might find \"Frischer Most\" or \"Süßer\" signposted at some places. That is the first product in the chain of \"Apfelwein\" production; one glass of it is nice, but after two or three glasses you will have a problem unless you enjoy spending lots of time on the toilet. In the [[Saarland]] and surrounding regions \"Apfelwein\" is called \"Viez\". It varies here from \"Suesser Viez\" (sweet), to \"Viez Fein-Herb\" (medium sweet) to \"Alter Saerkower\" (sour). The Viez capital of that region is [[Merzig]]. During winter it is also quite common to drink hot cider (along with some cloves and sugar) as a prophylactic measure against an upcoming cold.\n\n===Apfelschorle===\nThe real national drink of Germany is not beer. Good beer is also made in many other countries (ask the Czechs, the Brits, the Belgians, the Dutch, etc...). The true national drink is \"Apfelschorle\" - a fact that even some Germans may only realize as soon as they leave their country and just can't find their everyday drink abroad. You get it everywhere in Germany (plus Austria and Switzerland) but nowhere else.\n\nApfelschorle is a 50-50 mix of apple juice and carbonated water. It is popular in particular on hot summer days and kind of replaces soft drinks and sometimes even a beer! You will get it at almost any restaurant and bottled ready-mixed at every supermarket including the \"discounters\" and also from Cola vending machines. Even McDonald's put it on its German menu and The CocaCola Company launched \"Lift\", its own Apfelschorle brand - although you can't get the really good natural unfiltered-murky stuff from them.\n\nAnd yes: it is Alcohol-free and (also) very popular among kids.\n\nIn Bavaria and Austria you may have to ask for ''Gespritzter Apfelsaft'' to get the same kind of drink.\n\nWhen buying a bottled Schorle, read the fine print to make sure there is nothing but Apple juice and carbonated water in your drink. (Versions with 10% lemon juice may be acceptable though this is not part of the \"pure\" recipe.) In Summer be careful opening unrefrigerated plastic Schorle bottles. Schorle was not invented by industrial food designers that would have added de-foaming agents, so wetting yourself may be the price you have to pay for a sip of (violent) nature.\n\nEnjoy!\n\n===Coffee===\nGermans drink lots of '''coffee'''. Currently, the port of Hamburg is the world's busiest place for coffee trading. Coffee is always freshly made from ground coffee or beans - no instant. However, persons coming from countries with a great coffee tradition (like [[Italy]], [[Portugal]], [[Turkey]], [[Greece]] or [[Austria]]) might find the coffee that is served in normal restaurants a bit boring. A German specialty, originating from North Frisia but nowadays also common in East Frisia, is \"Pharisäer\", a mixture of coffee and a spirit, usually rum, with a thick cream top. A variation of this is \"Tote Tante\" (''dead aunt'', with coffee replaced by hot chocolate).\n\nOver the past few years, American coffee house chain Starbucks has expanded into Germany, but mostly you will encounter \"Cafés\" which usually offer a large selection of cakes to go along with the coffee.\n\n===Glühwein===\nVisiting Germany in December? Then go and see one of the famous Christmas markets [http://ntripping.com/german-christmas-markets/] (the most famous taking place in [[Dortmund]], [[Nuremberg]], [[Dresden]], [[Passau]], [[Leipzig]], [[Münster]], [[Bremen]], [[Augsburg]] and [[Aachen]]) and this is the place where you find Glühwein (''mulled wine''), a spiced wine served very hot to comfort you in the cold of winter.\n\n===Spirits===\n“Kirschwasser” literally means ''cherry water''; it certainly tastes of cherry but on the other hand it is not regular drinking water. There is a long lasting tradition in making spirits in Baden, and “Kirschwasser” is probably the flagship product and it might encourage you to taste other specialities such as Himbeergeist (from raspberry), Schlehenfeuer (flavored with sloe berries), Williamchrist (pear) and Apfelkorn (apple). \n\n“Enzian” Bavarians like their beer as well their Enzian. A spirit high in alcohol that is best as a digestive after a hefty meal.\n\n\"Korn\", made of grain, is probably the most common spirit in Germany. Its main production centre (Berentzen) lies in Haselünne, where tours and tastings can be arranged in the distilleries. The town is located near the river Ems in northwest Germany; for rail service to Haselünne (very sparse) see Eisenbahnfreunde Hasetal [http://www.eisenbahnfreunde-hasetal.de]. Another sort is the Doppelkorn from [[Nordhausen]] in Thuringia, in the very middle of Germany. \n\nIn North Frisia, \"Köm\" (caraway spirit), either pure or mixed with tea (\"Teepunsch\", ''tea punch''), is very popular.\n\n\"Eiergrog\" is a hot mixture of egg liquor and rum.\n\n\"Eierlikörpunsch\" is a hot eggnog drink with rum often founds in Christmas markets. \n\n\"Jägermeister\" is a famous German bitter liquor brewed with herbs and spices. Produced only in Wolfenbüttel, Lower Saxony, but exported to many countries.\n\n===Tea===\nTea is also very popular, and a large choice is readily available. The region of East Frisia in particular has a long tea tradition, and is probably the only place in Germany where tea is more popular than coffee. The East Frisian tea ceremony consists of black tea served in a flat porcelain cup with special rock sugar (''Kluntje'') that is put in the cup before pouring the tea. Cream is added afterwards, but is not stirred into the tea.\n\n===Wine===\nGermans are just as passionate about their wines as they are about their beer. The similarities don't stop here, both products are often produced by small companies if not by families or individuals, and the best wines are consumed locally and only the remaining ones are exported. The production of wine has a 2000 year old history in Germany as learned from the Rheinisches Landesmuseum [[Trier]], but of course this was a roman settlement at this time. Sunshine is the limiting factor for the production of wines in Germany and therefore the wine production is limited to the south. White wine plays a main role in the wine production, but some areas produce red wines (Ahr, Baden Württemberg). White wines are produced from Riesling, Kerner and Müller-Thurgau grapes (there are a lot more, but to name them all would be too much), and produce generally fresh and fruity wines. German wines can be rich in acid and are quite refreshing. It is generally accepted that Riesling grapes produce the best German wines, but they demand a lot of sunshine and they grow best in very exposed areas such the Mosel, Rheingau, Bergstrasse, Kaiserstuhl and Pfalz. \n\nThe best way to learn about wines is go to the place where they are grown and taste them on the spot. This is called \"Weinprobe\" and is generally free of charge though in touristic areas you have to pay a small fee. Good wines usually go together with good food and therefore it is well worth it to visit some of those places. \n\nAnother nice opportunity to get a taste of local wine is the so-called ''Straußenwirtschaft'', ''Besenwirtschaft'' or ''Heckenwirtschaft''. These are little \"pubs\" or gardens where a wine-producer sells his own wine, normally with little meals such as sandwiches or cheese and ham. Normally, they are open only in summer and autumn, and not longer than 4 months a year (due to legal regulations). As they are sometimes located in the vineyards or in some backstreets, they are not always easy to find, so you best ask a local for the next (or best) Straußenwirtschaft he knows.\n\nDuring the fall you can buy \"Federweisser\" in south-western Germany. This is a partially fermented white wine and contains some alcohol (depending on age), but tastes very sweet. It is also available from red grapes, being called \"Roter Sauser\".\n\nWine producing areas are:\n\n'''Ahr''' \nAhr is the paradise of German red wines. Half of the production is dedicated to red wines and it is densely populated with “Gaststätten” and “Strausswirten”. A saying goes: Who visited the Ahr and remembers that he was there, hasn’t actually been there. \n\n'''Baden''' [http://www.badischer-wein.de/] With approx. 15,500 hectare of wine yards and a production of 1 mn hectolitre Baden is Germany’s third biggest wine growing area. It's the most southern German wine growing area and is Germany’s only member of the European Wine Category B together with the famous French areas Alsace, Champagne and Loire. Baden is more than 400 km long and is split into nine regional groups: Tauberfranken, Badische Bergstraße, Kraichgau, Ortenau, Breisgau, Kaiserstuhl, Tuniberg, Markgräflerland and Bodensee. The Kaiserstuhl and the Markgräflerland are the most famous areas for wine from Baden. One of the largest wine cooperatives is the  Badischer Winzerkeller [http://www.badischer-winzerkeller.de/] in [[Breisach]] (English site).\n\n'''Franken''': Franconia is in the northern part of [[Bavaria]] and you can find there very nice wines. Some wines produced in Franconia are sold in a special bottle called \"Bocksbeutel\". \n\n'''Hessische Bergstrasse''': located on the slopes of the Rhine valley it is a quiet small wine producing area and wines are usually consumed within the area in and around [[Heppenheim]].\n\n'''Mosel-Saar-Ruwer''': the steepest vineyards in Germany can be seen when driving in the Mosel valley from [[Koblenz]] to [[Trier]]. \n\n'''Pfalz''': biggest wine producing area in Germany. Has some excellent wines to taste and a lot of nice villages embedded in vineyards. Tasting wine in [[Deidesheim]] is a good idea and several prime producer of German wine are all located on the main road. Want to see the biggest wine barrel in the world then go to [[Bad Dürkheim]]. \n\n'''Rheingau''': is the smallest wine producing area, but it produces the highest rated Riesling wines in Germany. Visit [[Wiesbaden]] and make a trip on the Rhine to [[Rüdesheim]].\n\n'''Rheinhessen''' too is especially famous for its Riesling.\n\n'''Sachsen''': One of the smallest wine regions in Germany, nestled along the Elbe River near [[Dresden]] and [[Meissen]].\n\n'''Württemberg'''\nAs it was mentioned before, here the rule, that the wine production is consumed by the locals, strictly applies. The wine consumption is twice as high as in the rest of Germany, regardless of whether it's red or the white wine. The specialty of the region is the red wine called Trollinger and it can be quite nice by German standards.\n\n'''Saale-Unstrut''': located in the state Saxonia-Anhalt at the banks of the rivers Saale and Unstrut it is most northern wine area in Europe.\n\n==Sleep==\nGermany provides almost all options for accommodation, including hotels, B&B's, hostels, and camping. You might also consider staying with members of a [[hospitality exchange]] network.\n\n=== Hotels ===\nMost international hotel chains have franchises in the major German cities, and a large variety of local hotels exist. All hotels in Germany are ranked by stars (1 to 5 stars). The rankings are made independently under consideration of strict guidelines and are therefore reliable albeit somewhat technocratic. The rate always includes VAT, is usually per room and includes in most places breakfast. Prices vary significantly by city ([[Munich]] and [[Frankfurt]] are most expensive). A cheap and convenient way to stay are Ibis Hotels [http://www.ibishotel.com] and City Hotels[http://www.hotels-frankfurt-oder.de], usually located near major railway stations. For people who travel by car,  Etap [http://www.etaphotel.com/gb/home/index.shtml] hotels located at the outskirts of cities near autobahns offer rates that can compete with hostel prices; though those hotels are not necessarily better and they lack the individuality hostels are renowned for.\n\n=== B&Bs ===\nB&Bs (\"Pensionen\" or \"Fremdenzimmer\") (usually) provide less comfort than hotels for cheaper prices. The advantage is that you are likely to meet Germans and get a touch of the German way of living. A sign saying \"Zimmer frei\" indicates a B&B with a room available.\n\n=== Hostels ===\n[[Hostels]] provide simple, budget accommodation primarily in shared rooms. They are good places to get to know other travellers. In Germany, as in many countries, two flavors exist: international youth hostels and independent hostels.\n\nInternational Youth Hostels (\"Jugendherbergen\") are owned and run by the association \"Deutsches Jugendherbergswerk\" (DJH), which is part of the Hostelling International (HI) network. There are more than 600 hostels spread all over Germany in big and small cities as well as in the country side. Not only individual travellers are guests but also school classes and other youth groups. To sleep there, you have to be or become a member in a youth hostel organisation belonging the  HI network [https://www.hihostels.com]. Detailed information about this and each of their hostels can be found on the DJH's [http://www.jugendherberge.de/international/].  Generally, this entails simply filling out a card and payng a few extra Euro per night.  In general, the advantage of these places is that they tend to serve a buffet style breakfast for no additional charge, though this is not an absolute rule.  However, the quality is often below that of private hostels although they are more expensive in germany, and many do not provide a good opportunity for socializing.\n\nPrivately run independent hostels are starting to be an attractive alternative for a similar price. More than 60 already exist in Germany, getting more and more every year. They are located in bigger cities, especially in [[Berlin]], [[Munich]], [[Dresden]], and [[Hamburg]]. Only few are in the country side. Sometimes run by former travellers, hostels refrain from having strict rules. Especially small ones are frequently places where you can feel at home. Many are known for their vibrant, party atmosphere and can be an excellent way to meet other travelers.  There is no need to be a member in some organisation to sleep there. About half of the hostels have organized themselves in a  \"Backpacker Network Germany\" [http://www.german-hostels.de], which provides a list of their members hostels. A website which lists almost every independent hostel in Germany is Gomio [http://www.gomio.com/].  Of course, international room booking agencies such as Hostelsclub, Hostelworld and Hostelbookers are also good resources, and give travelers the ability to leave reviews.\n\n=== Camping ===\nThere are countless campsites in Germany. They vary significantly in the infrastructure and standard. The ADAC, the German automobile club, offers an excellent guide for most German camping groups. If you are member of your national motorclub assistance and guides are free or at substantial reduced prices.\n\nSome travellers just put up their tents somewhere in the country side. In Germany this is illegal, unless you have the landowner's permission, which is easy enough to obtain: politely asking local farmers might even get you an invitation at their dinner table in exchange for your travel stories.\n\nPractically however nobody cares about wild camping as long as you are discreet, stay for one night only and take your trash with you. Do not camp in nature reserves however, when caught you will be fined. Lightening an open fire in the woods is forbidden, and will be fined, due to the risk of causing forest fires. There are distant early warning systems in place to detect forest fires. Military practise grounds are obviously off limits, but they are abundantly signposted.\n\n=== City Taxes ===\nMany places, such as spa towns, but also cities like Berlin, charge a tax from generally anyone visiting overnight. Those taxes are usually collected by the hotels, B&Bs, hostels, and the like. At some places, in particular at spa towns, a tax receipt is handed over to the guest at check-in, which he or she will have to carry with him or her at all times that he or she is using some public facilities, as, for example, recreational parks, beaches, or even beach promemades. On the other hand, showing such passes often leads to discounts at some local venues. In some cases, passes from one municipality are also accepted in neighbouring municipalities.\n\nAt many places, e.g. Berlin, business visitors are exempt from paying the city tax. For using such exemption, it is required to hand over at check-in at the hotel or other place of accomodation an informal declaration issued by the visitor's employer stating that the stay is a business visit. Such declaration must then include the name of the hotel guest, the period of stay, and some broad indication of its purpose (e.g. \"business negotiations\"). As the rules for such letters vary from state to state or even within the state, hotels etc. will usually be ready to assist and provide some model letters.\n\n==Learn==\n*[http://www.goethe-institut.de/ Goethe-Institut] offers German language courses\n*[http://www.daad.de/ German Academic Exchange Service]\n*[http://degreefromgermany.com/universities.html German universities]\n\nGerman universities are amongst the best in the world. \n\nSince the vast majority of universities are state-run, studying in Germany is usually very cheap (€50-700 per semester), but keep in mind that the cost of living is quite high (eg: in [[Tübingen]] rent is around €350-400  per mo for a one room apartment plus living expenses) with rent being the major factor. Because of this, most students either share a flat or live in a Hall of Residence. Halls of Residence often offer subsidies to poor residents.\n\nAs many German technical universities do a lot of research in partnerships with companies their research results are confidential and may not be published. This means that German engineering universities are often highly under-ranked in international rankings that only count the number of publications in science journals. In the Times Higher Education Ranking it is hard to find German universities in the top 100 for this reason.\n\nAccess to universities is easy for [[EEA]] nationals, non-EEA foreigners may face some bureaucratic hurdles and may be asked to provide proof that they can cover their own expenses. There are very few scholarships available, work-study jobs rarely exist, and student-loans are rare. In addition, German universities rarely provide the discounted and high quality amenities that other universities do. Some German universities do not have a coherent campus and opening hours can be short so check carefully.\n\nGerman universities have now changed their traditional course system to Master/Bachelor programmes. In general the courses have become more structured and school-like with a higher workload. Nevertheless more self-initiative is expected at German universities. Help with problems is not \"automatic\" and newcomers may feel a little left alone in the beginning. The same applies to ''Fachhochschule'' (describing themselves as \"Universities of Applied Science\").\n\nAltogether there are over 500 universities (universities and universities of applied sciences - public and private, but accredited by the government). In some federal states you can also find universities of co-operative education (''Berufsakademien''), a specific type of education in the tertiary area of education.\n\nIn Germany you don't count in years of studies or in terms but in half years of studies - a \"semester\". The summer semester runs from 1 April to 30 September, the winter semester runs from 1 October to 31 March. In the semester break students have to write thesises; at universities of applied sciences students have tests during this time. \n \nTo apply to a German university, you need a university entrance requirement like that one you would need to study in your own country, for example High School Diploma, Matura, A-Levels, Baccalaureate. Check in the [http://www.anabin.de database of the minister of education conference] if your university entrance requirement is equal to the German one. \n \nMost of the courses of study in Germany start in the winter semester. For courses without admission restrictions the closing date is generally in the middle of September.\n\n==Work==\nWhile the official unemployment rate in Germany is at around 4.7% (as of November 2015;realistic figures might be much higher since only registered unemployment is counted and many German part-time workers are desperately wishing to work full-time), there are jobs for those with the right qualifications or connections. Non-EU foreigners wishing to work in Germany should make sure they secure the proper permits. Since this can mean extended acts of distinctly German bureaucracy especially for non-EU citizens, it is likely not a good method to help your travelling budget.\n\nNon-EU students are permitted to work on their residence permits, but there is a limitation of 90 full (more than four hours worked) days per year or 180 half days (under 4 hours worked) without special authorization. Working through one's university, though, does not require a special permit.\n\nCitizens of some non-EU countries (Australia, Canada, Japan, Israel, New Zealand, South Korea and the US) can apply for a residence title with a work permit during their 90 day visa-free stay in Germany, however, they may not work without a visa/authorisation. Other nationals require a work visa before entering the country, which they need to exchange into a residence title after entry. For more information, see the 'Entry requirements' subsection of the 'Get in' section above.\n\nIllicit work is still quite common in Germany and virtually the only way to avoid the German bureaucracy.  Being caught, however, can mean time in jail, and a criminal conviction. Furthermore, illegal non-EU workers can expect to be legally expelled from the county and registered for refusal to re-entry into any Schengen State - not only Germany, but continental Europe - for at least three years.\n\nIf you want to stay in Germany for an extended period of time, but do not speak German, your best bets are large multinational companies in the banking, tourism or high-tech industries, or younger start-ups. [[Frankfurt]], [[Stuttgart]], [[Munich]] and of course [[Hamburg]] and [[Berlin]] are likely the best places to start looking. While there are many websites that could be helpful here, there is one service from a company called [https://www.taledo.com/?locale=en Taledo] that allows employers to apply to qualified job-seekers through an online platform, though most of the available roles are in the digital space. A good knowledge of German is usually expected, but not always a prerequisite.  English speakers who are certified teachers in their home countries might be able to secure work at American or British international schools. English teaching without these qualifications is not lucrative in Germany.\n\nDuring the asparagus season (Apr-Jun) farmers are usually looking for temporary workers, but this means '''really hard work and miserable pay'''. The main advantage of these jobs is that knowledge of German won't be required.\n\nApplying for a job in Germany is different from many other countries. As in nearly every country there are some peculiarities that every applicant should know.\n\nLegal residents and citizens of any EEA nation and Switzerland more than 18 years old are allowed to work as prostitutes, They will, of course, be taxed in the same way as any other worker in Germany.\n\n==Minimum Wage==\nGermany has a set minimum wage of €8.50 per hour as of 2015, but there are exceptions. Generally, pay rates must be agreed upon directly with the employer through collective bargaining or other means of negotiating a fair living wage and this is strictly enforced. But builders, electrical workers, janitors, roofers, painters, and postal workers aren't protected. So if you wish to work in these fields while in Germany, you could end up working for low pay.\n\n==Stay safe==\nGermany is a very safe country. Crimes rates are low and the rule of law is strictly enforced. \n\nViolent crimes (homicide, robberies, rape, assault) are very rare compared to most [[Africa]]n and [[America]]n countries. For instance, 2010 homicide rates were, with 0.86 cases per 100,000 inhabitants, significantly lower than in the UK (1.17), Australia (1.20), France (1.31), Canada (1.81) and the US (5.0) - and they continue to decline. [[Pickpockets]] may sometimes be an issue in large cities or at events with large crowds. Begging is not uncommon in some larger cities, but not to a greater extent than in most other major cities, and you will rarely experience aggressive beggars. Some beggars are organized in groups. Be aware that flashing any cardboard sign very near to your body could be a pickpocket trick.\n\nIf you stay in Berlin or Hamburg (Schanzenviertel) around the first of May, ''Tag der Arbeit'', expect demonstrations that frequently evolve into clashes between the police and a minority of the demonstrators.\n\nTake the usual precautions (such as not walking in parks alone in the early hours, not leaving your camera unattended or bicycle unlocked, and not flashing around a big fat wallet) and you will most likely not encounter any crime at all while staying in Germany.\n\nProstitution (including brothels and non-exploitative pimping) is a legal business in Germany and is a common sight (especially in cities like Berlin and Hamburg). Managers of larger brothels use to keep close contact to law-enforcement, health, and tax authorities in order to keep their business \"clean\". Advertisement for brothels can even be found on municipal buses or at other municipal advertisement space. Soliciting a prostitute under the age of 18 is illegal. \n\n===Emergencies===\nThe nationwide emergency number for the police, fire and rescue services is <big>'''''112'''''</big> (same in all EEA countries and with English-speaking operators). The police have an additional number, '''110''', which is unlikely to be staffed with English-speaking operators and not recommended for tourists. These numbers can be dialled toll-free from any phone, including phone booths and mobile phones (SIM-card required). If you are reporting an emergency, the usual guidelines apply: stay calm and state your exact location, the type of emergency and the number of persons involved. Do not hang up until the operator has received all required information and ends the call.\n\nThere are orange emergency telephones interspersed along the main motorways. You can find the closest SOS-phone by following arrows on the reflectively marked posts at the side of the road.\n\nAmbulances (Rettungswagen) can be summoned via the national toll-free emergency number '''112''' and will help you regardless of insurance issues. All hospitals (Krankenhäuser) except for the smallest private ones have 24-hour emergency rooms able to cope with all kinds of medical problems.\n\nIf you face an emergency situation with someone else in need or danger of losing her or his life (injury, unconsciousness, lifelessness, poisoning etc.) you are obliged by law to help according to your capabilities. Leaving a person behind which needs your help will be prosecuted (denial of assistance, Unterlassene Hilfeleistung §323c StGB). Self-endangerment has to be avoided and will not be expected of course, but calling an ambulance and staying on a close but safe position will be the least anyone can do in most cases. Call the attention of other people nearby. Bringing in a German speaking person will avoid language issues.\n\n===Racism===\nThe overwhelming majority of foreign visitors will never deal with issues of open racial discrimination or racism in Germany; however, discrimination still remains an issue. Large cities in Germany are very cosmopolitan and multi-ethnic with large communities of people from all continents and religions. In large cities, you can meet many people looking somewhat Asian or African, but whose mother tongue is German, and who would consider themselves as nothing else than simply German. German government officials and at least quite a few organizations exercise a very strict no-tolerance policy against any people known to have a Nazi / Nationalist ideology. Many Germans still feel at least quite aware if not even ashamed of the historical burden of the Nazi era and are usually open-minded and tolerant in contacts with foreigners. Non-white visitors might still get an occasional wary look, but not to a greater extent than in other countries with a predominantly white population. Racial profiling by the Federal Police (\"Bundespolizei\"), however, had been a known issue that has been addressed publicly and repeatedly challenged in court. Foreign looking people were more likely to be stopped and asked for their papers than others (Federal Police is usually present at some train stations and patrolling in some trains). However, their action used to be based on intelligence, and providing a passport and some explanation why, for example, you had been sitting in some train station for three hours, would usually lead them to perform their real duties. In addition, Federal Police had started to use poetic justice: Once a young black man had been asked for his papers, they might also request documents from a mid-aged pale woman some minutes later. In very rare cases you can also get racial slur from Police regarding your name or too many controls can make you sometimes annoyed.\n\nThe generally relaxed situation may be different in economically weak and/or rural parts of Germany. There are sometimes incidents of violence against non-whites in these regions. Most of these happen at night when groups of drunken \"Neo-Nazis\" look for trouble (and solitary victims) downtown or near public transport stations. The anger of these groups is directed against anything which is different. Hence, it might not only affect foreign visitors, but also homeless persons and people with alternative looks such as Punks, Goths, etc.\n\nPublic displays of overt anti-Semitism are forbidden by law. The Hitler salute and the swastika are banned, as well as the public denial of the Holocaust, or Nazi slogans or anthems. Foreigners should avoid asking Germans about Hitler or WWII as it is a sore subject for Germans, akin to asking about slavery in the USA.\n\n===Police===\nGerman [http://www.polizei.de Police] officers (''Polizei'') are trained to be always helpful, professional and trustworthy, but tend to be rather strict in enforcing the law, which means that one should not expect that exceptions are made for tourists. When dealing with police remain calm and courteous and you will be treated calm and courteous. An attempt at bribery will frowned upon, cause suspicion or prompt thorough investigation. Avoid getting into any confrontation since you may be fined for insulting or even physically resisting police officers. Most police officers should speak/understand at least basic English or at least have colleagues who do so. The younger they are, the better the chance to catch one who speaks good English. The level of English varies but all have a pretty good understanding. Otherwise some do speak French, Spanish or their parents' languages like Turkish, Polish, Russian and so on.\n\nPolice uniforms are blue (except for Bavaria, where the uniform still is green but will be changed to blue from 2016 on), police cars are blue or green. Green used to be the standard, but most states and the federal police have transitioned to blue uniforms and silver/blue cars to comply with the EU standard.\n\nPolice officers are employed by the states except in airports, train stations, border crossings, etc, which are controlled by the Federal Police (''Bundespolizei''). In mid-sized towns and big cities, local police (called ''Stadtpolizei'', ''kommunale Polizeibehörde'' or ''Ordnungsamt'') have some limited law enforcement rights and are, in general, responsible for issues of ''non-moving'' traffic (parking etc.).\n\nThe police can ask you for identification anytime. However if you refuse to identify yourself, the police can only enforce this if they have a reason to suspect you are a danger for public safety or public order, that you committed a crime or are in an area where crimes are typically comitted, at the border, within 30 km from the border, at airports, railway stations, in public transportation and in some more circumstances. As this is a long list of reasons to enforce identification, police can easily find (or invent) one that applies on you. It is therefore the easiest way just to identify yourself if asked to. You have to own a valid passport or ID card (depending on your country of origin) but you do not have to carry it with you all the time while in Germany. If you have to identify yourself and do not carry your passport or ID card with you, police may come with you to the place where you keep it and/or arrest you until you are identified. You have to carry your passport/ID card with you at the border (including borders within the Schengen area).\n\nIf you are a victim of crime (for example robbery, assault or theft in public) and wave down an oncoming patrol car or officer, it is not uncommon that the officers will (sometimes rather abruptly: \"Einsteigen\") command you to enter the back seat of the police vehicle. This is an action to start an instant manhunt to identify and arrest the suspect. In this case remember that you are not under arrest but there to help the officers enforce the law and, hopefully, recover your property. In general, if police ask you to enter some police car, to attend them, or to follow them to some station, and you have not committed any offence, you are not under arrest. This even applies if they body search you before entering the police car, because, in some states, police are simply ordered to routine search any person who enters a police car. In case of doubt, ask them which status you have in the investigation. If you get the information that you are a witness, this means that you have to state the truth if you are stating something, but that you are free to leave whenever you want, unless you are formally summoned by a prosecutor or judge. Under German law, no witness is obliged to appear at the police, but only by order of a prosecutor or a judge. You are allowed not to testify if your testimony endangers you of incriminating yourself or a close relative. You also do not have to testify if you would breach legally protected confidentiality by doing so (eg. as a doctor). You always have the right to have a lawyer with you when testifying.\n\nGerman Police do have ranks but are not that keen about them. Don't count the stars on the officer's shoulders to choose the officer you will address. Such behaviour is seen as impolite and a disrespect to lower rank officers. Talk to any officer and they will answer your questions or redirect you (if needed) to the officer in charge.\n\n===Prosecution===\nIf you get arrested, you have the right to have an attorney and an interpreter (if necessary). Foreign nationals also have the right to contact their respective embassy for assistance. With respect to your personality and data protection, your embassy will only be contacted upon your express request and consent - you might prefer not to let your home country know about your arrest. Thus, you will have to expressly request such embassy contact. You are never obliged to make a statement that would incriminate yourself and you have the right to remain silent. Wait until your lawyer arrives and talk to your lawyer first. If you do not have a lawyer, call your embassy (or someone else who can hire one for you), otherwise the local justice official will appoint a lawyer for you, which might not be the best available in town. The criminal procedure code allows it to arrest foreigners without permanent residence in Germany even for minor crimes that usually will not lead to imprisonment. In this case, arrest can be avoided by paying a bail (Sicherheitsleistung).\n\nContraventions (Ordnungswidrigkeiten), such as offending against traffic regulations, may lead to a warning by the police, often combined with a small warning fine (Verwarnungsgeld) of 5-55 €, or a fine (Bußgeld) of 5-1000 €, depending on the severity of the offence. An unpaid Bußgeld fine might lead to short imprisonment. If you do not have enough money to pay the fine, payment by installments is possible.\n\nCrimes are sentenced with a fine (Geldstrafe) or imprisonment (Freiheitsstrafe). The fine depends on your daily income (monthly income/30 days). A daily income is minimum 1 € and maximum 30,000 €. The maximum fine is 360 daily incomes. Imprisonment is from one month to fifteen years depending on the crime. Very few major crimes lead to lifelong imprisonment (such as murder, rape or robbery with death sequence, violent high treason against the german government and some more). However even a person sentenced to lifelong imprisonment might be released after a minimum of fifteen years.\n\nAs the criminal code states short imprisonment up to six months to be an exception, minor crimes are usually punished by a fine. Continued minor offences however may bring you into prison (Freiheitsstrafe), as will unpaid fines. A typical fine for minor crimes is 30-60 daily incomes (30-60 Tagessätze) (one or two monthly incomes). If you do not pay the fine you can get arrested for a period of days as long as the amount of daily incomes you have to pay.\n\nIf you are sentenced to imprisonment up to one year, you may be released on probation immediatley. The probation period is from two to five years. Non EU citizens might be deported from Germany for commiting crimes. If you commit a serious criminal offence expect a long prison sentence. EU citizens can only be expulsed if sentenced to at least five years of imprisonment or if they are a severe danger for public safety.\n\n===Drugs===\nLow strength alcohol like beer and wine may be bought and consumed if you're 16 years and older. However, spirits and drinks mixed with those (including the popular 'Alcopops') are available only at 18. It's not technically illegal for younger people to drink, but it is illegal to allow them to drink on premises. Parents can allow their children to drink alcohol within the limits of good parenting and child's welfare (to let a 14 year old consume a glass of beer or sparkling wine is no problem while permitting a 10 year old to drink spirits might lead to problems with the youth office). Under age drinking is not uncommon in Germany, but if the police notices it, they may pick the person up, confiscate the drinks and send the person home in the presence of an officer. In many public transport systems, such as the subways and buses in [[Berlin]], [[Hamburg]], or [[Nürnberg]] and increasingly many other cities, as well as on private local train operators such as Metronom in Lower Saxony, the consumption of alcohol is prohibited. (Therefore you will see lots of beer and brandy bottles on interchanging station like Uelzen.) Drinking is only prohibited if there is a sign at the door or inside the train/bus. It is not prohibited in Deutsche Bahn trains.\n\nSmoking is allowed starting at age 18. Vending machines for cigarettes require a valid \"proof of age\", which in practice means that you need a German bank card or a (European) driving license to use them.\n\nThe situation on marijuana can be confusing. The Constitutional Court ruled that possession for \"personal use\", though still illegal, should not be prosecuted. Germany is a federal state, therefore the interpretation of this ruling is up to the state authorities. In fact charges are sometimes pressed even for tiny amounts, which will cause you a lot of trouble regardless of the outcome. As a general rule the northern states tend to be more liberal while in the south (especially Bavaria), even negligible amounts are considered illegal. The customs officials are also aware of the fact that you can legally buy marijuana in the Netherlands and therefore set up intelligence-based border controls (also inside trains) as import is strictly prohibited.\n\nEven if you get off the charges, the authorities may cause different problems, like revoking your driving licence and if you have more than a few grams, you will be prosecuted in any case. Also, the drugs will be confiscated in all cases. Authorities are free to inform your home country about the results of their investigation, and about the sanctions imposed on you.\n\nIn case you are found guilty of a felony involving narcotics, and you are not an EU (EEA, Swiss) citizen, you might be expelled from Germany and banned from re-entry into the whole Schengen area for up to ten years.\n\nAll other recreational drugs (like ecstasy) are illegal and possession will lead to prosecution and at least a police record.\n\n===Weapons===\nSome types of knives are illegal in Germany: this concerns mostly some types of spring knives, \"butterfly\" knives, knuckle knives and the like. These knives are ''illegal'' and owning them is an offence. Knives that are ''intended'' as weapons are restricted to persons over 18.\n\nIt is illegal to carry ''any'' type of \"dangerous knife\" on your person in public unless you have a valid reason to do so. For example, if you are out fishing you are still entitled to carry a fishing knife. \"Dangerous\" knives are generally those with a blade length exceeding 12cm and \"one-handed\" folding knives.\n\nCarrying any knife (except a Swiss Army knife in some cases) without any professional reasons (carpenter, etc) is seen as very rude and unacceptable in Germany. Germans consider any non-professionally used knives as signs of aggression and do not accept this behaviour. Flashing a knife (even folded) may cause bystanders to call the police, who will be very serious in handling the upcoming situation.\n\nFirearms are strictly controlled. It is practically impossible to legally carry a gun in public unless you are a law enforcement officer. Fake firearms may not be carried in public if they resemble real guns. Carbon dioxide and air guns are relatively easy to acquire. If the police finds any kind of weapon or firearm on you, you will appear highly suspicious.\n\n===Fireworks===\nAvoid bringing any fireworks into Germany, especially from outside the EU. Even bringing those can be an offence. Fireworks are traditionally used on New Year's Eve. Most \"proper\" fireworks (marked as \"Klasse II\") will be available at only the end of the year; they may be used by persons only over 18 on 31 December and 1 January. Really small items (marked as \"Klasse I\") may be used around the year by anyone. On December 31 and the preceding days, be aware that some possibly drunk and frustrated people may throw fireworks at bystanders. This typically happens in some areas in larger cities.\n\n===Fishing===\nFishing laws differ a lot from state to state. Obtaining a fishing license for Germans and foreigners has become a highly bureaucratic process due to animal protection laws.\n\n===Homosexual travellers===\nThe attitude towards gays and lesbians is tolerant with openly gay politicians and celebrities being considered increasingly normal. While some, especially the elderly, Germans inwardly still don't approve of homosexuality or bisexuality, they may not always express disapproval out loud. Displays of homosexuality (holding hands or kissing) will, in some areas, provoke stares or sometimes comments by children or elderly people.\n\nIn some non-central areas of Berlin and eastern Germany 'gay-bashing' is popular with neo-Nazis, migrants from Islamic countries or other gangs, so use common sense and be geared to the behaviour of the locals around you: if no one else is openly gay, better avoid it.\n\n===Football (soccer)===\nEven before the FIFA World Cup victory in 2014, association football or soccer (''Fußball'') is a very popular sport in Germany. That means that there are many supporters all around the country - and that means also many rivalries, most legendary to mention are those between FC Schalke 04 and Borussia Dortmund in the Ruhr Area or between Hamburger SV and Werder Bremen in the North. In minor leagues, newspapers are occassionally stuffed with reports about violent riots taking place particularly in East Germany.\n'''Avoid at all costs to wear or buy anything from FC Bayern, as it is obnoxious outside Munich and therefore frowned upon!'''\n\n==Stay healthy==\nSanitary and medical facilities in Germany are excellent. The phone book lists telephone numbers for various medical services, many hotlines and services exist that are open during \"off hours\". See the section ''Medical Emergencies'' above if you are in an emergency\n\n=== Health care === \nIf you have an non-urgent medical problem, you may choose from any local doctor. The German health system allows specialists to run their own surgery so you usually will be able to find every discipline from Dentistry to Neurology on duty within reasonable reach. In remote regions finding a doctor might require a ride to the next town but the German infrastructure allows fast connections. GPs/family doctors will usually describe themselves as \"Allgemeinmediziner\" - meaning \"general practitioner\".\n\nPharmacies are called \"Apotheke\" and are marked by a big,  [http://commons.wikimedia.org/wiki/Image:Pharmacy_Germany.jpg red \"A\" symbol]. At least one pharmacy in the area will be open at all times (usually a different one every day), and all pharmacies will post the name and address of the pharmacy-on-duty in the window. Some medication that is sometimes freely available in other countries (e.g. antibiotics and the \"morning-after pill\") needs a prescription in Germany, so you may want to check before your journey. The staff of an Apotheke have specially trained personnel, as it is mandatory to have a university degree in pharmaceutics to run an Apotheke in Germany.  A German pharmacist and his staff is not only able to offer advice on medications, but also obliged to do so. Thus, expect them to ask which person the medication will be intended for, and to give some mostly helpful advise on it. In Germany, it is not considered shameful to talk about disease, thus, the dialogue might be quite straightforward. Waiting other customers will usually wait behind a line painted on the floor as a measure to increase discretion.\n\nIn Germany pharmaceuticals tend to be expensive, so it might be wise to ask the pharmacist for \"Generika\" (generic drugs): A \"Generikum\" is virtually the same produce, often even produced by the same pharmaceutical trust, just lacking the well-known brand name and being considerably cheaper.\n\n=== Health insurance ===\nEU citizens that are members of any public health insurance can get a [http://ec.europa.eu/social/main.jsp?catId=559&langId=en European Health Insurance Card]. The card is issued by your insurance provider and lets you use the public health care system in any EU country, including Germany.  If you are an EU citizen, you simply have to tell a doctor or the hospital that it goes through the 'AOK', the German state health insurance scheme.  If doctors and hospitals don't accept this, go to the local AOK office and they will usually telephone them to confirm.\n\nIf you're from outside the EU, or if you have a private health insurance, check if your insurance is valid in Germany. If not, get a travel health insurance for the trip - German health care is expensive.\n\nForeign insurance, even if it covers travel abroad, may not be accepted by local hospitals, i.e. you may have to pay up front and claim it back from the insurance company.  (Be sure to keep the originals safe.)  Alternatively, you might be sent a bill in the post.\n\n=== Drinking water ===\nTap water has a good quality, is very strictly controlled and can be freely used for consumption. Exceptions have to be labelled (''\"Kein Trinkwasser\"'' = not drinking water), usually found on fountains and in trains.\n\n=== Swimming ===\nMany lakes and rivers, as well as both the North Sea and Baltic Sea are generally safe for swimming. Nevertheless, while there may be no life-threatening pollutants in most bodies of water, you would do very well to inform yourself about local regulations. If you intend to swim in a large river, at best do so only on official bathing locations. Keep away from structures (power plants might cause streams you don't see from the surface) in the river or reaching from the shore into the river, also keep out of the path of ships. Both structures and ships, even if they look harmless or far away, may create major sucks underwater. Take particular care of children. \n\nIf you intend to swim in the North Sea you should inform yourselves about the tide schedules and weather conditions - getting caught in a tide can be fatal, getting lost in the mist, too. Hiking in the ''Wattenmeer'' without a local guide is extremely dangerous, so keep out if you do not really know your way around. There are no tides in the Baltic Sea.\n\n=== Diseases ===\nYou should be aware of rabies (''Tollwut'') which has been a problem in some areas in the past, even if forestry officials combat it very seriously. If you want to go to Germany for hiking or camping you should inform yourself about the situation at your destination and take appropriate precautions. Normally, you won't have to worry about it because the main transmitting animal is the fox.\n\nThe biggest risks hikers and camper face are two diseases transmitted by ticks. In some parts of Germany there is a (low) risk of contracting tick-borne encephalitis; vaccination is advised if you plan out-door activities in high-risk areas. The risk of Lyme disease is higher and vaccination is not available. Therefore you should try to prevent tick-bites by wearing long trousers and appropriate shoes. Chemical repellents can also be effective. You should also check for ticks afterwards since the risk of transmission is lower if the tick is removed early. The safest way to remove a tick is by using a credit card sized device called a \"Zeckenkarte\" (tick card), wich you can get at most pharmacies. Other methods (fingers, using glue, etc.) might lead to the tick injecting even more infectious material into the wound. If in any doubt consult a doctor.\n\n===Natural danger===\nToday, wild animals, although they abound, are mostly very elusive, so you might not get to see many. Wolves prosper in Brandenburg and Saxony and a bear in Bavaria has been sighted. In the course of events, \"Bruno\" (the bear) has been shot, the wolves however are under heavy protection. In fact chances to see one are almost zero. The most dangerous animal in Germany's forests is by far the wild boar; in particular, sows leading young are nothing to joke about. Wild boar are used to humans, since they often plunder trash cans in villages and suburbs, and their teeth can rip big wounds. If you see one, do not approach it, and back away cautiously.\n\nDeath cap mushrooms are relatively common in German woodlands. These mushrooms can be easily mistaken for champignon mushrooms. The fungus of Death cap mushrooms is highly toxic, and is responsible for the majority of fatal mushroom poisonings worldwide. After eating a Death cap mushroom, very quick aid is mandatory to prevent death. Nevertheless a chronic liver damage often remains as an outcome after eating a Death cap mushroom even if quick and professional aid has been given.\n\nThe common European adder, Cross adder or common European viper, is a venomous snake which occurs in Germany. It havs some kind of zigzag dorsal pattern down the entire length of its body and tail. This snake is quite rare and elusive. Generally, the snake is not regarded as especially dangerous; it is not aggressive and usually bites only when alarmed or disturbed. A bite causes a swelling and the victim should be monitored. Sometimes breathing trouble and heart complaint can occur. Usually a bite of an European adder is not dangerous for common adults but it can couse more serious problems for weakened people, children or the elderly. However, in some recent cases also more severe toxicity processes came to be known.\n\n==Cope==\nThe [[Electrical_systems|electric supply]] runs at 230V, 50Hz AC. [[Electrical_systems#Plugs_and_adapters|Plugs]] are European style (type C or type F).\n\n===Public Holidays===\nOn national holidays, shops are closed and public transportation runs at a lower level. The national holiday is October 3rd, in memory of the German Reunification on this date in 1990. There are two christmas holidays, December the 25th and 26th. Christmas eve ist a holiday from 2 p.m. or 4 p.m., depending on the Bundesland. The same goes for new year's eve, while new year's day is a holiday in whole. Good Friday (Karfreitag), Easter Sunday (Ostersonntag) and Easter Monday (Ostermontag) are public holidays, as are Pentecost Sunday (Pfingstsonntag) and Whit monday (Pfingstmontag). Other holidays depend on the Bundesland. Typically the holidays differ with the major confession of the state. E.g. the protestant Reformation Day (October 31st) is a holiday in Brandenburg, Mecklenburg-Western Pomerania, Saxony, Saxony-Anhalt and Thuringia, while the catholic All Saint's Day (November 1st) is a holiday in Baden-Wuerttemberg, Bavaria, North Rhine-Westphalia, Rhineland-Palatinate and Saarland. States with a catholic majority are said to have a few more holidays than protestant dominated Bundesländer.\n\n===News===\nWhile newspapers and online media are dominated by private media companies, tv and radio broadcasting stations are mainly in public hands, although private broadcasting stations do exist.\n\n====Newspapers====\nImportant German newspapers are\n* [http://www.sueddeutsche.de '''Süddeutsche Zeitung'''] (center-left, daily newspaper and online news; originates from Munich but available and read nation-wide)\n* [http://www.faz.net '''Frankfurter Allgemeine Zeitung'''] (abbreviated \"FAZ\", conservative, daily newspaper and online news; originates from Frankfurt but available and read nation-wide)\n* [http://www.welt.de '''Die Welt'''] (conservative, daily newspaper and online news; originates from Berlin but available and read nation-wide)\n* [http://www.handelsblatt.com '''Handelsblatt'''] (daily business newspaper and online news)\n* [http://www.taz.de '''die tageszeitung'''] (abbreviated \"taz\", leftist, daily newspaper and online news)\n* [http://www.spiegel.de '''Spiegel Online'''] and [http://spiegel.de/spiegel '''Der Spiegel'''] (daily online news and weekly printed magazine)\n* [http://www.focus.de '''Focus Online'''] (daily online news and weekly printed magazine)\n* [http://www.zeit.de '''Die Zeit'''] (daily online news and weekly printed newspaper)\n* [http://www.bild.de '''Bild'''] (daily newspaper and online news, considerated part of the \"yellow press\")\n\n====Televison====\nTelevision may be received via cable (analogue or digital (DVB-C), although analogue tv has become quite rare in the last years), digital antenna (DVB-T), or digital satellite (DVB-S). Public broadcasting stations are paid for by every occupant of a flat or a house, regardless of whether they watch tv or not, and it is therefore free to receive in high definition. Private broadcasting stations usually only can be received in sd for free while the hd-version is only available after special payment. There also exist some pay tv stations.\n\n=====Public Broadcasting Services=====\nThere are two broadcasting stations for the whole country: \n* [http://www.daserste.de '''Das Erste'''], ''the first'', often called \"ARD\", which is short for ''Arbeitsgemeinschaft der öffentlich-rechtlichen Rundfunkanstalten der Bundesrepublik Deutschland'' (''Consortium of public broadcasters in the Federal Republic of Germany''), a cooperation of the regional public broadcasting stations who run the nation-wide ''Das Erste'' program together.\n* [http://www.zdf.de '''Zweites Deutsches Fernsehen'''] (ZDF), ''Second German Television''.\n\nARD and ZDF do run several broadcasting stations for special purposes, e.g. for news, culture and children/teenagers.\n\nThe [http://www.dw.com '''Deutsche Welle'''], ''German Wave'' is Germany's public international broadcasting service and also part of the ARD.\n\nThe regional broadcasting stations of the ARD are \n* [http://www.wdr.de '''Westdeutscher Rundfunk'''] (WDR), ''West German broadcasting service'' for North Rhine-Westphalia\n* [http://www.swr.de '''Südwestrundfunk'''] (SWR), ''Southwest broadcasting service'' for Baden-Wuerttemberg and Rhineland-Palatinate\n* [http://www.br.de '''Bayerischer Rundfunk'''] (BR), ''Bavarian broadcasting service'' for Bavaria\n* [http://www.hr-online.de '''Hessischer Rundfunk'''] (HR), ''Hessian broadcasting service'' for Hesse\n* [http://www.mdr.de '''Mitteldeutscher Rundfunk'''] (MDR), ''Middle German broadcasting service'' for Saxony, Saxony-Anhalt and Thuringia\n* [http://www.ndr.de '''Norddeutscher Rundfunk'''] (NRD), ''North German broadcasting service'' for Mecklenburg-Western Pomerania, Lower Saxony and Schleswig-Holstein\n* [http://www.radiobremen.de '''Radio Bremen'''] for Bremen\n* [http://www.rbb.de '''Rundfunk Berlin-Brandenburg'''] (RBB), ''Broadcasting service Berlin and Brandenburg'' for Berlin and Brandenburg\n* [http://www.sr-online.de '''Saarländischer Rundfunk'''] (SR), ''Saarland broadcasting service'' for Saarland\n\n=====Private Broadcasting Services=====\n* [http://www.rtl.de '''RTL'''], German station belonging to Radio Luxemburg\n* [http://www.pro7.de '''ProSieben'''] part of ProSiebenSat.1Media SE\n* [http://www.n24.de '''N24'''] News programme owned by the newspaper ''Die Welt''\n* [http://www.sat1.de '''Sat 1'''] despite the name, which refers to \"satellite\" can also be received via dvbc and dvbt, part of ProSiebenSat.1Media SE\n* [http://www.kabel1.de '''Kabel 1'''] despite the name, which refers to \"cable\" can also be received via dvbs and dvbt, part of ProSiebenSat.1Media SE\n\n====Radio====\nThere exist a lot of radio stations, run by the public broadcasting services and by private owners. Most of them are regional stations. [http://www.dlf.de '''Deutschlandfunk'''] can be received all over Germany. All radio stations can be received via FM broadcasting, a lot of them also via satellite.\n\n==Respect==\nThe Germans adhere to a set of values revolving around order, privacy and punctuality. They respect and pursue perfectionism in all aspects of life.\n\nGermans have an undeserved reputation for being \"cold\", but in actuality that's far from the truth. Communication is direct, and chit chat is largely ignored unless there's an absolute necessity for it. Hence, it's uncommon for Germans to communicate with strangers. Once you do get past a certain barrier though, Germans become warm, welcoming and sincere. \n\n===Social Etiquette and Breaches===\n\n*'''Never be offended if someone points out something you've done wrong.''' Germans in general are honest and direct to the bluntness, but they are tactful about it in a way that can come across as condescending in many parts of the world. Don't get annoyed by this as Germans don't intend to patronise or pull you down in any way. Policing and correcting one another is considered a social duty, and Germans expect you to do the same.\n\n* '''Spending time wisely is highly valued in Germany.''' The Germans highly value organisation and efficiency, which is why wasting time is highly frowned upon in Germany. Cancelling something at the last minute, being late to an appointment, and/or delivering something in a half-hearted fashion is all taken very negatively in Germany. \n\n* '''Always be punctual to any appointment or meeting.''' Even arriving a minute late to a meeting or a few minutes early is regarded as rude and inconsiderate, unless you can provide a good reason for it. It is good form to inform your hosts if you seem to be running late for any reason. For example, if you're late due to public transport (it's not unheard of for the driver to leave you behind). Most Germans tend to arrive to meetings, appointments and so on '''5-10 minutes early''' and it's best to follow suit with this to not stand out like a sore thumb. \n\n* '''Always be courteous wherever possible.'''  Germans tend to be very formal people, especially in the business world. Some colleagues that have worked together ank known each other for many years still call each by their title and surname. When a German introduces himself to you, he/she will often simply state their surname, prompting you to call them \"\"Herr/Frau...\" (\"Mr/Mrs...\")\". Using first names immediately may be met with a frosty reception. Whenever an elderly or a highly ranked person walks into an appointment, home or business meeting, always stand up. \n\n* '''Women are treated with a degree of chivalry.''' Female travellers shouldn't be surprised or be confused when their male German acquaintances or colleagues walk in front of them, open every door in front of them, walk to the left side of them, and/or relinquish their role to the maître d' when sitting in a restaurant. Male travellers should also take note that this will all be expected by German women too. \n\n* '''Be careful with delivering compliments.''' Showering someone with too many compliments is seen as an attempt to embarrass someone. If you must compliment, deliver a simple nicety (e.g. \"Nice Shoes\") and move on. \n\n* '''Do not raise your voice, lose your temper in a conversation.''' It is widely viewed as a sign of weakness and uncouthness. For similar reasons, it's also good form to not publicly or privately criticise someone either. Most Germans will be very offended, and won't hesitate to give you a piece of their mind if you talk about them negatively. As a general rule of thumb, if you have an issue with someone, it's best to resolve the matter privately. \n\n* '''Don't hesitate to discuss German history and culture.''' Ordinary Germans very much appreciate the few that have an interest in their country, and this can be a potential icebreaker, although some historical topics (World War II, Nazism, etc.) should be treated more delicately than others.\n\n* '''Don't hesitate to have intellectual, passionate debates.''' Ordinary Germans very much appreciate intellectually stimulating conversation, and you will find that most Germans are very tolerant of differing opinions, even if they do not necessarily agree with them.  \n\n* '''Privacy is a virtue in Germany.''' In the business world, there is no such thing as an open door policy. Do not be nosy about one's religious or personal affairs, especially if it's someone you're not close to. Doing so is a very quick way to make Germans lose their respect for you. Similarly, it's considered unacceptable to call a German person at home unless it is an urgent matter. \n\n* '''Do not insist or press someone to do something if they've refused.''' Even if it is coming from a good place (such as asking to accompany you somewhere), heckling someone is seen as rude and impolite.\n\n=== Things to Avoid ===\n\n'''Politics:'''\n\n* ''' Unless you follow German news closely, it's wise to refrain from commenting on German politics ''' as it may make others see you as uninformed and judgemental. It's also advised to refrain from commenting on matters such as '''immigration''' as it can make many Germans emotional. Don't hesitate to ask any questions that you may have about German politics, but know the position that being a foreigner puts you in. \n\n'''Symbols:'''\n\n* '''Do not desecrate the German flag, as well as any flags of its federal states'''. Not only will Germans be very offended, but you will also risk a hefty prison sentence and/or a fine as it is a federal crime. \n\n* '''Do not wear anything with a German flag on it unless you're at a sporting event'''. Germans will be very offended.  \n\n* '''Refrain from speaking the first verse of the German national anthem'''. It’s considered highly offensive towards Germany’s troubled past. \n\n'''Sensitive Issues:'''\n\n* '''Be very respectful when talking about Nazi Germany'''. German society has an incredibly emotional stance on this. Jokes, even made innocently about the matter, is '''absolutely''' the wrong way of approaching the matter and Germans will be very offended. \n\n* '''Be respectful when talking about the division of Germany'''. Although this isn't as emotional of a topic as Nazi Germany, the issue of the Berlin Wall is still a very divisive issue.\n\n* '''Do not exhibit Nazi-era slogans, symbols and gestures'''. This carries a prison sentence of several years and/or a hefty fine, or if you're a foreign citizen, the possibility of being deported from the country.\n\n\n'''Regional habitudes:'''\n\n* '''Take care about regional habitudes'''. In many rural areas dialects are often heard, especially in Bavaria, Saxony, Swabia, North Germany ''(Plattdeutsch)''. Some people may feel offended, if you imitate their dialect, as they may think you mock them. On the other hand, you should know some typical local habitudes and terms, as you may be misunderstood, mocked or frowned upon if you use one from another region far off. For example, in North Germany the ''\"Grüß Gott!\"'' (which is a salute in Bavaria) is often regarded as rude. Use the habitual ''\"Moin!\"'' or the more neutral ''\"Guten Tag!\"'' instead. \nSome things may not be understood correctly: In South Germany, hardly anyone will know the ''\"Broiler\"'' (''baked rooster'' especially in East Germany). In Berlin, ''\"Pfannkuchen\"'' is a ''doughnut'', everywhere else, it's a ''pancake''. In Munich, Stuttgart and around, a ''bread rolls'' are called ''\"Semmel\"'', even in Nuremberg and in most regions elsewhere in Germany, they're called ''\"Brötchen\"''. Once a bakery in Hamburg used to sell ''sweet bread rolls'' as ''\"Semmel\"''.\n\n==Contact==\n\n===Telephone===\nThe international calling code for Germany is +49, and the prefix for international calls is 00; the area code prefix is 0. Some number blocks are reserved for special use: Number starting with 010xx let you choose a different phone provider (see below), 0800 and 00800 are toll-free numbers, 0180 are service numbers (which may or may not be more expensive than a local call). Avoid 0900 prefix numbers. These are for commercial services and usually incredibly expensive.\n\nMobile phone coverage on the three networks (T-Mobile, Vodafone, and the recently joined E-Plus/o2 networks) is generally good, with T-Mobile having the best coverage in rural areas, followed by Vodafone. UMTS (3G) is almost universally available, and LTE (4G) is available in all urban areas. All mobile providers use GSM technology on the 900 and 1800 MHz frequency ranges. This is different to the GSM 1900 standard used in the United States, but modern \"multi-band\" handsets will usually work in all GSM networks. Non-GSM phones cannot be used in Germany.  If you have a GSM mobile telephone from the USA, make sure to call your provider in the USA prior to your trip and have them \"unlock\" your telephone handset so that you can use it with a German SIM card.  \n\nThe vast majority of Germans own mobile phones (called \"Handys\" in German, pronounced \"hendy\"); the disadvantage of this is that the once-common phone booths have started to disappear except at \"strategical\" locations such as train stations. They usually consist of a silver column with a pink top and the phone attached on the front. At some places there are still older versions consisting of a yellow cabin with a door and the telephone inside.\n\nIf you stay for a longer period of time, consider buying a prepaid phone card from one of the mobile phone companies; you won't have trouble finding a T-Mobile (in a \"T-Punkt\"), Vodafone, E-Plus or O<sub>2</sub> store in any major shopping area. \n\nMobile telephony is still comparatively expensive in Germany, depending on your contract you may be charged about &euro;0.09 to &euro;0.39 per minute (and more for international calls).\n\nIn most grocery store chains (such as ALDI, Lidl), there's an abundance of prepaid SIM cards from their own virtual carriers - these SIM cards use the major networks but come at a much lower price. They are usually quite cheap to buy (10-15&euro; with 5-15 &euro; airtime) and also quite cheap to use for national and international (Europe and USA) calls  (0.09-0.19 &euro;/minute). Incoming calls and SMS are always free. SMS cost around 0.09-0.19 &euro;. All of those carriers also offer inexpensive data plans without any long term commitment. They are available at: Aldi, Lidl, Penny, Netto, Tchibo, Rewe, toom, blau.de. A registration via Internet or (expensive) phone call is necessary after buying to activate the SIM card.\n\nWhile international calls using the German SIM card can be expensive, there are some prepaid offers with good rates. Since the liberalization of Germany's phone market, there is a multitude of phone providers on the market. If you're calling from a private fixed line, you can usually choose from the different providers (and thus from different pricing schemes) by using special prefix numbers (starting with 010xx) with prices of 0.01 € or 0.02 €, sometimes below 0.01 € even for international calls. There's a calculator on the net [http://www.billiger-telefonieren.de/] where you can compare the prices for different destinations. Hotels usually have contracts with a particular phone provider and won't let you use a different one. \n\nAlternatively, you can also buy prepaid phone cards you can use by calling a toll free number; this is especially a good deal if you intend to make international calls. Cards' quality and prices vary wildly, however, so a good recommendation cannot be made. \n\nRecently, '''phone shops''' have sprung up in the major cities, where you can make international calls at cheap rates. These call shops are mostly located in city areas with a high number of immigrants and are your best option to call internationally. Apart from offering calls abroad themselves they sell international calling cards for use from any phone in Germany. You can usually spot these shops by the many flags decorating their windows.\n\n===Internet===\n'''Internet cafes''' are common and usually small, local businesses. \nYou probably won't have a problem finding at least one in even smaller towns or large villages. See [http://www.online-cafes.net/ Online-Cafes] (in German) for details. Phone shops will often offer internet access, too.\n\nMost '''hotels''' offer free internet access for guests, however speeds are limited and may be inadequate for viewing and using multimedia-rich pages/apps quickly.  Premium high-speed internet may be available - often at rip-off rates, so confirm access and rates with your hotel before using.\n\nIn several cities, projects exist to provide free \"community\" '''hotspots''' for wireless networking. \n\nSee [http://mobileaccess.de/wlan/ Public Spots] (page in German) for details.\n\nPassenger lounges at some '''airports''' and central railway stations also provide internet access to their customers.\n\n'''Public libraries''' often offer Internet access, however usually not free of charge. The libraries are open to the public for free, taking a book home might require you to get a customer card at a low fee, though.  Note the National Library in Leipzig, Frankfurt am Main and Berlin is not free.\n\n====Mobile Data====\n\nVirtually all pre-paid SIMs allow Internet access for a monthly flat fee, for example those available at Tchibo coffee stores (O2 network, 10 €/month limited to 500 MB,  €20/month for 5 GB) or Aldi (E-Plus network, €15/Month (5GB)). A regular O2 sim card, which can be used for calls and text messages, is €15 and another €15 buys 1GB of data valid for 1 month. Vodafone offers a prepaid sim card for €25 which includes €22.5 of credit, out of which you can get 300MB of data for 2 days for €15 and be left with €7.5 of credit. After reaching your data traffic limit, your internet will be slowed down, you will not be cut off. These SIM cards can be used in all countries that are part of the European Union, without additional charges. \n\nCarriers in order of network speed are: T-Mobile>Vodafone>O2>E-Plus\n\nIf you want very fast internet at a low price, use a SIM from Congstar (T-Mobile Network); if you just want some internet on your phone and don't really care about the speed (perfect for apps like WhatsApp, Viber, Line,...) use a SIM from Aldi (E-Plus).\n\nMost universities in Germany participate in [http://www.eduroam.org eduroam]. If you are a student or member of a university, this service may allow you to get guest access to their wireless networks. Check with your own university for details in advance of your trip.\n\n===Postal Service===\nDeutsche Post [http://www.deutschepost.com] (the German postal service) runs several international companies including DHL [http://www.dhl.com] and others. A standard postcard costs €0.45 to send within Germany and €0.90 everywhere else. (Prices change frequently, expect the cost to be higher.) A standard letter not weighing more than 20 grams costs €0.70 to send within Germany and (again) €0.90 everywhere else.  Letters within Germany are mostly delivered within 1 day, allow a bit longer for Europe. If you are going to buy postage stamps from souvenir stores, the stores usually only sell these together with postcards (though you can buy postcards alone). However, you can buy stamps separately at the post office and the postcards themselves at souvenir stores.  \n\nThe service has been reduced in the privatization process. Due to a surge in the theft rate [especially by outsourced letter carriers and contractors] any international shipments, especially incoming, should be insured if they are valuable.\n\nAir mail (''Luftpost'') can be as cheap as the alternative, ''Landweg''. If you want to send packages, there are three options (cheapest to most expensive)-''Maxibrief'' an oversized letter up to 2 kg and L+W+H=900mm. ''Päckchen'' is a small(up to 2kg for international), uninsured packet. Otherwise it will have to be sent under the price system of a ''DHL Paket''.\n\nIf only books are sent, reduced rates apply (''Büchersendung''), but expect the mail to be opened and looked at, as really only books are allowed in them.\nRates for ''Büchersendungen'' vary between €1.00 and €1.65, depending on size and weight.\n\nIt is possible to drop letters and parcels at FedEx and UPS stations. Expect to queue.\n\n[[ca:Alemanya]]\n[[de:Deutschland]]\n[[eo:Germanio]]\n[[es:Alemania]]\n[[fi:Saksa]]\n[[fr:Allemagne]]\n[[hi:जर्मनी]]\n[[hu:Németország]]\n[[it:Germania]]\n[[ja:ドイツ]]\n[[nl:Duitsland]]\n[[pl:Niemcy]]\n[[pt:Alemanha]]\n[[ro:Germania]]\n[[ru:Германия]]\n[[sv:Tyskland]]\n[[zh:德國]]\n\n[[wts:Category:Germany]]\n[[Wikipedia:Germany]]\n[[World66:europe/germany]]\n\n{{countryguide}}\n\n{{isPartOf|Central Europe}}"
        }
    }
}