{
    "parse": {
        "title": "Guinea-Bissau",
        "pageid": 716,
        "wikitext": {
            "*": "{{pagebanner|Guinea Bissau banner.jpg}}\n\n{{Warningbox| Violent crime is common in Guinea-Bissau. Aggressive vendors, panhandlers, and occasionally criminals target foreigners at the Bissau airport and other crowded areas, especially Bandim Market in the center of the capital. Local police lack the resources, capacity, and training to respond effectively to serious criminal incidents. The country has experienced chronic political and institutional dysfunction for decades, and there is the potential for violence.}}\n{{quickbar\n| image=Guinea-Bissau children.jpg\n| caption=the children of the country\n| location=Guinea-Bissau in its region.svg\n| flag=Flag of Guinea-Bissau.svg\n| capital=[[Bissau]]\n| government=Fragile Democracy\n| currency=West African CFA franc (XOF), interchangeable at par with the Central African CFA franc (XAF)\n| area=''total:'' 36,120 km<sup>2</sup><br />''water:'' 8,120 km<sup>2</sup><br />''land:'' 28,000 km<sup>2</sup>\n| population=1,442,029 (July 2006 est.)\n| language=[[Portuguese]] (official), Crioulo, African languages\n| religion=Indigenous beliefs 50%, Muslim 45%, Christian 5%\n| electricity=\n| callingcode=+245\n| tld=.gw\n| timezone=UTC\n}}\n\n[http://bissautourism.com/ '''Guinea-Bissau'''] is a former Portuguese colony bordered by [[Senegal]] to the north and [[Guinea]] to the south and east. \n\n==Understand==\n\n===History===\nGuinea-Bissau was once part of the kingdom of Gabu, part of the [[Mali]] Empire; parts of this kingdom persisted until the eighteenth century.  Early reports of Europeans reaching this area come from the mid 15th century. The rivers and coast of this area were among the first places colonized by the Portuguese in the 16th century, the interior was not explored until the 19th century.\n\nThe Portuguese tried desperately to hang on to their colony much longer than other European countries. An armed independence rebellion began in 1956, but it was not until 1974 that the Portuguese finally accepted independence for Guinea-Bissau.\n\nGuinea-Bissau's post-independence history has been chequered. A civil war in 1998, followed by the imposition of a military junta in 1999 has been replaced with a multi-party democracy. The economy remains fragile, however hopes are high.\n\n===Climate===\nGuinea-Bissau is warm all year around and there is little temperature fluctuation; it averages 26.3°C (79.3°F). The average rainfall for Bissau is 2,024&nbsp;mm although this is almost entirely accounted for during the rainy season which falls between June and September/October. From December through April, the country experiences drought.\n\n==Regions==\n[[Image:Guinea-Bissau regions map.png|thumb|550px]]\nGuinea-Bissau is divided into 8 administrative regions (regiões) and 1 autonomous sector (sector autónomo), and are subdivided into 37 sectors.\n\n==Cities==\n*[[Bissau]] - capital\n* [[Bafatá]] - Bafata is a pleasant town with an interesting colonial centre, located on the Rio Gêba. Hometown of Bissau-Guinean patriot Amilcar Cabral. Ask around near the old market to visit his house. \n* [[Bissora]] - Bissora is a town in the region of Oio. The majority of people living in the Bissora sector belong to the Balanta ethnic group.\n* [[Bolama]] - capital of the country until 1941, has some magnificent examples of colonial architecture and has been suggested as a world heritage site.\n* [[Buba]] - End of the tarmac going to the south of Guinea-Bissau. The town is built along a tidal river, the Rio Grande de Buba. Decent hotel.\n* [[Bubaque]] - Largest town in the Bijagos archipelago, with hotels and harbor for boat trips to other islands.\n* [[Cacheu]] - Cacheu was once an important place for slave-trading, and there is still a little fort.\n* [[Catió]]- \n* [[Farim]]\n* [[Gabú]] - Bustling, friendly market town with a few nightclubs, bars and hotels. \n[[Image:Caravela.jpg|thumb|Houses in Caravela, one of the Bijagós islands]]\n\n==Other destinations==\n* [[Bijagos Islands]] - an archipelago of some twenty tropical, beautiful islands. On the island of Orango it is possible to see hippos, and there are many other possibilities of eco tourism on the \"unspoiled islands\". On some islands there are even turtle nesting grounds. Many islands have French-owned fishing lodges. \n\n* [[Varela]] - Just south of Cap Skirring, but on the Guinea-Bissau side of the border, it is a tour de force to get to Varela on a 50 km long bumpy dirt road from São Domingos - but it is all rewarded when you reach this little paradise, with a superb Italian-owned hotel, beautiful beaches and pine forests and a very relaxed atmosphere with almost no other tourists. You may contact the small hotel in Varela via their Facebook page: Aparthotel Chez Helene\n\n* [[Boé Sector]] - The country's most South-Eastern corner is a mosaic of savannah, forest and farmland. Its remoteness has left the sector underdeveloped, but its Fular/Mandinka population is warm and welcoming. Primates constitute the majority of large mammals in the Boé, chiefly among them a healthy population (possibly 1000+) of chimpanzees. Although they are shy and not habituated to humans, there is a chance for ecotourists to spot humanity's closest relative. The Fonda Huuwa \"campsite\" in the main village Béli offers huts and meals at shoestring prices.\n\n==Get in==\n\n===Visa===\nEU passportholders are charged a staggering amount of 75€ for a single entry visa. An electronic Visa Application System was introduced in 2015. Following is cc from that website [https://www.rgb-visa.com] \n\n\" A biometric visa is required to enter Guinea Bissau. All foreign nationals entering Guinea Bissau are required to have a valid international travel document in the form of a national passport with a valid visa sticker bonded into passport obtained from any Border Control checkpoint or Guinea Bissau embassy (see the list of embassies here)\n\nAll Individual visa seekers are requested to apply for the Guinea Bissau Visa by filling in the online application form. Please follow the instructions for filling the form by following the step by step procedure. \nThe visa application (pre-enrolment) is done online on the following website: [https://www.rgb-visa.com], upon payment (online payment) to which a processing fee of 2.5 EUR is added. These amounts are not refunded if the visa is not granted.\n\nIf the request is accepted, the applicant receives a visa issuing confirmation (by email if the request is made online), required at the border crossing / entry to the country. Upon payment and visa confirmation you will receive visa slip that serves as a receipt. This receipt needs to be printed and it needs to be shown to the visa officer at the chosen border crossing with your passport. This pre-visa slips can also be used by the airlines companies as an ok to board. \nNationals of other countries (than Guinea-Bissau), must present a valid passport or valid national identity card (for ECOWAS citizens). The biometric visa for 1 to 90 days stay, with single entry is issued after prior collection of biometric data (fingerprints, photo) and biographical data of the applicant. It also requires the provision of information on travel and accommodation. \nThis biometric visa is issued at the diplomatic and consular offices in the following eight countries (more may be added later): Germany, Morocco, Guinea, Gâmbia, Usa, Cape Verde, Brasil, Spain, visa on arrival at Guine Bissau International Airport and possibly other border crossings into the country. \"\nA Yellow fever vaccination certificate is required.\n\n===By plane===\n[[Image:Oswaldo_Viera_Airport.jpg|thumb|upright=1.3|Oswaldo Vieira Airport, located in Bissau is the only international airport in Guinea Bissau]]\nDirect flights from [[Portugal]] with [http://www.flytap.com/ TAP] every Friday, returning the same day.\nAdditional direct flights from Europe and the US are possible with [http://www.royalairmaroc.com/ Royal Air Maroc].\n\nThe daily Air Senegal  [http://www.senegal-airlines.com/index.php]  flight Dakar(DKR) to Bissau(OXB) is working, the flight time is 1 hr. \n[http://www.caboverde.com/pages/615813.htm TACV Cabo Verde Airlines] has daily flights from Cap Verde. The flight time is 45min.\n\n===By train===\nThere are no trains in Guinea-Bissau\n\n===By car===\n* Warning ! As of now (Feb 2016), it is strongly and specifically recommended by the French foreign ministry travelers advice to avoid using the Ziguinchor - Bissau border crossing and to use Pirada instead. Source: http://www.diplomatie.gouv.fr/fr/conseils-aux-voyageurs/conseils-par-pays/guinee-bissao/\n\n*From [[Ziguinchor]], [[Senegal]] to Bissau it should take you 3-4 hours by sete-place (seven-seat Peugeot) or your own car, depending on the border bureaucracy and the ferry in São Vicente (A bridge is under construction, improving access to Senegal and Gambia markedly. This bridge is completed but won't be open for use until the end of May 2009). Roads are in good conditions. The ferry in São Vicente operates approximately from sunrise to sunset, after sunset, you will have to cross in canoa (pirogue) and change to another vehicle.\n*From [[Gambia]] (Serrekunda), count on 7-8 hours if everything goes smooth. If going by sept-place, you'll have to switch in [[Ziguinchor]]. The only really bad road in the trip is in Gambia, just before the border to Senegal.\n*[[Dakar]]-Bissau with public transport can be done in one day with a little luck, but you need to leave Dakar early and change vehicle in [[Ziguinchor]]. \n\nOther main borderposts include Pirada (dirtroad from there to [[Gabú]]) to [[Senegal]], and Buruntuma to [[Guinea]]-Conakry (also via Gabú).\n\n[[Image:A Saltinho (16).jpg|thumb|Saltinho Waterfalls]]\n\n===By boat===\nThere is a sea route between Dakar and Bissau. Additionally there are boats to and between the Bijagos islands.\n\n==Get around==\n[[Image:Bissau Taxi.jpg|thumb|A Guinean Bissau Taxi]]\nIn [[Bissau]] minibuses called '''toca-toca''' provide transport within the city. There are also regular '''taxis'''. For inter-city travel there are ''sept-places'', (seven-seat Peugeot) and ''candongas'', big commercial vehicles carrying ten to twenty passengers. Prefer sept-place or at least try to get the front seats. It is also possible to rent taxis to other towns and cities.\n\nThe main bus-station \"paragem\" of Bissau is situated behind the BCEAO (Banco Central dos Estados de África Ocidental) on the Airport Road. Are you heading for Biombo or Prabis, you need to go to another bus-station in Estrada de Bor. There are no time-schedules; cars leave when they are full. As most locals travel in the early morning (c. 07.00), cars fill up quicker in the morning. It might be hard to get transport in late afternoon and evening.\n\n[[Image:Varela.jpg|thumb|Varela Beach]]\nTo go to the islands, there's a choice between cheap, but rather unsafe, canoas (pirogues) leaving from Porto Pidjiguiti or Porto de Bandim, and expensive modern boats owned by french fishing lodges on the Bijagos islands. In 2007 a ferry started sailing between Bissau and Bubaque, leaving Friday and returning Sunday. Schedules depend on tides, so check in advance.\n\nAs Guinea Bissau is very flat and there is virtually no traffic on the roads outside Bissau, it's a good country for cycling. Bikes can be bought in the country, which will probably (as in most parts of the world) be  Chinese made  bikes. As always, good value for money.\n\n==Talk==\n\n'''[[Portuguese phrasebook|Portuguese]]''' is the official language and the language used for writing. However, less than one in seven of the population speak it fluently. \n\n'''[[Creole phrasebook|Upper Guinea Creole]]''' - a Portuguese-based creole language - is the ''lingua franca'' spoken among the locals. It is spoken as a first language by approximately 15% of the population, and as a second language by approximately 50%, and is the de facto language of national identity.\n\nNative languages include Balanta, Fula, Mandjak, Mandinka and Papel. [[French phrasebook|French]] is widely spoken - it is taught in schools as Guinea-Bissau is surrounded by French-speaking countries and is a full member of the Francophonie as well as the CPLP.\n\nYou can buy a Creole/English dictionary at the WEC Mission which is in Caracol, and in the Mavegro supermarket which is located right next to the Simão Mendes Hospital (on the road that passes on the right hand side, 300&nbsp;m forward on the right)\n\n==See==\n* '''Forests of Jemberem''' - Cantanhez Natural Park, where you can see chimpanzees with a little luck.\n\n==Do==\n[[Image:Bissau_carnival_dance.jpg|thumb|Dance performance during carnival in Bissau]]\n*Carnival in Bissau\n\n==Buy==\n[[File:CFA Franc map.svg|thumb|Countries using the West African CFA franc are in green, using the Central African CFA franc in red]]\nThe '''West African CFA franc''' (XOF) is used by Guinea-Bissau and is also used by its neighbours, [[Benin]], [[Burkina Faso]], [[Côte d'Ivoire]], [[Mali]], [[Niger]], [[Senegal]] and [[Togo]]. Strictly speaking, it's a separate currency from the Central African CFA franc (XAF) with the bank notes being different, but the two currencies are used interchangeably one-for-one throughout.\n\t\nBoth these CFA franc currencies are guaranteed by the state and pegged to the euro at a rate of €1 = 655.957 CFA francs.\n\nIn December 2007 the first ATM's arrived to the country of Guinea-Bissau - in the BAO (Banco da Africa Occidental) branches of Bissau and Gabú. An ATM is also being set up in the Hotel Malaika in Bissau. These ATM's only function if you have a local account with that bank.  So, leave your credit card/bank card at home because it will do you no good. Probably still safest to bring euros or francs CFA enough to cover the time you plan to stay. Western Union is present in [[Bissau]] (eight locations), [[Bafatá]], [[Gabú]], Buba, Canchungo and Mansoa. (They will rip you off by taking 10%.)\n\nThe largest market in the country is Bandim Market, which is on the main road going into town. You can buy many things there and the atmosphere is nice. Otherwise there are small vendors on most roads of the capital. In the villages (Tabankas) you will also find small vendors selling the necessities. In the main towns in the countryside there are larger markets called \"Lumo\", which give farmers and merchants the possibility to sell/trade their goods. Don't forget that Guinea-Bissau is a poor country and as such the possibilities for shopping are smaller than in the Gambia or Senegal.\n\t\n[[File:BilletBCEAO.jpg|thumb|10,000 francs CFA banknote]]\nWhen shopping in Guinea Bissau you have to keep in mind that locals quite rightly tend to consider foreigners as rich (especially white people). The first price you are asked to pay will always be much higher than the actual price of an item. Haggling is absolutely common and no item should be bought without haggling for a better price.\n\nUseful creole shopping phrases:\n''Ke ku bu misti?'' (what do you want?)\n''N'mistil'' (I want it)\n''N'ka mistil'' (I don't want it)\n''Es i kanto'' (How much is this)\n''Rapatil'' (Request to lower the prize)\n\n* More phrases at [[Creole phrasebook]]\n\n==Eat==\nMost Guineans eat rice with fish, because the country is rich in fish, and rice (homegrown or imported from Thailand) is relatively cheap. The more costly meals contain beef, goat, chicken or pork. Meals are also made with palm oil and peanut sauces and diverse vegetables. Guineans also eat wild/game meat (bushbuck, monkey, wild hogs, etc.) but these animals are considered to be in danger of extinction and so it is not recommended to support this.\n\nGuineans are known for their warm heartedness and so you will always be asked to come have a bit with a group of people (it is common to eat from a large bowl)...\"bin kume, no kume\"\n\nFruit available depends on the season, but mangos, papayas, oranges, grape fruits, bananas, cashews and peanuts are abundant. Also try the sour \"fole\" fruits and the baobab fruit juice (sumo de cabaceira). Imported fruit can be bought in \"fera de prasa\" in the centre of Bissau (apples, pears, pineapples, watermelons etc) but is more expensive than in Europe.\n\nVegetables sold in the markets include lettuce, tomatoes, cucumbers, bell pepper, parsley, okra, potatoes, carrots, onions, garlic, chili, sweet potatoes.\n\nStreet snacks are typically sandwiches with hardboiled egg, omelete, fish or beef - or donuts, cake or hardboiled eggs. Frozen juice in small plastic bags or glass water bottles is popular among locals.\n\n==Drink==\n\n'''Guinea-Bissau doesn't have a legal drinking/purchasing age'''. \n\n[[Image:Warga.jpg|thumb|Warga (strong sweet green tea)]]\nThe people of Guinea-Bissau love to drink a sweet green tea known as \"warga\", the brewing of which is an experience to watch. In Bissau and other towns, Portuguese beer and wine are popular, but the African take on the originally Brazilian Caipirinha is definitely worth a try. Strong liquor made from fermented cashew apple, sugar cane or oil palm is usually available in the more remote locations.\nWith regard to water, it is recommended that foreigners only drink it bottled, filtered or boiled.\n\n==Sleep==\n<!--THIS SECTION IN COUNTRY ARTICLES IS NOT FOR LISTINGS. If possible all listings should go to city articles. This should be an overview saying, for example, \"Cheaper hostels can be found in \"cityname\".-->\nHotels in [[Bissau]] are generally overpriced - but some hotels were undergoing renovation in 2007, giving hope for more competition and lower prices.\n\nIn most of the towns outside the capital, there are possibilities to find hotels or other rentable rooms.\n\nThere are also mainly French-run hotels on the Bijagos islands which are recommendable.\n\n==Learn==\n\n==Work==\nThere are numerous NGO's, missionaries and international organizations (UN, EU, WHO, UNICEF, The Global Fund) working in Guinea Bissau.\n\n*[http://www.bandim.org/ Bandim Health Project]\n*[http://www.medicosdomundo.pt/ Médicos do Mundo]\n*[http://www.inde.pt/ INDE - Intercooperação e Desenvolvimento ]\n*[http://www.chimbo.org/ \n* Agencia de Cooperacao de Timor-Leste em Guine-Bissau\n\n==Stay safe==\n{{warningbox|Guinea-Bissau has experienced a volatile recent political history. It has the onerous distinction of never having an elected president complete a full 5-year term in office and there have been dozens of coups and attempted coups as well as numerous assassinations of officials and military leaders since independence in 1974. The most recent coup was in April 2012, which follows a failed coup attempt in 2011, the house-arrest of the prime minister by the military (and threat of killing him) in 2010, and the assassination of the president by soldiers in 2009 (a day after a top military leader & rival of the president was killed by a bomb). In 2015, the president sacked his cabinet over a dispute with the prime minister, but this time no shots were fired and the military vowed to stay in their barracks. A new cabinet has recently been peacefully installed, giving cause for careful optimism. Political violence is generally not aimed at travellers but it is wise to avoid any political demonstrations and stay clear of any large presence of military on the streets.\n([https://www.gov.uk/foreign-travel-advice/guinea-bissau UK Government travel advisory])}}\n\nGuinea-Bissau is considered by the UN to be a major port for drug shipments into Europe. The military is know for corruption, prompting the head of the UN to refer to the head of the Air Force as a drug kingpin. Fortunately for travellers, the drug trafficking is generally confined to the open sea and harbor, and drug lords are too busy smuggling dope to be bothering anyone inside the country, local or expat.\n\nThere is very little tourism in Guinea-Bissau, and as a result the criminal tactics typically aimed at tourists are absent. Nightlife is generally safe, but keep your wits about you as you would anywhere else. \n\nMany western nations lack a diplomatic presence in Guinea-Bissau, which means you will have a much harder time if arrested, detained, or in need of consular assistance in an emergency. There is no UK or US embassy in Guinea-Bissau; the UK and US embassies in [[Dakar]], Senegal are accredited to Guinea-Bissau. The UK has an honorary consul, Dutch businessman Jan van Maanen, who is also honorary consul to the Netherlands. He is very approachable (also if you are neither Dutch nor British) and well connected in the country's political hierarchy, and can usually be found at his compound MAVEGRO in Bissau (taxi drivers know it), ☎ +245 955522772  The US has a liaison office at: Edifício SITEC, Rua José Carlos Schwarz 245, Bairro d’Ajuda, ☎ +245 325-6382.\n\nIf you are arrested, be prepared to pay a bribe. However, it is not recommended to bribe officials directly. Simply ask if they can pay the fine for you, because you do not understand the customs procedures. Then leave the country as soon as possible.\n\n==Stay healthy==\n{{warningbox|Neighboring countries [[Guinea]], [[Liberia]], [[Mali]] and [[Sierra Leone]] were recently struck with an outbreak of the often fatal and largely untreatable '''Ebola''' Viral Haemorrhagic Fever. The outbreak currently seems to be under control, and Guinea-Bissau was thankfully not affected.\n}}\nBefore travelling, make sure you have the yellow fever, hepatitis A, tetanus and typhoid vaccinations up to date. Malaria prophylaxis is highly recommended - consult a medical doctor for advice on which type to choose. \n\nHIV is prevalent, as are most major sexually transmitted diseases. The [http://wwwnc.cdc.gov/travel/destinations/guinea-bissau.htm CDC in the US] listed Guinea-Bissau as a groundswell point for new HIV infections. Always use a condom when having sexual relations with new partners.\n\nDepending on the length and purpose of your stay, also consider vaccinations for typhoid fever, hepatitis B, rabies, meningitis and tuberculosis.\n\nIf bitten by a dog, cat, monkey or bat - seek a doctor as fast as possible, no matter if you've been vaccinated or not. Everybody needs post-exposure rabies prophylaxis - but if vaccinated beforehand, you'll need less vaccines. Rabies can be prevented with vaccines and immunoglubulin, but once the symptoms present, there is no cure and about 100% die.\n\nMake sure you drink only bottled/filtered water.\n\n==Respect==\nGuinea-Bissau's different ethnic and religious groups mostly coexist in peaceful acceptance, and sectarian or tribal violence (as opposed to political violence) is practically unheard of. \n\nSome people (especially children) will ask you to take their photo, while others will get upset if you take photos - always ask in advance, especially when taking close-ups.\nAvoid taking photos of military installations without asking, though sometimes you'll be allowed to.\n\n==Contact==\nThere are numerous internet cafés in the center of Bissau, but ask around, more of them are hard to spot from outside. Other options are Lenox or go wireless in Restaurant Phoenicia or hotel Bissau Palace.\n\nThere are three mobile companies in Guinea Bissau all with prepaid mobile cards, that can be bought all over. It's easy to call abroad or other mobiles of the same company, but can be hard to call from one company to another (e.g. MTN->Guinétel).\n*MTN GSM 900 - simcard 500 FCFA, not very expensive to call Europe or other African countries. Will soon be possible to get internet connection via an MTN mobile.\n*Orange GSM 900/1800\n*Guinétel GSM 900\n\n\n{{isPartOf|West_Africa}}\n{{countryguide}}\n{{outline}}\n{{Wikipedia|Guniea=Bissau}}     \n\n\n[[ca:Guinea-Bissau]]\n[[de:Guinea-Bissau]]\n[[eo:Gvineo Bisaŭa]]\n[[es:Guinea-Bissau]]\n[[fi:Guinea-Bissau]]\n[[fr:Guinée-Bissau]]\n[[hu:Bissau-Guinea]]\n[[it:Guinea-Bissau]]\n[[ja:ギニアビサウ]]\n[[nl:Guinee-Bissau]]\n[[pl:Gwinea Bissau]]\n[[pt:Guiné-Bissau]]\n[[ru:Гвинея-Бисау]]\n[[sv:Guinea-Bissau]]\n[[zh:幾內亞比索]]\n[[wts:Category:Guinea-Bissau]]\n\n\n[[WikiPedia:Guinea-Bissau]]\n[[Dmoz:Africa/Guinea-Bissau/]]\n[[World66:africa/guineabissau]]"
        }
    }
}