{
    "parse": {
        "title": "Hungary",
        "pageid": 472,
        "wikitext": {
            "*": "{{pagebanner|Hungary Banner.jpg}}\n\n{{quickbar\n| image=Budapest parliament 42447015 9d06c74869 o.jpg\n| caption=Hungarian Parliament Building, Budapest\n| location=Hungary in its region.svg\n| flag=Flag of Hungary.svg\n| capital=[[Budapest]]\n| government=Parliamentary democracy\n| currency=Forint (HUF)\n| area=93,030km²<br />''water: 690km²<br />land: 92,340km²''\n| population=10,049,000 (2008 est.)\n| language=[[Hungarian]] 98.2%, other 1.8%\n| religion=Roman Catholic 67.5%, Calvinist 20%, Lutheran 5%, atheist and other 7.5%\n| electricity=230, 50Hz (European Plug)\n| callingcode=+36\n| tld=.hu\n| timezone=UTC +1\n}}\n[http://www.hungary.com '''Hungary'''] (''Magyarország'') is a country in [[Central Europe]] bordering [[Slovakia]] to the north, [[Austria]] to the west, [[Slovenia]] and [[Croatia]] to the south west, [[Serbia]] to the south, [[Romania]] to the east and [[Ukraine]] to the north east. Member of the [[European Union]] and the [[Europe#Countries|Schengen]] Border-less Europe Agreement. The country offers many diverse destinations: relatively low mountains in the north-west, the Great Plain in the east, lakes and rivers of all sorts (including Balaton - the largest lake in Central Europe), and many beautiful small villages and hidden gems of cities. Top this off with Hungary's great accessibility in the middle of Europe, a vivid culture and economy, and you get a destination absolutely not worth missing if you're in the region.\n\n==Understand==\nHungary is one of the 15 most popular tourist destinations in the world, with a [[Budapest|capital]] regarded as one of the [http://whc.unesco.org/archive/advisory_body_evaluation/400bis.pdf most beautiful in the world]. Despite its relatively small size, Hungary has numerous World Heritage Sites, UNESCO Biosphere reserves, the second largest thermal lake in the world (Lake Hévíz), the largest lake in Central Europe ([[Lake Balaton]]), and the largest natural grassland in Europe ([[Hortobágy]]). In terms of buildings, Hungary has the largest synagogue in Europe (Great Synagogue), the largest medicinal bath in Europe (Széchenyi Medicinal Bath), the third largest church in Europe (Esztergom Basilica), the second largest territorial abbey in the world (Pannonhalma Archabbey), the second largest Baroque castle in the world (Gödöllő), and the largest Early Christian Necropolis outside Italy (Pécs), the second underground in Europe and the third all over the world after New York and London (Millennium Underground).\n\nYou can expect to find safe food and water, good safety and a generally stable political climate.\n\nHungary doesn't attract terrorists and keeps drug and crime levels moderate. \n\n===People===\nHungary has been ethnically diverse since its inception, and while today over 90% of the population are ethnically Hungarian, pockets of ethnic and cultural Slovaks, Romanians, Germans and others dot the country. Due to the border changes of Hungary after World War I, over 2 million ethnic and cultural Hungarians live in bordering countries, as well. The Hungarians, otherwise known as Magyars, are the descendants of several tribes from Central Asia, who were believed to be fierce, nomadic horsemen and came to Central Europe in the 9th century.\n\n===Climate===\nTemperatures in Hungary vary from -20°C (-4F) to 39°C (102F) through the year. Distribution and frequency of rainfall are unpredictable due to the continental climate of the country. Heavy storms are frequent after hot summer days, and rainfall is more frequent in the Autumn. The western part of the country usually receives more rain than the eastern part, and severe droughts may occur in summertime. Weather conditions in the Great Plain can be especially harsh, with hot summers, cold winters, and scant rainfall. The weather of the capital city is humid continental with agreeable temperatures  in spring and autumn, during the summertime the climate is warm and sudden heavy showers are common, while the winter is cold and the temperatures are usually under 0 degrees.\n\n==Regions==\n\n{{Regionlist|\n\nregionmap=Hungary colour.png |\nregionmapsize=upright=2 |\nregionmaptext=Regions of Hungary |\n\nregion1name=[[Central Hungary]] |\nregion1color=#a4c28d |\nregion1items=|\nregion1description=The most-visited part of the country due to the capital [[Budapest]].  |\n\nregion2name=[[Lake Balaton]] |\nregion2color=#b383b3  |\nregion2items= |\nregion2description=A great variety of destinations from rural, peaceful wine regions to vibrant towns. |\n\nregion3name=[[Transdanubia]] |\nregion3color=#c8b7b7  |\nregion3items= |\nregion3description=This historic region west of the river Danube is one of the most economically developed of the country.|\n\nregion4name=[[Northern Hungary]]  |\nregion4color=#6698bb  |\nregion4items= |\nregion4description=Great historic towns and cave baths are to be seen here. |\n\nregion5name=[[Great Hungarian Plain]]  |\nregion5color=#c5995c  |\nregion5items= |\nregion5description=Somewhat isolated from the rest of the country, this is a large region with flat to rolling plains. [[Szeged]] could be considered the unofficial capital of the region. |\n}}\n\n==Cities==\n<!-- DO NOT MAKE CHANGES BEFORE DISCUSSION ON TALK PAGE -->\n* [[Budapest]] {{-}} with jovial leafy parks, renowned museums, an extensive Medieval Castle District and a thriving nightlife, Budapest is one of Europe's most delightful and enjoyable cities\n* [[Debrecen]] {{-}} the second largest city in the country, a cultural and ecclesiastical centre\n* [[Eger]] {{-}} a beautiful northern town with an ancient castle and camera obscura\n* [[Győr]] {{-}} there are many cafés, restaurants, boutiques, and night clubs in its lovely Baroque city centre\n* [[Kecskemét]] {{-}} a city famous for its vibrant music scene, plum brandy, and Art Nouveau architecture\n* [[Miskolc]] {{-}} with a unique cave bath in [[Miskolc-Tapolca]], the fourth largest city in the country, located near the scenic Bükk Mountans\n* [[Nyíregyháza]] {{-}} a medium-sized city with a busy water resort, museum village, and annual autumn festival\n* [[Pécs]] {{-}} a pleasant cultural centre and university town\n* [[Szeged]] {{-}} the sunniest city in Hungary with a particularly rich history\n* [[Székesfehérvár]] {{-}} former Royal seat, currently famous for its Baroque architecture and museums\n* [[Szombathely]]\n\n==Other destinations==\n* [[Aggtelek]] {{-}} beautiful caves with dripstones and stalagmites\n* [[Bükk]] {{-}} a section of the Carpathian Mountain range\n* [[Harkány]] {{-}} a historic small town along the Villány-Siklósi wine route famous for its spa\n* [[Lake Balaton]] {{-}} the major lake of Hungary and the biggest lake in [[Central Europe]]\n* [[Mohács]] {{-}} Famous for the Battle of Mohács (1526, 1687), These battles represented the beginning and end, respectively, of the Ottoman domination of Hungary. Every spring, the town hosts the annual Busójárás carnival.\n\n==Get in==\n{{Schengen}}\n\nRecognised refugees and stateless persons in possession of a valid travel document issued by the government of any one of the above countries/territories are exempt from obtaining a visa for [[Hungary]] (but '''no''' other Schengen country, except [[Germany]] and, for refugees, [[Slovakia]]) for a maximum stay of 90 days in a 180 day period.\n\nCitizens of [[Antigua and Barbuda]] are permitted to work in Hungary without the need to obtain a visa for the period of their 90 day visa-free stay. However, this ability to work visa-free does not necessarily extend to other Schengen countries.\n\n===By plane===\nHungary's main international airports are '''Budapest Ferenc Liszt International Airport''' [http://www.bud.hu/index.nfo?tPath=/english] in [[Budapest]] (formerly \"Budapest Ferihegy International Airport\") and '''Debrecen Airport''' [http://www.airportdebrecen.hu/] in [[Debrecen]]. Only these two have scheduled flights. There are other less used international airports; the Hévíz-Balaton Airport has seasonal charter flights, the Győr-Pér and Pécs-Pogány airports serve mostly general aviation. Hungary does not have a flag carrier airline. There are several '''low cost carriers''' operating to Budapest: for example '''Ryanair''' [http://www.ryanair.com], '''Wizzair''' [http://www.wizzair.com], '''Easyjet''' [http://www.easyjet.com], '''Germanwings''' [http://www.germanwings.com] and '''Airberlin''' [http://www.airberlin.com]. Alternatively, a bus connection exists between '''Vienna International Airport''' and the capital, which is a 3 hour ride [http://www.viennaairport.com/jart/prj3/va/main.jart?rel=en&content-id=1249344074246].\n\n===By train===\n[[Budapest]] is an important railway hub for the whole country and large part of Central Europe, with frequent train connections from [[Austria]], [[Germany]], the [[Czech Republic]],[[Slovakia]] and [[Romania]]. There is at least one daily train to/from [[Croatia]], [[Slovenia]], [[Poland]], [[Switzerland]] and [[Ukraine]].\nAs of 2019, rail traffic is discontinued between Budapest and [[Belgrade]], due to track construction works in Serbia.\n\nFor detailed info see [[Budapest#By_train]].\n\nYou can search for train connections and look up timetables at the official site of [http://elvira.mav-start.hu/ MÁV], Hungary's national train company, or at the [http://www.bahn.de German Railways website] covering almost all of Europe.\n\n===By private transfer===\nMany types of private transfers are available from Budapest to close Capital cities: Prague, Vienna and Bratislava. Most private transfers include hotel pick-up and hotel drop-off and save you the hassle of getting to the airport/train station and back. For example with [http://www.airporttransferbudapest.com Airport Transfer Budapest].\n\n===By car===\nTo enter the country, ensure that your International Motor Insurance Card is valid for Hungary(H) along with the Vehicle Registration and a Power of Attorney from the owner if the car is not yours. The border guards are very strict about allowing cars through without these documents (see excerpt below). \n\nThe Hungarian border control is very strict and thorough. They will not hesitate to conduct a full vehicle search if necessary.  \nEntry from Schengen countries (Austria, Slovenia, Slovakia) does not require such border control since the abolishment of physical borders in 2007. All remaining EU borders show light control (Romania, Croatia) and due to a bilateral agreement Serbian citizens are also no more to undergo a strict border control. However you have to take into consideration that if entering from the Schengen area you might have to undergo a so called domestic customs control at any time when moving/driving in the country. Non-Schengen passengers must count with having to face a strict control upon passing the border from Ukraine and Serbia. Coming from Serbia you are allowed to bring 2 packets of cigarettes into Hungary. Any excess will be confiscated and you will end up with a fine of €102. Hunting weapons can be imported from any EU member state provided that you have a European Licence. However you cannot buy or sell your a new weapon here. Automatic weapons can't be held at all, and there is little chance you'd ever get a license in Hungary to obtain such. The same is the situation with illicit drugs. Infringement of these rules will lead to your immediate arrest!\nEntry from non-Schengen countries can take quite a long time, in particular in the summer months on the weekends when EU-Nationals are returning back north along the E75 corridor from Belgrade, Serbia. The wait lines to get through the border have been as long as 7km with a wait time of up to 6 hours. Alternative border-crossing points in Hungary or Croatia can be used to by-pass. If you are driving in from an EU country e.g. Austria, you are required to pull over to check with authorities at the border, otherwise, the borders are open and usually the immigration control kiosk are empty. \n\nWhen driving into Hungary, make sure that the border crossing on the route you choose allows the passage of foreigners. Also some smaller crossings close in the afternoon for the night. It is also required to buy a vignette for driving on highways before entering them. [http://www.motorway.hu/02Ematrica/01Dijtablazat2011].\nDomestic (Budapest) car hire: [http://www.budapestcarhire.hu] and International car rental supplier: [http://www.rent-a-car.start4all].\n\n===By bus===\nSeveral international bus lines go in or through Hungary. You can find timetables and book tickets on the homepage of Volánbusz [http://www.volanbusz.hu/en/], which is the national bus company and also the local Eurolines representation.\nAlternatively, Orangeways bus company [http://www.orangeways.com/en] offer services on routes between Budapest and Austria, Croatia, Czech Republic, Germany, Poland, Romania and Slovakia. There are many taxi and minibus companies [http://www.eurobusways.com] going door to door at your request.\n\n===By ship===\nIt is possible to enter Hungary by international shipping lines on Danube (Duna) or Tisza rivers.\n\nThere is a scheduled hydrofoil service on the Danube to and from Vienna and Bratislava between May and September operated by '''Mahart.''' [http://www.mahart.info/webset32.cgi?MAHART@@EN@@38@@365391497]\n\n===From Slovakia===\n* Direct trains connect Budapest with '''[[Bratislava]]''' (9 trains daily, one nightly train in each direction) and '''[[Košice]]''' (2 trains daily in each direction). Reservations are not required, but possible.\n\n* The other border crossing railway passenger services were cut back in the recent years, making difficult to cross the border. However, at some places it is easier to walk through the border. There are many suburban trains from Budapest (or from Győr) to Komárom, and from Bratislava to Komárno. Although there's no train crossing the border, the two stations are in relatively close walking distance. In the eastern part of the country, the MÁV operates hourly trains to Sátoraljaújhely, from where Slovenské Nové Mesto railway station accessible with a 2 km walk, where there are many trains to Kosice, offering an alternative to the daily 2 direct trains.\n\n* Student Agency [http://www.studentagency.cz] operates buses from '''[[Prague]]''' via Bratislava to Gyor and Budapest (currently 2 daily buses in each direction). These buses are very comfortable and somewhat cheaper than trains. Ticket can be easily bought online and even returned (without a cancellation fee!) until 5 hours before the departure time. Advance reservation is recommended, as these buses tend to be booked up.\n\n* Several private companies operate microbuses between '''Košice''' and the Budapest International Airport. Look around the city center of Košice, you'll find travel agencies displaying these offers.\n\n* Alternately, there is a local bus 801 from '''Bratislava''' to '''Rajka''' just across the border. From Rajka, a few local trains depart daily to '''Győr''', where you can change for a Budapest-bound train. Keep in mind this is much slower than taking a direct bus or a direct train and costs about the same. The only difference is the route taken, since direct trains between Bratislava and Budapest do not travel through Győr, instead they follow an entirely different route through Nové Zámky, Štúrovo and Szob.\n\n* Štúrovo railway station is connected with [[Esztergom]] railway station by local buses: [http://www.volan.hu/menetrmezo/223.pdf]\n\n==Get around==\n\n===By plane===\nHungary presently has no regular domestic flights. As Budapest lies in the center of the country and pretty much any point can be reached within three hours by train or bus, there isn't much need for scheduled domestic flights.\n\n===By train===\nThe Hungarian National Railway is '''MÁV''' [http://www.mav-start.hu/] and '''GYSEV''' [http://www.gysev.hu] (some lines in the west of the country). MÁV has an '''online schedule and pricing site''' [http://elvira.mav-start.hu/], which can be used in English as well.\n\nThe train '''network''' is star-shaped (hub-and-spoke), fanning out from the centre at [[Budapest]]. This is caused by history because half of the once complete train system went to the neighbor countries after World War I. If neither the starting or ending point is Budapest, expect to travel for a ''long time'' often with change in Budapest. \n\n'''Intercity (IC)''' trains are the fastest, and they're up-to-date, well maintained and clean. They link the major cities with Budapest. Expect to pay about HUF550 (=EUR2) extra fee independently from the distance for the mandatory seat reservation (not in international ICs, ECs). In some cases the extra charge can be lower. Compared to the majority of Western European ticket prices, Hungary's IC trains are amongst the cheapest, with an excellent record of speed and comfort. In almost all cases they also have a restaurant car. At the '''weekends''' many students use these IC trains to commute between Budapest and other cities, so an early advance booking is recommended on Friday afternoons for the trains leaving Budapest and on Sunday evenings for trains towards Budapest.  Working with a notebook is generally safe, unless it's heavy overcrowded.\n\n'''Other train lines''' usually are not that fast, and not always cleaned up to the high standards (even in the 1st class), and often vandalised (mostly in Budapest region); however quality standards are improving. During summer trains linking Balaton to Budapest are sometimes overcrowded with the IC usually being sold out. The next choice is the gyorsvonat (fast train, with a moderate extra fee). Pricing depends only on the distance and on the car class. Cash desks assume 2nd class by default for non-IC trains (at least in Budapest for English speakers), so if you didn't catch your IC, consider asking 1st class, paying small extra for much more comfort. Smoking is prohibited on all trains, as well as on the station platforms.\n\n'''Young people''' (under 26 years) may travel with 33% reduction at the weekends (Friday afternoon included). '''Children''' (under 6 years) and '''retired''' (citizens from EU countries over 65 years) can travel free except on InterCity and fast trains where the extra fee (reservation) must be paid.\n\nIt is possible to travel with an '''[[Inter Rail]] pass''' in Hungary. Check whether buying tickets for each journey is cheaper.\n\n=== By bus ===\nHungary’s national bus network is operated by 28 state run companies, united under '''Volán Association''' [http://ujmenetrend.cdata.hu/uj_menetrend/en/index.php]. Connections are frequent, prices are close to those on non-Intercity trains. Buses, especially longer distance ones are efficient and quite similar in speed to the train, sometimes even faster as they do not need to connect through [[Budapest]] unlike the train. Demand for bus transport is high and buses tend to get overfilled. To guarantee a seat on a long-distance bus it is therefore recommended to queue on time for the bus at its departing platform. Tickets are purchased from the bus driver, this usually includes most long-distance buses. Have sufficient cash on you as it is not possible to pay by card. It is a good idea to reserve your tickets for national holidays, Friday and Sunday evenings beforehand.\n\nIf you use the public Budapest airport busline (No. 200E), make sure you validate your ticket after buying it. (You can buy it from the bus driver as well.) The small orange boxes on the bus are used for validating tickets. Ticket inspectors can show up and if you have not validated your ticket you are liable for a 8000HUF on the spot fine.\n\n===By boat===\nThere are several scheduled riverboat and hydrofoil lines operated by MAHART PassNave Ltd. from the capital city [[Budapest]] to towns in the Danubebend, like [[Szentendre]], [[Visegrád]] and [[Esztergom]]. [http://www.mahart.info/webset32.cgi?MAHART@@EN@@32@@546056730]\n\nIn the capital city there are several sightseeing and night cruises opereated by MAHART PassNave Ltd. and other shipping companys, like Legenda Ltd.\n\nAlthough from May to September there is a good hydrofoil boat connection [http://www.mahart.info/webset32.cgi?MAHART@@EN@@38@@365391497] between [[Vienna]] and [[Budapest]].\n\nThere are some ferries on Danube and Tisza but their undetermined working hours make them non-recommended. You can trust the ferry on Lake Balaton, though, for a modest price.\n\n===By car===\nMost roads in Hungary are two lane apart from modern motorways. Main roads are mostly in good shape, however cracks, potholes and bumpy roads are common on minor roads and in major cities though they are constantly being repaired. Usually you can travel by using a map and the road signs. \n\nMotorists frequently pass cars at the last possible moment resulting in a daily symphony of near, head-on collisions. As there are few shoulders alongside Hungarian roads, motorists are frequently passing bicyclists and the numbers of fatalities have risen sharply in recent years. Generally speaking, Hungarians tend to drive very aggressively, tailgating, flashing, and honking is very common, especially on motorways.\n\nExpressways are not free, but there are no other toll roads or tunnels. A vignette system is used, similar to that in neighbouring Austria and Slovakia, but as of 2008 the vignette is stored electronically and checked for using gantries that read license plate numbers. You can purchase them in intervals of 10 days, 1 month, or 1 year. The vignette is very important and it is a good idea to buy it even if you don't plan to use the highway. Control is automatic with video cameras and you will get a high ticket (HUF70,000) automatically without any warning.\n\nIf you travel by normal roads the speed limit is 90km/h between cities and 50km/h inside, which slows you to the average around 60km/h. Roads often have high traffic (especially main roads like #8 to the west, #6 to the south and #4 to the east). On highways, the speed limit is 130km/h unless explicitly noted otherwise, but in the inside lane it is still very common to have someone speed by you. As elsewhere in Europe, you are expected to use the right lane for travel, and move into the left lane only for passing.  Passing on the right in not allowed on highways.\n\nWhen you cross the country from the west to the east (or vice versa), take into account that there are only a few bridges crossing the [[Danube]] outside [[Budapest]]. There are some ferries available though.\n\nOutside urban areas, it is a legal requirement to drive with headlights on, even during the day.  A peculiar custom in Hungary is that the flashing of one's headlights in an intersection means that the driver is giving up his or her right of way and letting the other party ahead.  \n\nHungary has a policy of zero tolerance for driving under the influence of alcohol. If you are caught driving even after only having a couple of units of alcohol you are most likely to be arrested.\n\n==== Highways ====\nThere is a fast growing highway network in Hungary (1,480km in total). Each highway starts in Budapest.\n\n* M0 - Motorway ring around Budapest, with a missing section in the north-west.\n* M1 - connection to [[Győr]], [[Austria]] and [[Slovakia]] (west)\n* M2 - connection to [[Vác]], planned to reach the border to [[Slovakia]] by 2015 (north)\n* M3/M30/M35 - connection to [[Miskolc]], [[Debrecen]] and [[Nyíregyháza]] (east)\n* M5 - connection to [[Serbia]], via [[Kecskemét]] and [[Szeged]] (south-east) \n* M6/M60 - Connection to [[Dunaújváros]] and [[Pécs]](south)\n* M7/M70 - connection to [[Lake Balaton]], [[Croatia]] and [[Slovenia]] (south-west)\n* M43 - branch off near [[Szeged]] to [[Romania]] (south-east)\n\nPlanned:\n\n* M4 - will provide connection to [[Romania]] via [[Szolnok]] by the year 2015 (east)\n* M44 - will provide connection between the M5 at [[Kecskemét]] and the Romanian border via [[Békéscsaba]] (east)\n* M8/M9 - will cross the country east-west by 2015\n\nA single vignette is required to use all highways. Vignettes can be purchased online with bankcard on [https://ematrica.nemzetiutdij.hu], at filling stations and at ÁAK (State Motorway Management Co.) offices. A 10-day vignette for a passenger car costs HUF 2975 (~EUR 10) during summertime, the 4-day ticket for car has been cancelled. Vignettes are controlled automatically through a camera system. See [http://www.motorway.hu/] or [http://www.nart.hu/] for details.\n\n===By taxi===\nInspect the change that taxi drivers give you. Cabbies commonly rip off tourists by giving them change in outdated Romanian currency, which looks similar to Hungarian currency, but is worthless and cannot be redeemed. : ''See also: [[Budapest#By taxi]]''.\n\n===By Metro===\nWithin the city centre of Budapest, you will find there is local metro (underground) stations throughout the capital and within proximity to many tourist attractions, usually indicated with large \"M\" signs. Tickets are available at kiosks and at automatic ticket machines (newer ones accept coins, banknotes and credit cards as well). If buying single tickets remember that they must be validated (punched) at the machines in front of the escalators (or if travelling on buses and trams at the machines inside the vehicle). Single tickets are valid for one journey on one service. If you change between metro lines, you don't have to validate a new ticket, but in any other cases (changing from metro to bus or tram, bus to bus, tram to bus etc.) you have to use a second ticket. If you make only occasional journeys, save by buying a book of 10. However, be warned that many ticketing staff do not speak English and some times it is best to use the available ticket machine which has an English option. However, if you do plan to see a number of attractions with public transport, it is best to get a 24 hour travel card. It is valid for a full 24 hours from the time of purchase. There are also 3 day and weekly tickets. If you buy a three day Budapest Card, this includes public transport and entry to many museums. Many travellers will find that there are metro ticket inspectors virtually at every stop. If you are caught with invalid fare, you will be asked to pay a fine of 8000 HUF on the spot or you will be taken to the police station. \n\nWhen you approach the ticketing machine, you will see a number of options. Short fare is intended for only 3 stops, and only on metro lines, regardless of which one you catch or change to. Regular fare instructions is as listed, but be sure to validate your fare or it'll be considered invalid. For more information: [http://www.bkk.hu/en/prices/]\n\n==Talk==\n\n===Hungarian===\n: ''See also: [[Hungarian phrasebook]]''\n\nHungarians are rightly proud of their unique, complex, sophisticated, richly expressive language, '''Hungarian''' (''Magyar'' pronounced \"mahdyar\").  It is a Uralic language most closely related to Mansi and Khanty of western Siberia.  It is further sub-classified into the Finno-Ugric languages which include [[Finnish]] and [[Estonian]]; it is not at all related to any of its neighbours: the Slavic, Germanic, and Romance languages belonging to the Indo-European language family.  Although related to Finnish and Estonian, they are not mutually intelligible.  Aside from Finnish, it is considered one of the most difficult languages for English speakers to learn with the vocabulary, complicated grammar, and pronunciation being radically different.  So it is not surprising that an English speaker visiting Hungary understands nothing from written or spoken Hungarian.  Hungary did adopt the Latin alphabet after becoming a Christian kingdom in the year 1000. \n\nEnglish-speakers tend to find most everything about the written language tough going, including a number of unusual sounds like ''gy'' (often pronounced like the ''d'' in \"during\" and ''ű'' (vaguely like a long English ''e'' as in ''me'' with rounded lips), as well as agglutinative grammar that leads to fearsome-looking words like ''eltéveszthetetlen'' (unmistakable) and ''viszontlátásra'' (goodbye). Also, the letters can very well be pronounced differently than in English: the \"s\" always has a \"sh\" sound, the \"sz\" has the \"s\" sound, and the \"c\" is pronounced like the English \"ts\", to name a few.  On the upside, it is written with the familiar Roman alphabet (if adorned with lots of accents), and--unlike English--it has almost total phonemic orthography. This means that if you learn how to pronounce the 44 letters of the alphabet and the digraphs, you will be able to pronounce almost every Hungarian word properly. Just ''one'' difference in pronunciation, vowel length, or stress can lead to misinterpretation or total misunderstanding. The stress always falls on the first syllable of any word, so all the goodies on top of the vowels are pronunciation cues, and not indicators of stress, as in Spanish.  Diphthongs are almost-nonexistent in Hungarian (except adopted foreign words). Just one of many profound grammatical differences from most European languages is that Hungarian does not have, nor need to have the verb \"to have\" in the sense of possession - the indicator of possession is attached to the possessed noun and not the possessor, e.g. Kutya = dog, Kutyám = my dog, Van egy kutyám = I have a dog, or literally \"Is a dog-my\".  Hungarian has a very specific case system, both grammatical, locative, oblique, and the less productive; for example a noun used as the subject has no suffix, while when used as an direct object, the letter \"t\" is attached as a suffix, with a vowel if necessary.  One simplifying aspect of Hungarian is that there is NO grammatical gender, even with the pronouns \"he\" or \"she\", which are both \"ő\", so one does not have to worry about the random Der, Die, Das sort of thing that occurs in German, \"the\" is simply \"a\".  In Hungarian, family name precedes given name, the same as with Asian languages.  And the list of differences goes on and on, such as the definite and indefinite conjugational system, vowel harmony, etc. Attempting anything beyond the very basics will gain you a great deal of respect since so few non-native Hungarians ever attempt to learn any of this small, seemingly difficult, but fascinating language.\n\n===Foreign languages===\nSince English is widely taught in schools and universities, if you address people in their teens, twenties or lower thirties, you stand a good chance that they will speak very good English.\n\nHowever, due to Hungary's history, the older generation will tend to not speak English. These Hungarians may speak Russian, which was compulsory in the Communist era, although most have not used it since. \n\nGerman is very useful and is almost as widely spoken as English, and almost universally near the Austrian border and especially Sopron, which is officially bilingual and has '''huge''' contacts with Vienna due to it being accessible by Vienna suburban trains. In these areas, and with older people in general, German will most often take you a lot further than English. Spanish, French and Italian are secondary languages in schools and are increasing in prominence where there are increasing numbers of firms basing subsidiaries in the country.\n\nYou will have a much better chance finding someone speaking a foreign language (mostly English and German) in larger cities, especially in those with universities such as [[Budapest]], [[Debrecen]], [[Miskolc]], and [[Szeged]].\n\n==See==\nHungary has several [[UNESCO World Heritage List|World Heritage sites]]. These are:\n[[Image:Estibp13.jpg|300px|thumb|right|Buda Castle by night]]\n* [[Budapest]], including the Banks of the Danube, the Buda Castle Quarter and Andrássy Avenue\n* Old Village of [[Hollókő]] and its Surroundings\n* Caves of [[Aggtelek]] Karst and Slovak Karst\n* Millenary Benedictine Abbey of [[Pannonhalma]] and its Natural Environment\n* [[Hortobágy]] National Park - the Puszta\n* Early Christian Necropolis of [[Pécs]] (Sopianae)\n* [[Fertő]]/[[Neusiedlersee]] Cultural Landscape\n* [[Tokaj]] Wine Region Historic Cultural Landscape\n\nOther major tourist destination is [[Lake Balaton]], with winehills, thermal spa in [[Hévíz]] around.\n\nThere are also some amazing things to see. \n\n* '''Tiszavirágzás'''. In mid-[[June]] the Tisza produces swarms of mayflies which are likened to flowers. Once decimated by pollution, the population is rebounding. (They're famous for living only for 1-2 days.)\n\n==Do==\n'''Birdwatching'''\n\nHungary is an excellent destination for birdwatching (aka birding) holiday. There are wooded hills, vast fish-pond systems and grasslands, the ''puszta''. Particularly good areas include the Kiskunsag and Hortobagy National Parks and the Aggtelek, Bukk and Zemplen Hills. \n\n'''Horse riding'''\n\nVast areas of open countryside coupled with the long traditions of horsemanship make Hungary an ideal country for riding.\nWide open plains in the south and forested hills in the north offer varied riding terrain.\n\n===Baths===\nThermal waters abound in Hungary with over 1000 thermal springs in the country (more than 100 just in the Budapest area) many of which have been turned into baths and spas. The most famous being the [[Budapest#Szchnyi_Spa|Szechenyi baths in Budapest]]. It was completed in 1913 and built in Modern Renaissance style. This is the biggest thermal bath complex in Europe, its venue is the Budapest City Park. There are, however, hundreds of individual baths all around the country. The cave baths at [[Miskolc-Tapolca]] and the spa at Egerszalók are some nice examples. The first thermal baths were erected by the Romans more than 2000 years ago.\n\nSee [http://wikitravel.org/en/Budapest#Thermal_baths Budapest], [http://wikitravel.org/en/Ny%C3%ADregyh%C3%A1za#Do Nyíregyháza] for details. More thermal bath and spa from Hungary:\n[http://www.seeuinhungary.com/wellness.htm] [http://budapest-travel-guide.info/]\n\n\"Budapest History Museum\"\nThere are three major sections. The Roman Antiquities and Archaeology section (Aquincum Museum). The Medieval section (Castle Museum). And the Modern Age section (Kiscelli Museum).\n\n\"Holocaust Memorial Center\"\nIt is an interactive exhibition that shows original documents and objects from the Holocaust. There is also a library, bookshop, a coffee shop, and the Braham Information Centre. (also guided tours are available)\n\n\"House of Terror Museum\"\nIts exhibitions commemorate the victims of the racist and communist regimes in Hungary in the 20th century. (including those detained, interrogated, tortured or killed in the building.) It portrays the country's relationship with Nazi Germany and the Soviet Union during their years of occupation.\n\n\"Lake Balaton\"\nThe biggest lake in Central Europe and there are numerous villages on its edges catering to tourists. It is one of the most popular holiday destinations.\n\n==Buy==\nThe unit of Hungarian currency is known as the ''forint'' ('''HUF'''). The Hungarian \"cent\" (''fillér'') is long since obsolete. \n\nBank notes come in denominations of HUF20,000, 10,000, 5,000, 2,000, 1,000 and HUF500, coins are HUF200 (two coloured, similar to a one euro coin), HUF100 (two coloured, similar to €2), HUF50, HUF20, HUF10 and HUF5.\n\nEuros are now accepted at most hotels and some of the restaurants and shops. Make sure you check the exchange rate though, sometimes even well known places (like McDonald's) will exchange at unrealistic rates.\n\nYou can use major credit cards (EuroCard, Visa) in major shops and larger restaurants, but never expect that without checking first. Small places cannot afford to handle cards. ATMs are available even in small cities, the coverage is good.\n\nWhile completing any monetary transactions, it's best to pay in ''forint'' when you can. Some restaurants and hotels charge a steep rate for euro exchange and often, due to the fluctuation in exchange rates, cost and services stated may vary drastically.\n\n===Money Exchange===\nThere were 285 forints to the US dollar and 300 forints to the euro in March 2015. Shopping in Hungary is extremely cheap for people from the US and the euro zone.\n\nExchange rates for EUR and USD are roughly the same downtown (at least in [[Budapest]] and [[Eger]]). Rates will likely be much worse in airports and large train stations - so change exactly what you need to reach downtown. A good habit is to compare the buy and sell rates: if they are drastically different, you're best going somewhere else. Official exchange offices always give a receipt and normally have a large glass between client and a cashier making all steps transparent for client.\n\nTravellers report that unofficial money changers operating nearby an official money changing booth offer unfavourable rates--and recommend to use official exchange offices. It's worth noting that such exchanges are illegal.  If someone offers to change at a very good rate, it is to actually slip you less money with some hand trickery, hoping that you won't notice till later.  \n\nIf you arrive to Budapest at late nights or state holidays it is quite likely you won't be able to find any working bank or exchange office. In this case you may attempt to exchange your money with any random taxi driver. They will rip you off by HUF100-200 (around €1), but it's better than nothing. There is an ATM in the arrival hall at Budapest Ferihegy, and the rates for using ATMs with a card are often better than the bureau de change. There are many banks machines in Budapest which will accept European and North American debit/credit cards, if it becomes necessary, it maybe in your best interest to draw a sufficient amount for your stay and it will often give a more much favourable rate.\n\n===What to buy?===\nApart from classical tourist souvenirs like postcards and trinkets, here are some things unique to Hungary or just hard to find elsewhere.\n\n* '''Cold-smoked sausages'''\n\n* '''Spices''': Paprika and Hungarian Saffron\n\n* '''Gundel set of cheese''': aged in Gundel wines or with walnut pieces or seasonings. Most easily found in 350g sets of three kinds in duty-free of Ferihegy Airport in [[Budapest]] (at least in Terminal 2), but is likely available in Gundel 1894 Food & Wine Cellar (see [[Budapest/Pest#Gundel|Pest#Eat]]). Keep in mind that shelf life for this cheese is only 2 months.\n\n* '''Wines''': Tokaji, Egri Bikavér (see Liquor), red wine from Villány area etc.\n\n* '''Pálinka''': very famous and strong brandy made from fruits.\n\n* '''Unicum''': a herbal digestive liqueur.\n\n* '''Herend''': luxury hand painted and gilded porcelain.\n\n==Eat==\n[[File:Csabai kolbász.jpg|thumb|upright=1.3|Kolbász, Hungarian sausage]]\n\nMain courses in menus are normally HUF2,500-3,000 in touristy places in Budapest, HUF1,500-1,800 outside it, or in towns like [[Eger]] and [[Szentendre]] (''March 2009'').\n\nA lunch in [[Budapest]] is HUF900-8000 per person, and half or one third of that outside Budapest. (Chinese fast food menu is around HUF500).\n\nIn restaurants, a service charge is frequently included into bill, 10% or even 12%, but this has to be clearly pointed out on the menu. If it's not mentioned, the place has no right to include a service charge in the bill.\n\nEven if there's no service charge, unless the service was preposterous most Hungarians tend to leave a generous tip (10% minimum). Unlike in most western countries, tip is usually not left on the table, but rather the amount is specified to the waiting staff when you pay.\n\nThere were some places (mainly in downtown Pest) that tried to rip off drunk tourists at night by charging ridiculously high prices for drinks. Most of these places are closed now, but it's still a good idea to always check the prices on the menu before ordering.\n\nIn major cities and next to the highways you can find restaurants of the major international chains such as KFC, McDonald's, Burger King, Pizza Hut, Subway and TGI Friday's.\n\n===Cuisine===\n[[File:Szeged goulash from pork.jpg|thumb|upright=1.3|Szeged-style goulash from pork, served with flour dumplings]]\nHungarians are quite proud of their cuisine (''Magyar konyha''), and most of the time not without a reason. Food are usually spicy (but not hot by general standards), and it's tasty rather than healthy &mdash; many dishes are prepared with lard or deep-fried.  The national spice is '''paprika''', made from ground sweet bell peppers and which actually has some flavor when fresh.  The national dish is, of course, '''goulash''', but Hungarians call the thick paprika-laden stew known as goulash elsewhere by the term ''pörkölt'' and reserve the term ''gulyás'' for a lighter paprika-flavoured soup.\n\n[[File:Palatschinke.jpg|thumb|upright=1.3|Palacsinta filled with nuts and chocolate sauce.]]\nMeat is popular- especially pork (sertés), beef (marha) and venison (őz). Less common is lamb and mutton. The best fish in Hungary are river fish: Carp (Ponty) and Fogas (Zander), though many restaurants will serve fish from far away. Chicken (csirke) and Turkey (pulyka) and common, and you will also find game birds excellent in smarter restaurants and country areas- Pheasant (Fácán), Partridge(Fogoly) and duck (Kacsa). A typical meal will involve soup, often like a consommé (erőleves), meat with potatoes (burgonya) and a side salad, and a dessert like pancakes (palacsinta).\n\n[[File:Szeged-paprika1.jpg|thumb|upright=1.3|Paprika]]\nLess well known in the rest of the world are '''paprikás csirke''', chicken in paprika sauce, and '''halászlé''', paprika fish soup often made from carp.\n\nGoose is also quite popular in Hungary.  While tourists gorge on '''goose liver''' (''libamáj''), still cheap by Western standards, probably the most common dish is ''sült libacomb'', '''roast goose leg'''.  Stuffed (''töltött'') vegetables of all kinds are also popular, and Hungarian pancakes ('''palacsinta'''), both savoury and sweet, are a treat.  Common snacks include '''kolbász''', a Hungarianized version of the Polish ''kielbasa'' sausage, and '''lángos''', deep-fried dough with a variety of toppings (mostly sour cream, cheese and/or garlic).\n\nA Hungarian meal is almost always &mdash; even at breakfast &mdash; accompanied by Hungarian '''pickles '''called ''savanyúság'', literally \"sourness\".  These are often dubbed ''saláta'' on menus, so order a ''vitamin saláta'' if you want fresh veggies. Starch is most often served as potatoes, rice or dumplings (''galuska''' or ''nokedli''), the primary Hungarian contribution in this field is an unusual type of small couscous-like pasta called ''tarhonya''.\n\nIt is worth to visit a \"Cukrászda\" if you are in Hungary. These are very popular with delicious cakes and coffee. Try the traditional Krémes (with vanila cream), Eszterházy (lots of nuts) or Somlói Galuska. You should visit '''Auguszt''', Szamos or Daubner if you want the best! Daubner is a little out of the way, Auguszt Cukrászda is an absolute must. They have a shop downtown near Astoria metro station, founded in 1969.\n\nAnother favourite is '''Lángos''', it is basically deep fried bread, similar to \"whales-tail or beaver-tail\" but in Hungary, it can be served with any fillings imaginable. Most common is plain, with salt, garlic (fokhagyma) and soured cream (tejföl). If you do come across a Langos stand, there are usually a large number of options from pizza langos, or eggs with mayo or nutella and bananas.\n\nA very popular vegetarian dish throughout Eastern Europe is Kaposzta Teszta (kaposhta tasteta) Cabbage with noodles. In Poland, it's called kapusta z kluski or haluski, in the Czech Republic, it's known as nudle s zelí, and Slovaks call it haluski. This can be a strictly vegetarian dish, sometimes with mushrooms. This side dish or main-course offering holds up well on a buffet table.\n\n===Vegetarian food===\nVegetarians and Vegans will have about as much ease eating out as in any other western country.  \n[[Budapest]] is not a problem, as there is a wide variety of restaurants to choose from, but in an ordinary Hungarian restaurant the non-meat mains on the menu are pretty much limited to ''rántott sajt'' (fried cheese) and ''gombafejek rántva'' (fried mushrooms).\n\nHowever, in recent years, Italian food has become a lot more popular, so as long as you don't mind a pasta heavy diet as a vegetarian you will find a wider choice.\n\nIf one self-caters from supermarkets or local shops and markets, however, the selection of fruits and vegetables is quite good, especially in summer. Hungarian peaches and apricots are delicious (buy from farmers at local markets). \n\nThere are plenty of vegetarian and vegan restaurants, and a lot of healthfood stores that offer all sorts of vegetarian/vegan products (including cosmetics). Regular stores like Groby among other brands sell everything from vegan sausages to mayonnaise. A good place to start is looking at Budaveg[http://www.budaveg.com/] and Happy Cow[http://www.happycow.net/europe/hungary/budapest/index.html] for specific information.\n\nOverall, apply the same rules as you do at home, and you should be well fed.\n\n==Drink==\n\n===Wine===\n[[Image:Villany wine.jpg|upright=1.3|thumb||Hills, grape plantations and wine cellars near [[Villány]], southern Hungary.]]\n[[File:Tokaji from Hungary (5613984851).jpg|thumb|upright=1.3|Tokaji from Hungary]]\n[[File:Sopron barack 07.JPG|thumb|Barack palinka a hungarian apricot brandy, served cold with a glass of mineral water.]]\n\nHungary has several famous vine regions, most known are [[Villány]], [[Eger]], [[Badacsony]], [[Tokaj]], [[Szekszárd]]. Prices are reasonable.\n<!-- NOTE TO EDITORS: This is a short summary for \"Egri Bikavér\", which should be described fully in [[Eger#Drink]]. Please update information there as a primary description; add only most essential details here. -->\n* '''Egri Bikavér''' (Bull's Blood of Eger) (HUF 1000 for a good one) is a strong red Hungarian wine which supposedly saved a clever Hungarian girl from her fate with a Turkish sultan. During the time of the Turkish occupation, it is said a young girl was summoned to become a member of the local sultan's harem. Not wanting this fate for his daughter, her father gave her a bottle of Egri Bikavér to take to the sultan. He told her to tell the ruler it was bull's blood, and would make him invincible. The sultan, being Muslim, was unaccustomed to alcohol, and proceeded to pass out, leaving the daughter unharmed. There is another story connected to why Bull's Blood is called so, and it also comes from the Turkish era. According to that one, the defenders of the different castles used to drink this red wine. When they saw the color on the mouths of the Hungarians, they thought that it must have been from a bull, thus the name.\n\n* '''Tokaj''' is known for its sweet dessert wines (''Tokaji aszú''), (HUF 2000 < x < 6000) which acquire their distinctive taste from grapes infected by the \"noble rot\" ''Botrytis cinerea''.  The favorite tipple of aristocracy, past fans of Tokaji include Louis XIV (who called Tokaj as \"''The king of the wines, the wine of the kings''\"), Beethoven, Napoleon III and Peter the Great &mdash; which is still reflected in the steep pricing of the best varieties.  Almost uniquely among white wines, Tokaj keeps very well for long time.\n\nIf new to Hungarian wine, be aware that both champagne (\"pezsgő\") and wine, red or white, are quite likely to be sweet (\"Édes\"). If dry wine is your preference, look for the word \"Száraz\" on the label. When buying bottled wine, don't bother with types cheaper than 6-700 HUF, as these are usually very low quality (maybe not even produced from grapes). In wine cellars, however, high quality may be available at surprisingly low prices.\n\n===Liquor===\nIn Hungarian, '''pálinka''' denotes strong brandy-like liquor distilled from fruit.  ''Pálinka'' is a very social drink: just as the English drink tea, the Hungarians, especially in rural areas, will offer ''pálinka'' to guests upon arrival.   The best-known varieties are ''barackpálinka'', made from apricots, ''körtepálinka'' from pears, and ''szilvapálinka'' made from plums.  Factory-made ''pálinka'' is widely available, but keep an eye out for homemade ''házipálinka''. Pálinkas usually contain around or above 50% of alcohol, often more for the homemade ones. Pálinka bottles marked ''mézes'' will be heavily sweetened with honey. (HUF 3000 for something good)\n\n'''Unicum''' is a strong ''digestif'' made from a secret mix of over 40 herbs. It comes in striking black bottles emblazoned with a red and white cross, and has a very strong and unusual taste. ''Unicum Next'' has a lighter, citrusy flavor, and is rather more palatable. Definitely worth trying, the bottle itself may also be used for decoration, and keeps very well for a long time.\n\n===Beer===\nHungarian beer is quite average compared to other Central European countries like Germany and the Czech Republic as it has long been a wine culture.  The most common beers are Dreher, Szalon, Borsodi, Soproni and Arany Ászok, available in the styles ''világos'' (lager) and ''barna'' (brown). All of Hungarian breweries are owned and managed by international brands such as: Dreher Sörgyár (Budapest) - SAB-Miller; Heineken Hungaria (Sopron and Martfű) - Heineken; Borsodi Sörgyár (Bőcs) - Interbrew; Pécsi Sörfőzde (Pécs)- Ottakinger. \nThey cost about 200-300 Forints at a store and 400-600 at a bar. Some expensive clubs can charge up to 900 in Budapest.\n\nImported beers like Pilsner Urquell, Staropramen and Budweiser-Budvar (the Czech variety) are widely available in bars and markets for not much more than the ubiquitous Hungarian brands. \n\nWhen offering a toast with beer, be warned that most Hungarians will politely refuse.  This is due to an old tradition due to remembering soldiers killed in the 1848 revolution, whereby it was decreed no Hungarian would toast with beer for 150 years.  It's been so long, however, that most Hungarians no longer know the origins of this tradition or that they've been free to make toasts over beer for the past ten years.\n\n===Coffee===\nCafe culture is alive and well in Hungary, although it may never recover the romance of its turn-of-the-century intellectual heyday. Unless asked, it's a good idea to specify what kind of coffee you prefer. The word ''kávé'' means the strong, espresso like coffee to most Hungarians, although American-style coffee (known as ''hosszú kávé'' in Hungarian, usually translated as \"long coffee\") is now also available at most places.\n\n===Tea===\nTea houses are now getting popular in cities, especially among the young. There is a growing number of tea houses, mainly in [[Budapest]] and some bigger cities where people can buy several types of loose tea. As it is quite fashionable to spend time in a tea house, more and more people will be able to serve good tea even at home. The best teas to go for are the herbal and fruit varieties. In restaurants and cafes, lemon juice is frequently served in a small bottle. In traditional restaurants or cafes however, good teas are hard to find, as coffee and beverages are preferred.\n\nWhen you ask for a black tea in a budget cafe, frequently Earl Grey is served instead--remember to specify if that does matter for you.\n\n===Mineral water===\n''Ásványvíz'' (mineral water) is widely available and it is good practice to carry a bottle with you during the hot summer.\n\nIt should be noted though that as it is the case of most European countries, in Hungary it is safe to drink tap water anywhere, even in 'remote' settings. Bottled waters are offered in a large selection, both the fizzy (blue bottle cap ''buborékos'') and still (red/pink bottle cap) water and it is cheap (starts from less than 100 HUF for one and half liter). The only notable exception of the drinking water are trains where the tap water is not drinkable and other places where tap water is labeled as such.\n\n==Sleep==\n\n===Hostels===\nPrices vary greatly. For the cheapest room in a youth [[hostel]] in Budapest expect to pay between €6 and €10, but the normal rate in a hostel is €20-22 per person.\n\n===Farmhouses===\n'''Village Tourism''' is popular and very well developed in Hungary, and can be a remarkable experience. Start your research with ''1Hungary'' [http://www.1hungary.com/info/hungary/], ''National Federation of Rural and Agrotourism'' [http://www.fatosz.hu/11-5115.html] and ''Centre of Rural Tourism'' [http://www.falutur.hu/].\nNear Budapest it is also possible to find rural houses to rent, for instance the ''Wild Grape Guesthouse'' [http://www.travelfever.org/], what makes a good combination to explore the capital and a National Park while staying at the same accommodation.\n\n===Camping===\nThere are campgrounds available.  See the city guides, including the [[Budapest]] guide.\n\n==Learn==\nHungarian universities are open to all foreign students. Many European exchange students come through the EU's Erasmus program. There are quite a lot students from Asia and the Middle East as well, particularly because despite the high standard of education, fees are still considerably lower than in the more developed Western European countries. Those interested should visit Study in Hungary [http://www.studyhungary.hu/] or University of Debrecen [http://www.ud-mhsc.org/] websites.\n\n==Work==\nIt could be very difficult for an individual to seek (legal) employment in Hungary because of the complexity, cost and time involved. Most foreign workers in Hungary have received their visas and other necessary documents through the company they are employed by. It is hoped, however, that since the joining of Hungary to the EU a reduction will follow in the amount of red tape involved.\n\nCitizens of Antigua and Barbuda are permitted to work in Hungary without the need to obtain a visa for the period of their 90 day visa-free stay. However, this ability to work visa-free does not necessarily extend to other Schengen countries.\n\nMany students (usually on a gap year) work as second language teachers at one of Budapest's many language schools. Be advised that a qualification is required (ESL/TEFL/TESOL) and that experience is preferred.\n\nOne option is to teach through the Central European Teaching Program [http://www.ticon.net/~cetp/]. For a placement fee they will take care of paperwork and set you up in a school in Hungary teaching English on a local salary. Contracts are for one semester or a whole school year. Qualified ESL/EFL teachers can find employment in Hungary at private language schools which offer better rates of pay and without having to pay a placement fee. \n\nSee also [[Budapest#Work|Work section in Budapest article]].\n\n==Stay safe==\nHungary is, in general, a very safe country. According to the 2012 study of the United Nations Office on Drugs and Crime, Hungary had an intentional homicide rate of only 1.3 per 100,000 inhabitants. This is lower than the European average intentional homicide rate of 3.5, and also lower than the North American average intentional homicide rate of 3.9 per 100,000 inhabitants.\n\nHowever, petty crime in particular remains a concern, just like in any other country. Watch your baggage and pockets on public transport. There is a danger of pickpockets. Passports, cash, and credit cards are favorite targets of thieves. Keep items that you do not store in your hotel safe or residence in a safe place, but be aware that pockets, purses and backpacks are especially vulnerable, even if they close with a zipper. There are also reported cases of people who got their baggage stolen while sleeping on the train, so watch out for that. Bag- and wallet- snatching, while rare, is not unheard of.\n\nGenerally, Hungary is rather quiet during the night compared to other European countries, and crime to tourists is limited to pickpocketing and eventual cheating on prices and bills and taxi fares.\n\nDue to recent government communications warning about the risks of replacement migration, some people mainly in the rural areas show a protectionist attitude and this may manifest as intolerance against people of colour. There were several cases in the last months, when local people notified the police because of a group of tourists who they believed were illegal immigrants. \n\nEveryone is required to carry their passport or (for EU/EFTA/Monaco nationals) ID card. Not doing so can end you in trouble with the police. The police will be most pragmatic if a color copy of your passport is provided. \n\nThe police force is professional and well trained. However, one must have a good knowledge of Hungarian to ask them for assistance as most of the policemen hardly speak any English.\n\nSee the Budapest travel guide for more specific and valuable information about common street scams and tourist traps in Hungary.\n\n===Driving conditions===\nWhile the majority of Hungarians observe the traffic rules, some drive dangerously, which resulted 739 deaths on the roads in 2010. This is largely due to careless driving habits. Many drivers do not observe the speed limits and you should be extra careful on two-way roads where local drivers pass each other frequently and allow for less space than you may be used to.\n\nCar seats are required for infants. Children under age 12 may not sit in the front seat. Seat belts are mandatory for everyone in the car. You may not turn right on a red light. The police issues tickets for traffic violations and charge fines on the spot. In practice the laws are widely ignored. \n\nAlso, Hungarian laws have '''zero tolerance''' to drink and drive, and the penalty is a severe fine. It means no alcoholic beverage is allowed to be consumed if driving, '''no blood alcohol of any level is acceptable.''' Failure to pay fines may result in your passport getting confiscated, or even a jail term until or unless you pay the fine.\n\nMore importantly, the police stops vehicles regularly for document checks. You shouldn't worry when you are stopped because by law, everyone needs to have their identification papers checked.\n\nHungary has some of the harshest, if punishing penalties if people are involved in a car accident. Involvement in a car accident results in a fine, and maybe a jail sentence from 1 year to 5 years (depending on the aggravating circumstances).\n\n===Same-sex travelers===\nHungarians generally display a more modern progressive balance towards homosexuality and have legal protections in place, such as a by-law which protects same-sex civil partnerships.  While public displays of affections amongst same-sex couples might be met with stares on the casual ''budapesti'' street, Hungarians generally display a let-live attitude to others' affairs.  \n\nHungarians generally subscribe to the World Health Organization's classification of gender identity dysphoria and not to the views held by some in Western Europe or North America regarding the subjectivity of identity.  Hungarians are proud of their culture and history and travelers are advised to not impose their beliefs or culture on Hungarians while they are visiting.\n\n==Stay healthy==\nFood and water is generally safe, even in remote villages. \n\nPrivate health care providers are high quality, but limited in scope once outside Budapest. Dentistry is both famously high quality and cheaper than in Western Europe (8-10000 HUF for an appointment and x-ray), and physiotherapy also (3000HUF for a half hour treatment), but check the price with the provider before you confirm the appointment. Outside Budapest and Sopron you will likely have to speak basic Hungarian to communicate your needs as few doctors will have any English or German skills.\n\nPublic health care is free for qualifying (insured) people, and is of adequate quality in urban areas.\n\nThe country has joined the EU, so basic coverage is present for EU citizens, but check before entering the country how far are you insured and what you have to pay for. Do not expect at this time that the local doctor will know the EU rules, prepare to provide info.\n\nThe European Health Insurance Card is required from EU citizens applying for free treatment under this regulation; European health card for 1 June 2004 [http://europa.eu.int/comm/employment_social/news/2003/feb/hicard_en.html]\n\nPharmacies are everywhere, you may expect high prices, but very good pharmaceutical coverage. The only problem might be communicating with the pharmacist as most of them speak only Hungarian outside  Budapest. Even some rusty Latin might come handy quite unexpectedly. For travelers from Eastern Europe, some of familiar medications might be unavailable -- so be prepared to find a substitute in advance.\n\n==Respect==\n* The 1956 Revolution continues to be a sensitive subject with the right wing community and many of the elderly. You shouldn't discuss the Treaty of Trianon (1920) with nationalists - they can take it pretty sensitively.\n\n* Open display of the Communist red star and hammer and sickle symbol, the Nazi swastika and SS symbols, and the Hungarian fascist Arrow Cross, is prohibited by law. Make sure your clothing does not have these symbols on it, even if it's just a joke. You can be fined for it.\n\n* Members of the Gypsy community may find the traditional Hungarian label 'Cigány' (pron. 'tzigan') slightly offensive, preferring to be labeled as Roma.\n\n* As a rural tradition, Hungarians affectionately refer to themselves as \"dancing with tears in our eyes\" (\"sírva vígad a magyar\"), as in a bittersweet resignation to the perceived bad luck in their long history. Avoid mocking Hungarian history and Hungarian patriotism. \n\n* When entering a home, shoes should generally be taken off. \n\n===Uncommon customs===\n* Even if you meet someone of the opposite sex for the first time, it's not unusual to kiss each other on the cheeks instead of shaking hands as a greeting. \n\n* It's an old tradition (although nowadays not held by everyone) that Hungarians do not clink beer glasses or beer bottles. This is due to the legend that Austrians celebrated the execution of the 13 Hungarian Martyrs in 1849 by clinking their beer glasses, so Hungarians vowed not to clink with beer for 150 years.  Obviously this time period has expired, but old habits die hard. This is not so much followed by the youngest generation.\n\n==Contact==\n* Broadband Internet access is now widespread in Hungary. It's quite usual to find free Internet access (Wi-Fi) in Shopping centres; in Budapest, most cafes and pubs. You'll have wifi access even in small towns. Look for the \"Wi-Fi\" signs, you may have to ask for the access password, however, if you consume, it will be freely given.\n\n\n[[ca:Hongria]]\n[[de:Ungarn]]\n[[eo:Hungario]]\n[[es:Hungría]]\n[[fi:Unkari]]\n[[fr:Hongrie]]\n[[hu:Magyarország]]\n[[it:Ungheria]]\n[[ja:ハンガリー]]\n[[nl:Hongarije]]\n[[pl:Węgry]]\n[[pt:Hungria]]\n[[ro:Ungaria]]\n[[ru:Венгрия]]\n[[sv:Ungern]]\n[[wts:Category:Hungary]]\n\n\n[[WikiPedia:Hungary]]\n[[Dmoz:Europe/Hungary/]]\n[[World66:europe/hungary]]\n\n{{hasDocent|DenisYurkin}}\n\n\n{{IsPartOf|Central Europe}}\n{{outline}}\n{{countryguide}}\n\n{{related|New_Year_holidays_in_Hungary}}"
        }
    }
}