{
    "parse": {
        "title": "Jamaica",
        "pageid": 513,
        "wikitext": {
            "*": "{{pagebanner|Jamaica Banner.jpg}}\n{{cautionbox|The CDC has identified [[Jamaica]] as an affected area of the Zika outbreak. Pregnant women are advised to be cautious as the virus can lead to birth defects. Adults affected by the virus experience fever, rash, joint pain, and conjunctivitis (red eyes) typically lasting a week.  You can learn more by visiting [http://www.cdc.gov/zika/index.html the official CDC website].}}\n\n{{quickbar\n| image=2419996668 8942ac4f3e o.jpg|no frame|250px\n| location=Jamaica in its region.svg\n| flag=Flag of Jamaica.svg\n| capital=[[Kingston (Jamaica)|Kingston]]\n| government=Constitutional Monarchy and Parliamentary Democracy\n| currency=Jamaican Dollar (JMD)\n| area=10,991km²<br />''land: 10,831km²<br />water: 160km²''\n| population=2,758,124 (July 2006 est.)\n| language=English (official), Jamaican Creole\n| religion=Protestant 61.3% (Church of God 21.2%, Baptist 8.8%, Anglican 5.5%, Seventh-Day Adventist 9%, Pentecostal 7.6%, Methodist 2.7%, United Church 2.7%, Brethren 1.1%, Jehovah's Witness 1.6%, Moravian 1.1%), Roman Catholic 4%, other, including some spiritual 34.7%\n| electricity=110V, 50Hz (USA Plug)\n| callingcode=+1-876\n| tld=.jm\n| timezone=UTC-5\n}}\n{{otheruses}}\n\n[http://www.visitjamaica.com '''Jamaica'''] is an island nation in the [[Caribbean]], located to the south of [[Cuba]] and to the west of the island of [[Hispaniola]].\n\n==Understand==\nWith 2.8 million people, Jamaica is the third most populous anglophone country in the Americas, after the United States and Canada. It remains a Commonwealth realm with Queen Elizabeth II as Head of State.\n\nJamaica has a large population of Chinese and East Indians. Sizeable numbers of Whites and Mulattoes, and persons of Syrian/Lebanese descent, many of which have intermixed throughout the generations. Individuals on the island seldom belong to one racial group as mixed-race Jamaicans are the second largest racial group; the genetic roots of many people can be traced to origins that are not necessarily physically apparent. Christianity is the major religion in the island.\n\nJamaica's resources include coffee, papaya, bauxite, gypsum, limestone and sugar cane.\n\n===History===\nThe Arawak and Taino indigenous people originating from South America settled on the island between 4000 and 1000BC.\n\nHistory. \nJamaica was inhabited by Arawak Indians when Columbus explored it in 1494 and named it St. Iago. It remained under Spanish rule until 1655, when it became a British possession. Buccaneers operated from Port Royal, also the capital, until it fell into the sea in an earthquake in 1692.\nDuring its first 200 years of British rule, Jamaica became one of the world's leading sugar-exporting, slave-dependent nations. After the abolition of the slave trade in 1807, the British imported Indian and Chinese workers as indentured servants to supplement the labour pool. Descendants of indentured servants of Asian and Chinese origin continue to reside in Jamaica today.\n\nBy the beginning of the 19th century, Jamaica's heavy reliance on slavery resulted in blacks (Africans) outnumbering whites (Europeans) by a ratio of almost 20 to 1. Even though England had outlawed the importation of slaves, some were still smuggled into the colonies. \n\nIn the 1800s, the British established a number of botanical gardens. These included the Castleton Garden, set up in 1862 to replace the Bath Garden (created in 1779) which was subject to flooding. Bath Garden was the site for planting breadfruit brought to Jamaica from the Pacific by Captain William Bligh. Other gardens were the Cinchona Plantation founded in 1868 and the Hope Garden founded in 1874. In 1872, Kingston became the island's capital.\n\nJamaica slowly gained increasing independence from the United Kingdom and in 1958, it became a province in the Federation of the West Indies before   attaining full independence by leaving the federation in 1962.\n\n===Flora and fauna===\n[[Image:2419182555 30b36299c2 o.jpg|thumb|upright=1.3|The edge of the Blue Mountains just north of Kingston.]] \nJamaica's climate is tropical, supporting diverse ecosystems with a wealth of plants and animals.  \n\nJamaica's plant life has changed considerably over the centuries. When the Spanish came here in 1494- except for small agricultural clearings- the country was deeply forested, but the European settlers cut down the great timber trees for building purposes and cleared the plains, savannahs, and mountain slopes for cultivation. Many new plants were introduced including sugarcane, bananas, and citrus trees. \n\nIn the areas of heavy rainfall are stands of bamboo, ferns, ebony, mahogany, and rosewood. Cactus and similar dry-area plants are found along the south and southwest coastal area. Parts of the west and southwest consist of large grasslands, with scattered stands of trees. \n\nThe Jamaican animal life, typical of the Caribbean, includes a highly diversified wildlife with many endemic species found nowhere else on earth. As with other oceanic islands, Land mammals are made up almost entirely of bats. the only non-bat native mammal extant in Jamaica is the Jamaican Hutia, locally known as the coney. Introduced mammals such as wild boar and the Small Asian Mongoose are also common. Jamaica is also home to many reptiles, the largest of which is the American Crocodile. However, it is only present within the Black River and a few other areas. Lizards such as anoles and iguanas and snakes such as racers and the Jamaica Boa (the largest snake on the island) are common. None of Jamaica's native snakes are dangerously venomous to humans. Birds are abundant, and make up the bulk of the endemic and native vertebrate species. beautiful and exotic birds such as the Jamaican Tody and the Doctor Bird (the national bird) can be found, among a large number of others. Insects and other invertebrates are abundant, including the world's largest centipede, The Amazonian giant centipede, and the Homerus swallowtail, the Western Hemisphere's largest butterfly.\n\nJamaican waters contain considerable resources of fresh-and saltwater fish. The chief varieties of saltwater fish are kingfish, jack, mackerel, whiting, bonito, and tuna. Fish that occasionally enter freshwater include snook, jewfish, grey and black snapper, and mullet. Fish that spend the majority of their lives in Jamaica's fresh waters include many species of live-bearers, killifish, freshwater gobies, the Mountain Mullet, and the American Eel. Tilapia have been introduce from Africa for aquaculture, and are very common.\n\nAmong the variety of terrestrial, aquatic and marine ecosystems are dry and wet limestone forests, rainforest, riparian woodland, wetlands, caves, rivers, seagrass beds and coral reefs. \n\nThe biodiversity is indicated by a number five (5) ranking amongst countries worldwide of the endemic plants and animals in Jamaica. \n\nThe authorities had recognized the tremendous significance and potential of this aspect of their heritage and designated some of the more 'fertile' areas 'protected'. Among the island's protected areas are the Cockpit Country, Hellshire Hills, and Litchfield forest reserves. In 1992, Jamaica's first marine park, covering nearly 6 square miles (about 15km²), was established in Montego Bay. \n\nThe following year Blue and John Crow Mountains National Park was created on roughly 300 square miles (780km²) of wilderness that supports thousands of tree and fern species and rare animals.\n\n===Climate=== \nThe climate in Jamaica is tropical, with hot and humid weather, although higher inland regions are more temperate. Some regions on the south coast are relatively dry rain-shadow areas. Jamaica lies in the hurricane belt of the Atlantic Ocean; as a result, the island sometimes experiences significant storm damage.\n\n==Regions==\n[[Image:Jamaica Regions map.png|thumb|upright=2.5|Map of Jamaica]] \n{{Regionlist\n\n| region1name=[[Cornwall County]]  \n| region1color=#71b37b\n| region1items=\n| region1description=The western region consisting of the parishes of Hanover, Saint Elizabeth, Saint James, Trelawny and Westmoreland.\n\n| region2name=[[Middlesex County (Jamaica)|Middlesex County]]\n| region2color=#CAA570\n| region2items= \n| region2description=The central region consisting of the parishes of Clarendon, Manchester, Saint Ann, Saint Catherine and Saint Mary.\n\n| region3name=[[Surrey County]]\n| region3color=#6FA4C7\n| region3items= \n| region3description=The eastern region consisting of the parishes of Kingston, Portland, Saint Andrew and Saint Thomas\n}}\n\n==Cities== \n*[[Kingston (Jamaica)|Kingston]]\n*[[Montego Bay]] \n*[[Negril]] \n*[[Ocho Rios]]\n*[[Port Antonio]]\n*[[Morant Bay]]\n*[[Black River]]\n*[[Falmouth (Jamaica)|Falmouth]]\n\n==Other destinations==\t \n* [[Black River]]\n* [[Blue Mountains (Jamaica)|Blue Mountains]]\n* [[Cave Valley]]\n* [[Nassau Valley (Jamaica)|Nassau Valley]]\n* [[Manchester (Jamaica)]]\n* [[Discovery Bay]]\n\n==Get in== \n\n===Visas===\n\n====Visa-free====\n\nCitizens of [[Anguilla]], [[Antigua and Barbuda]], [[Australia]], the [[Bahamas]], [[Bangladesh]], [[Barbados]], [[Belize]], [[Bermuda]], [[Botswana]], [[Brunei]], [[Canada]], [[Cyprus]], [[Dominica]], [[Fiji]], the [[Gambia]], [[Ghana]], [[Gibraltar]], [[Grenada]], [[Guyana]], [[India]], [[Kenya]], [[Kiribati]], [[Lesotho]], [[Malawi]], [[Malaysia]], the [[Maldives]], [[Malta]], [[Mauritius]], [[Mozambique]], [[Namibia]], [[Nauru]], [[New Zealand]], [[Papua New Guinea]], [[Saint Helena (island)|Saint Helena]], the [[Seychelles]], [[Sierra Leone]], [[Singapore]], the [[Solomon Islands]], [[South Africa]], [[Saint Kitts and Nevis]], [[Saint Lucia]], [[Saint Vincent and the Grenadines]], [[Samoa]], [[Swaziland]], [[Tanzania]], [[Tonga]], [[Trinidad and Tobago]], [[Turks and Caicos]], [[Tuvalu]], [[Uganda]], the [[United Kingdom]], the [[United States]], [[Vanuatu]] and [[Zambia]] may enter Jamaica visa-free for up to 6 months. United States citizens may enter Jamaica using a Passport Card in lieu of a passport if arriving by cruise ship.\n\nCitizens of [[Belgium]], [[Brazil]], [[Chile]], [[Denmark]], [[Finland]], [[Germany]], [[Iceland]], [[Ireland]], [[Israel]], [[Italy]], [[Liechtenstein]], [[Luxembourg]], [[Mexico]], the [[Netherlands]], [[Norway]], [[Russia]], [[San Marino]], [[South Korea]], [[Suriname]], [[Sweden]], [[Switzerland]] and [[Turkey]] may enter Jamaica visa-free for up to 90 days.\n\nCitizens of [[Argentina]], [[Austria]], [[Bolivia]], [[China]] (PRC), [[Colombia]], [[Costa Rica]], the [[Czech Republic]], [[Ecuador]], [[El Salvador]], [[Estonia]], [[France]], [[Greece]], [[Guatemala]], [[Hong Kong]], [[Hungary]], [[Japan]], [[Latvia]], [[Lithuania]], [[Monaco]], [[Panama]], [[Paraguay]], [[Peru]], [[Poland]], [[Portugal]], [[Slovakia]], [[Slovenia]], [[Spain]], [[Ukraine]], [[Uruguay]] and [[Venezuela]] may enter Jamaica visa-free for up to 30 days. Those from Estonia, Latvia, Lithuania and Slovenia will need to demonstrate that they are vaccinated against measles, polio and rubella in order to enjoy visa-free travel, otherwise they may obtain a visa on arrival.\n\n====Visa on arrival====\n\nCitizens of [[Albania]], [[Andorra]], [[Armenia]], [[Azerbaijan]], [[Belarus]], [[Bosnia and Herzegovina]], [[Bulgaria]], the [[Cayman Islands]], [[Croatia]], [[Estonia]], [[Georgia]], [[Kazakhstan]], [[Kosovo]], [[Kyrgyzstan]], [[Latvia]], [[Lithuania]], [[Macedonia]], [[Moldova]], [[Montenegro]], [[Romania]], [[Serbia]], [[Slovenia]], [[Tajikistan]], [[Turkmenistan]] and [[Uzbekistan]] may obtain a visa on arrival for US$100. In addition, visitors from [[Taiwan]] with an \"Affidavit of Identity\" can obtain a visa on arrival.\n\n====Visa waiver====\n\nCitizens of any country who hold a residence permit issued by Canada or a U.S. Green Card may enter Jamaica visa-free for up to 6 months.\n\nAdditionally, the following may enter Jamaica visa-free for up to 30 days:\n*Nationals of the [[Dominican Republic]] who hold a valid visa issued by Canada, the United Kingdom, the United States or a Schengen member-state.\n*Nationals of [[Belarus]], [[Kazakhstan]] and [[Moldova]], who hold a valid visa issued by Canada, the United Kingdom, the United States or a Schengen member-state, and can prove that they are immunised against measles, polio and rubella.\n*Nationals of [[Albania]], [[Bosnia and Herzegovina]], [[Macedonia]], [[Montenegro]] and [[Serbia]] who hold a valid visa issued by Canada, the United Kingdom or the United States, and can prove that they are immunised against measles, polio and rubella.\n*Nationals of [[Honduras]] who hold a valid visa for Canada or the United States.\n*Nationals of [[Bulgaria]] and [[Romania]] who hold a valid visa issued by Canada or the United States, and can prove that they are immunised against measles, polio and rubella.\n*Nationals of [[Croatia]] and [[Slovenia]] who hold a valid visa for the United States, and can prove that they are immunised against measles, polio and rubella.\n\n===By plane=== \n*'''Norman Manley International Airport''' ({{IATA|KIN}}) in [[Kingston (Jamaica)|Kingston]]. \n*'''Donald Sangster International Airport''' ({{IATA|MBJ}}) in [[Montego Bay]].\nBoth airports receive vast numbers of international flights daily. There are smaller airports in [[Negril]] and [[Ocho Rios]] as well as another smaller one in Kingston, which can be accessed by smaller, private aircraft.\n\n==Get around==\n\n===By train===\nJamaica has about 250 route miles of railways, of which 77 are currently active to handle privately operated bauxite (aluminum ore) trains. Passenger and public freight service ceased in 1992, but increasing road congestion and poor highway conditions have caused the government to re-examine the commercial feasibility of rail operations.\n\n*'''Clarendon Express'''. A Tourist Railroad in Clarendon, on Alcan Railroad tracks using Jamaica Railway Corp. Coaches, with American-built diesel-electric locomotives for motive power.\n\n===By car=== \nDriving in Jamaica is an adventure in and of itself. Jamaican roads are not renowned for their upkeep nor are their drivers for their caution. Roads in and around major cities and towns are generally congested and rural roads tend to be narrow and somewhat dangerous, especially in inclement weather. Alert and courteous driving is advised at all times. There are very few north-south routes as well, so travel from the north to the south can involve treks on mountain roads. These trips can induce nausea in the more weak of stomach, so it is advisable that if you suffer from motion sickness to bring Dramamine or similar medication. Jamaican drivers do not slow down because of these twists and turns, so beware.\n\nJamaica, as a former British colony, '''drives on the left'''. Make note of this when driving, especially when turning, crossing the street, and yielding right of way.\n\nThere are relatively few traffic lights outside of urban centres; they are generally found in major city centres, such as Montego Bay, Falmouth, Kingston, Mandeville, Spanish Town and Ocho Rios. For towns where traffic lights are not installed, roundabouts are used.\n\nAvis rents GPS units for USD12 per day with a USD200 deposit.\n\n===By boat===\nIt's not advised to travel by boat unless the service is operated by a hotel or tourism company. It's not a quick way to get around unless you want to tour the coastline. Many fishermen may offer this service to willing tourists but they may overcharge.\n\n===By bus===\nDon't be afraid to take Jamaican local buses&mdash;they're cheap and they'll save you the headache of negotiating with tourist taxis. Be prepared to offer a tip to the luggage handlers that load your luggage into the bus. The ride is very different from what you are probably used to. Many resorts offer excursions by bus. Check with the resort's office that is in charge of planning day trips for more information. Excursions by bus from Ocho Rios to Kingston and Blue mountain, can turn into a long bus ride without many stops. A visit to Kingston  might consist of a stop at a shopping centre for lunch, a visit to Bob Marley's home and a 2 minute stop in the Beverly Hills of Jamaica. The guided tour at the Blue Mountain coffee factory can be interesting and informative.\n\n===By taxi===\nLocal taxis (called \"route taxis\") are an interesting way to get around and far cheaper than tourist taxis.  For instance, it may cost JMD100 (about USD1) to travel 20 miles.  It will just look like a local's car, which is precisely what it is.  The licensed ones usually have the taxi signs spray painted on their front fenders, although there seems to be little enforcement of things like business licenses in Jamaica.  Seldom you will find one with a taxi sign on the top, because not many do this. The colour of the license plate will tell you. A red plate will tell you that it is for transportation, while a white plate will tell you it is a private vehicle. The yellow plate indicates a government vehicle (like a police car or ambulance) and the list continues.  Although the route taxis generally run from the center of one town to the centre of the next town, you can flag a taxi anywhere along the highway.  Walk or stand on the side of the road and wave at passing cars and you'll be surprised how quickly you get one.  \n\nRoute taxis are often packed with people, but they are friendly folk and glad to have you with them.  Route taxis are the primary mode of transportation for Jamaicans and serve the purpose that a bus system would in a large metropolitan city.  This is how people get to work, kids get to school, etc.\n\nRoute taxis generally run between specific places, but if you're in the central taxi hub for a town you'll be able to find taxis going in any of the directions you need to go.  Route taxis don't run very far, so if you need to get half way across the island you'll need to take it in stages.  If worst comes to worst, just keep repeating your final destination to all the people who ask where you're going and they'll put you in the right car and send you on your way. You may have to wait until the taxi has enough passengers to make the trip worthwhile for the driver, and many route taxis travel with far more people in them than a Westerner would ever guess was possible. If you have luggage with you, you may have to pay an extra fare for your luggage since you're taking up space that would otherwise be sold to another passenger.\n\nPricing can be a little foggy, but between two nearby towns (e.g. Montego Bay and Lucea) it shouldn't likely be more than JMD100-200. If you get \"cheated\" in a route taxi, it'll likely be for only tens of Jamaican dollars (like, the driver will just keep the coins he owes you). If you want to be a stickler, just pay close attention to what the locals pay. Really though, no sense in arguing over USD0.25. \n\nAct like a local. It's proper to give an appropriate greeting when entering a taxi (e.g. Good Morning) and to reply similarly when a greeting is given to you. Stop the taxi by saying \"One Stop, Driver!\"\n\n===By plane===\n*[http://www.jamaicaairshuttle.com/ Jamaica Air Shuttle] has several daily flights between Kingston Tinson Pen (closer to downtown than the main airport) and Montego Bay for around USD70. There are additional flights at weekends. \n\n*[http://www.airjamaica.com/ Air Jamaica] has a couple of daily flights between Montego Bay and Kingston for around USD75 each way. However, Air Jamaica was scheduled to be taken over by Caribbean Airlines in Apr 2010 and it was not clear whether these domestic flights would continue.\n\nIf money is no object, you can fly between the minor airports on the island on a small charter plane. There are a couple of companies that provide this service and you need to make an appointment at least a day in advance.  A flight across the entire island (from Negril to Port Antonio, for instance) runs about USD600.\n\n==Talk== \nJamaicans speak Patois (pronounced \"patwa\") natively. Its pronunciation and vocabulary are significantly different from modern English because it's based on a combination of languages such as English, Spanish and French . Despite not being official, some of the billboards and signs use phrases like \"''Everyting irie''\" to mean \"Everything is all right.\"\n\nAlthough '''all Jamaicans can speak English''', '''which is the official language''', they often have a very thick accent and foreigners may have trouble understanding them because of this. Some Jamaicans speak a little bit of other popular languages such as Spanish.\n\nYou will usually hear Jamaicans say \"Waah gwan?\", \"Waah appen?\", or \"what tah gwan\", the Creole variation of \"What's up?\" or \"What's going on?\" More formal greetings are usually \"Good morning\" or \"Good evening.\"\n\n==See==\nVisit Nine Mile where Bob Marley was born and now buried. The journey up into the mountains lets you experience the heart of the country. If you have a choice , hire a private driver or small van tour.  You will be able to stop and visit the small shops near the school as you enter the village.  People are friendly, and well spoken.  If you simply want to see Bob Marley's, take the nice Air-conditioned bus and be quickly whisked in-side the compound.  Just be sure to visit.\n\nSpend a day at Negril 7 mile beach and finish off at Rick's Cafe for a spectacular sunset and watch even more fantastic cliff diving.\n\n==Do==\nHiking, camping, fishing, golfing, snorkelling, horse back riding, backpacking, swimming, jet skiing, scuba diving, kite surfing, visiting the Giddy house, drinking and swimming with dolphins.\n\nDunn’s River Falls is a must see and do if visiting Jamaica. It is located in Ocho Rios. The 600 feet cascading falls are gorgeous. You can actually climb right up the falls. It’s an amazing experience! Give it a try if you're up for a breathtaking challenge. \n\nMystic Mountain has a bob-sledding ride combined with options for ziplining, a water slide and an aerial tram. The aerial tram is slower method to learn about the rainforest canopy.  \n\n\n*<do name=\"The Villagev Rose HALL\" alt=\"\" address=\"RHYNE PARK VILLAGE\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\"></do>\n===Marriage===\nOver the past several decades, with the rapid growth of the tourism industry, \"hotel marriages\" have become a significant contributor to the total number of marriages occurring in the island. Hotel marriages are any marriage occurring in the island, performed by a certified marriage officer of the island. \n\n''The following is what you need to know or provide for your marriage in Jamaica:''\n\n#Proof of citizenship - certified copy of Birth Certificate, which includes father’s name. \n#Parental consent (written) if under 18 years of age. \n#Proof of divorce (if applicable) - original Certificate of Divorce. \n#Certified copy of Death Certificate for widow or widower. \n#'''Québécois(e)''' need a notarized translated English copy of all documents and a photocopy of the original French documents.\n#'''Italian''' nationals celebrating their marriage in Jamaica must notify their embassy for legalization and translation.\n\n==Buy==\nThe currency of Jamaica is the''Jamaican dollar'' '''JMD''' (locally symbolised as $, J$, JA$). It comes in banknotes of JMD50, JMD100, JMD500, JMD1,000 and JMD5,000. Coins in circulation are JMD20, JMD10, and JMD5 (with smaller coins being almost worthless). As of April 2016, the exchange rate was hovering around JMD122 for USD1.\n\nThe US dollar is widely accepted in places most tourists visit. Indeed, all hotels, most restaurants, most shops, and almost all attractions in major cities will accept the US dollar. However, be aware that some places accept the dollar at a reduced rate (although it still may be a better rate than exchanging money beforehand). While it is possible for someone visiting only touristy places or for a few hours to not see the Jamaican currency at all, be advised that US dollars won't be accepted at a lot of \"local\" shops on the outskirts of cities and in rural areas.\n\nAlways stay up-to-date on the exchange rate and carry a calculator. Some places might try to make you pay ten times as much if you pay in US dollars. The cost of living in Jamaica is comparable to the United States.\n\nUS dollars, Canadian dollars, pounds sterling, and euros are easily converted to Jamaican dollars at forex cambios and commercial banks island wide. \n\nBuy products made on the island as they are cheap and you are supporting the local economy.\n\nPrices are usually higher in tourist areas like Negril and Ocho Rios.  Shops in \"tourist traps\" usually have higher prices than native ones, and you'll see the same items on offer in them.\n\n'''Credit cards''' such as VISA, MasterCard and to a lesser extent American Express and Discover are accepted in many business establishments, such as supermarkets, pharmacies and restaurants in Kingston, Montego Bay, Portmore, Ocho Rios and Negril and most other major towns. A curious exception is petrol stations which mostly require cash. There are a few petrol stations in uptown Kingston that will accept a credit card, but most will not\n\nCash advances from your MasterCard, VISA, Discover or American Express credit card will be quickly available at commercial banks, credit unions or building societies during normal banking hours. For cash advances on a non-Jamaican bank issued Mastercard or VISA cards or any American Express or Discover card, be prepared to show your foreign issued passport or overseas drivers license.\n\nA bit of advice if you are paying for \"fully inclusive\" when you arrive or any other big ticket item such as tours, when you are there, take travellers cheques in US dollars. There is something like an 8% additional charge on a Visa or MasterCard transaction. Hotels and resorts usually give the worst exchange rates.\n\n'''ATMs''' are called ABMs in Jamaica and are widely available in every parish and almost all ABMs in Jamaica are linked to at least one overseas network such as Cirrus or Plus and sometimes both. Indeed, the safest way for a visitor to transact business in Jamaica is to use an ABM to withdraw your daily cash requirement directly from your overseas account in local currency, as flashing foreign currency, foreign credit cards or large quantities of cash might draw unwanted attention, and will almost certainly be disadvantageous when bargaining for the best price.\n\nDon't be alarmed if you go to an ATM and you find an armed guard as he is there to protect you.\n\n==Eat==\n[[Image:2419251409 d5b275c85d o.jpg|thumb|upright=1.3|Jerk stands along Highway A1 in central Jamaica.]] \nJamaican food is a mixture of Caribbean dishes with local dishes. Although Jamaican food gets a reputation for being spicy, local trends lean towards more versatile food variety. Some of the Caribbean dishes that you'll see in other countries around the region are '''rice and peas''' (which is cooked with coconut milk) and patties (which are called empanadas in spanish speaking countries). The national dish is '''Ackee and saltfish''', and MUST be tried by anyone visiting the island. It is made with the local fruit called Ackee, which looks like scrambled eggs, but has a unique taste of its own and dried codfish mixed with onions and tomatoes. You probably won't get a chance to try this food anywhere else, and if you really want to say that you did something uniquely Jamaican, then this is your chance. Freshly picked and prepared ackee is 100 times better than tinned ackee, but must be harvested only when the ackee fruits have ripened and their pods opened naturally on the large evergreen tree on which they grow: unripe ackee contains a potent toxin (hypoglycin A) which causes vomiting and hypoglycaemia . Don't worry. locals are expert at preparing ackee and will know how to pick it safely. \n\nAnother local food is called '''bammy''', which was actually invented by the Arawak (Taino) Indians. It is a flat floury cassava pancake normally eaten during breakfast hours that kind of tastes like corn bread. There is also hard-dough bread (locally called hard dough bread), which comes in both sliced and un-sliced varieties. Try toasting it, for when it is toasted, it tastes better than most bread you'll ever eat. If you are looking for dishes with more meat in them, you can try the jerk flavoured foods. The most popular is '''jerk chicken''', although jerk pork and jerk conch are also common. The '''jerk seasoning''' is a spice that is spread on the meat on the grill like barbeque sauce. Keep in mind that most Jamaicans eat their food well done, so expect the food to be a bit drier than you are accustomed to. There are also '''curries''' such as curried chicken and curried goat which are very popular in Jamaica. The best curried goat is made with male goats and if you see a menu with curried fish, try it.\n\nYou may even want to pick up a piece of '''sugar cane''', slice off some pieces and suck on them.\n\nFruit and vegetables in Jamaica are plentiful, particularly between April and September, when most local fruits are in season. The many mango varieties are a 'must have' if you are visiting during the summer months. If you have not tasted the fruit ripened on the tree, then you are missing out. Fruit picked green and exported to other countries does not compare. Try drinking 'coconut water' straight out of the coconut. This is not the same as coconut milk. Coconut water is clear and refreshing, not to mention the fact that it has numerous health benefits. Pawpaws, star apples, guineps, pineapples, jackfruit, oranges, tangerines, ugli fruit, ortaniques are just some of the wonderful varieties of fruit available here. \n\nLocally grown fruits and vegetables are inexpensive. Visitors may well find that imported produce such as American apples, strawberries, plums etc. tend to be more expensive than in their home country.  Grapes in particular tend to be very expensive on the island.\n\nChinese food is available in many places from Chinese takeout stores and has a distinct Jamaican taste.\n\nIt is recommended to sample the local fruit and vegetables.  If unfamiliar with a particular fruit it can pay to ask a local about which parts can be eaten.  Local and imported fruits are available from road-side vendors. If the fruit is to be eaten immediately the vendors can generally wash the fruit for you on request.\n\nFinally, there is the category of '''\"ital\" food''', the domain of practising Rastafarians, who abide by strict dietary guidelines. This type of food is prepared without the use of meat, oil or salt, but can still be tasty due to the creative use of other spices. Ital food is not generally on the printed menus in the upscale tourist restaurants and can only be found by going to specialty restaurants. You may have to ask around to find an establishment that serves Ital food as it is not very common.\n\n==Drink==\nThere are many drinks in Jamaica. Standards such as Pepsi and Coca-Cola can be found, but if you want to drink local soda, you can try Bigga Cola, Champagne cola or grapefruit soda called \"Ting\" and also Ginger beer. Also, try any soda by Desnoes & Geddes, typically labelled as \"D&G.\"  \"Cola champagne\" and \"pineapple\" are popular flavors that you won't find anywhere else.  Since the turn of the century, the majority of soft drinks are bottled in plastic instead of glass. You can try the local lager called Red Stripe (which is exported to many countries in the west, so there is a good chance you have already tasted it) and Dragon Stout. Most beers can be found in Jamaican pubs and hotels. A local hard drink is Jamaican Rum, which is made from sugar cane. It normally tends to be overproof and drunk with cola or fruit juice. DRINK WITH CAUTION! It's not designed for someone who is drinking it for the first time. It is not unheard of to have 150 proof Jamaican Rum. Since Jamaica was colonized by Britain, the drinking laws are 18 and over, but they don't generally enforce it as strictly as it would be in the Western countries (minus the ones with no drinking laws, of course)!\nGuinness is popular and the export 7% has a kick.\n\n==Sleep==\nJamaica has a number of hotel options to choose from. The tourist towns of Ocho Rios, Montego Bay, and Negril have some of the finest resorts on the island.\n*<sleep name=\"Jamaica Ocean View Villa\" alt=\"\" address=\"Battle Site\" directions=\" just over an hour scenic drive from Montego Bay Airport\" phone=\"1 401 626 6942\" url=\"www.Jamaicaoceanviewvilla.com\" checkin=\"2pm\" checkout=\"11Am\" price=\"649\" lat=\"\" long=\"\">Jamaica luxury Villa at the edge of the Caribbean Sea in authentic Ocho Rios.\n\n5-bedrooms, 4.5 bathroom with expansive indoor and outdoor living areas just one block from the beach. A resort-style swimming pool glittering under the Jamaican sun, with poolside dining and more than enough lounge chairs for everyone. </sleep>\n\n*<sleep name=\"Mais Oui Tennis and Spa Villa\" alt=\"\" address=\"Discovery Bay\" directions=\"about 45 minutes leisurely drive from Montego Bay's Airport\" phone=\"1 914 709 0457\" url=\"www.MakeItJamaica.com\" checkin=\"3pm\" checkout=\"11am\" price=\nlat=\"\" long=\"\"> Family Fun! Child-friendly too. 8 bedroom, 7 bathroom ocean view villa in Discovery Bay, Jamaica ... Full staff, amenities galore including private pool, 2-minute stroll to beach ... all without the beachfront premium! </sleep>\n\n*<sleep name=\"Hyatt Ziva Rose Hall\" alt=\"\" address=\"Rose Hall Road, A1, Montego Bay, Jamaica\" directions=\"\" phone=\" 876-618-1234\" url=\"http://rosehall.ziva.hyatt.com/en/hotel/home.html\" lat=\"18.524478” long=\"-77.828913\"> The hotel is Located 15 minutes from Sangster’s International Airport and 5 minutes from three championship golf courses. It is an all-inclusive family resort offering the vacation experience from attentive beach butlers,Spa,24-hour room service and 7 Unique Restaurants </sleep>\n\n*<sleep name=\"Hyatt Zilara Rose Hall\" alt=\"\" address=\"Rose Hall Road, Montego Bay, Jamaica\" directions=\"\" phone=\"888 763 3901\" url=\"http://rosehall.zilara.hyatt.com/en/hotel/home.html\" lat=\"18.522940” long=\"-77.829948\"> This upscale, adults-only all-inclusive beachfront resort is a 12-minute walk from Half Moon Golf Course and 11 km from Sangster International Airport.  </sleep>\n\n==Learn==\n\n==Work ==\nUnemployment in Jamaica is at a high. The government does not invest in ventures to turn over capital but instead sells government paper to banks and overseas financial entities at very high interest rates. In an effort, as they say, to balance the budget a prominent member of the party described this as being the most massive transfer of resources from the poor to the rich that has ever occurred in this country since the abolishment of slavery. A whole lot of people who should be gainfully employed in the work force are not as a result of government policies. The garment industry, for example, has seen a sharp decline over the years due to soaring interest rates, so now banks make money, not by lending money to potential investors, but by buying government paper so the unemployment in the country is as a direct result of government policies.  Agriculture, manufacturing, and various other sectors are in a shambles causing many workers to find alternatives.\n\n==Stay safe== \nJamaica has the '''5th''' highest murder rate in the world. As in any other foreign country, should any emergency situation arise, especially at the domestic level, it is advised to immediately '''contact your government's embassy''' or consulate. Governments usually advise travellers staying in the country for an extended period of time to notify their embassy or consulate so they can be contacted in the case of emergency.\n\nIf you are approached by a Jamaican looking to sell you drugs or anything else that you are not interested in buying, the conversation will most likely go like this: \"Is this your first time on The Island?\" Respond: \"No, I've been here many times before\" (even if it is not true or as he will less likely  think you are gullible). Next, they will ask \"Where are you staying?\" Respond with a vague answer: for instance, if you are approached on Seven Mile Beach, respond by saying \"Down the street\". If asked \"Which resort?\", respond with another vague answer. They will see that you are not stupid nor ready to be taken advantage of. They will appear to be engaging in friendly conversation, but once you are marked a sucker (like \"It's my first time here\" \"I'm staying at Negril Gardens\"), you will be harassed. If you are further pushed to buy drugs or something else, calmly tell them: \"I've been to this Island many times before: please don't waste your time trying to sell me something. I'm not interested.\" They should leave you alone, they may even say \"Respect,\" and pound your fist.\n\nThe cultural and legal abhorrence against '''homosexuals''' (battymen) in Jamaica is far-reaching, and not only from a legal perspective, from which anal sex may be punished with up to 10 years. However, heterosexual anal sex is gaining in popularity, and while technically illegal, it has never been prosecuted by the state. It is advisable to avoid displaying affection to people of the same sex in public, especially between two men - Jamaica is a nation notorious for its persistent intolerance of homosexual behaviour, gay bashings are not uncommon (particularly in popular reggae and dancehall music in Jamaica) and victims would be met with indifference by the authorities. Simply put, Jamaica is not a suitable destination for [[LGBT tourism]].\n\n'''Marijuana''', (locally known as '''ganja''') - synonymous with Jamaica but illegal for many years - was decrimalized in February 2015. Having up to two ounces (around 56 grams) is punishable by a fixed penalty ticket of around $5 instead of an arrest and/or a criminal charge. Nevertheless, purchasing marijuana remains illegal at this time.\n\nIf in need of police, dial '''119''', just don't expect them to show up on the spot.\n\nAlso, it is best to avoid certain parts of the island at night. Drugs and alcohol are prevalent, and rural areas are especially dangerous. Armed men may pose a threat to women in some areas. Inner-city parts of the island such as Spanish Town and some districts in Kingston (eg Trench Town) should be avoided even during the day. However, those who are interested in visiting the Culture Yard in Trench Town should be safe if they go during daylight hours and with a hired local guide, which should not be terribly expensive. Be sure to ask for advice from locals before going, and avoid going there around elections, when violence flares up. Organised criminal groups, often referred to as ''Posses'', are prevalent in any Jamaican city. They are extremely politicised, but pose much less risk to tourists than the small, opportunistic petty crime groups active on the island.\n\nSeptember, October, and November have a lower number of tourists due to being hurricane season. As a result, the police are encouraged to take their vacation during this time. This reduction in the police force can cause areas like Montego Bay's hip strip to be less safe than they normally are.\n\n==Stay healthy== \n'''Medical facilities''' on the island are not always up to par with European or American health care standards. Falling ill can sometimes result in major medical fees. Therefore, it is advised to buy '''travel insurance''', as this will ensure peace of mind in emergency situations.\n\nThe '''tap water''' is generally good and safe to drink. All piped water in Jamaica is treated to international standards, and will be of the same quality you could expect to find in North America or Europe. Water service in rural areas can sometimes go out for several hours at a time. People in rural areas have their own water tanks, which catch water when it rains, so be ready to draw from a tank instead of turning a pipe. Water from these sources should be boiled before being consumed. Bottled water such as Wata (a local brand), Aquafina and Deer Park are widely available.\n\nBe cautious of the water quality at public swimming beaches, such as \"Walter Fletcher Beach\" in Montego Bay, which some locals call \"dump-up beach\", situated near the north gully.  Large amounts of solid and human waste flush down the gully during storm events.  The water flowing down Dunn's River Falls has also been said to contain high amounts of coliform bacteria, indicating fecal contamination.\n\nThe country's adult HIV/AIDS prevalence is nearly at '''1.6%'''. This is '''>2.5''' times higher than the USA and '''16''' times higher than the UK. The country has a relatively low infection rate compared to other developing nations.\n\nMalaria can be a risk, mostly near the Kingston area. The island had been malaria free for decades, until isolated incidents popped up in recent years. Jamaica has continued to remain malaria free.\n\nRumours have been heard of people suffering from symptoms similar to Dengue fever after visiting the cockpit country, but confirmed reports do not exist.\n\nSince December 2013, local transmission of chikungunya has been confirmed in the Caribbean, including Jamaica. There is no vaccine, so avoiding mosquito bites is the only way to prevent infection.\n\n==Respect== \nMany Jamaican people are very generous and warm. Returning this warmth and friendliness is a great way to show them you appreciate their country.\n\nChances are, you will be approached at one point or another during your travels in Jamaica for money.  Do not feel pressured into giving money.  A strong \"I'm alright\" and walking away is usually the best advice for instances such as this.  This also applies in the infamous '''straw markets'''.  Note that the European method of just walking away does not work well. You will generally need to engage with someone in order to get away from them.\n\nThat being said, if you befriend or encounter one of the many wonderful Jamaican people and you wish to give a friendly gift, that is perfectly acceptable and welcome. Just exercise common sense when it comes to money. \n\nCultural respect is far more important. You are guests on their island. Please know also that when speaking to the elderly you should say, \"Yes ma'am.\" or \"Yes, sir\". Good manners should be displayed at all times.  Respect the environment and the people. It is a simple rule of thumb that should always be applied when travelling abroad. Don't expect that everyone will respect you, however.\n\n==Contact==\n\n{{isPartOf|Caribbean}}\n{{Wikipedia|Jamaica}}\n{{Countryguide}} \n\n[[Category: Countries]]\n[[Category: Jamaica]]\n\n[[ca:Jamaica]]\n[[de:Jamaika]]\n[[eo:Jamajko]]\n[[es:Jamaica]]\n[[fi:Jamaika]]\n[[fr:Jamaïque]]\n[[hu:Jamaica]]\n[[it:Giamaica]]\n[[ja:ジャマイカ]]\n[[nl:Jamaica]]\n[[pl:Jamajka]]\n[[pt:Jamaica]]\n[[ru:Ямайка]]\n[[sv:Jamaica]]\n[[wts:Category:Jamaica]]\n\n[[WikiPedia:Jamaica]]\n[[Dmoz:Caribbean/Jamaica/]]\n[[World66:centralamericathecaribbean/thecaribbean/jamaica]]\n\n{{outline}}"
        }
    }
}