{
    "parse": {
        "title": "Kiribati",
        "pageid": 539,
        "wikitext": {
            "*": "{{pagebanner|Kiribati banner.jpg}}\n\n{{quickbar\n| image=Kiritimati AKK Lagoon Shore.jpg\n| caption=Kiritimati AKK Lagoon Shore, Kiritimati \n| location=Kiribati in its region.svg\n| flag=Flag of Kiribati.svg\n| capital=[[Tarawa]]\n| government=Republic\n| currency=Kiribati dollar (KBD); pegged at par with and circulating alongside the Australian dollar (AUD)\n| area=''total:'' 811 km<sup>2</sup>\n| population=105,432 (July 2006 est.)\n| language=I-Kiribati, English (official)\n| religion=Roman Catholic 52%, Protestant (Congregational) 40%, some Seventh-Day Adventist, Muslim, Baha'i, Latter-day Saints, and Church of God (1999)\n| electricity=\n| callingcode=+686\n| tld=.ki\n| timezone=UTC+12 to +14\n}}\n'''Kiribati''' [http://www.visit-kiribati.com] (pronounced Kiri-bass) is an island group in [[Micronesia]] straddling the equator and, until 1995, the International Date Line. Kiribati's 33 atolls, with a total area of only 811 km², are scattered over an area of 3.5 million km². Kiribati saw some of the worst fighting of the Pacific theatre during the Second World War, including the infamous Battle of Tarawa  in November 1943.\n\nKiribati is most emphatically '''not''' another [[Tahiti]], [[Hawaii]], etc. where you can go to relax and have nothing to worry about.  It has few visitors, and they have to be prepared to \"rough it.\" That said, there aren't many countries where the people are more friendly.  \n\nSouth Tarawa is one of the most densely populated, severely poverty-stricken places in the world.  Other islands have far fewer people, but getting to them can be difficult, and conditions are even more primitive. Most tourists, especially from the USA, go to [[Kiritimati]] (Christmas Island).  It received some attention on 1 January 2000 as the first location in the world to experience the new millennium.  Conditions there are somewhat better than in the rest of Kiribati.\n\n==Understand==\n\n===History===\nKiribati was inhabited for 2000 years prior to European contact. Under British colonial rule, it was known as the Gilbert Islands and was administered along with the neighboring group Ellice Islands (now the independent Polynesian nation of [[Tuvalu]]). Kiribati was granted self-rule by the UK in 1971 and complete independence in 1979. The US relinquished all claims to the sparsely inhabited Phoenix and Line Island groups in a 1979 treaty of friendship with Kiribati.\n\nThe name \"Kiribati\" is pronounced \"Kiri-bass\", and is derived from the Gilbertese pronunciation of the English word \"Gilberts\" (i.e. the Gilbert Islands). Gilbertese is the national language and belongs the Micronesian language family.\n\nThe Phoenix and Line Islands were generally held to be on the east side of the International Date Line and are in different time zones from the Gilbert Islands group, but on 1 January 1995, Kiribati proclaimed that all of its territory was on the same calendar day (skipping 31 December 1994 in those island groups), effectively extending the Date Line further eastward to accommodate this.  This makes the Line Islands the farthest \"ahead\" of any territory on the planet. \n\nIn 1995 Kiribati suspended diplomatic relations with [[France]] to protest the latter's decision to resume nuclear testing on [[Muraroa Atoll]]. In 1999 the government claimed that two atolls had been lost due to sea level rise and subsequently, in 2002, joined with [[Tuvalu]] and the [[Maldives]] to take legal action against the US for refusing to sign the Kyoto Protocol.\n\nThe presence of gun emplacements and ship wrecks from WWII battles on South Tarawa makes '''shipwreck diving''' a common tourist activity.\n\n===Climate===\nWhoever coined the phrase, \"It's not the heat, it's the humidity\" may have had Kiribati in mind.  Actually, the average high temperatures are quite reasonable compared to other well-known places in the tropics (such as [[Bangkok]], [[Singapore]], [[Manila]], etc.). But the humidity more than makes up for this, making it feel very sauna-like.  The wet season varies, but is usually December to March, give or take a month. Severe drought also occurs at times.\n\n==Regions==\nExcept for [[Banaba]] (Ocean Island - ''6 km², pop.~300''), all the main islands are in one of three groups: the Gilbert Islands, the Line Islands, and the Phoenix Islands.\n\n{{regionlist\n| regionmap=Kiribati regions map.png\n| regionmaptext=\n| regionmapsize=450px\n\n| region1name=[[Gilbert Islands]]  \n| region1color=#93d1a0\n| region1items=\n| region1description=The western island chain is home to the vast majority of Kiribati's population, including the capital [[Tarawa]].\n\n| region2name=[[Line Islands (Kiribati)|Line Islands]]\n| region2color=#7ebcc2\n| region2items=\n| region2description=The farthest flung islands, with populations on the three northern islands of Kirimati (Christmas Island), Tabuaeran, and Teraina.\n\n| region3name=[[Phoenix Islands]] \n| region3color=#ceb1b3\n| region3items=\n| region3description=Almost completely uninhabited, with the exception of a few families on Kanton.\n}}\n\n==Get in==\n\n===Visa requirements===\n\nNationals of all [[European Union]] member states - except Ireland and the United Kingdom - may enter Kiribati visa-free for 90 days within a 180-day period.\n\nNationals of [[Antigua and Barbuda]], [[Australia]], the [[Bahamas]], [[Barbados]], [[Belize]], [[Canada]], [[Fiji]], [[Grenada]], [[Hong Kong]], [[Ireland]], [[Jamaica]], [[Japan]], [[Kenya]], [[Lesotho]], [[Macao]], [[Malawi]], [[Malaysia]], [[Marshall Islands]], [[Mauritius]], [[Federated States of Micronesia|Micronesia]], [[Nauru]], [[New Zealand]], [[Palau]], [[Saint Kitts and Nevis]], [[St. Lucia]], [[Saint Vincent and the Grenadines]], [[Samoa]], [[Seychelles]], [[Sierra Leone]], [[Singapore]], [[Solomon Islands]], [[South Korea]], [[Switzerland]], [[Taiwan]], [[Tonga]], [[Trinidad and Tobago]], [[Tunisia]], [[Tuvalu]], [[United Kingdom]] (including British National (Overseas) passports and nationals of [[Bermuda]], [[Cayman Islands]], [[Montserrat]] and [[Turks and Caicos Islands]] who hold BOT passports), [[United States of America]], [[Vanuatu]], [[Zambia]] and [[Zimbabwe]] may enter Kiribati visa-free for up to 30 days. An extension of the foreign national's stay is possible. However, the time spent in Kiribati without a visa by a citizen of one of these countries must not exceed 4 months in any calendar year.\n\nThere are honorary consulates in [[Rose Bay]] (near [[Sydney]]), NSW, Australia; [[Honolulu]], Hawaii; [[Suva]], Fiji; [[Hamburg]], Germany; [[Tokyo]], Japan; [[Seoul]], Korea; [[Auckland]], New Zealand; and [[London]], United Kingdom.  Also, visas may be obtained by writing the Principal Immigration Officer, Ministry of Foreign Affairs, P.O. Box 68, Bairiki, Tarawa, KIRIBATI (Central Pacific). Caution: Do not apply directly to Tarawa within a couple months or so of your departure date, or when you need your passport elsewhere. Usually, it's best to inquire at the nearest consulate abroad. There's no requirement that you be a resident of the same country that the consulate is located in.\n\nIf you require a visa to enter Kiribati, you might be able to apply for one at a British embassy, high commission or consulate in the country where you legally reside if there is no Kiribati diplomatic post. For example, the British embassies/consulates in Alexandria[http://www.ukba.homeoffice.gov.uk/countries/egypt/commonwealth-bots/?langname=UK%20English], Amman[http://www.ukba.homeoffice.gov.uk/countries/jordan/commonwealth-bots/?langname=null], Ashgabat[http://www.ukba.homeoffice.gov.uk/countries/turkmenistan/bot/?langname=UK%20English], Belgrade[http://www.ukba.homeoffice.gov.uk/countries/serbia/commonwealth-bots/?langname=null], Budapest[http://www.ukba.homeoffice.gov.uk/countries/hungary/commonwealth-bots/?langname=null], Cairo[http://www.ukba.homeoffice.gov.uk/countries/egypt/commonwealth-bots/?langname=UK%20English], Dublin[http://www.ukba.homeoffice.gov.uk/countries/ireland/commonwealth-bots/?langname=UK%20English],  Jakarta[http://www.ukba.homeoffice.gov.uk/countries/indonesia/commonwealth-bots/?langname=null], Moscow[http://www.ukba.homeoffice.gov.uk/countries/russian-federation/commonwealth-bots/?langname=UK%20English], Paris[http://www.ukba.homeoffice.gov.uk/countries/france/commonwealth-bots/?langname=UK%20English], Pristina[http://www.ukba.homeoffice.gov.uk/countries/kosovo/commonwealth-bots/?langname=null], Rome[http://www.ukba.homeoffice.gov.uk/countries/italy/commonwealth-bots/?langname=null] and Sofia[http://www.ukba.homeoffice.gov.uk/countries/bulgaria/commonwealth-bots/?langname=null] accept Kiribati visa applications (this list is '''not''' exhaustive). British diplomatic posts charge £50 to process a Kiribati visa application and an extra £70 if the Kiribati authorities require the visa application to be referred to them. The Kiribati authorities can also decide to charge an additional fee if they correspond with you directly.\n\n===By plane===\nIf the tickets are too expensive, get to Fiji anyway you can and go from there. On the other hand, if you've got thousands to spend and extra time, see how a [[Round the world flights|Round the world fare]] on [[Oneworld]] or [[Star Alliance]] compares with the fare to Tarawa, and include this on your itinerary. \n\n'''Solomon Airlines''' has a service which flies from Brisbane to Tarawa, this is currently the cheapest way to get to Tarawa, at roughly half the cost of the flight from Fiji.  This should put some pressure on the other airlines to reduce the air fares.  This service is a joint venture with the Air Kiribati.\n\n'''Fiji Airways''' [http://www.fijiairways.com] has two weekly non-stop flights (3 hrs) from [[Nadi]], [[Fiji]] with connections from [[Australia]], [[New Zealand]], [[Japan]], [[Canada]], and the [[United States]] including [[Honolulu]] (with codeshares on American Airlines, and possibly other ONEWORLD members).  If using another airline to get to Fiji, be certain it lands in [[Nadi]] and not [[Suva]] (unless you're staying a while and can get to other side of the island).  \n \n'''Air Marshall Islands''' does scheduled flights every 2 weeks Majuro to Tarawa CW117 returning the same day. \n\nCurrent price is US$330 if ticket bought in Marshall Islands.\nThey cannot issue a one way ticket unless you can provide proof of an onward ticket or Kiribati/RMI residence/work permit.\n\nAir Marshall Islands email amisales@ntamar.net Phone number is +692 625-3733, calling is suggested as emails often go unanswered.\n\n==Get around==\n'''Domestic Flights and Airlines in Kiribati'''\nAir Kiribati has two turboprop aircraft for inter-island travel. Flights travel to all Outer Islands in the Gilbert group regularly. \n\nA new domestic carrier has also been set up recently Coral Sun Airways. Coral Sun offers a scheduling alternative to Air Kiribati and can also be chartered for private use. \n\nReliability of internal flights in Kiribati is improving all the time and fares are relatively cheap. It is important to reconfirm your return flight on arrival at your destination. Each airline has different booking and confirmation conditions, you need to ensure you are familiar with these to ensure a hassle free trip.\n\n==Talk==\nThe official languages of Kiribati are English and Gilbertese - also known as Kiribati. While English is used heavily in South Tarawa, the further away from the capital the more you will just hear Kiribati being spoken. Most people on Kiritimati Island speak some English.\n\nYou can typically survive with just English, but a lot of people can be shy when speaking.  And there are often a lot of head nods, which is often mistaken for understanding.\n\n==See==\n[[File:South Tarawa from the air.jpg|thumb|South Tarawa from the air]]\n[[File:Rotjan - Enderbury Day 1 - 2nd half (62).JPG|thumb|Coral reefs near Enderbury Island, Phoenix Islands Protected Area ]]\n\nKiribati has some beautiful '''beach scenery''', is a great place for boating or yachting and many of the atolls are lovely to explore on bike or foot. The lagoons are stunning to look at and the white sandy beaches and waving palm trees are a typical holiday brochure sight. Especially on the outer islands you'll find '''traditional culture''' is still very much alive. The Kiribati people are generally friendly and welcoming to visitors, and will include you in their celebrations if you happen to be around. \n\nThe islands of Kiribati saw some of the bloodiest fighting of World War II and remnants of that war are still all around. [[Tarawa]] (and [[Betio]] in particular), [[Butaritari]], [[Abemama]] and [[Banaba]] island are home to the most prominent World War II sights, including coastal defense guns, bunkers and pillboxes. Tanks, ship wrecks, amtracs and plane wrecks are still visible at the coasts of Tarawa and Butaritari, especially during low tide. If you want the full story behind the remains, take a guided tour.\n\nFor anyone with an interest in sea life, the tranquil '''[[Phoenix Island Marine Protected Area]]''' (the world’s largest marine protected area) is a treasure waiting to be discovered. It boasts some gorgeous landscapes combining sandy beaches with coral islands and incredibly blue lagoons. The islands are a bird watcher's paradise and its under water coral life is practically unspoiled. However, limiting visitor numbers is an explicit goal of the authorities. Gaining access to the islands isn't easy and although there are rumors of plans to open the region a bit more for tourist purposes, you probably won't be able to dive there yet.\n\n==Do==\n*<do name=\"Outer Island Trip\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">[[Kiribati Outer Island]] trips allow you to see a bit more of the unspoiled Kiribati way of life, in a more subsistence and clean environment.  Most islands have council accommodation, but there are also other options.  \n\nDepending on scheduled flights or boats, you can do weekend trips.  Flying (Air Kiribati) is typically the only way to get to most islands, otherwise you would be spending 24h on a boat.</do>\n\n* '''Snorkeling'''\n* '''Diving'''\n* '''Surfing'''\n\n==Buy==\n\nThe official currency of Kiribati is the '''Kiribati dollar ($)'''. The currency is pegged 1:1 with the '''Australian dollar ($)''', and as such, both currencies are universally accepted across Kiribati.\n\n'''South Tarawa'''\n\nThere are a wide number of local handicrafts available. These are generally made by the women groups from around the Gilbert group. Of special note are the colorful tops worn by the local ladies called Tibuta. The Catholic Women's Association runs weekly classes in weaving and the making of these tops.\n\nATM's are located in Betio, Bairiki and Bikenebeu. There is also one located at the hospital. There is also a foreign exchange office at the Airport. The Australian bank ANZ operates in Kiribati.\n\nMost shops will only accept cash, as credit cards are rarely used--except for the two hotels. \n\n'''Outer Gilbert Islands''' \nCash only is used on the Outer Islands and banking services are not available.     \n\n'''Kiritimati Island''' \nAn ATM and bank are both available on Kiritimati Island. The branch is located in London.\n\nMost shops and stores will only accept cash. Credit cards are not widely used.\n\n==Eat==\nThe variety of food on Kiribati is limited.  If a shipment of imported food has just come in, buy it now, as it won't last long! The variety and amount is increasing and improving all the time as is the number of supply boats that arrive. \n\nWhile Western style products will always be slightly limited you will find that the basics are generally available, a lack of fruit and vegetables really being the major concern.   \n\nThe staple diet of the I-Kiribati is fish and rice and this is reflected in many of the eating outlets on Tarawa. It is always worthwhile trying the local sashimi which is straight from the ocean to your plate.\n\nWestern style meals are best found at the two hotels, Mary's and the Otintaai. \n\nThere is also a variety of Chinese restaurants.\n\n==Drink==\nThe local drink is toddy made from the sap of a coconut tree. This sweet toddy can then be fermented for a couple of days into the alcoholic sour toddy that is favored by locals.  The original sweet toddy can also be cooked into a syrup called Kamaimai. The Kamaimai can then be drizzled on sweet buns or ice cream. \n\nKava is also easily found throughout Kiribati with a large number of Kava bars appearing throughout Tarawa. \n\nThe two main bars in Tarawa are Captains Bar in Betio and the Lagoon Club in Ambo. Friday nights at the Otintaai is dance night. Supply of wine and spirits is limited, however there is a good supply of beer which is always cold. \n\nThere is a single night club in Tarawa called the Midtown which is open till late. \n\nAlcohol is not sold on a number of Outer Island in the Gilbert group.\n\n==Sleep==\nThe range of accommodation in Kiribati varies depending on which part of the country you are in.  \n\n'''South Tarawa'''\nThe two main hotels are Mary's Motel and the government owned Otintaai Hotel. Both offer motel style accommodation each with a restaurant and air-conditioning. They are located at different ends of South Tarawa and the decision on where to stay is usually made based on your activities while you are in South Tarawa. \n\nThere are also a variety of other smaller properties scattered throughout South Tarawa. A full listing including a map showing locations can be found on the Kiribati National Tourism Offices web site [http://www.kiribatitourism.gov.ki.]\n\nThese hotels can get very busy throughout the year so it is advisable to book ahead. \n\n'''North Tarawa''' \nA visit to North Tarawa is the easiest and most convenient way to experience village life in Kiribati. North Tarawa offers a number of guesthouses and traditional style accommodation. \n\nTabon te Keekee is the closest option, offering traditional Kiribati accommodation in an I-Kiribati family environment.  Located at Abatao it is only 10-15 minutes north of the airport. \n\nBiketawa Islet, run by the Otintaai Hotel, offers traditional kia kia accommodation. Run in a similar fashion to a retreat meals and sleeping equipment can be arranged, along with boat transfers.\n\nA council guesthouse is located at Abaokoro. \n\n'''Gilbert Island Group and Council Guesthouses'''  \nThe Outer Islands are the essence of Kiribati and not enough people make the time and effort to visit these remote islands.  Each has a distinctive culture and story to tell of its history.\n \nEach of the outer islands of the Gilbert Group have, at the least, a council guesthouse. Standards vary across the group however they are usual a mix of the local style houses known as Kia Kia’s and a open style guest rooms. Each guesthouse usually has a communal living area where meals are served and the cost is approximately $30 per night including 3 meals a day.\n\nThe facilities available vary from island to island, however they are located in isolated communities and expectations should be altered accordingly. Electricity will usually be supplied in the evening and throughout the night.  Food will mainly be based on the local fare and it is recommended that you take anything additional you may need. It is also recommended that fresh drinking water is taken.\nMost guesthouses are perfectly located on the beach or causeway and a lovely spot to stay easy for swimming and exploring.   \n\nThese guesthouses are run by the Island Councils and it is one of the very few ways the council earn revenue.   Each council will normally have a truck and driver that you will be able to hire to help you discover the island. Alternatively many of the locals will be keen to hire out the motorcycles and scooters to you. \n\nFor more information on the Outer Islands – get a copy of the fact sheets from [http://www.kiribatitourism.gov.ki] \n\n'''Kiritimati Island''' \nThis world renowned bone fishing destination has a variety of fishing lodges, guesthouses, and motels to choose from. Accommodation is usually booked in 7 night packages and each lodge will have the services of a fishing guide to assist you in your expeditions. For a full list of accommodation options visit http://www.kiribatitourism.gov.ki\n\nThe lodges are geared around fishermen and schedule meals and activities around your fishing day. \nMeals are usually included in the price. \n\nFor a full list of accommodation options visit [http://www.kiribatitourism.gov.ki.]\n\n==Learn==\nSchool in Kiribati is required from ages 6 to 14.\n\n==Work==\nWith very high unemployment, it is unlikely that foreigners will be allowed any work unless they have needed skills not otherwise available.  Aid agencies are active in Kiribati and undertake a range of volunteer and contracting programs.\n\n==Stay safe==\nKiribati is generally a safe place to travel. However, it may be risky to be outside after dark in Beito or along the beach in South Tarawa, especially for single females.  However, virtually all problems are caused by drunk males, not career criminals.\n\nNormal common sense applies when moving around.\n\nSome care should be taken on the roads as the traffic can include pigs, children, dogs and buses all fighting for road space.\n\n==Stay healthy==\nDon't drink the water without boiling or filtering. Chemical treatment is not recommended as it may not prevent giardiasis .  The lagoon (especially around Beito) is heavily contaminated, and may make the entire island segment smell bad at times. Always ask first before going out in the water at each location on South Tarawa, no matter how inviting it looks. This is a good idea on other islands too.  Get a hepatitis A shot, and be up-to-date on all your other vaccinations, preferably several weeks beforehand.  Mosquitoes can be very bad at times, so use repellent.  Be sure to bring your own insect repellent and sunscreen, as these are ''not'' available locally.  Don't expect any needed medications to be available either. (Some are, but you never know what is or when.)  \n\nThere's no [[malaria]], but [[dengue fever]] outbreaks (mosquito transmitted) do sometimes occur.  The fish caught locally may give you food poisoning (ciguatera ), so be extra careful.  Ciguatera is '''not''' preventable by cooking or freezing the fish.  Promptly treat even the smallest cut, sore, or insect bite, as these can become infected very easily.\n\n[[Travel insurance|Medical evacuation insurance]] is ''highly'' recommended for Kiribati.  Many outer islands have no airstrip, making any sort of evacuation long and difficult.\n\n==Respect==\nThe 'katei' or traditional way of life involves a strong sense of personal pride, respect one to another and a consistently open welcome to 'irua' or 'bwaroko' meaning foreigners.  This behaviour is commonly experienced by foreigners who are called into the homes and meeting places of the locals.\nUncommon to western society, the I-Kiribati people have a great respect towards their elderly citizens and religious leaders regardless of their denomination (almost all are of Christian background).  It is common to observe intoxicated people returning home to approach missionaries and apologize for being drunk.\nMany individual communities have laws specific to their village as decided by the elders of that village.  Respect for these laws are strongly maintained to keep order and harmony in the communities.  On several northern Gilbert Islands, including Marakei and Abaiang, users of the main road are expected to dismount from their push bikes or motorcycles as they pass a Mwaniebwa (large meeting house) that has a bootaki (meeting) in session.  As these meeting houses are typically built as a steep but low hanging A-frame roof without walls, it is clear and obvious from the outside to see if a meeting is being held.\n\n==Contact==\nContact the '''Kiribati National Tourism Office''' in the following ways:-\n\nWebsite: www.kiribatitourism.gov.ki\nE-Mail: info@kiribatitourism.gov.ki\n\nPhone: (+686) 25573 and ask for the Tourism Office. (Please note that English is not the first language for most of the staff in the office).\n\n==Go out==\n\n\n[[de:Kiribati]]\n[[eo:Kiribato]]\n[[es:Kiribati]]\n[[fi:Kiribati]]\n[[fr:Kiribati]]\n[[hu:Kiribati]]\n[[it:Kiribati]]\n[[ja:キリバス]]\n[[nl:Kiribati]]\n[[pt:Kiribati]]\n[[ru:Кирибати]]\n[[sv:Kiribati]]\n[[wts:Category:Kiribati]]\n\n[[WikiPedia:Kiribati]]\n[[Dmoz:Oceania/Kiribati/]]\n[[World66:australiaandpacific/kiribati]]\n\n{{IsPartOf|Micronesia}}\n{{outline}}\n{{Countryguide}}"
        }
    }
}