{
    "parse": {
        "title": "Lebanon",
        "pageid": 556,
        "wikitext": {
            "*": "{{pagebanner|Lebanon banner.jpg}}{{quickbar\n| image=BaalbekTempleJupiter1.jpg\n| location=Lebanon in its region.svg\n| caption=Temple of Jupiter, Baalbek\n| flag=Flag of Lebanon.svg\n| capital=[[Beirut]]\n| government=Parliamentary republic with a power-sharing mechanism based on religious communities\n| currency=Lebanese pound (LBP) (Also called Lira - lērä - [LL])<br>(''US dollars widely accepted'')\n| area=''total:'' 10,452km²<br />''water:'' 170km²<br />''land:'' 10,230km²\n| population=4,424,050 (2006 est.)\n| language=[[Arabic phrasebook|Arabic]] (official), [[French phrasebook|French]], English, Armenian\n| Religion= Christian 41% (Maronite Catholic, Greek Orthodox, Melkite Catholic, Armenian Orthodox, Syrian Catholic, Armenian Catholic, Syrian Orthodox, Roman Catholic, Chaldean, Assyrian, Copt, Protestant), Muslim 57.7 % (Shia, Sunni, Druze, Isma'ilite, Alawite or Nusayri), other 1.3%\n17 religious sects recognized ([https://www.cia.gov/library/publications/the-world-factbook/geos/le.html]\n| electricity=110-220V/50Hz (European and UK plugs)\n| callingcode=961\n| tld=.lb\n| timezone=UTC +3\n}}\n{{otheruses}}\n\n\nThe Republic of [http://www.lebanon-tourism.gov.lb '''Lebanon'''] ([[Arabic phrasebook|Arabic]]: '''لبنان''') is a small country (10,452km² in area) with 3.7 million inhabitants) within the [[Middle East]] region with its capital being [[Beirut]]. It has a long coastline on the eastern shore of the Mediterranean Sea and shares a long land border with its much larger neighbour [[Syria]] to the north and the east, a much shorter (and currently \"hot\") border with [[Israel]] to the south.\n\n==Understand==\n\n===History===\nLebanon is a country with a long and rich history. Phoenician, Egyptian, Greek, Persian, Roman, Arab, Crusader, and Ottoman ruins are scattered about the country and the most important of them are easily accessible. Byblos, Beirut, Tyre and Sidon are among the oldest continuously populated cities in the world. There are Roman baths in Beirut, as well as the Cardio Maximus - to name a few. Byblos is also rich in Crusader ruins and for a small fee you can view them (they are located near the bazaar). There are a lot of ancient mosques, synagogues, and churches in Lebanon. Also be sure to visit the Place des Martyrs (Martyrs' Square) in Beirut, a statue erected in memory of the Lebanese nationalists who were hanged by the Ottomans for revolting during the first World War.\n\n===People===\nThe people of Lebanon comprise a wide variety of ethnic groups and religions, with the majority split between Christians (Maronite, Greek Orthodox, Greek-Catholic Melkites, Armenians, Protestant etc), Muslims (Shi'a, Sunni, Alawites) and Druzes. The most recent demographics study, conducted by Statistics Lebanon indicate that Muslims make up 54% of Lebanese population, 40.5% are Christians, and approximately 5.5% are Druze. Other groups include a large number of Syrian refugees (between 1,200,000 and 1,600,000 as of spring 2015) and Palestinian refugees in the country (over 250,000). \n\nPeople are very easy-going and welcoming. Asking someone on the street for directions is easy, since most of them will do their best to help you. Political and religious questions may be sensitive topics of discussion.\n\nLebanon is populated by very open and educated people, especially in places like Beirut, Mount Lebanon and some of the larger cities. Attitudes and behaviors tend to be more conservative in the Bekaa Valley and rural north and south.\n\nLebanon and Beirut were once called the Switzerland and Paris of the Middle East. The recent wars have diminished this status, but the Lebanese have learned to adapt. Their pursuit of happiness and fun overshadows their financial capabilities and political problems.\n\n===Climate===\nLebanon has a temperate Mediterranean climate, with hot, dry summers and cold, wet winters. It is generally considered very rainy and mild in comparison to its more arid neighbors.\n\nSummer is usually the most popular time for people to visit, as there is virtually no rain between June and August, and the temperatures range between about 20-30°C (68-86°F). However, there can be occasional heat waves with the temperature rising above 30°C, and generally, it can be very humid along the coast line during the summer months. It is much drier and much cooler in the mountains, and many Lebanese tend to visit and vacation in the mountains during the summer if they wish to escape the heat and humidity of the coastline.\n\nAutumn and spring (18-24°C) are also good times to visit, with a bit more rain, but without the tourist crowds attracted in summer, and also with considerably less humidity and cooler temperatures.\n\nSnow falls for a large part of winter in the mountain regions that form a large portion of the country, and there are numerous ski resorts. However, the coast is still relatively mild, with maximums rarely falling below 13°C (55°F), although it can fall much lower than that and has on many occasions. Temperatures lower than 8°C or higher than 18°C are rare in the coast during winter. Summers rarely exceed 32°C. Temperatures are a lot cooler in the more mountainous areas.\n\nThe average annual temperature for the entire country is 16°C, dropping to -7°C in February, the coldest month, and rising to 28°C in August, the warmest month.\n\n===Time zone===\nLebanon is 2 hours ahead of Greenwich Mean Time (GMT), and observes daylight savings from end-March to end-October.\n\n===Holidays===\nLebanon has a number of both Christian and Islamic holidays. Holidays that are observed by the Lebanese Government are indicated in '''bold''':\n*'''New Year's Day''' (January 1)\n*'''Epifany & Armenian Christmas''' (January 6)- Christian religious observances.\n*St. Valentine's Day (February 14)\n*'''St. Maroun's Day''' (February 9)- Christian religious observances.\n*'''Prophet's Day''' (March 9)- Islamic religious observances\n*'''Annunciation'''- Christian religious observances.\n*'''Good Friday'''- Christian religious observances.\n*'''Easter''' (A Sunday in March or April)- Christian religious observances.\n*'''Labor Day''' (May 1)- most businesses and schools closed.\n*Liberation of the South (May 25)\n*St. Elias's Day (July 20)- A lot of fireworks and festivals.\n*National Army Day (August 1)\n*'''Assumption Day (August 15)\n*'''Ramadan''' (variable)-Islamic religious observances\n*'''Eid el Fiitr''' (variable)-Islamic religious observances\n*All Saints day (November 1)- Christian religious observances.\n*'''Ashouraa'''- Islamic religious observances\n*'''Independence Day''' (November 22)- All businesses and schools closed.\n*Eid il-Burbara or Saint Barbara's Day (December 4)- Christian religious observances.\n*'''Christmas''' (December 25)- Most businesses and restaurants closed the evening before and all day; family gathering, exchanging gifts, Christian religious observances.\n*'''New Year's Eve''' (December 31)\n\nAll in all, Beirut, Lebanon's capital city, is a vibrant metropolis with enough diversions that any city lover would look for, ranking it among the Middle East's top tourist destinations. Being perched on the shore of the Mediterranean Sea, Beirut has a climate that is perfect for year round visits, as it experiences all 4 seasons.\n\nBeirut has something to offer most tastes, from roadside ''à la Parisienne'' coffee shops to rooftop open air cafes, as well as a variety of shopping venues.\n\n==Regions==\nLebanon can be divided into five regions:\n\n{{Regionlist|\n\nregionmap=Lebanon_region_map.png |\nregionmaptext=Regions of Lebanon |\nregionmapsize=300px |\n\nregion1name=[[Beirut]] |\nregion1color=#D5DC76|\nregion1items= |\nregion1description= |\n\nregion2name=[[Bekaa]] |\nregion2color=#74A2C0 |\nregion2items= |\nregion2description= |\n\nregion3name=[[Mount Lebanon]] |\nregion3color=#71B37B |\nregion3items= |\nregion3description= |\n\nregion4name=[[North Lebanon]] |\nregion4color=#D09440|\nregion4items= |\nregion4description= |\n\nregion5name=[[South Lebanon]] |\nregion5color=#CE888E |\nregion5items= |\nregion5description= |\n}}\n\n==Cities==\nMany cities in Lebanon have Westernised names which are significantly different from their Arabic names; the Roman versions of the Arabic names are given in parentheses below.\n\n* [[Beirut]] - the capital and largest city , Claim as oldest continuously inhabited city in the world\n* [[Baalbek]] - a Phoenician and Roman archaeological site, including the biggest temple all over the Roman Empire\n* [[Byblos]] (Jbeil) - another city with plenty of remains, castles and museums , another city that Claim as oldest continuously inhabited city in the world\n* [[Jounieh]] - known for its seaside resorts and nightclubs\n* [[Sidon]] (Saida) - plenty of medieval remains\n* [[Tripoli_(Lebanon)|Tripoli]] (Trablus) - still unspoilt by mass-tourism\n* [[Tyre]] (Sour) - has a number of ancient sites, including its Roman Hippodrome which is a [[UNESCO World Heritage Site]]\n* [[Zahle]] - capital of Bekaa Valley\n\n==Other destinations==\n* [[Bcharre]] - Surrounded by mountains, it's a gateway to the Cedars of God forest and Cedars ski slopes.\n* [[Jeita]] - Known for its grotto, and Nahr-el-Kalb, a discreet historical site in a walkable distance.\n* [[Qadisha Valley]] or Qannoubine Valley - You can visit the home of the (now deceased) Lebanese poet Khalil Gibran.\n* [[Beiteddine]] - Famous for its palace.\n* [[Deir el Qamar]] - Traditional village in Chouf district.\n* [[Brummana]] - A traditional town often considered a summer resort with pleasant weather, spectacular views of Beirut and a good nightlife.\n* [[Chouf Cedar Reserve]] - Famous for its cedar forests, its wildlife and its views.\n\n==Get in==\n\n===Visas===\n{{VisaRestriction|Entry will be refused to citizens of [[Israel]], travellers with any evidence of having visited [[Israel]], and anyone carrying products made in Israel or with Hebrew labelling. }}\n\n====Visa-free====\n\nForeign nationals of the following countries/territories can enter Lebanon '''visa-free''', as long as they present a valid passport, are holding a telephone number and address in the Republic of Lebanon and a non-refundable return or circle trip ticket:\n\n'''For up to 6 months per year:''' [[Bahrain]], [[Kuwait]], [[Oman]], [[Qatar]], [[Saudi Arabia]] and the [[United Arab Emirates]]\n\n'''For up to 3 months within 6 months:''' [[Jordan]], provided that their passport includes a national serial number. An official identity document is accepted in lieu of a passport for Jordanian citizens.\n\n\n====Visa on arrival====\n\nForeign nationals of the following countries/territories may obtain a '''visa on arrival''' at any port of entry, as long as they present a valid passport, are holding a telephone number and address in the Republic of Lebanon and a non-refundable return or circle trip ticket:\n\n'''For 3 months, extendable by up to 1 month:''' [[Turkey]].\n\n'''For 1 month, extendable by up to 2 months:''' All [[European Union|EU/EEA]] member states, [[Andorra]], [[Antigua and Barbuda]], [[Armenia]], [[Australia]], [[Azerbaijan]], [[Bahamas]], [[Barbados]], [[Belarus]], [[Belize]], [[Bhutan]], [[Canada]], [[Chile]], [[China]], [[Costa Rica]], [[Dominican Republic]], [[Georgia (country)|Georgia]], [[Hong Kong]], [[Kazakhstan]], [[Kyrgyzstan]], [[Macau]], [[Macedonia]], [[Malaysia]], [[Moldova]], [[Monaco]], [[Montenegro]], [[Russia]], [[Saint Kitts and Nevis]], [[Samoa]], [[San Marino]], [[Serbia]], [[Singapore]], [[Tajikistan]], [[Turkmenistan]], [[Ukraine]], [[United States of America]], [[Uzbekistan]], and [[Venezuela]].\n\n'''For 1 month, extendable by up to 90 days:''' [[Brazil]].\n\n\nForeign nationals of the following countries/territories may obtain a '''visa on arrival''' at any port of entry, as long as they present a valid passport, are holding either a copy of a reservation in a 3 to 5 star hotel or both a telephone number and address in the Republic of Lebanon, a non-refundable return or circle trip ticket and at least US$2,000 in cash:\n\n'''For 1 month:'''  [[Algeria]], [[Comoros]], [[Cote d'Ivoire]], [[Djibouti]], [[Egypt]], [[Ghana]], [[Iraq]], [[Libya]], [[Mauritania]], [[Morocco]], [[Nigeria]], [[Somalia]], [[Sudan]], [[Tunisia]], and [[Yemen]].\n\n====Visas====\n\nAll other nationals not listed or not falling into the categories above must apply for a visa at an embassy or a general consulate of the Republic of Lebanon.\n\nFor those who require a visa in advance, the process can be rather bureaucratic. Visa applicants must submit the following information in either Arabic, French or English:\n\n*A passport valid for 6 months beyond the period of intended stay, and with two blank pages bearing no Israeli stamps, visas, or seals.\n*Photocopies of the passport pages (Passport cover, bio-page, pages 7 and 9, and last page) containing the full name, photo, passport #, issue date, and expiry date (one copy of each page).\n*Appointment letter.\n*Proof of fee payment, which is a valid receipt.\n*If applying outside the resident's country of origin, a copy of the applicant's residency card with no less than 6 months until expiration.\n*Two fresh and new passport-sized photos, which must be on a white background format 3.5 cm x 4.5 cm taken from the front.\n*Recent (within three months) original and till dated online bank statement (Should state account-holder’s name, sort-code & account number. Printouts should be stamped by the bank.).\n*Travel reservations showing dates of travel.\n*Hotel reservations in the name of the Lebanese sponsor or place of residency with a listed contact number. If the sponsor is not a citizen of the Republic of Lebanon, they must show proof of residency in the Republic of Lebanon for at least 3 months.\n*No objection letter from the sponsor mentioning the reason of the visit, or for minors, a Parental Consent Form from both parents allowing their dependents to travel to the Republic of Lebanon is required.\n*Proof of travel insurance, which must clearly state all the travelling passengers’ names on the policy. The area of validity must clearly cover the Republic of Lebanon or Worldwide, coverage of at least $30,000 for emergency medical & repatriation in order to face any expenses that may arise in connection with the applicant's repatriation for medical reasons, urgent medical attention or emergency hospital treatment, with these scenarios expressly stated on the policy document.\n*For minors, an original full birth certificate, stating both parents’ names and child’s name.\n*For those with passports from the Palestinian Authority or Jordan without a national ID number who are living in occupied Palestine, they will need proof that they can return.\n\nIn addition to acquiring a visa, nationals of [[Angola]], [[Bangladesh]], [[Benin]], [[Bosnia and Herzegovina]], [[Botswana]], [[Burkina Faso]], [[Burundi]], [[Cameroon]], [[Central African Republic]], [[Chad]], [[Cote d'Ivoire]], [[Democratic Republic of the Congo]], [[El Salvador]], [[Equatorial Guinea]], [[Eritrea]], [[Ethiopia]], [[Fiji]], [[Gabon]], [[Gambia]], [[Ghana]], [[Guinea-Bissau]], [[Guinea]], [[India]], [[Indonesia]], [[Kenya]], [[Liberia]], [[Madagascar]], [[Malawi]], [[Mali]], [[Mauritius]], [[Mozambique]], [[Namibia]], [[Nicaragua]], [[Niger]], [[Nigeria]], [[North Korea]], [[Pakistan]], [[Palau]], [[Papua New Guinea]], [[Paraguay]], [[Philippines]], [[Rwanda]], [[Saint Lucia]], [[Seychelles]], [[Sierra Leone]], [[South Africa]], [[Sri Lanka]], [[Suriname]], [[Taiwan]], [[Tanzania]], [[Togo]], [[Trinidad and Tobago]], [[Uganda]], [[Vietnam]], [[Zambia]] and [[Zimbabwe]] are required to obtain a '''pre-approval''' from the General Directorate of General Security. This is a convoluted process that can take months, so start early. Visas issued this way are valid for 1 month but can be extended till 3 months at [http://www.general-security.gov.lb/Entry_visa.aspx Sureté Générale] once in Lebanon.\n\n\nThe easiest way to renew a tourist visa is to leave the country and come back the day after. Due to the Syrian question, the only way to currently do this is to fly to Cyprus or Turkey, which are the cheapest destinations.\n\nAfter these 2 months, if you don't leave the country (or get a work permit), you will have to regularise your situation with Sureté Générale's offices in Beirut. (This is a special building - don't go to the main office on Damas St - ask the guards for the precise address.) There, to be allowed to leave the country, you'll have to pay a LBP50,000 (USD30) fee, which will grant you 7 days to leave the country. (Information dated May 2012)\n\n===By plane===\nBeirut International Airport (BEY), is located 5km (3&nbsp;mi) south of the city centre) - Middle East Airlines [http://www.mea.com.lb/MEA] services daily to [[Abidjan]], [[Abu Dhabi]], [[Accra]], [[Amman]], [[Athens]], [[Cairo]], [[Cologne]], [[Copenhagen]], [[Dammam]], [[Doha]], [[Dubai]], [[Frankfurt]], [[Geneva]], [[Istanbul]]-Ataturk, [[Jeddah]], [[Kano]], [[Kuwait]], [[Lagos]], [[Larnaca]], [[London]]-Heathrow, [[Milan]]-Malpensa, [[Nice]], [[Paris]]-Charles de Gaulle, [[Riyadh]] and [[Rome]]-Fiumicino, [[Warsaw]]-Okęcie.\n\nIn addition the Airport is served by foreign airlines\n\n{| \n|-\n| style=\"vertical-align:top;width:50%;\" |\n'''Middle East''' (''Arabic countries'')\n#Air Algérie ([[Algiers]]) \n#[http://www.airarabia.com Air Arabia] (Sharjah, United Arab Emirates, [[Alexandria]]-Borg Al Arab) \n#EgyptAir ([[Cairo]], [[Alexandria]]-El Nohza) \n#Emirates Airline ([[Dubai]]) \n#Etihad Airways ([[Abu Dhabi]]) \n#FlyDubai [http://flydubai.com/english.aspx] ([[Dubai]])\n#Gulf Air ([[Bahrain]]) \n#Iran Air ([[Tehran]]-Imam Khomeini) \n#Jazeera Airways ([[Dubai]], [[Kuwait]]) \n#Kuwait Airways ([[Kuwait]]) \n#Oman Air ([[Dubai]], [[Muscat]]) \n#Qatar Airways [http://www.qatarairways.com] ([[Doha]]) \n#RAK Airways ([[Ras Al Khaimah]]) \n#Royal Air Maroc ([[Casablanca]]) \n#Royal Jordanian ([[Amman]]) \n#Saudi Arabian Airlines ([[Jeddah]], [[Riyadh]]) \n#Tunisair ([[Tunis]]) \n#Yemenia ([[Amman]], [[Sanaa]]) \n| style=\"vertical-align:top;width:50%;\" |\n'''Europe'''\n#Aegean Airlines ([[Athens]]) ([[Larnaca]])\n#Aeroflot ([[Moscow]]-Sheremetyevo) \n#airBaltic ([[Riga]])\n#Air France [http://www.airfrance.fr] ([[Paris]]-Charles de Gaulle, [[Marseille]])\n#Air Serbia ([[Belgrade]])\n#Alitalia ([[Rome]]-Fiumicino) \n#British Airways [http://www.britishairways.com/travel/home/public/en_us] ([[London]]-Heathrow) \n#Bulgaria Air ([[Sofia]])  \n#Czech Airlines [http://www.czechairlines.com] ([[Prague]])\n#Germania [http://www.flygermania.com] ([[Stockholm]]-Arlanda, [[Berlin]]-Schönefeld, [[Munich]], [[Düsseldorf]], [[Hamburg]])  \n#KLM Royal Dutch Airlines ([[Amsterdam]])\n#LOT Polish Airlines [http://www.lot.pl]\n#Lufthansa ([[Frankfurt]]) \n#Tarom ([[Bucharest]]-Otopeni) \n#Transavia ([[Amsterdam]])\n#Turkish Airlines [http://www.thy.com] ([[Istanbul]]-Ataturk) \n'''Asia'''\n#Malaysia Airlines ([[Dubai]], [[Kuala Lumpur]]) \n'''Africa'''\n#Ethiopian Airlines ([[Addis Ababa]]) \n|}\n\nFor flights from the United Kingdom try [http://www.thy.com Turkish Airlines], Air Serbia, Tarom or [http://www.czechairlines.com Czech Airlines] (please note Czech Airlines no longer fly to the UK). These three airlines are often cheaper even than MEA or BA direct from Heathrow.\n\n===By bus===\nAs of February 2013, Lebanon essentially became a '''fly-in, fly-out''' territory for tourists, with the ongoing civil war enveloping Syria and ferries from Turkey and Cyprus showing no sign of resumption.\n\nIn the peaceful times, buses would leave Damascus every hour and typically cost SYP400 or 500 .  The trip is normally 4-5 hours, depending on traffic at the border.  Note that when leaving Syria, you must pay an exit fee of SYP550 and must acquire a Lebanese visa on the other side of the border (48 hrs Transit Visa is free, 15 day Transit Visa is LBP25,000 (USD17), single-entry 30 day Tourist Visa is LL50,000 (US$34), payable in Lebanese Pounds only. Money changers can exchange currency, typically with a $1 exchange fee).\n\n===By ship===\nThere is a weekly, seasonal ferry available that runs between Tripoli (North Lebanon) and Tasucu in Turkey.\n\n==Get around==\n[[Image:Ifyourodeabike.jpg|300px||right||thumb|Bike activist mural in Beirut's Hamra district, Mohammad Abd al-Baqi Street, June 2015]]\nLebanon is a small country and it is possible to drive from north to south in under 3 hours. The main means of transport are buses, service taxis, taxis and private cars. The streets in and around Beirut often are congested and traffic jam can occur any time which makes it difficult to estimate the time of travel in advance.\n\n===By bus===\nLebanon's towns are well connected by frequently running buses, though it is difficult to find a bus going to smaller mountain towns. The bus fares are surprisingly cheap and are usually not open to negotiation. \n\nMost buses for north Lebanon depart from the Dora roundabout east of Beirut and from Charles Helou Station (east of Downtown), while most buses to regions south and east of Beirut (including [[Damascus]] and [[Baalbek]]) depart from the Cola \"Station\" (which is really an intersection adjacent to the Cola bridge/overpass). Besides the big buses there are also minivans which often go to the same destinations as the big buses but some destinations, for example the Beqa', are only served by minivans. \n\nFor most destinations there are no time schedules and buses often depart when the majority of seats are occupied. As buses are a highly used means of transport this usually doesn't take more than 20 minutes. \n\nBuses from Tyre to Sidon get scarce after 8pm and Buses from Sidon to Beirut and vice versa before midnight, while buses between Tripolis and Beirut run all night.\n\n===By taxi===\nFor short distances and within towns or villages there often are \"service\" taxis. Those taxis often operate like buses on set routes between towns, though they can be hired to visit other places with some negotiation. Each taxi carries up to between 4 (inside metropolitan areas) to 6 (longer distances) passengers, who share the fare between them. The fare usually is 2000 LL (Lebanese Lira) for inner-city distances (June 2015) but might be different for distances between towns and it increases depending on both distance to be travelled and of course, like everything in Lebanon, persuasion/negotiation skills. A private taxi ride, without sharing it with other passengers is similar to a \"service\" taxi in that the same pre-negotiation is required to determine the fare, and as a rule of thumb costs the same as a fully loaded \"service\" taxi (the fare * number of passengers).\n\nTaxis and \"service\" taxis are physically the same, and the mode of operation depends on the availability of passengers and their demands and the willingness of the driver to go as \"service\".\n\nAll types of public transportation vehicles in Lebanon (taxis, buses, mini-vans and even trucks) can be recognized by their '''Red-bordered licence plate with the letter P'''.\n\n===By train===\nThere are no trains in Lebanon.\n\n===By car===\nCar rental is relatively expensive in Lebanon compared to elsewhere in the region. Reasonable, if not exactly cheap rates can, however, be found with perseverance and negotiation and - once you have your rental - fuel is easy to get. Be warned, however, that fuel is not cheap, with fuel prices being among the most affected by inflation.\n\nLebanon's roads are generally in fair condition but Lebanese drivers are not known for their caution. Exercise extreme caution when driving in Lebanon. \n\nDriving in Lebanon should be considered an extreme activity for drivers accustomed to safe driving. Street names are virtually non-existent. Mountain driving is particularly hazardous, often involving narrow highly perched roads. Traffic, especially in major cities like Beirut and Tripoli, and on the highway from Beirut to Jounieh, can be extremely crowded and time-consuming, turning a normally 20 minute trip into over an hour during peak times.\n\n==Talk==\n\nThe official language of Lebanon is '''[[Arabic phrasebook|Standard Arabic]]''', and the native language '''[[Lebanese Arabic phrasebook|Lebanese Arabic]]''', which is similar to (but not indistinguishable from) the Arabic of Syria, Jordan and the Palestinian territories. Almost all Lebanese understand Standard Arabic but might reply in Lebanese Arabic. \n\nEnglish is widely spoken, especially by the youth and in the business and scientific sectors. \n\nA good percentage of the population speak fluent [[French phrasebook|French]]. The use of French dates back to the French mandate of the area in the first half of the 1900's. Currently, however, English is more widespread than French. The French language remains strong in some areas, such as the north of Beirut.\n\nThe use of formal Arabic by Lebanon's educated youth in dialogue is declining, as some usually prefer to speak in English or French, which are seen as more fashionable. In general, the older generation has a larger percentage of French-speaking abilities than the younger generation, while the shift is transferring to an English speaking majority with substantial triple-language speaking educated citizens.\n\nMost of Lebanon's secondary schools use both English and French as the medium of instruction, but recently over the past decade, English has become more widely used.\n\nThere is a notable Armenian community in Lebanon mostly in Borj Hammoud area north of Beirut and Anjar on the Eastern borders with Syria. Inside these areas almost all signs are in Armenian, however the Lebanese Armenians speak Lebanese Arabic and can have blended in with the locals. There are also small ethnic groups who speak Greek or Kurdish. \n\nGenerally, signs are written in at least two languages, usually Standard Arabic and English/French. The language and/or spelling of the latter may vary from one sign to another (Mar Mikael and Mer Micael are the same, and English \"Beirut\" is the same as the French \"Beyrouth\" for instance).\n\n==See==\n\nLebanon is a country rich in natural scenery from beautiful beaches to mountains and valleys. Lebanese people take pride that Lebanon is one of the few countries that gives you the opportunity to go skiing in the morning and going to the beach in the afternoon. Keep in mind that this is only actually possible for a few days in the year, usually in the few days when winter shifts to spring and/or summer shifts to autumn.\n\n'''[[Beirut]] Downtown''' Visitors from all around get astonished by the beautiful downtown. At Place de l'Etoile, tourists can enjoy a delightful meal or a cup of coffee at the outdoor cafes. In addition to those, the capital provides other restaurants and hangouts that people of all ages can enjoy. There are many also many nightclubs, bars, cafes, and restaurants, catering to a diverse amount of styles and budgets. \n\n'''[[Baalbek]] Roman Temples''' in the city of Baalbeck are among the largest and most beautiful Roman ruins.\n\n'''[[Al Bass]] Archaeological Site''', '''Tyre''' (Sour), a UNESCO World Heritage site and one of the largest and best preserved Roman archeological sites in the world. The site is made up of a huge Necropolis, a massive monumental arch leading to a Roman Road, alongside which there is an excellent example of an acqueduct as well as the largest and best preserved Roman Hippodrome found to date.\n\n'''[[Jeita]] Grotto''' Jeita Grotto is nominated to be one of the new Seven Natural Wonders of the World. Jeita Grotto is the jewel of tourism in Lebanon offering to its visitors 2 fabulous grottoes. It is a source of attraction for whole the families wishing to discover a mysterious world in the heart of the earth. The “Touristic Site of Jeita” gathers all elements of nature such as stone, water, trees, flowers, air and animals in a venturous environment and with a touch of Lebanese cultural heritage. It is one of the most impressive and interesting natural sites in the world. \n\n'''[[Beiteddine]]''' One of the most authentic Arabic architectural jewels is the palace of Beiteddine. This historic monument comprises two large courtyards: the “midane”, a vast rectangular place for visitors, and a smaller one for the royal private apartments, with a magnificent fountain in its centre.\n\n'''[[Qadisha Valley]] (Holy Valley)''' Located in north Lebanon, the “Holy Valley” spreads from Bcharreh to the coast. Classified under UNESCO's world heritage, it is full of countless caves, chapels, and monasteries.\n\n'''[[Byblos]]''' also known in Arabic as \"Jbeil\", is an ancient Phoenician city that had been declared a UNESCO World Heritage Site. Its touristic attractions include a medieval castle and a Roman amphitheater, as well as many seaside cafes and restaurants serving fresh seafood.\n\n'''[[Anjar]]''' is a city in the Beqaa Valley with many local restaurants where you can enjoy the unique Lebanese cuisine. The city is home to the unique ruins of an 8th century Omayyad city.\n\n'''[[Sidon]]''' (Saida) is famous for its labyrinthine old town with centuries old mosques and the Sea Castle ruins. It is also home to beautiful museums like old mansions and the soap museum.\n\n==Do==\n\n===Night-Life===\n\nThe Lebanese people have had to adapt to the political turmoil. Beirut is easily the party capital of the Middle East and the world. The city features many different and distinct nightlife neighborhoods, like Gemmayze (close to Martyrs' Sq), Uruguay street in Down Town district, mostly full of bars and restaurants such as Gatsby, NU and Uruguay Bar which are trendy bars featuring outdoor terraces, or Armenia Street in Mar Mekhael which features nightclubs and bars. Lebanon is also known for it's open-air nightclubs open during the summer season such as Sky Bar, AHM, ARCH and Iris. Greater Beirut is a sleepless city, as the great majority of it open 24 hours a day.\n\nDuring colder days the same night clubs mentioned earlier switch to closed locations and sometimes even rebrand their name such as Caprice, The Grand Factory, HNGR and the infamous B018 which used to be a bomb shelter and if the skies were clear opens up its rooftop for clubbers to watch the sunrise.\n\nThe Lebanese nightlife can cater to all tastes whether western or oriental and most nightclubs have adopted themed nights throughout the week. Night clubs such as Grand Factory play R&B on Thursdays, Pop on Fridays and a state of the art Deep House night on Saturday (CU NXT SAT), with worldwide DJs and artists performing there.\n\nLebanese nightclubs are widely diverse, as one can find both the \"oriental\" and \"occidental\" style, and in some cases, a mix of both. Nightclubs such as Mandaloun and Music Hall hold oriental shows and are considered to be one of the most energetic and engaging oriental nightclubs in the region.\n\nIt is very common to find people dancing at the local pubs however, recently pubs are becoming a source of live music hosting local and sometimes international talents.\n\nLebanon also has a huge beach party scene having exquisite beaches and beach resorts such as Oceana, Laguava or Edde Sands and Janna Sur Mer.\n\nMost those events are advertised on Facebook, so be sure to check them out before hand.\n\nBe sure to get a proper pitch in on the price and its usually better if you let a local friend deal with the tabs, most nightclubs have a minimum charge policy and would offer you high end alcohol bottles such as Belvedere, Grey Goose or Johnny Walker Black Label which would exceed the mentioned minimum charge and go way over with bottles costing up to 1000$. However, walk-ins are common and usually an a la carte system is used with walk-ins but usually a group of guys cannot use the walk-in system unless accompanied by girls following a 1:1 ratio. Girls on the other hand face no problem whatsoever being admitted to nightclubs if they meet the age requirments. Make sure you read about the nightclub's admission policy beforehand to avoid any embarrassment. \n\n===Hike===\n\nLebanon's countryside and especially the mountains are beautiful and could be great hiking areas. Unfortunately, hiking is not easy because of a lack of hiking trails and a lack of signs on existing paths and dirt tracks. Even locals often don't know the paths or where exactly they lead to and many ways are dead ends. You can find hiking trails on [http://www.wikiloc.com/wikiloc/find.do?q=lebanon| wikilocs], but you need GPS to find them on the ground. Another solution is to take part in a guided group event that usually depart from Beirut.\n\n* [[Lebanon Mountain Trail]] (LMT) - 440-plus km national hiking trail extending from Al Qobaiyat in the north to Marjaayoun in the south.  The Trail is not well marked and it is recommended that you get a guide because you will get lost.  The guides can be expensive but it is worth talking them down on price.  If you do decide to go alone, the country side is populated and you are never very far from people.  This is by far the best way to see wild Lebanon!\n\n===Ski===\n\nLebanon has six ski resorts with groomed slopes, catering to skiers and snowboarders of all levels. Beyond the ski-able domains await you kilometers of cross-country skiing and snowshoeing trails waiting to be explored; Lebanon has something for everyone. Each of the ski resorts has a different flavor.\n\n===Wine-tasting===\nLebanon is one of the oldest sites of wine production in the world and today enjoys a burgeoning industry producing award-winning wines for export throughout the world, mainly in the UK, Europe and the United States.  Wine Tasting is an absolute ''must'' with any visit to Lebanon. Below are some wine producers in Lebanon for you to keep an eye out for:   \n-    \n- * Chateau Musar [http://www.chateaumusar.com.lb/]   \n- * Chateau Ksara [http://www.ksara.com.lb/]   \n- * Chateau Kefraya [http://www.chateaukefraya.com/]   \n- * Domaine Wardy [http://www.domaine-wardy.com/]   \n- * Vin Héritage [http://www.vinheritage.com/]   \n- * Chateau Fakra [http://www.chateaufakra.com/]   \n- * Chateau Nakad [http://www.winenakad.com/]   \n- * Massaya [http://www.massaya.com/]   \n- * Domaine des Tourelles [http://www.domainedestourelles.com/]   \n- * Clos Saint Thomas [http://www.closstthomas.com/]   \n- * Cave Kouroum [http://www.cavekouroum.com/]   \n- * Clos de Cana [http://www.closdecana.com/ ]   \n- * Nabise Mont Liban [http://www.nabise.com/]   \n- * Enotica   \n- * Chateau Khoury [http://www.chateaukhoury.com/]   \n- * Couvent St. Sauveur\n\n==Buy==\n\n===Currency===\n\nThe Lebanese currency is the ''Lebanese pound'', abbreviated \"LBP\" or \"Lebanese Lira\" abbreviated \"LL\", which is the most common abbreviation. Its value is kept stable relative to the US dollar, with a value of about LL1,500 to US$1. Either Lebanese pounds or US dollars are accepted almost everywhere, and it is common to pay in dollars but receive change in pounds (in which case, make sure you don't get short-changed).\n\nBills used are LL1000, LL5000, LL10,000, LL20,000, LL50,000 and LL100,000.\np.s: you may find two forms of LL1000 and they are both accepted.\n\nBills not used are LL1, LL5, LL10, LL25, LL50, LL100, LL250, LL500.\n\nThere are LL25, LL50, LL100, LL250 and LL500 coins. LL25, LL50 and LL100 coins are virtually never used.\n\n===Exchange rates===\n\nCorrect as of October 2018:\n\n<table cellpadding=\"2\" cellspacing=\"0\" style=\"border: 1px solid #9866FF; background-color:  #f3f3ff\" width=\"70%\">\n<tr><td valign=\"top\" style=\"padding-left: 2px\">'''$ US Dollar'''</td><td>USD$1 = LL1,507</td><td>LL1,000 = USD$0.66</td></tr>\n<tr><td valign=\"top\" style=\"padding-left: 2px\">'''&pound; Pound Sterling'''</td><td>&pound;1.00 = LL1,922</td><td>LL1,000 = &pound;0.52</td></tr>\n<tr><td valign=\"top\" style=\"padding-left: 2px\">'''&euro; Euro'''</td><td>&euro;1.00 = LL1,711</td><td>LL1,000 = &euro;0.58</td></tr>\n<tr><td valign=\"top\" style=\"padding-left: 2px\">'''$ Australian Dollar'''</td><td>AUD$1 = LL1,068</td><td>LL1,000 = AUD$0.94</td></tr>\n<tr><td valign=\"top\" style=\"padding-left: 2px\">'''$ New Zealand Dollar'''</td><td>NZD$1 = LL986</td><td>LL1,000 = NZD$1.01</td></tr>\n<tr><td valign=\"top\" style=\"padding-left: 2px\">'''$ Canadian Dollar'''</td><td>CAD$1 = LL1,149</td><td>LL1,000 = CAD$0.87</td></tr>\n<tr><td valign=\"top\" style=\"padding-left: 2px\">'''&yen; Japanese Yen'''</td><td>&yen;1.00 = LL13</td><td>LL1,000 = &yen;75</td></tr>\n</table>\n\n===Money transfer===\n\nYou may transfer money from/to Lebanon through Western Union. For more information about locations offering Money transfers you may contact BOB Finance on the number 1262 from inside Lebanon or +961-5-955262 and +961-1-906666 from outside with 24/7 Customer Service Support.\n\n==Eat==\n[[File:Flickr - cyclonebill - Tabbouleh.jpg|thumb|200px|Tabbouleh]]\n[[File:HummusLebanese.jpg|thumb|200px|Lebanese hummus]]\n[[File:Israeli zaatar manakeesh.jpg|thumb|200px|Manaeesh – Mini pizzas made in any number of local bakeries]]\n[[File:ByblosMarinusFruitsS.jpg|thumb|200px|Free fruit served at end of lunch for two people at Marinus, Byblos]]\n\nLebanon fosters exquisite cuisine ranging from mezze like the dips ''hommos'', ''muhammara'' and ''moutabal'' to salads such as ''tabouleh'', ''fattoush'', and ''salatit kizbara bi-banadora'' (cilantro and tomato salad) and stuffed wine leaves called ''waraq 'inab''. It is common to eat Mezze only and groups going to a restaurant often share a variety of Mezze which reflects the socially and culturally important sharing of food. After eating two kinds of Mezze you might find yourself already stuffed and thus skip the main course. The Mezze concept is also a great way to try many Lebanese dishes in a short period. Main dishes often are meat based and include Lebanese barbeque such as ''shish tawouk'' (barbequed chicken) - usually consumed with garlic, ''lahm mishwe'' (barbequed meat), and ''kafta'' (barbequed seasoned minced meat).\n\nA full meal at an Arabic restaurant can cost as little as 15 USD (22500 LL) depending on where you go, though more expensive options can also be found.\n\nLebanese \"fast food\" is also available as sandwiches offered in roadside shops, such as ''falafel'', different baked potato and fries, ''maqali'' (fried vegetables) and ''shawarma'' sandwiches (known in other countries as ''doner'' - or ''gyros'' in Greece). Shawarma, as opposed to ''doner'' is seasoned with ''tarator'' sauce based on sesame oil, vegetables and is rolled in lebanese thin bread. Walking thorough the streets of Beirut you will come across many fast food restaurants. Various barbequed meat sandwiches are also available, and even things such as lamb or chicken spleen, brains, lamb bone marrow or lamb testicles can be served as sandwiches.\n\nBreakfast usually consists of ''manaqeesh'' (singular: manqoushe) which looks like a folded pizza. Most common toppings are ''zaatar'' (a mixture of thyme or oregano, olive oil sesame seeds), vegetables (tomatoes, onions and peppers), ''harr'' with hot tomato sauce and vegetables, and jebneh (cheese), but at some places you can also get different variations such as sugar and cinnamon or \"halloum and bacon\". It also comes as ''sabanigh'' when it gets folded into big or small triangular shapes containing spinach, onions, lemon juice and spices. Many manqoushe places stay open 24 hours a day and partygoers often go there for a bite at 4 in the morning. It costs between 500 LL and 3000 LL. The za'atar, vegetables, spinach and sugar Manaqeesh (plural of Manqoushe) usually are vegan, but sometimes the dough is made with milk.\n\nAnother traditional breakfast food is ''knefeh'', a special kind of breaded cheese that is served with a simple syrup in a sesame seed bread. It is also served as dessert.\n\nFamous and delicious Lebanese dishes are:\n\n* '''Hummus''' (or Hummus bi-Taheeni): a dip made from chick peas with sesame paste, lemon juice, garlic, salt and olive oil. You can have it as part of Mezze, but it makes a full meal served with bread, onions, tomatoes, mint and pickled cucumbers, parsnips and olives. Hummus is usually vegan (though especially in Syria and Turkey there are versions containing a kind of yoghurt).\n\n* '''Falafel''': Fried chick pea balls. They are served on a plate with bread, a sesame sauce and veg, but more often in a rolled sandwich containing fresh and pickled veg and a sesame sauce. Falafel is usually vegan, but you might want to ask if the sauce contains milk, which is very rare in Lebanon.\n\n* '''Manqoushe''': A kind of pizza with different toppings, see above.\n\n* '''Tabboule''': A parsley salad with mint, tomatoes, spring onions, bulghur (crushed wheat), olive oil and lemon juice. Usually vegan.\n\n* '''Fattoush''': A lettuce salad with tomatoes, cucumbers, radishes, spring onions, mint, lemon juice and olive oil. Just before serving some crunchy bread is sprinkled on top. Usually vegan.\n\n* '''Salatit Kizbara bi-Banadoura''': Cilantro and tomato salad with a lemon juice and olive oil sauce. Usually vegan.\n\n* '''Batata bi-Kizbara''': Baked potato chunks with cilantro and sometimes crushed chilli. You can sprinkle lemon juice on top. Usually a part of Mezze. Sometimes you can get it rolled up in a sandwich to go. Usually vegan.\n\n* '''Batata Harra''': Like Batata bi-Kizbara with more chilli but without cilantro. Usually vegan.\n\n* '''Mjaddara''': Cooked lentils and rice or bulghur (cracked wheat) with spices and olive oil and a topping of fried onions. Usually vegan.\n\n* '''Muhammara''': Dip made from red peppers, walnuts, bread crumbs, olive oil, pomegranate molasses, lemon juice, onions, garlic and spices. Usually vegan.\n\n* '''Mutabbal''' (or Mutabbal Beitinjân): A dip made from baked and skinned eggplants with sesame paste, lemon juice and olive oil. As hummus this can be eaten as part of Mezze or as a full meal with the same bread and veg accompanying it. Usually vegan.\n\n* '''Msabbha''' or '''Mshawshe''': Similar to Hummus, but the chick peas don't get mashed and so it tastes quite differently. Served similar to Hummus. More popular in Saida than in Beirut and usually vegan.\n\n* '''Baleela''': Chick pea salad with olive oil and lemon juice. Usually vegan.\n\n* '''Hendbe''': Dandelion fried in olive oil with onions. Usually vegan.\n\n* '''Loubie bi-Zeit''': Green beans fried in olive oil with tomatoes, onions, garlic and spices. Usually vegan.\n\n* '''Bâmie bi-Zeit''': Fried okra with tomatoes and onions. Usually vegan.\n\n* '''Qarnabeet Meqle''': Fried cauliflower. Comes as Mezze or in a sandwich. Usually vegan.\n\n* '''Sherbet 'adas''': A simple but delicious lentil soup. Usually vegan.\n\n* '''Waraq 'enab''': Grape leaves stuffed with rice and spices and sometimes with tabboule before being pickled. Eaten cold. Usually vegan.\n\nLebanon is also very famous for its Arabic sweets which can be found at leading restaurants. The city of Tripoli, however, is THE city for Lebanese sweets. Many critics refer to it as the \"Sweet Capital\" of Lebanon, the Hallab Sweets Palace (Abdul Rahman Hallab - Kaser El Helou 1881) is the place to visit when making a trip to Tripoli. A great place for organic (and vegan) traditional sweets is The Olive Tree in Beirut's Sodeco square.\n\nIf taking a trip to the Beqa', the restaurants known as the El-Wadi restuarants in Zahle serve exquisite Lebanese food. In Beirut, Abd el-Wahab in the \"Monot\" area and Mezyan in Hamra also serve excellent Lebanese food in a traditional setting.\n\nInternational food chains such as KFC, McDonald's, Pizza Hut, Burger King or Domino's pizza and many other are widely spread and easily found across the country. French Pâtisseries, Chinese, Italian, American and Japanese cuisine are also widely spread and are found in virtually all of the country's malls. Foreign restaurants are concentrated mostly in Beirut, although they can be found in some of the other larger cities like Tripoli and in some of the more tourist friendly smaller cities like Byblos. \n\nCafes also exist virtually everywhere and as with foreign restaurants, foreign chains like Starbucks, Dunkin Donuts, Costa, etc, are also concentrated more in Beirut.\n\nRestaurant are very generous in supplying free extras. You get salted nuts, fresh pistachios, olives, carrots etc with your drink, and if you eat them all they are replaced even if you do not order more drinks. There is plenty of bread, often with delicious spreads. At the end of the meal many places give you a great selection of fresh fruits and cakes.\n\nEven though there are hardly any explicitly vegetarian restaurants in Lebanon it is very easy to eat vegetarian or vegan because of the many traditionally vegetarian/vegan dishes. Make sure what ingredients are used in every restaurant as recipes may vary of course. There is also a [http://veganwiki.info/en/Beirut vegetarian guide to Beirut] and to [http://veganwiki.info/en/Lebanon Lebanon].\n\n==Drink==\n\nLebanon's wines have an international reputation. Grapes have been grown since antiquity, and the vineyards, largely in the Bekaa Valley, produce the base wine for distillation into the national spirit Arak, which, like Ouzo, is flavoured with aniseed and becomes cloudy when diluted with water. Arak is the traditional accompniment to Meze.\n\nBut the grapes have also historically been used to make wine. This used to be predominantly white and sweet, but the soliders and administrators that came to administer the French mandate after World War One created a demand for red wine, and large acreages were planted especially with the Cinsault grape. Over the last 20 years these have been supplemented with the most popular international varieties, such as Cabernet Sauvignon and Chardonnay.\n\nWineries often offer wine tasting and are very welcoming. The highly individual, old fashioned, Chateau Musar, is based at Ghazir, 15 miles north of Beirut, and trucks in the grapes from Bekaa. In Bekaa itself, wineries include the large Kefraya, Ksara, the oldest winery of all, Massaya, a fashionable new producer in Tanail, and Nakad in Jdeita, which like Musar has stuck with an idiosyncratic old fashioned approach. Kefraya, in the West Bekaa region, also has a nice restaurant attached and the region itself is beautiful to pass through.\n\nA wide variety of alcoholic drinks from all over the world can be found at any liqour store or establishment that serves alcohol, with higher end liqours being only available at certain high-end liquor stores and restaurants. \n\n==Sleep==\nLebanon is full of hotels, with a range in price and quality, from hostels starting at $10/night to many hundreds of dollars per night, and the quality ranges just as much. Many international chains, such as Intercontinental, Holiday Inn, and Crowne Plaza, can be found here, as well as local boutique and \"mom-and-pop\" style hotels, as well as low quality budget hotels. \n\nAirbnb is becoming very popular, make sure to check out some apartments and compare it with hotel prices.\n\nThe best way to save money if you are staying for a long visit is furnished apartments or all-suite hotels, as they come with cleaning and other services.\n\n==Learn==\nA handful of private schools, such as the '''Lycée Français''' (several branches over the country), the '''Collège Protestant Français''' [http://www.cpf.edu.lb], '''Collège Saint Joseph Antoura''' [http://www.college-antoura.edu.lb], '''Lycée Abdel Kader''', '''Lycée Verdun''' college notre dame de jamhour and college elysee amongst others follow the official French curriculum. The official French Baccalaureate exams can be taken in Lebanon.\n\nSome schools (such as \"ACS\") teach English as a first language and follow the english curriculum. \n\nBeirut is also home to one of the most prestigious schools in the region, the '''International College(IC)''' which teaches both french and english as first languages among many others.Furthermore, IC offers a variety of baccalaureate programs such as the French, Lebanese, High School, and International Baccalaureat(IB).\n\nThe '''American University of Beirut - AUB''' [http://www.aub.edu.lb] is considered one of the best English speaking universities in Middle East.\nOther Accredited and notable anglophone private universities are: '''University of Balamand''' [http://www.balamand.edu.lb]| '''Notre Dame University - NDU''' [http://www.ndu.edu.lb] | '''Lebanese American University - LAU'''[http://www.lau.edu.lb]| '''Haigazian University''' ...  \n\nSome private universities have French as the main teaching language. '''Université St. Joseph - USJ''' [http://www.usj.edu.lb] is one of these, it is an old and respected institution in Lebanon, and probably offers the best price/quality ratio among private universities in the country. It is the private university which has enrolled most of the Lebanon students as well as foreign students from other countries in Middle East, Africa and Europe. Other francophone private universities are USEK and Université la Sagesse.\n\n'''The Lebanese University''' is the state owned / public university and is the largest learning institution in the country. It offers virtually free tertiary education.\n\n==Work==\n \nYou will need a work permit to engage in work in Lebanon. This might not be the easiest, but definitely doable if you find a local company to sponsor your work visa. \nPlenty of NGO's that have multin-national staff are operating in Lebanon, so contact them for vacancies if you're interested in such line of work.\n\n==Connect==\n[http://www.touch.com.lb/autoforms/portal/touch/Personal/Prepaid/Start/Tariffs MTC Touch] Mobile phone operator offers a GSM card for approximately 5$. Internet access starts at $5 for up to 300 MByte in a month. The only competitor of MTC Touch is [http://www.alfa.com.lb Alfa]. There are shops all around the country that sell SIM-cards and credit but they usually don't have all offers and charge more, sometimes up to the double price. Therefore it's worthwhile to go to one of the official phone company shops. However, during the recent years prices have become more stable and unified around all the certified vendors. If you want to recharge little credit only it's better to ask at local stores.\n\n==Stay safe==\nThe vast majority of Lebanese are friendly, and most tourists experience no problems. Nevertheless,the Syrian border is also somewhat unstable, however has been cleared up since the summer of 2016.\n\nTripoli was the scene of frequent deadly clashes between Wahabbi militias from Bab al-Tabbaneh and pro-Assad groups in Jabal Mohsen neighborhoods in the north part of the city in the winter of 2013/4. These clashes included small arms, RPG and even mortar fire. While these clashes were usually confined to the north of the city and only erupt occasionally since 2014 Tripoli has seen attacks in other parts as well and should be considered unsafe and thus avoided.\n\nThere was a major clash between the Army and Wahabbi militants in Sidon between 23-25 June 2013 that left some 50 people dead (however only two were civilians), but the militants were defeated and since then the city has seen no further incident.\n\nThe historical attraction town of Baalbek has seen a few minor incidents without casualties, but can still be considered safe to visit.\n\nLike in any country, it is preferable to be accompanied when visiting certain locations. In general, the Israeli borders and any Palestinian refugee camps should be avoided, since these camps have a sovereign rule of Palestenian militias confined to the camps' geographical areas. \n\nIt is best advised not to wander alone outside the modern areas of Beirut at night, criminal activities such as theft can be on the rise especially in dark areas.\n\nVisitors to areas in the vicinity of the border with Israel need a permission without which they won't be allowed to cross the many checkpoints in the area.\n\nVisitors should always register with their respective embassies once they enter Lebanon and keep up-to-date regarding any travel warnings regarding Lebanon. Automobile accidents are also a big problem in major cities like Beirut, so take care driving. Motorcycles will sometimes swerve in front of you; numerous motoring laws do not apply to motorcycles. \n\n'''Useful phone numbers:'''\n* Police: 112 \n* Fire brigade: 175 (metropolitan Beirut only)\n* Civil defense: 125 (outside Beirut)\n* The Red Cross (Medic Response): 140 \n* Information:  1515\n\n==Stay healthy==\nAs a key destination for health tourism in the region, Lebanon has a professional and private healthcare system. Located mainly in Beirut , key hospitals include:\n\n* AUBMC (American University of Beirut- Medical Center), Hamra area: +961-1-344704. \n* SGHUMC (Saint George Hospital University Medical Center), Ashrafieh area: +961-1-441000.\n* RHUH (Rafic Hariri University Hospital), Bir Hassan area: +961-1-830000.\n* Hotel Dieu de France, Ashrafieh area: +961-1-386791. \n* UMC-RH (University Medical Center – Rizk Hospital), Ashrafieh area:  +961-1-200800.\n* BMC (Bellevue Medical Center), Mansourieh:  +961-1-682666, Hotline:1565.\n* Mont Liban Hospital, Hazmieh area:  +961-1-955444.  \n* Sacré Coeur Hospital, Hazmieh area:  +961-1-451704.\n* Tel Shiha - Zahle, Beqaa\n* Makassed General Hospital (MGH), Tarik el Jadida area: +961-1-636000\n* Jabal Amel Hospital - Jal Al Baher Area, Tyre: +961-7-740343, 07-740198, 07-343852, 03-280580\n* Labib Medical Center - Abou Zahr Street, Sidon Area: +961-7-723444, 07-750715/6\n* Sahel Hospital -  Airport Ave Area: +961-1-858333\n* Bahman Hospital - Beirut, Haret Hreik Area: +961-1-544000 or 961-3-544000\n\nIt is extremely important that you get travel insurance prior to your departure to Lebanon. Hospitals in the country can be very expensive and, with the lack of insurance, cash payments may be expected beforehand.\n\n==Respect==\nIn general the people in Lebanon are very kind, polite and respectful. Thus treating them similarly is easy and comes quite naturally. \n\nLebanese in general are extremely '''hospitable''' and consider it a pleasure to have guests in their home and in their country.\n\nLebanon is a country of many different religious groups and '''religion''' plays a vital role in many people's lives. It is wise to respect the religious differences of the Lebanese population but people are accustomed to religious differences so there is no need to hide your religious (non-)affiliation.\n\nIt is recommended to wear modest '''dress''' when visiting religious sites (churches, mosques, etc). The same is true for visiting areas populated mainly by Muslim Lebanese if you want to avoid surprised and continuous looks. Even in Beirut, some areas are more conservative than others depending on the religion of the majority. Visitors should bear that in mind when exploring the city. Overall, however, clothing considered 'western' is generally acceptable in all areas. Bear in mind, however, that as open and western as Beirut is, for women \"topless\" at any beach, whether private or public, is not recommended at all. Beirutis rather dress chic, comparable to people in Paris and Italian cities, and especially local women like to express their individual taste, but casual clothes are totally acceptable and (neat) tracksuit trousers are a common sight on people of any gender. In Tripoli, especially in the old city, it is recommended that women dress conservatively. The same applies on most traditional markets in the country. In general, Lebanese are accustomed to different lifestyles and usually do not take offence easily, especially with matters related to dress, though not all Lebanese are so open-minded. Again this depends on the area. Some areas are as liberal as any European city while other areas are much more conservative. Keep a lookout and dress similarly to the population of the area.\n\nIt is common that people in Lebanon discuss political and social matters  openly even though many of them are very frustrated by the political system and politicians. Because of political tensions and the conflict with Israel and tension with Syria tourists should be cautious not to strongly take sides with one of those two countries although regional problems are among the topics which are discussed the most. Visitors should be open to regional perspectives on world politics and might be interested in hearing the many different views and interpretations of regional problems and their background from various people.\n\n\n\n[[de:Libanon]]\n[[eo:Libano]]\n[[es:Líbano]]\n[[fi:Libanon]]\n[[fr:Liban]]\n[[hu:Libanon]]\n[[it:Libano]]\n[[ja:レバノン]]\n[[nl:Libanon]]\n[[pl:Liban]]\n[[pt:Líbano]]\n[[ru:Ливан]]\n[[sv:Libanon]]\n[[zh:黎巴嫩]]\n[[wts:Category:Lebanon]]\n\n[[WikiPedia:Lebanon]]\n[[Dmoz:Middle East/Lebanon/]]\n[[World66:asia/middleeast/lebanon]]\n\n{{IsPartOf|Middle_East}}\n{{related|Skiing_in_Lebanon}}\n{{outline}}\n{{countryguide}}"
        }
    }
}