{
    "parse": {
        "title": "Netherlands",
        "pageid": 666,
        "wikitext": {
            "*": "{{pagebanner|Netherlands Banner.jpg}}\n\n{{quickbar\n| image=KinderdijkMolens02.jpg\n| caption=Kinderdijk\n| flag=Flag of the Netherlands.svg\n| location=Kingdom of the Netherlands in its region.svg\n| capital=[[Amsterdam]]\n| government=parliamentary democracy with constitutional monarch\n| currency=Euro (€) (mainland)<br>U.S. Dollar ($)(special municipalities in the Caribbean)\n| area=41,543km²<br />''water: 7,650km²<br />land: 33,893km²''\n| language=Dutch (official & main)<br>Frisian (official in [[Friesland]])<br>English (official in Amsterdam and the special municipalities of Saba and Sint Eustatius)\n| religion=(2013) Roman Catholic 23.7%, Protestant 10.2%, Muslim 5,5%, other 6%, unaffiliated 51.3-61% / (2014) Atheism 25%, Agnosticism 31%, Ietsism 27%, Theism 17% \n| population=16,803,893 (2013 estimate) \n| electricity=230V, 50Hz (European plug)\n| callingcode=+31\n| tld=nl.\n| timezone=UTC +1\n}}\nThe [http://www.holland.com '''Netherlands'''] ([[Dutch]]: ''Nederland'', also commonly, but incorrectly, called ''Holland'') is a [[Europe]]an country, bordering [[Germany]] to the east, [[Belgium]] to the south, and [[France]] in the Caribbean as the Dutch territory [[Sint Maarten]] borders French territory [[Saint-Martin]]. The people, language, and culture of the Netherlands are referred to as \"Dutch\".\n\nWith over 17 million people on an area of just 41,543km², it's a densely populated country with its gorgeous capital [[Amsterdam]] being just one of many interesting cities. Once a great naval power, this small nation boasts a wealth of cultural heritage and is famous for its painters, windmills, clogs and notoriously flat lands. A modern European country today, it preserved its highly international character and is known for its liberal mentality. As a founding member of EU and NATO, and host to the International Court of Justice in [[The Hague]], the Netherlands is at the heart of international cooperation. Its small size, welcoming attitude to travellers and many sights make it a unique and fairly easy to discover destination and a great addition to any [[Europe]]an trip.\n\n==Regions==\nThe Netherlands is a constitutional monarchy, administratively divided into 12 provinces (''provincies''). Even though the Netherlands is a small country, these provinces are quite diverse and have plenty of cultural and linguistic differences. They can be divided in four regions:\n\n{{Regionlist\n\n| regionmap=Netherlands-regions-new.png |\n| regionmaptext=Regions of the Netherlands |\n| regionmapsize=upright=2 |\n\n| region1name=[[Western Netherlands]]\n| region1color=#c5995c\n| region1items=[[Flevoland]], [[North Holland]], [[South Holland]], [[Utrecht (province)|Utrecht]]\n| region1description=Commonly called the '''Randstad''', this is the heart of the Netherlands with its four biggest cities as well as typical Dutch countryside.\n\n| region2name=[[Northern Netherlands]]\n| region2color=#a4c28d\n| region2items=[[Drenthe]], [[Friesland]], [[Groningen (province)|Groningen]]\n| region2description=The least densely populated area, mostly unexplored by foreigners, but popular among the locals. The West Frisian Islands are excellent destinations for a few days out, as are the Frisian Lakes.\n\n| region3name=[[Eastern Netherlands]]\n| region3color=#b383b3\n| region3items=[[Gelderland]], [[Overijssel]]\n| region3description=Home to the largest national park of the Netherlands, Hoge Veluwe National Park, as well as the beautiful ''Hanzesteden'', seven mediaeval cities along the IJssel River with a traditional historic centre, such as Zutphen, Zwolle, Doesburg, among others.\n\n| region4name=[[Southern Netherlands]]\n| region4color=#c8b7b7\n| region4items=[[Limburg (Netherlands)|Limburg]], [[North Brabant]], [[Zeeland]]\n| region4description=Divided from the rest by its Catholic history, carnival celebrations and its \"Burgundian way of life\".\n}}\n\nThis article describes the European part of the Kingdom of the Netherlands. The [[Caribbean]] islands [[Bonaire]], [[Sint Eustatius]] and [[Saba]] are \"special municipalities\" fully integrated in the Netherlands proper. Beside the Netherlands proper, [[Aruba]], [[Curaçao]] and [[Sint Maarten]] are constituent countries within the Kingdom of the Netherlands.\n\n==Cities==\nThe Netherlands has many cities and towns of interest to travellers. Below are '''nine''' of the most notable ones:\n<!--This list should not exceed a representative sample of nine. Please discuss proposed changes to this list on this article's discussion page before implementing them.-->\n* [[Amsterdam]] — impressive architecture, lovely canals (''grachten''), museums and liberal attitudes\n* [[Arnhem]] — green city on the Rhine: Sonsbeek, Veluwe and Meinerswijk, old quarters and mansions, cultural events\n* [[Delft]] — historic unspoiled town with the world-famous blue and white ceramics\n* [[Groningen]] — student city with a relaxed atmosphere and nightlife till the sun gets up\n* [[The Hague]] — the judicial capital of the world, the seat of government and the royal family\n* [[Eindhoven]] — fifth largest city, brainport of europe, little less touristic so you can really experience the Dutch culture\n* [[Maastricht]] — fortified medieval city showing the different culture, style and architecture of the south\n* [[Nijmegen]] — oldest city of the country, known for its marches, left-wing politics and large student population\n* [[Rotterdam]] — modern architecture, good nightlife, vibrant art scene and the largest port of Europe\n* [[Utrecht]] — historic centre, antique stores and the Rietveld-Schröder House\n\n==Other destinations==\nThese are some interesting destinations outside of the major cities.\n\n* [[Efteling]] — renowned theme park with fairytale elements like elves and dwarves\n* [[Giethoorn]] — small village with beautiful traditional architecture and canals instead of streets\n* [[Hoge Veluwe National Park]] — largest national park with heathlands, sand dunes and woodlands\n* [[Dwingelderveld National Park]] — preserves 3700 hectares of the largest wet heathland in Europe. \n* [[Lisse|Keukenhof]] — more than 800,000 visitors see these enormous flower fields each spring\n* [[Kinderdijk]] — these windmills show the stereotypical Dutch landscape in all its glory\n* [[Schokland]] — old island evacuated in 1859, a well-preserved ghost village remains\n* [[South Limburg]] — hilly green landscapes, picturesque villages, castles and orchards\n* [[Texel]] — largest island suited for cycling, walking, swimming and horse riding\n* [[Waterland and Zaan Region]] — typical Hollandic villages with clogs, wooden houses, windmills and the Zaanse Schans\n* [[Zaanse Schans]] — open air museum with Dutch windmills and Zaan houses\n\n==Understand==\nThe official name of the country is the Netherlands. In the rest of the world, the name Holland is commonly used for the entire country. However, when used correctly, the name Holland only refers to the area covered by the provinces of North and South Holland. Indeed, in this area, which contains the largest cities and largest part of the population, this use is common as well. However, outside of this area, and particularly in the South and North, this use is often considered quite insulting, and the Netherlands is preferred. Consider how a Scot would feel if called English. In these areas, you are likely to be corrected with a slightly annoyed explanation of the difference between Holland and the Netherlands.\n\n===History===\nThe southern part of the country was part of the Holy Roman Empire until it was acquired piece by piece by the Burgundians. At the end of the Middle Ages, it became a Spanish possession (together with what is now Belgium). Little survives from this period, except a few historic city centres, and a few castles. \n\nFollowing the '''Dutch Revolt''', led by national hero William of Orange (''Willem van Oranje''), the Netherlands became a ''de facto'' independent republic in 1572. The (first) split with Belgium came when the northern provinces (including [[Flanders]]) signed the Union of Utrecht in 1579. It grew to become one of the major economic and seafaring powers in the world during the 17th century, which is known as the Dutch Golden Age (''Gouden Eeuw''). During this period, many colonies were founded or conquered, including the Netherlands East Indies (currently [[Indonesia]]) and New Amsterdam (currently [[New York City]]), which was later traded with the British for [[Suriname]].\n\nIn 1805, the country became a kingdom when Emperor Napoleon appointed his brother 'King of Holland'. In 1815, it became the '''United Kingdom of the Netherlands''' (''Verenigd Koninkrijk der Nederlanden'') together with Belgium and [[Luxembourg]] under King William I (''Willem I''). In 1830 Belgium seceded and formed a separate kingdom. Luxembourg received independence from the Netherlands in 1890, as the Salic Law prohibited a female ruler. \n\nAvoiding the liberal revolutions of 1848 and new adopted Treaty, the Netherlands quietly became a constitutional monarchy and remained neutral in World War I but suffered a brutal invasion and occupation by Germany in World War II. A modern, industrialized nation, the Netherlands is also a large exporter of agricultural products. In 1944, the Low Countries formed the union of the Benelux in which they economically (and sometimes politically) work together. The country was a founding member of NATO in 1949 and the European Community (EC) in 1957, and participated in the introduction of the Economic and Monetary Union (EMU) in 1999.\n\n===Culture===\nQuite a few travellers visit the Netherlands to enjoy its famously tolerant attitude: '''prostitution''' is decriminalized but only for those prostitutes registered at a permitted brothel. It is illegal for sex workers to solicit for customers on the street and prostitutes are most common in the capital Amsterdam, where red-light districts are popular, even if tourists only visit as a memento of the visit. In more rural areas, prostitution is almost non-existent. Sex shops, sex shows, sex museums and drugs museums are also popular amongst tourists. The sale, possession, and consumption of small quantities of '''cannabis''' while technically still illegal, is officially tolerated, but ''coffeeshops'' are subject to increasing restrictions.  Harder drugs (e.g. ecstasy or cocaine) remain illegal both in theory and practice. In the same open minded atmosphere is the Dutch ease towards '''homosexuality''', gay marriage is legalized. Also the practice of '''euthanasia''' is legalized under strict conditions.\n\n===Geography===\nThe Netherlands is one of the most densely populated countries in the world. No matter where you go, you are never far away from civilization. Cities can be crowded especially in the Randstad area, where congestion is a serious problem. Much of the country is flat and at or below sea level making it an ideal place to '''cycle'''. Hills may be found only at the Veluwe and Southern Limburg. Much of countryside is dominated by highly industrialized farming: despite its population density, the Netherlands is one of the largest food exporters in the world. Though there are some beautiful spots scattered across the country, tourists expecting a countryside full of picturesque villages, tulips and windmills may be in for a bit of a shock. The villages, tulips and windmills are there for sure, but you just have to find them (for example, in the [[Waterland and Zaan Region]]) and most Dutch have never been there actually. The most beautiful places are most of the times the places known only by the Dutch themselves. Asking a Dutch person for some ideas of what to see could be helpful. Otherwise, just visit local 'tourist shops', known as the VVV, found in all the larger towns.\n\nThe geography of the Netherlands is dominated by water features. The country is criss-crossed with rivers, canals and dikes, and the beach is never far away. The western coast of the Netherlands has one of the most beautiful North Sea beaches that can be found, attracting thousands if not millions of people every year, among them a lot of Germans as well.\n\n===Climate===\nThe Netherlands have a maritime temperate climate, which means that summers are generally cool and winters are generally mild. Every month of the year has rainfall, some are although very dry or wet. The best time to go is from May to September (daily maximum 18/19°C up to 23°C), but also April and October can once be pretty good months to come, if you're lucky.\n\n==Get in==\nThe {{Schengen}}\n\nA Schengen visa is generally not valid for travel to the Caribbean parts of the Netherlands. If you require a visa for that part, you will need to apply for a separate visa valid for that part at your nearest Dutch embassy or consulate.  \n\nAs of 1 January 2014, the requirement to register your visit at the police has been abolished for all travellers staying for a maximum of 90 days. Only under special circumstances registration will be required, in which case either your nearest Dutch embassy or consulate or the Dutch Royal Military Constabulary will inform you [https://www.politie.nl/themas/kort-verblijf-vreemdelingen-2014.html].\n\nApplications for visas and long-term residence permits are handled by the [http://www.ind.nl/nl/index.asp IND]. Generally speaking, travellers to the Netherlands who do not require a short-stay visa ''may'' be able to get a residence permit upon arrival without a long-stay visa, but consult your nearest Embassy/Consulate for information.\n\nThere are a number of ways to get into the Netherlands. From neighbouring European countries, a drive with the car or a train ride are feasible; visitors from further away will probably be using air travel. Visitors from the United Kingdom can also travel by boat.\n\n===By plane===\n[http://www.schiphol.nl Schiphol Airport], near Amsterdam, is a European hub, and after [[London]], [[Paris]], and [[Frankfurt]] the largest of Europe. It is by far the biggest international airport in the country, and a point of interest in itself, being 4 metres below mean sea level (the name is derived from \"ship hole\" since Schiphol is built in a drained lake). Travellers can easily fly in from most places of the world and then connect with the Dutch largest airline KLM [http://www.klm.com]. \n\nSome budget airlines also fly to the Netherlands. [http://www.jet2.com/ Jet2.com], [http://www.easyjet.com Easyjet], [http://www.transavia.com Transavia] and other [[Discount airlines in Europe|low-cost carriers]] serve Schiphol, providing a fairly economical way to city-hop to Amsterdam from other spots in Europe. Especially flying to/from the British Isles and the Mediterranean countries can be relatively cheap. It's important that you book as early as possible, as prices tend to get higher closer to departure.\n\nFrom Schiphol there are excellent railway connections: Amsterdam, Rotterdam, The Hague, Utrecht and most large cities have a direct train service. International high speed trains depart to [[Brussels]] and Paris and Intercity trains to Germany. The train station at Schiphol is located underground, under the main airport hall. The train is the quickest and cheapest way to get around in the Netherlands. Taxis are expensive: legal taxis have blue number plates, others should be avoided. Some hotels in Amsterdam, and around the airport, have a shuttle bus service.\n\nOther international airports are '''Eindhoven Airport''', '''Maastricht/Aachen Airport''', '''Rotterdam - The Hague Airport''', and '''Groningen-Eelde Airport'''. These smaller airports are mainly attended by low-cost airlines. Eindhoven Airport and Maastricht/Aachen Airport are mostly used by [http://www.ryanair.com Ryanair], while Rotterdam Airport is frequented by [http://www.transavia.com/ Transavia], the low-cost subsidiary of KLM for tourists. The operator CityJet does an expensive commuter trip to London city. A direct bus connection, either to the local railway stations and then take the train are the best way to get to Amsterdam or any other town. There is a direct bus service between Eindhoven Airport and Amsterdam Central Station.\n\nIt is also possible to come to the Netherlands via airports lying in surrounding countries. Much-used airports are [http://www.dus-int.de/dus_en/ '''Düsseldorf International Airport'''] and [http://www.brusselsairport.be/ '''Brussels Airport''']. European low cost carriers (Ryanair and [http://www.airberlin.de Air Berlin]) also use the airports of Münster-Osnabrück and Weeze/Niederrhein which are near or just at the Dutch/German border. From these two airports there are frequent flights to the major European destinations.\n\n===By train===\n(High speed) trains may be the most comfortable mode of transport between major European cities. While some low cost airlines offer cheaper deals, remember that international high speed lines connect city centres, rather than airports that are usually located outside of the city. Also, trains do not require you to be present one hour before departure and can be part of the holiday experience: they allow you to enjoy the landscape, meet new people, have cup of coffee in the board restaurant or bring along a good bottle of wine. \n\nRemember that the cheapest tickets are often sold out early and that reservations are generally possible 3 (normal) to 6 (CityNightLine) months in advance. Bookings can be made via [http://www.hispeed.nl NS Hispeed] (Dutch railways) or its [http://www.bahn.de German] and [http://www.sncb.be Belgian] counterparts.\n\n====From France, Belgium, United Kingdom====\nThe [http://www.thalys.nl '''Thalys'''] high-speed train, which connects the Netherlands with [[France]] and Belgium, is a bit expensive, but if you book a return in advance or if you're under 26 or over 60 you can get good deals. It is also faster, normally cheaper and more convenient than flying. Direct trains depart from Amsterdam, Schiphol Airport and Rotterdam, for the south of the country has excellent connections via [[Liège]]-Guillemins (Belgium) and [[Aachen]] (Germany).\n\nA slow, but cheap alternative for trips to Brussels or Antwerp is the Intercity train. Take into account you may have to change trains. A local train runs hourly from Antwerp to [[Roosendaal]], where you can catch a domestic train to [[Rotterdam]] and [[Amsterdam]].\n\nLondon St. Pancras station is connected to the Netherlands by [[Eurostar]] high-speed trains via Brussels Midi/Zuid/South station. Use one of the connections mentioned above.\n\n====From Germany and Switzerland====\nThe '''ICE''' [http://www.bahn.de/p/view/angebot/international/zuege/ice-amsterdam.shtml] high-speed train, runs from [[Basel]] via Frankfurt to Amsterdam, via Cologne, [[Düsseldorf]], [[Arnhem]], and Utrecht.\n\nIntercity trains run from [[Berlin]] and [[Hannover]] to Amsterdam via [[Osnabrück]], [[Hengelo]], [[Deventer]], [[Apeldoorn]], [[Amersfoort]] and [[Hilversum]].\n\n[[CityNightLine]] and [[Euronight]] trains did provide direct overnight connections from Amsterdam to [[Copenhagen]], [[Prague]], [[Warsaw]] and [[Moscow]] until 13 December 2016. '''There are currently no regular international night trains from/to the Netherlands.''' \n\nThere are also a number of regional trains from and to Germany:\n\n* Between [[Groningen]] and [[Leer]] trains run every two hours [http://www.arriva.nl]. '''Service suspended until further notice, train has been replaced by bus due to an accident in December 2015.'''\n* There are trains between [[Enschede]] and [[Münster]] every hour, also between [[Enschede]] and [[Dortmund]] every hour [http://www.bahn.de].\n* Trains run hourly between [[Hengelo]] and [[Bielefeld]], via [[Osnabrück]] [https://www.eurobahn.de/].\n* Trains run hourly between [[Venlo]] and [[Hamm]], via [[Mönchengladbach]] and Düsseldorf [https://www.eurobahn.de/].\n* Trains run every hour between [[Maastricht]] and Aachen, via [[Heerlen]] [https://www.arriva.nl/].\n\n===By bus===\n[[Eurolines]] [http://www.eurolines.com/] is the main 'operator' for international coaches to the Netherlands. (In fact the name Eurolines is a common brand-name used by different operators). Services are limited: only a few main routes have a daily service, such as from Poland, London, Milan, Brussels and Paris [http://www.eurolines-pass.eu/timetable.aspx], but this is the cheapest way to travel and you get a discount if you are under 26 of age.\n\n[[Megabus]] [http://uk.megabus.com/] runs lines from [[London]] and [[Paris]] via [[Brussels]] to [[Amsterdam]].\n\n[[PublicExpress]] [http://en.publicexpress.de/] runs a line from [[Bremen]] via [[Oldenburg]] to [[Groningen]].\n\nDue to the Bosnian war in the 1990s, there are bus companies serving the Bosnian diaspora, which provide a cheap and [[Ecotourism#CO2_emissions|clean]] way of getting to the other side of the European continent. '''Semi tours''' [http://semi-tours.com] runs several times per week from various destinations in [[Bosnia and Herzegovina]] to Belgium and the Netherlands, Off-season approx. 135€ for a return ticket.\n\n===By car===\n[[Image:2008-09_Aa_road_sign.JPG|thumb|upright=1.3|Speed limits in the Netherlands]]\nThe Netherlands has good roads to Belgium and Germany, and ferry links to [[Great Britain]]. The country has a dense, well-maintained trunk-road network. Borders are open under the terms of the Schengen Agreement. Cars may be stopped at the border for random checks, but this rarely happens. There are car ferry services from the United Kingdom, see below. As the UK is not part of the Schengen zone, full border checks apply.\n\n'''Driving in the Netherlands'''\n\nRoad rules, markings and signs are similar to other European countries but have some particularities:\n*At unmarked intersections traffic coming from the right ALWAYS has priority. Traffic includes bicycles, horses, horse-drawn carts (recreational use and fairly uncommon), electric wheelchairs, small mopeds and motorised bicycles.\n*Cycle paths are clearly marked and are widespread throughout the country.\n*On motorways, on and off-ramps (slip-roads) are usually long and allow for smooth merging however do note that as of 2009 returning onto the motorway from an off-ramp lane is illegal. Passing on the right and needless use (other than for passing) of the inside lane(s) is prohibited. (passing on the right is permitted only in congested traffic) \n\nUrban driving:\nUrban driving in the Netherlands is considered by many tourists and locals alike to be an exasperating, time consuming and expensive experience.\nCity roads are narrow, riddled with speed bumps, chicanes and a large variety of street furniture (with knee-high, asphalt-coloured anti-parking poles being probably the most dangerous threat to paintwork as they tend to either blend into the background or be beneath the driver's view)\n\nOther hazards are: \n* Pedestrians protruding on the road or crossing in dangerous and not-permitted areas.\n* Cyclists and moped riders generally tend not to adhere to the rules or traffic lights so preventive driving is crucial.\n* Narrow bridges.\n\nParking: \nParking in city centres can be expensive. Particularly in Amsterdam, The Hague and Rotterdam street parking is sometimes limited to only a few hours and prices range between 3 and 6 Euros per hour.\nGenerally, underground car parks cost between 4 and 6 Euros per hour and may be by far the best choice for practical and safety reasons.\n\n===By boat===\nThere are three ferry services from the UK\n\n*[http://www.stenaline.nl Stena Line] between [[Harwich (England)|Harwich]] and [[Hook of Holland]]\n\n*[http://www.dfdsseaways.co.uk DFDS Seaways]  between [[Newcastle upon Tyne]] and [[IJmuiden]] on the outskirts of Amsterdam\n\n*[http://www.poferries.com P&O Ferries] between [[Kingston Upon Hull]] and [[Rotterdam]] Europoort.\n\nMore information, timetables and ticket prices for the North Sea ferries is available at [http://www.aferry.co.uk/ferry-to-holland-ferries-uk.htm AFerry.co.uk]. Dutchflyer[http://www.dutchflyer.co.uk] is a combination ticket that includes the train ride from anywhere on the Greater Anglia [http://www.nationalexpresseastanglia.com/] network (including London and [[Norwich]]) to [[Harwich (England)|Harwich]], the ferry, and the train ride from Hook of Holland to anywhere on the NS (the Dutch railway) network. Rotterdam is also the second largest port in the world, and (in theory) a good place for [[Freighter travel]].\n\n===From Belgium===\n* For a list of border-crossing buses between Belgium and the Netherlands, you may consult the list at [http://www.grenstreinbus.be/].\n* In order to avoid paying for an international train ticket on the route between Amsterdam and Antwerp, you can get off in one of the border stations of '''Essen''' (Belgium) and '''Roosendaal''' (Netherlands) and walk to the other on foot. You can follow the main road between the two places and will need to walk some 10 kilometres in a flat and open, though particularly uninhabited terrain.\n* Apart from being a peculiar result of ancient European history, the town of '''Baarle''' (formally '''Baarle-Hertog''' in Belgium and '''Baarle-Nassau''' in the Netherlands) is a possible change point, since the town's main bus stop ''Sint-Janstraat'' is operated by both Flemish (Belgian) and Dutch buses.\n* The Flemish (Belgian) company De Lijn operates a border-crossing bus between '''Turnhout''' in Belgium and '''Tilburg''' in the Netherlands, both of which are termini in the respective country's railway network.\n* There's a bus operated by the Flemish (Belgian) company De Lijn going between the train stations of '''Genk''' (Belgium) and '''Maastricht''' (the Netherlands). A train connection is non-existing in this place, but it is being built at the moment.\n\n==Get around==\n\nThe Netherlands has a fine-grained, well-organized public transport system. Virtually any village can be reached by public transport. The Dutch public transport system consists of a train network which serves as backbone, extended with a network of both local and regional buses. [[Amsterdam]] and [[Rotterdam]] have a metro network, and [[Amsterdam]], [[Rotterdam]], [[The Hague]] and [[Utrecht]] also have trams.\n\nWhenever you're walking through the bigger cities (especially Amsterdam), be aware that '''cyclists are a serious part of traffic'''! Be careful when you cross the street and keep clear of the special biking lanes (marked by red asphalt or a bike symbol). \n\n===Public Transport tickets===\n\n==== OV-chipkaart ====\n\n{{cautionbox|The old ''strippenkaart'' and the ''paper train tickets'' have been phased out in the Netherlands and are '''no longer valid'''. If you still own one from a previous visit, you can throw it away or keep it as a collector's item.}}\n\nThe contactless smart card '''OV-Chipkaart''' (OV-Chipcard  [https://www.ov-chipkaart.nl/?taal=en]) can be used on all forms of public transport (OV stands for ''Openbaar Vervoer'' meaning Public Transport).\n\n{| border=\"1\" cellspacing=\"0\" cellpadding=\"3\" width=\"90%\" align=\"center\"\n|-\n! \n! Train, bus, tram, metro \n|-\n| '''OV-chipkaart only'''\n|  Throughout the Netherlands you generally use an '''OV-chipkaart''' to travel in public transport.\n|  This includes all trains operated throughout the Netherlands: NS, Veolia, Arriva, Syntus, Connexxion.\nIf you travel domestic with the high-speed Intercity Direct or ICE you have to 'load' a supplement fee onto your card if traveling between Rotterdam - Schiphol Airport vice versa\n|-\n| '''Paper ticket only''' \n| 4 out of 5 West Frisian Islands (''Waddeneilanden''):\n*Vlieland (tickets in bus)\n*Terschelling (tickets in bus)\n*Ameland (tickets in bus)\n*Schiermonnikoog (tickets in bus)\n| \n*Cross-border journeys (such as the Thalys)\n|}\n\n=====Card types and obtaining a card=====\n\nThe OV-chipkaart comes in three versions:\n* Disposable OV-chipkaart sold with a travel product that cannot be recharged or reloaded with another product. For example a single or return train journey. It does not contain an electronic purse and is meant for people who rarely use public transport in the Netherlands. They are available for a range of fares, such as a three-day pass to all public transport in one city. The single-trip variants are sold on the bus by the driver, and sometimes on the tram.\n* Anonymous OV-chipkaart available for €7.50 at ticket offices and vending machines valid up till 5 years. This card is reusable and has an electronic purse. It is transferable, and therefore cannot be used for discounted travel, or for monthly or annual season tickets. However, the anonymous card can contain multiple products simultaneously, as long as those are 'simple' travel products, like those available for the disposable card.\n**NOTE: Because of the way the OV-chipkaart works (see below), it must always hold a minimum of €20 in order to cover the cost of the checking-in fee. Each time you check out, the screen on the card reader will show you your balance. If you dip below the €20 minimum, don't forget to top up at any kiosk (debit cards or credit cards with PIN only; some accept coins) or OV service desk. Don't worry: at the end of your time in the Netherlands, the balance on your card can be refunded to you by turning in your OV-chipkaart at the service desk.\n* Personal OV-chipkaart is useful for anyone entitled to travel with a discount. It is also the only type that can hold a monthly or annual season ticket. Because of these characteristics, the personal card is non-transferable and features the holder's photograph and date of birth. The personal OV-chipkaart has an electronic purse. In addition, it can be set to automatically top its balance up when it drops below a certain level. The personal card is the only one that can be blocked if it is lost or stolen.\n\nChoosing a card to fit your needs, you best consider how often and for what period you visit the Netherlands and how often you use public transport. If you are likely to use the bus/tram/metro three times or more per year, it's usually cheaper to get an anonymous card, rather than buy a disposable one for every trip. If you are likely to do a lot of travelling in a relatively short time, you could opt for a disposable one-day or multi-day card.\n\nTravellers can buy a travel product, for example a single ride, a one-day pass for an entire city or a monthly season ticket for a certain route. When they check out after the trip (see next section), the system will recognise that a certain product has been used and, if necessary, deactivate it.\nThe other option is to use money from the electronic purse on the OV-chipkaart. On checking in, the system will charge a checking-in fee (€20 for NS trains, €4 for metro, tram and bus), which will be refunded as soon as the traveller checks out, minus the fare for the trip actually made. If a user fails to check out, the checking-in fee, which is higher than the fare for most actual journeys, is refunded after filling refund forms from the travel company (refund forms can be found [here https://www.ov-chipkaart.nl/klantenservice/zelfregelen/nietinofuitgecheckt/?taal=en] and at the counters of the travel company ). \nLoading travel credit can be done at station ticket machines, at ticket offices and some tobacco shops and supermarkets, note that with the only exception being the ticket machines at stations, most other locations charge a small fee (around €0,50).\nDuring a trip, personnel can check cards with a mobile card reader. You must be travelling away from the point where you checked in.\n\n=====Using the chip card=====\n\nWhen travelling by train or metro, the OV-chipkaart is held against a card reader as soon as the traveller enters the platform. The card has now been 'checked in', and the boarding fee will be charged to the card. When the passenger ends the journey at another station, the card is held against the card reader again in order to 'check out'; the boarding fee is refunded (minus the fare for the journey actually made if the traveller is using the e-purse).\nThere are two types of card reader systems on train and metro stations: free-standing card readers, and card readers integrated into ticket gates (gates open with the reader at your right hand). \nWhen travelling by tram or bus, travellers check in and out when entering and leaving the vehicle. Card readers are placed near each door for this purpose. Changing buses or trams of the same company (as is likely within cities) travel costs will be combined (no double entrance fee, as you would pay when you check out and in between trains of the same company, see next). \n\nChecking in and out is always required, except when you transfer from one train to another from the same operator. Changing trains from one operator to a different operator requires checking out at a card reader of the first operator and checking in at a card reader of the second operator (these locations are usually marked with big signs with the text ''Overstappen'' (''Transfer'')). This is order sensitive (so check out first before checking in). If you expect to travel by train only, it's usually easier to buy single-use OV-Chipcards. If you also want to travel by bus, tram, metro or ferry an Anonymous OV-Chipkaart is recommended since it's easier to use and will save you money in the long run. If checking out is impossible (i.e. the check-out device is defective), you can claim refunds with the public transport company involved.\n\nAmsterdam: Checking in/out at combined stations\nBeware of different gates for train (NS) and metro in combined train+metro stations. Check in at the correct gate.\n\n=====Unused credit=====\n\nIt is possible to get a refund of unused credit on Personal and Anonymous cards at a ticket office for a €2.50 fee. The Anonymous and Personal OV-chipkaart have a validity of four to five years. Any credit that's still on an old card can be transferred to a new card; for free if the old card is still valid, or for €2.50 if it isn't.\n\n===By train===\n\nThe country is densely populated and urbanised, and train services are frequent. There are two main types of trains: Intercity trains and Sprinter (or sometimes 'Stoptrein') trains which stop at all stations. An intermediate type 'Sneltrein' is found in a few places. All these types of train have the same prices (you pay about € 0,25 per kilometer[http://www.ns.nl/reizigers/klantenservice/klantenservice/tarieven#index]). There are also a few high-speed trains (such as the 'Intercity Direct' between Amsterdam Central station, this includes Schiphol Airport, and Breda) which are more expensive and sometimes require an extra 'product' to be put on your OV-Chipkaart (see above). Travelling all the way from the north of the country (Groningen) to the south (Maastricht) takes about 4.5 hours.\n\nMost lines offer one train every 15 minutes (every 10 minutes during the rush hours), but some rural lines run only every 60 minutes. Where more lines run together, the frequency is, of course, even higher. In the west of the Netherlands, the rail network is more like a large urban network, with up to 12 trains per hour on main routes. \n\nThe [http://ns.nl/ Nederlandse Spoorwegen (NS)] operates most routes. Some local lines are operated by Syntus, Arriva, Veolia and Connexxion.\n\nBecause of the high service frequency, delays are quite common. However, the delay is usually limited to 5 to 10 minutes. Note though that NS boasts a punctuality of 91.6% (meaning that this percentage of trains departs/arrives within 5 minutes of the scheduled time), which could be higher than you're used to. Trains can be crowded during the rush hour, especially in the morning, but most of the time you'll find a seat. Reserving seats on domestic trains is not possible.\n\nMany tourists experience that they're in the wrong part of a train: many trains are split up somewhere along the way, for different destinations. So watch the signs over the platforms for parts and destinations: ''achterste deel/achter'' means back and ''voorste deel/voor'' means front, referring to the direction of departure. Sometimes trains leave in the direction they came from. Probably a more secure way to know would be the part of the platform: ''a'' or ''b'', also mentioned at time tables etc. Most trains have displays inside (front and back wall of each train section) showing stations and destination, and even information about times and platforms for changing trains. Announcements are made in Dutch when trains are separated. Feel free to ask other passengers (most people will be able to explain in English) or an employee.\nWhen you find yourself in the wrong part of a train, don't worry: you'll have time enough to change at the station where the train is split. \n\n''Schiphol to Amsterdam city''<br>\nAnother frequent surprise involves tourists travelling from Schiphol to Amsterdam. From Schiphol you can travel by train to either ''Amsterdam Centraal'' or ''Amsterdam Zuid (South)'' (or: WTC, Duivendrecht). Tourists heading for Amsterdam City/old town need to go to Centraal but many of them wind up at South. As these railway stations are not connected directly it can take a while to get to the city centre from there. So watch the signs on the platforms. But once you are at Amsterdam Zuid best you can do is take a metro to Centraal (takes about 15 min.), a train back to Schiphol, or to Duivendrecht (direction Amersfoort/Enschede or Almere), change there to Centraal (2nd floor). If you discover it too late you might wind up in another part of the country, especially if you're in an intercity train. If you passed the destination on your ticket and you get 'caught' by the conductor: stay polite and play the ignorant tourist (which is quite adequate). You're not the first.\nBe aware that NS trains have little room for luggage. Big suitcases blocking the paths are a pain for other passengers, so try to keep them between the seats. In some trains you can put them between the back of seats.\n\nThere is a convenient night train service (for party-goers and airport traffic) between Rotterdam, Delft, The Hague, Leiden, Schiphol, Amsterdam, and Utrecht, all night long, once an hour in each direction. In the nights Friday onto Saturday and Saturday onto Sunday, [[North-Brabant]] is also served. You can get to Dordrecht, Breda, Tilburg and 's-Hertogenbosch / Eindhoven.\n\nMany intercity trains, (almost all single-deck trains and a few double-deck trains) have free WiFi internet access (Named ''Wifi in de trein''). Some intercity trains have electrical outlets in the First Class, but it can't be guaranteed.\n\nMost trains have two comfort classes (First Class and Second Class, identified by big '1''s and '2''s on the side of the train). Some regional lines don't have first class. First class can easily be recognized since the seats are usually red (most 'Sprinters' and intercities) or black. Second class have blue or green seats. Some sections in trains are silent zones (which is indicated with a white stripe on the glass with the text '''Stilte - Silence'''. In this zone you aren't allowed to talk or make phone calls (the fine for calling in a silent zone is € 85,-). \n\n====Buying tickets====\n\nThere is one national tariff system for train travel. You don't need separate tickets for other operators (except in some international trains). Tickets are valid on both sprinter and intercity services; there is no difference in price. The most used tickets are the one way (''enkele reis'') and return tickets (''retour''). The latter is valid one day, so you should return on the same day. The price is equal to two 'one way' tickets, so a return ticket offers no price advantage. Single tickets (2nd class) can cost up to €30 and up to €60 for return on very long distances. This is the same as the price as of day passes. \n\nTickets are valid in any train on the route (as opposed to being valid in only one fixed train). You're free to take a break at any station on your route, even if this isn't a station where you need to transfer, and resume your journey later on. As in many countries, there is a difference between first and second class. A second class ticket is 60% of the price of a first class ticket. The main advantage of first class is that it is less crowded, and seats and aisles are generally wider. \nFor children 4-11 y.o. a Railrunner ticket is available for €2,50. The Railrunner ticket allows for free travel for the duration of one day; children need to be with a parent/guardian if they travel first class.\n\nThere is no discount for tickets that are bought in advance, unlike in some countries. The ticket price is uniform and depends on distance between start and destination (sometimes different routes are possible and allowed). Always make sure your OV-Chipkaart is checked in before boarding the train.\n\nTickets can be purchased from machines in stations. Some of the ticket machines, at least one at each station, also accept coins (but no notes). Since August / September 2014, all machines at all train stations accept Mastercard / VISA creditcards with PIN. There is a €0.50 supplement for paying by creditcard and a €1 supplement for buying a disposable, single-use, chipcard. Only larger stations have ticket counters. All ticket machines have English-language menus available. A common mistake made by foreigners is accidentally getting a 40% discount ('korting') ticket from the machine. A special discount-card is required for these tickets, although you can travel on other people's discount cards too (Tip; you can ask a student to travel along with you, his so-called ''Studentenreisproduct'' allows for three people to ride with a 40% discount). (See [[#Discount rail pass|Discount rail pass]]). If you have trouble using the ticket machine, ask someone else for help; almost everyone speaks English and will help you out. It is also possible to [https://www.ns.nl/eticket/ticket?language=en buy e-tickets online], although a Dutch bank account for payment (iDEAL) is necessary. Unfortunately, some tickets can only be bought online. For example group tickets, these tickets are low-priced from €7,00 till €13.75 (only depending on group size, price for all distances) for a day retour ticket.\n\nYou must '''buy a ticket before travelling'''—since 2005, you can no longer simply buy a ticket from the conductor, as in some other countries. If the conductor asks you for your ticket but you can't show any, you'll have to pay the ticket (without any discount) plus a € 35,- fine. If the ticket machines are defective, go to the conductor immediately when boarding. The conductor is not allowed any discretion on this policy, though being polite and pretending to be an ignorant tourist ''might'' help you get away with having an invalid ticket. In worst case though, if you do not have either enough cash, or a passport, you could be arrested by railway police. The only exception to this rule is the [http://www.grenslandexpress.nl/ Grensland Express] that connects Hengelo to Bad Bentheim (Germany), where you have to get the ticket from the conductor and the OV Chipkaart is not valid.\n\n====In the station====\n\nWhile many villages have small stations with only one or two platforms and no railway staff, cities like Amsterdam and Utrecht have large central stations with up to 18 platforms. It can take 5-10 minutes to move from one platform to another, especially for people not familiar with the station.\n\nThe platforms are all numbered. When platforms are so long that two or more trains can halt at the same platform, the different parts of the platform are indicated with the lowercase letters a/b/c, these signs are blue and have the platform number, followed by the letter (e.g. 14b) printed on them and are usually located next to the monitors containing train information. On some stations, capital letters are used to indicate which part of the train stops at which part of the station (usually seen at stations where international trains arrive), these signs are white, significantly smaller than the blue platform signs, and have only the capital letter on them.\n\nTime tables can be found in the station hall and on the platforms. All train tables are normally yellow, with exceptions for the different schedules during planned maintenance works (blue) and queen's day (orange). Departing trains are printed in blue (on yellow tables), arriving train tables in red. Unlike in other countries, the tables themselves are not ordered by time of departure, but by direction. In some cases, more than one table is necessary to cover a single day for a certain direction. Additionally, all stations have blue electronic screens, indicating the trains departing during the next hour (which include delays and/or cancellations).\n\n*NOTE: Dutch trains tend to be VERY punctual. This means that the train leaves the station the moment the clock strikes the appointed time. Thus, the doors tend to close a little earlier, around 30 seconds before. Be sure to be on the platform, ready to board, at least 3-5 minutes before the published departure time—especially during peak hours and/or on a crowded route.\n\n====Discount rail pass====\n\nVisitors planning to travel by train in the Netherlands should consider the [[Eurail]] pass with the Benelux package.  This allows for unlimited train travel within Belgium, the Netherlands, and Luxembourg over multiple days. Europeans, not being eligible for Eurail passes, should look into [[Inter Rail]] Passes for their discount train travel.  \n\nIf two or three people want to travel around the Netherlands together for a few days during the summer, the ''Zomertoer'' may be used. This pass gives them two, not necessarily consecutive, days of unlimited travel. An add-on also allows you to travel on all other public transportation in the country. In autumn weekends, the ''Herfsttoer'' also gives some discounts. These packages may or may not be available since they're bound to seasons.\n\nIf you're thinking of staying a longer time in the Netherlands it can be a good deal to get the ''Dal Voordeel Abonnement'' (Off-peak discount)[http://www.ns.nl/reizigers/campagnes/nieuwe-abonnementen#dal-voordeel], which gives the cardholder (and up to three additional persons travelling with him or her) 40% off for one year on NS trains, except when travelling during peak hours (working days 6.30-9.00h and 16.00-18.30h, except holidays). The subscription costs € 50,- for one year (2014). The subscription includes a personal OV-chipkaart which takes 2 weeks to process. If you already have one, the subscription can be loaded onto your own personal OV-chipkaart. Remember that you always have to check in and out, the discount will be automatically applied, depending on the time of check in. Depending on your travel pattern, NS also have monthly and yearly subscriptions for free travel in weekends, off-peak hours or the entire subscription period including peak hours, and also a subscription that offers a 40% discount for the entire period including peak hours.\n*The accompanied traveller discount can be loaded easily at any kiosk.\n\nIf you are in the Netherlands for only one day and want to see much of the country by train, you may want to get a \"Dagkaart\" (day pass), for € 50,80 (2014)), valid in 2nd class on all non-surcharge trains in the Netherlands (thus excluding the Fyra and international trains, but including local companies. These trains are marked by a white bar on the displays stating ''Een extra toeslag is mogelijk van toepassing op deze trein''). Sometimes different stores sell \"Dagkaart\" at a cheaper rate (€ 13 or € 16), however those are just tokens (only valid in a certain time period possibly weeks AFTER the day you purchased these tokens) you use on the NS website in order to change them to tickets (see instructions on the token or receipt itself). These tickets are bound to a name and date and the procedure is all in Dutch but pretty self explanatory. You also need to print these cards out, tickets displayed on an electronic screen (smartphone, tablet etc) will not be accepted. The cheaper € 13 ticket is only valid on weekends (Saturday, Sunday and holidays) while the € 16 ticket is valid every weekday after 9 AM and all day in the weekends and holiday. Stores that sell these reduced day tickets are Kruidvat, Blokker, Intertoys, HEMA and Albert Heijn as long as supplies last. \n\nFor an additional 5,50 you get the OV-Dagkaart, which adds free transport on bus, tram and metro.\n\nThe NS train service also has a [http://www.spoordeelwinkel.nl/ special website] with which you can buy combined tickets to various tourist attractions (e.g. 20% discount + free train connection). However, the website is exclusively in Dutch and a Dutch bank account is needed in order to buy the tickets (payments are processed by iDeal).\n\n===By bus===\nThe network of regional and local buses in the Netherlands is fine-grained and frequent and usually connects well with the train network; you can reach most small villages easily. However, for long-distance travel, these regional buses are not convenient at all, and are much slower than the train.\n\nFast long-distance buses are only available on a small number of routes that aren't covered by the rail network; these buses have special names that differ by region, such as ''Q-liner,'' ''Brabantliner'' and ''Interliner,'' and special tariffs.\n\nThere are four main bus companies in the Netherlands, ''Connexxion,'' ''Keolis,'' ''EBS,'' ''Arriva'' and ''Qbuzz.'' A few large cities have their own bus company.\n\nA big downside regarding the busses is that bus lines are very indirect. For example, if you want to travel from Amsterdam to Rotterdam, you have to change three or more times to get all the way there. In short: bus journeys will almost always take longer than train travel. For example, trip to Rotterdam from Utrecht will take 40 minutes, but in the Bus it will take 1 hour and 30 minutes. However, if you want to enjoy the countryside and villages you can prefer the bus trips.\n\nMany companies and regions have their own bus discount tickets, which are often cheaper than using credit on the OV-chipkaart. Especially on longer rides they will be cheaper then the OV-chipkaart.\n\nPark-and-ride-(travel-)tickets: some towns and cities have special cheaper bus tickets from car parks near the city limits to the city centre, for outside rush hours, usually a return ticket.\n\n==== Night buses ====\nAmsterdam, Rotterdam, The Hague, Utrecht, Nijmegen and Arnhem offer public transport at night. Only Amsterdam has a service all night and every night; in the other cities it is more limited to the beginning of the night or only during the weekend. Several other cities and regions also have night buses, usually even more limited.\n\nYou might need special night-bus tickets so be sure to check the city pages.\n\n===Metro, tram===\nThe two largest cities, [[Amsterdam]] and [[Rotterdam]], have a metro network which runs mainly on elevated railways outside the city centres, and underground within the center. Furthermore there is a large city tram network in the agglomerations of Amsterdam, Rotterdam and The Hague; Utrecht has two ''sneltram'' lines (fast tram or light-rail).\n\n===Travel information===\n*'''9292.nl - Journey planner for all Dutch public transport'''[http://journeyplanner.9292.nl/] - All public transport companies participate in the OV Reisplanner, which can plan a door-to-door trip for you using all public transportation types. The site mostly relies on scheduled detours, but delays are incorporated to a limited degree. 9292 OV-informations is also available by telephone: 0900-9292 (€ 0,70 per minute/max. € 14,-).\n*'''Nederlandse Spoorwegen (Dutch Railways)'''[http://www.ns.nl/en/] - Information about the trains can be found at the Nederlandse Spoorwegen (NS) website , which includes a trip planner which uses the latest information about train delays and detours. For the information of the other transport types they use 9292ov information.\n*'''Google Maps (Transit)'''[http://maps.google.nl/?hl=en] - Some public transport is also in Google Maps, the planner is however not reliable. Beside is has no current information it makes lot of mistakes. This year more transport companies will participate, and Google will enhance the planner.\n*'''During the journey''' - At large train stations are (yellow) information desks, at most smaller stations there is an information/SOS kiosk. If you push the blue information button you are connected to an operator from 9292ov. If you ask train-staff, they often look for you in their smart-phone journey-planner. Almost all vehicles have digital displays with current travel information. Most train platforms and some bus stops have electronic information. Both 9292ov[http://m.9292ov.nl/] and NS[http://m.ns.nl/planner.action?lang=en] also have mobile sites.\n\n===By car===\nA car is a good way to explore the countryside, especially places not connected by rail, such as Veluwe, parts of Zeeland and The North Sea islands. The motorway network is extensive, though heavily used. Congestion during peak hour is usual and can better be avoided. Roads are well signposted. Driving is on the Right side.\nWhen driving in cities, always give priority to cyclists when turning across a cycle lane. If you are involved in a collision with a cyclist, you will be automatically liable (though not guilty) unless you can prove that the cyclist was in error, in which case you will be deemed half liable. If you can definitively prove that they were both in error and trying to hit you, and the person hit was 14 or older, they will 100% liable. If you wish to see only cities, a car is not the best option. Due to limited road capacity and parking, cars are actively discouraged from entering most bigger cities. \n\nP+R '''park and ride''' facilities are available at the outskirts of bigger cities; you can park your car cheaply there, and continue your journey via public transport (often free or with a discount when you have parked at the P+R). \n\nRoad signs with directions are plenty, but having a map is useful, especially in cities where there are many one way streets, and getting from one part of the city to another is not always so straightforward. Be careful not to drive on bus lanes, often indicated with markings such as ''Lijnbus'' or ''Bus'', nor on cycling paths, marked by the picture of a bicycle, or by a reddish colour of asphalt. \n\n==== Rules regarding Public Transport ====\n\n'''Public transport buses have the priority when leaving a bus stop''', so be careful as they may pull in front of you expecting that you will give way. Furthermore, in cities where there are streetcars (Amsterdam especially), remember that '''Streetcars always have priority under every circumstance'''. Note that some tram stops are in the middle of the road, so passengers exiting the streetcars will cross the street in order to get to the sidewalks. '''Exiting streetcar passengers always have priority''' so be careful when driving past a streetcar that stopped.\n\n==== Speed limits ====\n\nThe speed limit in built up areas is 50 km/h with some zones limited to maximum of 30 km/h. Note that 30 km/h zones are home of unmarked intersections (so '''all''' traffic from the right has right of way!). Outside of towns speed is limited to 80 km/h (this includes most N-roads, though some are restricted to 70 or 100). On some local roads the speed limit is 60 km/h. The maximum speed limit on the highways is 130 km/h, however this might depend on the time you are driving, as well on the opening of the spitsstroken (rush hour lanes, indicated by long interrupted lines; when open, the speed limit is 100 or 80 km/h. This is indicated by a green arrow (open) or red cross (closed)). This is always designated next to the highway, but this is confusing even for locals, so remember this when driving on a highway:\n\n* If there are no signs whatsoever, you may drive 130 km/h.\n* If there are signs saying 120, 100, 80, the top speed at all times is (respectively) 120, 100, 80 km/h.\n* If there is a sign saying 120 (6-19) the top speed is 120 km/h between 6 AM and 7 PM, and 130 at all other times.\n* If there is a sign next to or in proximity of the 120 (6-19) sign saying 100, the top speed is 100 '''until''' you see a sign stating 120, '''not 120 (6-19)!'''\n* Speed indicated on the dot matrix signs above the lanes '''always''' take precedence over anything else you see, both when the speed is in a red circle (the regular speed limit) or without (an incidental speed limit, indicating traffic or construction). A white circle with a diagonal bar in it indicates 'end of all speed limits from dot matrix signs' from which moment on you obey the ordinary signs.\n\nThese limits are strictly enforced and the fines are very heavy (see below)!\n\n==== Fines ====\n\nYour speed will be checked nationwide by the police and fines are heavy. Exceeding the maximum speed with more than 50km/h will result in seizure of your driving licence. After that driving is considered a criminal act. Pay extra attention to '''Trajectcontrole''' signs: that means that in the road you're driving there is an automatic system that checks your average speed on a long section. Radar detectors are illegal devices to have in your car. They will be impounded and you will be fined &euro;250. Keep in mind that the police use so-called radar detector detectors to track down radar detector users, so it is best to turn them off. \nHowever, you can install the Flitsmeister app on your smartphone. This app warns you for all known radars and \"Trajectcontroles\". Using this app is free and legal.\n\nDrinking and driving is not allowed and this is enforced strongly. Breathalyzer tests occur frequently (especially during the weekends), both on an individual basis (i.e. you get pulled over and the police see it necessary for you to undergo a breathalyzer test) as on a bigger scale (i.e. the police has set up a designated control checkpoint on a highway). \n\nAn unbroken yellow line next to the sidewalk means '''no stopping''', a broken yellow next to the sidewalk means '''no parking'''. Some crossings have \"shark teeth\" painted on the road, this means you have to give way to the other traffic. \n\nNote that police also use unmarked traffic surveillance cars, especially on the highways. They have a video surveillance system and often they '''don't''' stop you right after doing a violation but they keep on following you. That means if you do more violations, you'll be fined for everything you did. Note that the policemen in unmarked cars are '''obliged''' to identify themselves after pulling you over, which means you shouldn't have to ask. Policemen in marked cars have to show their ID only when you ask them for it, but they too are obliged to show it when asked.\n\nParking fees within cities can be pretty steep. When considering going to bigger cities, such as Amsterdam, Utrecht, and Rotterdam, consider use of public transportation to avoid traffic jams and the great difficulties involved in finding a parking spot. Note that a blue line on the road or on the sidewalk next to the road indicates that you need to have a ''parking disc'' indicating the time of arrival. You may stay up to half an hour (usually) without paying. Not having a parking disc or staying too long results in a fine.\n\n==== Breaking down ====\n\nYou might use a mobile phone to reach the ANWB [http://www.anwb.nl/] autoclub via toll-free number 0800-0888; your membership of a foreign autoclub might entitle you to discount rates on their services. Leased (business) cars and rental cars are usually serviced by the ANWB services included in the lease/rental price; but you may want to check any provided booklets.\n\nIf you are involved in an accident, both drivers need to complete and counter-sign a statement for their respective insurance companies (damage form/\"schadeformulier\"). You are required to have this form on hand. The police need to be notified if you have damaged (public) property (especially along the highways), if you have caused any sort of injury, or if the other driver does not agree to sign the insurance statement. It is illegal to hit and run. If the other driver does this, call the police and stay at the scene. The emergency telephone number is 112 (tollfree, will even work from disconnected mobile phones); the telephone number for non-emergency police presence is 0900-8844.\n\n==== Fuel ====\n\nFuel is easy to come by, but extremely expensive! The Netherlands have the doubtful title for having the most expensive fuel prices in the world for 20 years. It is better to refuel your car for 100% before going in the Netherlands, since the Belgian and German fuel prices can be €0,30 lower. If it's truly desperately needed, only try to tank at unmanned gas stations, such as TanGo or Firezone. They save up to 10 cents, but are still far more expensive than their Belgian counterparts. Prices of fuel are, as of 2017, €1,65 a litre in manned stations (which equals $6.60 per US gallon). Along highways many gas stations are open 24/7. More and more unmanned gas stations can be found, even along highways, selling petrol cheaper. These unattended stations accept all common debit and credit cards. All gas stations sell both petrol and diesel; the \"premium\" brands have the same octane level (they allegedly contain compounds that improve fuel efficiency to offset the higher price). Liquid Petroleum Gas is sold at relatively many gas stations along the high ways, but it is never sold in built-up areas. The symbol for LPG gas is a green-collared petrol pump icon, set beside the general case black-collared petrol pump icon. LPG fuelled cars need regular petrol to start the motor, and can also be operated using strictly petrol, though it is more expensive.\n\nIf you come in the Netherlands with your LPG fuelled car, probably you will need an adaptor. If you buy in your country, ask for the ''specific'' Dutch adaptor. The plug sold as \"european\" (screw style), is used in Belgium, Luxembourg and Germany but won't fit Dutch pumps.\n\nGetting a public charging point for electric cars is quite hard to come by, and are only located in city centres generally. Public charging points can be found at [http://www.oplaadpalen.nl/]. \n\nThere are currently 2 hydrogen gas stations in the Netherlands, Arnhem and Amsterdam, although more are planned in e.g. Rotterdam.\n\n===By taxi===\n\nTaxi service was traditionally a tightly guarded monopoly. In recent years, the market was deregulated, but prices are still high. Taxi drivers are licensed, but they do not, as of yet, have to pass a proficiency exam, providing they know the streets. This is planned in the future, since the taxi market is being re-regulated. In the bigger cities taxi drivers can be un-friendly to very rude. One will find that especially in the western part of the country the cost of a taxi are very high for very little politeness and service. The public transport system often proves to be cheaper and a lot faster.\nIf you have to rely on a taxi, there is a free smartphone app [http://www.tomtomtaxi.com/nl_en/] for ordering taxis in most of the major cities in the Netherlands that gets you a responsible driver, and helps you keep track of the route and price.\n\nSome taxi drivers refuse short rides (e.g. under &euro;10). This is illegal, but it's hard to enforce this prohibition. There is a maximum tariff (about €3.00 curb call plus €2.10 per km traveled), and it's built into the taxi meters. If you negotiate a price before you get in, the price you have to pay is the negotiated price, or the metered price, whichever is lower. Getting in a cab without enough money to pay for the ride is illegal, so it's wise to negotiate a price. Note that most taxi's only accept payment in cash, debit or credit cards cannot be used. Around Amsterdam and to some extent Utrecht, Uber taxi's are available and can be paid for online. \n\nAll legal taxis have blue license plates. So do some other vehicles for group transport, such as minibus services for the handicapped.\n\n===By thumb===\nMaking your way on thumb is accepted, works quite well and locals that take you typically expect no payment in return. It's also suited for short rides from small towns or minor streets, there might be less traffic, but in general drivers will be more likely to stop. Hitch-hiking ''on'' the highways/motorways is not allowed but generally tolerated on the on-ramps and other access points, provided you do not create a dangerous traffic situation. Try to stay before the traffic sign \"highway/motorway\" on a spot where cars have slow speed and where it is possible for drivers to stop and let you get in. The same safety rule applies to highway gas stations and rest places, and to traffic lights on non-motorway roads.\n\nFor longer distances, the large amount of highway crossings make it difficult to find a driver going to your exact destination, while the limited number of gas stations make it hard to change cars half way. A simple (cardboard) plate with your destination written on it is a common way to increase chances of finding the right driver, and may also convince suited drivers that they will not be stopping in vain.\n\nThere are official hitch-hiking spots (''liftershalte'') (lift-stops) and recommended unofficial spots at the centre or edge of a few major cities:\n\n====Amsterdam====\n[[Image:Bernhard_Hitch.jpg|thumb|Liftplaats at Prins Bernardplein]]\n* Prins Bernhardplein , before NS Station Amsterdam Amstel (on east side of the river Amstel) (past the bus stop).  Leads to the ramp of the S112 of the A10, direction E231-A1/E35-A2. It is recommended for the directions Middle-/East-Netherlands. For other directions/routes try also alternative spots.\n'''Alternative spots / other directions'''(recommended for the directions West-/South-Netherlands):\n* Amstel (on the west side of the river Amstel) near traffic-lights/Utrechtsebrug and near beginning-/end-stop of Tram-line 25. Leads to the ramp of the S111 of the A10, directions E35-A2-E25/E231-A1. \n* Junction S109 of the A10, close to NS Station RAI (RAI Congress Centre; specially when there are large events or congresses). Leads to the ramp of the S109 of the A10, directions E35-A2-E25/E19-A4/E231-A1.\n*At bus stop Amstelveenseweg / Ringweg Zuid just northeast from metro station Amstelveensweg. There is an on-ramp which leads to the A10 North, A4 South and A9 (both directions). What makes this location convenient is that cars can easily stop in the bus lane in order to pick you up.\n\n====The Hague====\n* Utrechtsebaan next to the northside of the Malieveld, at the beginning of the E30-A12 towards [[Utrecht]]. Also possibilities towards E19-A4 [[Delft]]-[[Rotterdam]] or E19-A44 [[Leiden]]-[[Amsterdam]] \n'''Alternative spots / other directions:'''\n*  edge northwest-side of Malieveld/crossing Zuid-Holland-laan/Utrechtse baan/Benoordenhoutseweg, towards Leidsestraatweg N44 and [[Leiden]] E19-A44 and [[Amsterdam]] E19-A4.\n\n====Nijmegen====\n* Graafseweg ([[Venlo]] and [[Den Bosch]]), at the major city-centre roundabout (''verkeersplein'') Keizer Karelplein (hitch-hiking on the roundabout itself is not recommended)\n* near the Waalbrug/before the bridge in direction [[Arnhem]], \n* at the Annastraat, close to the Radboud University (RU)/University Medical Centre (UMC)\n* at the Triavium, across shopping centre Dukenburg\n\n====Other cities:====\n* '''[[Groningen]]''': Emmaviaduct (''200m west of Centraal Station''), on the road to A28\n*'''[[Maastricht]]''' at the beginning of A2 near the soccer-football stadium 'De Geusselt', to E25-A2 ([[Eindhoven]]) and A79 ([[Heerlen]]).\n*'''[[Utrecht]]''' close to petrol station and ramp of the Waterlinieweg near 'De Galgewaard' soccer-football-stadium, north to A27/A28, south to A2/A12/A27.\n\n===By bicycle===\n\nCycling in the Netherlands is much safer and more convenient than in other countries, because of the infrastructure - cycle paths, cycle lanes, and signposted cycle routes. However, the proliferation of bicycles also means that you're seen as a serious part of traffic - motorists and other cyclists will hate you if you don't keep by the rules or if your cycling skills are not up to scratch. Some things to know:\n\n* Cycle lanes and cycle paths are indicated by a round blue sign with a white bike icon, an icon on the asphalt, or by red asphalt. Using them is mandatory.\n* Cyclists must obey the same traffic signs as motorists, unless exempted. For example, a cycle icon under a no-entry sign, usually with the text 'uitgezonderd' (except), means cyclists may use the street in both directions.\n* Where there is no cycle lane or path, use the regular road. This is unlike the rule in Germany and Belgium, where you are supposed to use the footpath in many places.\n* On some narrow streets that do have a cycle path parallel to them, mopeds may be required to use the cycle path, rather than the main street (as is usual).\n* Bicycles must have working front (white) and rear (red) lights. Reflectors are ''not'' sufficient. You may be fined (€ 40) for cycling in the dark without a light, and you seriously endanger yourself and other traffic by doing so. Small, battery-operated LED lights attached to your person are allowed.\n\nThere are different ways to use a bicycle:\n\n* if you are staying in a city, you can use the bike as a means of transport, to get from A to B. This is the way local people use it, for short journeys it is faster than car, bus or tram. You can use the bike to get to places near the city, which may not be accessible by public transport. '''If you choose to do this, make sure you are trained and you have a 'working knowledge' of riding a bike'''. You can seriously endanger yourself and/or other cyclists if you don't know how to handle a bike.\n* you can cycle around on the bike, in a city, or in the surrounding area. The bike is then a means to see places and landscapes. The many '''signposted cycle routes''' are designed for this, most of them are octagonal and take you back to the starting point. Some rural routes go through areas inaccessible by car. Signs for bicycle routes are usually white, with a red border and lettering. In most of the Netherlands it's possible to create your own routes by connecting marked and numbered points called \"knooppunten\".\n* you can take the bike on a train, for a day trip to another city or region. It costs  € 6, and you may not travel with a bike in the rush hour. You must carry a supplementary ticket called \"dagkaart fiets\", which is easily obtained from the automated kiosks. As an alternative, you can easily rent bikes at (or near) stations.  Folding bikes can be taken on board for free when folded.\n* you can load your tent on the bike, and set off across the country. For this you do need to be fit, and not afraid of rain. The national '''long-distance cycle routes''' are designed for this type of holiday, see Cycling in the Netherlands Long-distance routes [http://holland.cyclingaroundtheworld.nl/Wheretogo/WhereToGo-LongDistance.html].\nThe best online routeplanner for cyclists can be found at [http://www.fietsersbond.nl/fietsrouteplanner/fietsroutes-vandeurtotdeurplanner/index.html] a wikiplanner made by volunteers of the Dutch cyclist union \"Fietsersbond\".\n\n====Bike theft====\n\nBike theft is a serious problem in the Netherlands, especially around train stations, and in larger cities. If possible, use the guarded bike parking ('stalling') at train stations and in some city centres. They will cost up to €1.25 per day. In general, '''use 2 locks of different kinds''' (for example, one chain lock and one tube lock). This is because most bike thieves specialize in a particular kind of lock, or carry equipment best suited to one kind of lock. Ideally, you should lock the bike to a lamppost or similar. Bike thieves have been known to simply pickup unattached bikes and load them into a pickup truck, so they can crack open the locks at leisure.\n\nIn cities, most bikes are stolen by drug addicts, and they sell most stolen bikes too. They often simply offer them for sale to passers-by, if they think no police are watching. Buying a stolen bike is itself illegal, and police do arrest buyers. If you buy for a suspiciously low price (e.g. € 10 to 20), or in a suspicious place (in general, on the street), the law presumes you \"know or should have known\" the bike was stolen. In other words, actual ignorance of the bike's origins is no excuse. \n\nBike shops are the best place to buy a second-hand bike legally, but prices are high. Some places where you can rent bikes will also sell their written off stock, which is usually well maintained. Most legal (and often cheap) second-hand bike sales now go through online auction sites like marktplaats.nl - the Dutch subsidiary of Ebay.\n\nThe Dutch bicycle-share system \"OV-fiets\" is only accessible for residents of the Netherlands or those who have a Dutch bank account. The member fee of 9 Euros a year and 3 Euros per trip is written of automatically.\n\n====Extra legal protection====\n\n\"Weaker\" parties in traffic such as cyclists and pedestrians enjoy extra protection from the law regarding liability when an accident occurs with a \"stronger\" party (e.g. cars). The basic idea is that the stronger participant (e.g. a car driver) is ''always'' liable when an accident occurs between a weaker (e.g. a cyclist) and the stronger party, ''unless'' force majeure can be proven. Force majeure is here defined as (1) the car driver was driving correctly and (2) the faults of the cyclist were so unlikely that the car driver did not have to accommodate his driving for them. When this cannot be proven, the car driver is liable, but this can be limited when the accident can be attributed to the behaviour of the cyclist, up to 50% (more if the cyclist was consciously being reckless).\n\nThe burden of proof for force majeure, for faults of the cyclist and for recklessness are with the car driver. Such things can be hard to prove, which is why some people take this rule to mean that cyclists/pedestrians always have right of way, but this is incorrect.\n\n===By plane===\nDue to the small size of the country as well as the abundance of road and rail connections, domestic flights have proven to be unprofitable in the past. Therefore, none exist at the moment.\n\n==Talk==\nThe national language in the Netherlands is [[Dutch phrasebook|Dutch]]. It's a charming, lilting language punctuated by phlegm-trembling glottal ''g''s (not in the south) and ''sch''s (also found, for example, in Arabic). Dutch, especially in written form, is partially intelligible to someone who knows other Germanic languages (especially German and Frisian), and you might be able to get along at least partially in these languages if spoken slowly.\n\nBesides Dutch, several other languages are spoken in the Netherlands, in the eastern provinces of Groningen, Overijsel, Drenthe and Gelderland people speak a local variety of Low Saxon (Grunnegs or Tweants for example). In the southern province of Limburg the majority speaks Limburgish, a language unique in Europe because of its use of pitch and tone length to distinguish words (for example: 'Veer' with a high tone means 'we', while the same word with a low tone means 'four').\n\nOfficially, the Netherlands is bilingual, as Frisian is also an official language. Frisian is the second closest living language to English. Despite its status as official language, it is spoken almost exclusively in the province of [[Friesland]]. Other forms of Frisian are also spoken by small minorities in Germany. When travelling through Friesland you will come across many road signs in two languages (similar to Wales and South Tyrol). This is also the case in southern Limburg. Everybody speaks Dutch, but the Frisians are so protective of the minority language that ordering a beer in it might just get you the next one free. \n\n\"They all speak English there\" is quite accurate for the Netherlands. Education from an early age in English and other European languages (mostly [[German phrasebook|German]] and to a lesser degree French) makes the Dutch some of the most fluent polyglots on the continent, and the second most English-proficient country in the world where English isn't official (after Sweden; 90% of the population speaks at least some English). Oblivious travellers to the major cities should be able to make their way without learning a word of Dutch. Dealing with seniors or finding yourself in a family atmosphere, however, will probably require learning a bit of the native tongue.\n\nIn areas bordering Germany, German is widely spoken. However, outside of the eastern provinces, a good amount of people (especially amongst the younger generation) can also speak basic German too. French will be understood by some as well, especially the older generations. Immigrant languages are prominent in urban areas, they include Turkish, Berber, Sranan-Tongo ([[Suriname]]) and Papiamento ([[Netherlands Antilles]]).\n \nForeign television programmes, films and are almost always shown in their original language with subtitles.  The same is true for segments in locally/nationally-produced programmes that involve someone using a foreign language.  The major exception is children's programmes, which are dubbed into Dutch.\n\n==See==\n\n===Traditional Netherlands===\n\n[[Image:Zaanse Schans - Windmills 3.jpg|350px|thumb|Zaanse Schans]]\n\nFor many foreigners, nothing captures the idea of the Netherlands more vividly than windmills, wooden shoes, tulips, and remarkably flat lands. Although some of these characteristics have evolved into stereotypes far off from the daily lives of Dutch people, there's still a lot of truth to them and plenty of authenticity to be found. The Dutch have preserved many elements from this part of their past, both for touristic and for historic reasons.\n\n[[Kinderdijk]] boasts a network of 19 windmills, once used to drain the adjoining polder. The [[Zaanse Schans]] has windmills as well, and a nice museum with traditional crafts and old Dutch houses on display. [[Schiedam]], world-famous for its ''jenever'', has the tallest windmills in the world, and they're right in its lovely old town centre.\n\nThinking about the Dutch countryside, you might imagine wide, flat, grasslands with black and white cows. If you do, you're not that far off. A large swathe of the country, especially the western part of it, consist of polders; reclaimed land separated by ditches. These rural areas are dotted with picturesque villages, old farms, impressive summer estates, and of course, windmills; the [[Waterland and Zaan Region]] is especially scenic. For a touch of folklore, see the traditional clothing and fishermen boats in [[Volendam]] or [[Marken]].\n\nThe Netherlands is a major international player in the flower industry. The tulip fields are seasonal, and are specific to the [[Bulb Region]] and some areas in [[North Holland]]. They are a lovely Dutch alternative to the lavender fields you could find in France. The famous [[Lisse|Keukenhof]], the world's largest flower garden, only opens between March and May. It is a great way to see what the Dutch flower industry has to offer. Another way to see the Dutch proudly present their flowers is by visiting a '''flower parade''', called Bloemencorso. In a parade of this kind the floats (praalwagens), cars and (in some cases) boats are magnificently decorated or covered in flowers. Each parade has its own character, charm and theme. Many towns and regions in the Netherlands hold parades every year. \n\nThey make great destinations for a recreational bike trip or can serve as a laid-back base, from where you can explore cities in the area. The rolling hills of [[South Limburg]] have characteristic timber-framed houses and a lot of castles. The province of [[Gelderland]] combines its many castles ('''Palace 't Loo''' in [[Apeldoorn]] being the highlight) with the natural scenery of the [[Veluwe]]. Don't worry if you're headed elsewhere: you'll find a beautiful countryside in every Dutch province.\n\n===Historic cities===\n\nWandering through the magnificent city of Amsterdam, with its lovely canals and hundreds of 17th century monuments, is a delightful experience. For most people, a visit to the Netherlands would not be complete without a good day in its bustling capital. Nevertheless, it is only one of many towns in the country that offers a beautiful, historic centre.\n\nBefore Amsterdam's rise to fame in the late 16th century, the fortified city of [[Utrecht]] was the country's most important town. Much of Utrecht's mediaeval structures remain, with canals flanked by wharf-based structures, lots of buildings from the Early Middle Ages and some impressive ancient churches. [[Maastricht]] is often claimed as the most beautiful city of the country. It is known for its romantic lanes, ancient monuments, and for what the Dutch call its \"Burgundian\" atmosphere.\n\n[[Leiden]], the birthplace of Rembrandt and home to the oldest university of the country, is yet another beautiful place with canals, narrow streets, and over 2,700 monuments. [[The Hague]] is often called the \"judicial capital of the world\", as it famously hosts the Peace Palace and many international organisations. It has a spacious layout, with large estates, and the ancient Binnenhof, where the Dutch government had its seat for centuries. Also consider the gorgeous old town centres of [[Haarlem]], [[Delft]], [['s-Hertogenbosch]], [[Alkmaar]], [[Gouda]] and [[Amersfoort]].\n\n===Art museums===\n\nConsidering its small size, this country has brought forward an impressive number of world-famous painters. Arts and painting flourished in the 17th century, when the Dutch Republic was particularly prosperous, but renowned artists have lived in the country before and after that age as well.\n\nRembrandt, Johannes Vermeer, Vincent van Gogh, Frans Hals, Jan Steen, Jacob van Ruysdael, and Piet Mondriaan are just a few of the Dutch painters whose works now decorate the walls of the world's greatest museums. Fortunately, some of these world-class museums can be found in the Netherlands as well. The [[Amsterdam/South|Museum Quarter]] in [[Amsterdam]] has the '''Rijksmuseum''', the '''Van Gogh Museum''' and the '''Stedelijk Museum''' right next to each other, all three with excellent collections. The '''Museum Boijmans Van Beuningen''' in [[Rotterdam]] also has a huge collection of drawings, including Rembrandt, Van Gogh, and foreign masters.\n\nThe '''Kröller-Müller Museum''' is beautifully located in the [[Hoge Veluwe National Park]], with the second largest Van Gogh collection in the world (after the Van Gogh Museum in Amsterdam). Less focused on Dutch art, but with a unique modern collection, is the '''Van Abbe Museum''' in [[Eindhoven]]. Other cities with notable art museums include [[Groningen]] with the '''Groninger Museum''', and [[Haarlem]] with the '''Frans Hals Museum'''. The newly established '''Hermitage''' in [[Amsterdam]] has all the grandeur of its big sister in [[Saint Petersburg]], with changing Russia-oriented exhibitions on display.\n\n===Living with the water===\n\n[[Image:Deltawerke-Oosterschelde-Sturmflutwehr_Strasse.jpg|350px|thumb|Oosterscheldekering, part of the Delta Works]]\n\nThe Dutch are famous for their struggle with the sea. As a former naval power, the Netherlands owed its 17th century Golden Age to the water, and still depends heavily on it for modern day trade and fisheries, as the massive, modern port of [[Rotterdam]] demonstrates. However, with much of the country's land below sea level, the water also caused terrible floods and great losses over centuries.\n\nDutch attempts to protect their lands with dikes are well recorded from the 12th century, but started around 2,000 years ago. An enormous flood in 1287 created the large Zuiderzee, an inland sea that is now known as the IJsselmeer. From that period onwards, a long process of reclaiming lands lost to the sea began. Windmills and extensive networks of dikes were created to pump out the water, slowly creating the characteristic polders. One of these polders is the [[Beemster|Beemster Polder]], and when you visit you get a few fortifications of the Defence Line of Amsterdam included as a bonus.\n\nAfter another devastating flood in 1916, the country started the '''Zuiderzee Works''', a massive undertaking to reclaim and tame the Zuiderzee once and for all. In the 1930s, the impressive [[Friesland#Afsluitdijk|Afsluitdijk]] was finished, which turned the inland sea into a fresh water lake called the IJsselmeer. The '''Zuiderzee Museum''' in lovely [[Enkhuizen]] is devoted to the cultural heritage and folklore of the region, as well as the maritime history of the Zuiderzee.\n\nAnother devastating flood struck the country in 1953, recording 1,836 deaths in the province of [[Zeeland]]. In the following fifty years, the famous [[Delta Works]] were constructed to protect the south-western portion of the Netherlands from flooding. It can be visited at various visitor centres, the most notable of which is the '''Neeltje Jans''' park near the '''Oosterscheldekering''' (Eastern Scheldt Storm Surge Barrier). The American Society of Civil Engineers have recognised the Zuiderzee Works and the Delta Works collectively as one of the Seven Wonders of the Modern World.\n\n===Sinterklaas===\nSinterklaas is a traditional winter holiday figure still celebrated today in the Netherlands and a few other countries. His birthday (December 6th) is celebrated annually on Saint Nicholas' eve (December 5th). Since the celebration is a family affair, the chance is small to see the celebration as a tourist. Sinterklaas traditionally arrives in the Netherlands each year in mid-November (usually on a Saturday) by steamboat from Spain. The Sinterklaasintocht (his arrival and walk through the city) is public and organized by almost every city. From his arrival until his celebration, you can walk into Sinterklaas or the 'zwarte pieten' (which are his helpers) in shopping malls. \n\nZwarte Piet is felt by some to be racist, because these black men are the helpers/servants of the white skinned Sinterklaas. Today, Zwarte Pieten have become more modern servants and parents often tell their children that the Pieten have black faces because they climb down dirty, soot-filled chimneys. The discussion about Zwarte Piet being racist or not, intensified as of 2013. Towards December, this becomes headlining news and the Dutch in general are polarized about the subject. In order to avoid being hassled or intimidated by people either in favor or against Zwarte Piet, it is wise to be careful whilst discussing the subject. Some areas have since introduced Pieten in many different colors. Again, opinions on this change are heavily polarized. Do not however avoid the celebration because of this, demonstrations are not violent.\n\nIf want to you experience a part of the Sinterklaas tradition, your best option is to visit the arrival of Sinterklaas, called the Sinterklaasintocht. There is a big celebration in a designated city on the saturday between November 10th and 16th, and smaller celebrations in nearly all cities the day after. Also consider buying some Sinterklaas candy such as: Pepernoten, Kruidnoten, taai-taai, chocolate coins or chocolate letters. The candy is available in supermarkets and other candy selling stores from September until the fifth of December.\n\n==Do==\n\n<!--Please add activity listings to their respective city pages. This section is only for general information and pointers-->\n\nOne of the most popular activities among the locals is '''cycling'''. And for a reason — the Netherlands has about 22,000 km of dedicated bicycle paths, which criss-cross the country with many of them numbered. It's as easy as getting a map, picking a number, and start cycling! Particularly scenic areas well suited for cycling include the [[Green Heart]], [[Hoge Veluwe National Park]], [[South Limburg]], and the [[Waterland and Zaan Region]]. Just be aware that winds can be strong (because of the flat lands), and that winters can be cold and rainy.\n\nThe Dutch coastline measures 1,245 km of coastline with many '''beaches'''. Popular activities include '''swimming''' and '''sunbathing''', but these are mostly restricted to warm summer days. Expect [[Scheveningen]] to be extremely crowded when temperatures rise towards tropical levels. More mellow and family friendly beaches include [[Zandvoort]], [[Bloemendaal]], [[Bergen (North Holland)|Bergen]], and the [[West Frisian Islands]].\n\n'''Water sports''' is another activity mostly undertaken by the locals. Lakes can be found in every province, but the [[Frisian Lakes]] are outstanding, especially during the annual '''Sneekweek''' that starts the boating season. Boating can be done without licence as long as the boat is not longer than 15m and/or faster that 20km/h. Other lake-rich areas include [[Wijdemeren]], [[Kaag]], and [[Aalsmeer]]. Most of these lakes are very calm, with parasailing and rafting impossible.\n\n'''Local non-profit tourist information organizations''' are mostly called 'VVV', they can inform you about organized activities during your stay. \n\n===Festivals===\nThe big organized festivals such as Lowlands, Dancevalley, Pinkpop and Sensation, usually sell out very fast. Advised is to buy tickets before you go to the festivals, to prevent disappointment buy them as quick as you can. For most free festivals such as Carnaval, Queens/Kings day and the Vierdaagsefeesten, you don't need to get a ticket. \n\n* Every two years, the country goes '''football crazy''' as either the European Championship or the World Cup is held. Complete streets will be decorated with orange flags, the country's national colour. It's not uncommon for literally fifty percent of the population to be watching a game if it's a particularly important one. Often bigger cities will put up large TV screens for the general public, like on the Rembrandtplein in Amsterdam. Likewise, cafes and bars are another popular place to watch games.\n* In the [[Southern Netherlands]] ([[North Brabant]], [[Limburg]] and to a smaller extent also in [[Twente]], [[Overijssel]] and the south of [[Gelderland]]), the Catholic celebration of '''Carnaval''' is held since mediaeval times. It occurs immediately before Lent; which is usually during February or March. Mainly in Limburg - where carnaval is called \"vastelaovend\" - carnaval is celebrated very traditionally. Every town get's a new name and is symbolically ruled by the local carnaval-association. It is expected that you dress up in a weird- or funny-looking costume. Parades can be seen in many towns on Sunday, sometimes also occurring on Monday. Parades can also be held in the evening, usually on Saturdays all the wagons are then lit up by numerous small lights. The other days of the week, many activities can be found ranging from street painting (stoepkrijten) to beer drinking contests, some of the activities have their own dress-code like the farmer's wedding (the \"boerebroelof\", a tradition in almost every town in [[Limburg]] and some of [[North Brabant]]). The cities of Venlo (Jocus Riék), 's-Hertogenbosch (Oeteldonk) and Maastricht (Mestreech) are advisable for attending Carnival.\n* '''King's Day''' (''Koningsdag'') is held every year at April 27th all over the country (except if this day is a Sunday, then it will be held at the Saturday before). In every village and town, you will find frolicking Dutch, free markets and authentic Dutch games. Nowadays King's day much more becomes a day of festivals and parties. It is advised to wear orange clothing, as most Dutch people walk around in their national colour. An advisable city to attend at this day is Amsterdam, because it's one of the largest events of the year there. In several larger cities (most notably The Hague and Utrecht), the festivities start in the evening of the 26th of April. This day used to be Queens Day (Koninginnedag), which was held on the 30th of April.\n* '''Pinkpop''' [http://www.pinkpop.nl] is a three-day pop festival every year with Pentecost (\"''Pink''steren\") in [[Landgraaf]], Limburg.\n* '''Lowlands''' [http://www.lowlands.nl] popfestival - every last weekend of August at [[Biddinghuizen]], Flevoland. This festival has pop, rock and alternative live music as well as theatre performances. \n* '''Summercarnaval''' [http://www.zomercarnaval.nl/en/index.php] - A big parade through the center of [[Rotterdam]]. One of the largest events in the Netherlands.\n* '''Heineken Dance Parade''' [http://www.ffwdheinekendanceparade.nl] - A big dance parade through [[Rotterdam]]. Much in the spirit of the popular Love Parade in Germany.\n* '''Northsea Jazz Festival''' [http://www.northseajazz.nl] - Big summer jazz festival, held in the Ahoy stadium, [[Rotterdam]] since 2006 as it moved there from The Hague. Around 1,800 jazz, blues, funk, soul, hip Hop, Latin and R&B acts play during this 3 day event.\n* '''Vierdaagsefeesten''' [http://www.vierdaagsefeesten.eu] - Summer festival in Nijmegen lasting seven days, during the Nijmeegse Vierdaagse, which always starts on the 3rd Tuesday in July. The Nijmeegse Vierdaagse is a walking event where people walk a route of 30-50 km for four days in a row. You only can join the walk if you have registered yourself [http://www.4daagse.nl/en/]. The celebrations (that are mostly not attended by the walkers) start already the weekend before until the weekend after and over 1 million people attend. During the festival, there is a section for all the top Dutch bands, pop, alternative and rock, electronic dance music and of course the numerous terraces and bars.\n* '''Sensation''' [http://www.sensation.nl] - (Formerly known as 'Sensation White') One of the best-known parties in the world organized by ID&T.[http://http://www.id-t.com/] 40,000 people all dressed in white gather to hear some big and upcoming house music DJs. Several international editions are being organized several times a year around the world with the main concert being held in Amsterdam ArenA every summer. Sensation Black (with hardstyle music) was previously hosted annually in the same location but is now being held in Belgium instead.\n*'''Dance Valley''' [http://www.dancevalley.com] - The largest and oldest dance festival, with over 40,000 visitors. Annually the first weekend of August in park Spaarnwoude, near Schiphol Airport. The focus is on celebrating summer, and has circus tents in which every tent is a different genre in dance music.\n* '''Mystery Land''' [http://mysteryland.id-t.com] - Dance festival with a flower-power theme. In the last week of August near Schiphol Airport. Most dance genres are present, including even electro. Also has activities such as workshops and theatre, which are usually uncommon with dance festivals.\n* '''Defqon.1''' [http://defqon1.nl] - Dance festival focussing on the harder dance styles, such as hardstyle and hardcore. Residing in Flevoland, usually in mid June, but in 2009 is held in mid September.\n\n==Buy==\n{{Euro}}\n\nA lot of shops do not accept banknotes of &euro;100, &euro;200 and &euro;500, due to concerns about counterfeiting and burglary. Shops also do not give 1 or 2 cent coins as change, usually rounding the price of shopping up or down to the nearest 5 cent denomination. Shops usually open by 9AM and they usually close by 5:30PM or 6PM. Most shops are closed on Sundays, except at the \"koopzondag\". \"Koopzondag\" means the biggest part or all the shops are open. It differs from town to town which Sunday is the \"koopzondag\". In most towns it is the last or first Sunday in a month. In a few cities (Amsterdam, Rotterdam, The Hague, Utrecht and Leiden) the shops are open every Sunday, in most cases they are open from noon till 5PM or 6PM. In Amsterdam centrum area is an exception, since you can see the shops open till 9PM and Sundays from noon till 6PM. The shops can be crowded with people coming into town from outside the city. In some areas shops are closed on Monday. \n\n===Credit cards & ATMs===\nFor safety reasons, credit card use in the Netherlands increasingly requires a PIN-code. Credit card use in general is reasonably common, but not by far as much as in the US, UK or Scandinavia. The Dutch themselves often use local bank cards, i.e. debit cards without a Visa or MasterCard logo for which even small shops and market stands usually have a machine. In tourist destinations you will generally find credit cards widely accepted, as well as in larger shops and restaurants in the rest of the country, but ask in advance or check the icons that are usually displayed at the entrance. Note that most supermarkets only accept local debit cards, not foreign credit cards. Some have an ATM on the premises where you can withdraw cash before going shopping.  \n\nATMs are readily available, mostly near shopping and nightlife areas. The very smallest ones excluded, even villages usually have an ATM. The Dutch word for these machines is \"pinautomaat\", and the verb meaning both withdrawing cash from ATMs and paying with a debit card (\"pinpas\") is \"pinnen\".\n\n===Costs===\n\nAccommodation and food is on the expensive side. Rail travel, museums, and attractions are relatively cheap. Retail prices for clothing, gifts, etc. are similar to most of Western Europe; consumer electronics are a bit more expensive. Gasoline, tobacco and alcohol are relatively expensive due to excise taxes. however tobacco products can be considered cheap compared to prices paid in the UK. A pack of Marlboro (19 cigarettes) averages about €6,00.\n\n===Shop===\n\nThe Netherlands is a good place to buy '''flowers'''. Besides florists, you can buy them pre-packaged in most supermarkets.\n\n\nIn most cities there's a big variety of shops and some bigger cities even have some malls.\n\n===Klompen===\nThe Netherlands is famous for its wooden shoes. However, nowadays almost no one, except for farmers in the countryside, wears them. You could travel through the Netherlands for weeks and find no one using them for footwear. The only place where you'll find them is in tourist shops and large garden stores. Wearing wooden shoes in public will earn you quite a few strange looks from the locals.\n\nIf you do try them on, the famous \"wooden shoes\" are surprisingly comfortable, and very useful in any rural setting. Think of them as all-terrain footwear; easy to put on for a walk in the garden, field or on a dirt road. If you live in a rural area at home, consider taking a pair of these with you if you can. A good quality wooden shoe protects your foot from falling objects up to 10 kg, so you won't feel a thing. Wooden shoes are made from willow or poplar wood. Willow is more expensive than poplar, because the wood is harder and more compressed. This means that the wooden shoe of willow is stronger and more wear-resistant. Also they are better insulated and more water resistant. \n\nFor good quality wooden shoes; avoid the kitschy tourist shops at Schiphol and Amsterdam's Damrak street, and instead look for a regular vendor (such as Welkoop[http://www.welkoop.nl/pagina/locations.html?city=A]) which can usually be found in towns and villages in rural areas. The northern province of Friesland has a lot of stores selling wooden shoes, often adorned with the bright colours of the Frisian flag.\n\n==Eat==\n[[Image:DutchFood Herring.JPG|thumb|A fancy serve of herring at a restaurant]]\n[[Image:DutchFood SnertWithBacon.JPG|thumb|Pea soup (''snert'') with bacon]]\n\nThe Netherlands is not known for its cuisine, but hearty Dutch fare can be quite good if done well. Some of these \"typically Dutch\" foodstuffs taste significantly different from, but do not necessarily improve upon, specialties from other countries. For example, while Dutch coffee and chocolate can instil feelings of homesickness in expats and might be seen as \"soul food\", fine Belgian chocolate and Italian coffees (espresso, etc.) are considered to be delicacies. The Dutch, however, are known for their specialties and delicious treats:\n\n===Snacks & candy===\n[[File:Stroopwafel.jpg|thumb|Stroopwafel]]\n* '''Bitterbal''' (a round ball of ragout covered in breadcrumbs and deep-fried), served in bars as snacks with drinks and usually arrive in groups of at least five or as part of a bittergarnituur, always with mustard. Be sure to try these, Dutch people love them.\n* '''Bittergarnituur''', a plate containing different warm and cold snacks, like blocks of cheese, slices of sausage, bitterballen, perhaps something like chicken nuggets or mini spring rolls, and mustard or chilli sauce for dipping. One usually orders a bittergarnituur along with (alcoholic) drinks, from which the name of the dish is derived (translated to English \"bitterganituur\" would become \"Dutch gin garnish\").\n* '''Poffertjes''' are small slightly risen pancakes with butter and powdered sugar. Eat them in ''poffertjeshuizen'' or at a fair.\n* '''Syrup waffle''' (''Stroopwafel''). Two thin layers with syrup in between. Available packaged from any supermarket or made fresh on most street markets and specialized stalls.\n* '''Unadorned chocolate bars''' (''Pure chocolade'').\n* '''Limburgse vlaai''' (predominantly in the [[Southern Netherlands]]), dozens of kinds of cold sweet pie, usually with a fruit topping.\n* '''Liquorice''' (''drop'') is something you love or hate, you can buy all kinds of varieties. You can get it from sweet to extremely salty (double salt) and in a hard or soft bite.\n* '''Tompouce''' (a mille-feuille or Napolean), sold in most bakeries. \n* '''Nonnenvotten''' (a Limburgish braided doughnut sprinkled with sugar and cinnamon. Usually seasonal in the winter).\n* '''Kruidnoten''' taste like a small cookie and are is originated from the 'Sinterklaas' tradition. Available in supermarkets, bakeries and other candy selling stores from September until the fifth of December. Try the other Sinterklaas candy as well, such as '''Pepernoten''' or  '''taai-taai'''.\n* '''Oliebollen''' are deep fried dough balls, that are sold at bakeries and street stalls in the last weeks of December (because it's a new years eve tradition). At most fairs it's being sold as well throughout the year.\n\n===Breakfast or Lunch===\nA typical Dutch breakfast or lunch is a simple slice of bread or bread roll with butter and a slice of cheese or ham with a glass of milk or a '''Dutch coffee''' (dark, high caffeine grounds, traditionally brewed). The following typical Dutch products are often placed on the bread roll: \n* '''Dutch cheese''' is particularly famous, especially Gouda, Edam, Leerdammer, Maaslander and Maasdam.\n* '''Chocolate spread''' (like Nutella).\n* '''Dutch peanut butter''' which is considerably different from e.g. US peanut butter. Dutch peanut butter is also the basis for Dutch Indonesian or 'Indo' saté (satay) sauce which also contains lots of Asian herbs and spices.\n* '''Chocolate sprinkles''' (''Hagelslag''), sprinkled on top of buttered slices of bread (much like jam). If you want to be adventures: try a slice of bread with Dutch peanut butter and chocolate sprinkles. \n* '''Kroket''' (a round roll of ragout covered in breadcrumbs and deep-fried) served in a bread roll (''broodje kroket'') as lunch; best spiced up with mustard (not mandatory, though).\n\n===Meals===\nA conventional Dutch meal consists of meat, potatoes and some type of vegetable on the side. \n* '''Raw herring''' (''haring''), which is actually cured in salt. It's available both from ubiquitous herring stands and fancy restaurants, usually served with chopped onion and occasionally even plopped into a bun to make ''broodje haring''. New herrings (''Hollandse Nieuwe'') is a special treat available around June.\n* '''Mosselpan''' (''mussels''), boiled with vegetables (carrots, onions, celery, leek and different spices and herbs) and eaten with cold dip (garlic, cocktail). It's cooked and served in a big dark pot. Usually only eaten between May and July. \n* '''Pea soup''' (''erwtensoep'' or ''snert''), made of green peas and smoked sausage.  Can be very hearty and a meal itself if there are enough potatoes and other veggies mixed in.\n* '''Kroket''' (a round roll of ragout covered in breadcrumbs and deep-fried), is the most typical Dutch street snack. You can buy them at any snackbar or ''frituur'' and at several places you can buy them from a vending machine built in the wall. Also served with French fries (which you should try with mayonnaise!) on the side as a regular street meal (''friet met met een kroket''). \n* By ordering a '''Kapsalon''' you will get a big meal (1800 kcal) containing French fries covered with döner or shawarma meat, grilled with a layer of Gouda cheese until melted and then subsequently covered with a layer of dressed salad greens. The term kapsalon literally means, \"barbershop\" in Dutch, alluding to one of the inventors of the dish. This meal is sold in döner restaurants and most of the snackbars. \n* '''Borecole mash pot''' (''boerenkool''), mashed potatoes with borecole (kale), often served with a sausage or 'rookworst'. Most locals only eat this during the winter. \n* '''Asperges Flamandes'''. White asparagus with Hollandaise sauce, ham, crumbled hard-boiled egg and served with boiled new potatoes. Highly seasonal and usually only eaten between spring and summer.\n* '''Dutch Sauerkraut''' (''zuurkool''), mashed potatoes with sauerkraut.\n* '''Hotch-potch''' (''hutspot''), mashed potatoes with onions & carrots. Served with slowly cooked meats or sausage.\n* '''Stoofvlees''' is the slowly cooked meat eaten with ''hutspot''.\n* '''Endive mashed pot''' (''stamppot andijvie''), potatoes mashed with endive and bacon.\n* '''Rookworst''' (literally \"smoked sausage\"), available to go from HEMA department store outlets, but also widely available in supermarkets. Best served on a bread bun or as a dish with mash pot such as Borecole, Hotch-Potch, Endive or Sauerkraut mash pot. \n* '''Dutch pancakes''' (pannenkoeken), which are either sweet (''zoet'') or savoury (''hartig'') in variety of tastes, like apple, syrup, cheese, bacon etc. Eat them in pancake houses (''pannenkoekenhuizen'')\n*'''Food from former colonies''' like Indonesia and Suriname. Many traditional dished from these countries have become part of the Dutch kitchen or even staple foods.\n\n===Restaurants===\n\nAs Dutch people usually eat Dutch food at home, most restaurants specialize in something other than local fare. Every medium-sized town has its own '''Chinese/Indonesian restaurant''', often abbreviated as Chin./Ind. restaurant, where you can eat a combination of Chinese and Indonesian dishes. Usually you get a lot of food for a small amount of money. Do not expect authentic Chinese or Indonesian cuisine though, the taste has been adapted for Dutch citizens. These restaurants have been influenced by the Dutch East Indies (currently Indonesia) from when they were a colony of the Netherlands. Typical dishes are fried rice (Indonesian: ''nasi goreng''), fried bakmi (''bami goreng'') and prawn crackers (''kroepoek''). A suggestion is the famous Dutch-Indonesian rice table (''rijsttafel''), which is a combination of several small dishes from the East Indies, not unlike the ''nasi padang'' of Indonesia. Most of them have a sit-in area and a separate counter for take-away with lower prices.\n\nBesides Chinese/Indonesian, the bigger cities offer a good choice of restaurants with '''Middle Eastern cuisine''' for a bargain price. Popular dishes are shawarma (''shoarma''), lahmacun (often called ''Turkish pizza'') and falafel. The Argentinian, French, Italian, Japanese, Mexican, Spanish, Surinam and Thai cuisines are also well-represented in the Netherlands.\n\nModern Dutch restaurants serve good quality food and are relatively expensive compared with surrounding countries. Most of the time, profit is made from the drinks and the desert, so be careful ordering those if you are on a budget. In the Netherlands, going to a restaurant is generally not seen as a quick way to eat food, but as a special night out with friends or family, which can take a couple of hours. Service fees and taxes are included in the menu prices. Tipping is not mandatory and seen as a sign of appreciation, not as means to make up a tiny salary. In case you do want to tip as a rule of thumb rounding up to the next Euro is normal or 10 percent. \n\nSince 1 July 2008, smoking has been banned in all restaurants, cafes, bars, festival tents and nightclubs. Smoking is allowed only in separate, enclosed, designated smoking areas in which employees are not allowed to serve. Staff may enter such smoking rooms only in emergency situations.\n\nIn restaurants the portions of food are not big, because usually people eat 3 dishes (starter, main, dessert).\nDrinks are served in small glasses and there are no free refills.\n\nThe local website Iens[[http://www.iens.nl/]] is used by a lot of locals to judge (almost all) restaurants in the Netherlands. There is also an English version of the website here[[http://en.iens.nl/]], but you can also let the grades (1 is worst, 10 is best) speak for themselves.\n\n===Snackbars===\n\n[[Image:Febo VendingMachine.JPG|thumb|Fast food vending machines at Febo]]\n[[Image:Febo Kroket.JPG|thumb|A mashed potato and mushroom ''kroket'']]\n\nIn town centres, near public transportation areas or even in more quiet quarters you can find a '''snackbar''', sometimes known as ''frituur'' or ''cafeteria''. These snackbars are pretty much the antithesis of high cuisine, but their snacks are considered typical for the country, and many Dutch expats miss them the most when going abroad.  The popular Febo [http://www.febodelekkerste.nl/] chain's outlets are basically giant vending machines, just slot in a euro or two and take out the snack of your choice.\n\nThe most popular snack is French fries, known as ''patat'' in most of the country and as ''friet'' in the [[Southern Netherlands]].  The \"standard\" way is to order them with mayonnaise (''patat met''), although the local mayo is not the same as you'd get in France or most of the rest of the world: it is firmer, sweeter and contains less fat, whilst remaining just as unhealthy. Other sauces are tomato ketchup, curry ketchup (unlike regular curry, tastes more like ketchup), Indonesian peanut sauce (''satésaus''), cut raw onions (''uitjes''), special (''speciaal'', a combination of mayonnaise, curry ketchup and optionally cut raw onions) and war (''oorlog'', a combination of mayonnaise, peanut sauce and optionally with cut raw onions). \n\nThe following fried snacks are considered typical for the country as well:\n* '''Croquette''' ('kroket'), a crispy roll filled with ragout. Can be ordered on bread as well.\n* '''Frikandel''', a long, skinless and dark-coloured sausage, kind of like a minced-meat hot dog. Can be ordered on bread, or as ''speciaal'' (with mayonnaise, curry ketchup and cut raw onions).\n* '''Kaassoufflé''', cheese snack popular with vegetarians, can also be served on bread.\n* '''Bear's claw''' (''berenklauw''), often called '''bear's snack''' (''berenhap'') or '''bear's dick''' (''berenlul''), is a sliced meatball with fried onion rings on a wooden skewer, often served with peanut sauce (''pindasaus'').\n\n===Vegetarianism===\n\nVegetarians should not have any major trouble. 4.5 percent of the Dutch population is vegetarian and most restaurants have at least one vegetarian option on their menus or can make you one if you ask for it. Most supermarkets sell vegetarian products or even have a part of their supermarket dedicated to vegetarian products. It is advisable to specifically mention what you do and do not eat (meat, fish, dairy, eggs) as not everyone has the same definition of vegetarianism. Finding a vegetarian option in a fast food restaurant might provide more of a challenge. Chip shops that sell veggie burgers are the exception rather than the rule; chips and ''kaassoufflés'' are often the only options.\n\n==Drink==\nAs of January 1st 2014, the legal drinking age is raised to 18, and anyone caught drinking underage will be fined €130,-\nBar's and Cafe's receive a tenfold fine, so expect severe ID checks.\nBeverages with an alcohol content lower than 0.5% aren't counted, anybody can buy then, and they may be called \"alcohol free\" or in the case of beer \"malt bier\".\n\nIt's illegal for youth under 18 to buy alcohol in liquor-shops or supermarkets and they can ask for an ID before buying. Usually if you are below 20 you are required to show an ID. \nFor most festivals people between 18 and 20 need to get an wristband before buying alcoholic drinks. \n\n\n===Beer===\n[[Image:DutchFood Witbier.JPG|thumb|Wieckse Witte, a popular white beer (''witbier'')]]\n\nAlthough the Dutch ''beer'' \"Heineken\" is one of the world's most famous beers, it is just one of the many beer brands in the Netherlands, and many Dutchmen consider it to be only a second-rate pilsner. You can get all kinds of beers from white beer to dark beer. Popular brands are Heineken, Grolsch, Brand, Bavaria, Amstel etc. There's a certain regional variety in the beers you'll find; whereas, in the Western Netherlands, many pubs serve Heineken or Amstel, pubs in Brabant will generally serve Bavaria or Dommelsch, in Limburg Brand and in Gelderland Grolsch.\n\nIn addition to the usual lagers, try Dutch '''white beers''' (''witbier''), which are flavoured with a spice mix called ''gruit'' and thus taste different from the better-known German varieties. Fruit-flavoured varieties (such as Kriek) are also available. \n\nTraditional beers come from monasteries in the Southern Netherlands  (Brabant and Limburg) or Belgium. You can visit a traditional beer brewer in for instance Berkel-Enschot (just east of Tilburg) at the 'Trappistenklooster'. It needs to be said that the brewery is now owned by the big brewer Bavaria, so it's not so traditional any more.\n\nThere are also a lot of excellent small and micro breweries (Brouwerij 't IJ, Brouwerij de Molen, Brouwerij de Prael etc.), if you're a beer lover in Amsterdam consider visiting the beer shop \"De Bierkoning\" near \"De Dam\" (central square of Amsterdam), it has over a thousand beers, about half of it is Dutch and \"Brouwerij 't IJ\".\n\nMost breweries nowadays also produce a non-alcoholic variant of their beers, like Bavaria Malt or Amstel Malt, which contain sometimes 0% or less than 0.5% alcohol and are very suitable for people who would like to drive and don't drink (or sometimes called \"de Bob\" as promoted in its campaign) or pregnant women.\n\nTravellers coming from the British Isles and hoping to find a decent pint of ale will be sorely disappointed; unfortunately the Dutch beer market is utterly dominated by pilsner.\n\n===Bitters and gin===\nAlso popular in winter are alcoholic '''bitters'''. Originally from the province of Friesland the bitter called Beerenburg is served in the entire country. Most other regions also produce their local, less famous variants of a bitter.\n\n* '''Orange bitter''' (''Oranjebitter''), this bitter liquor is drunk only on King's Day (Koningsdag)\n\n* '''Dutch gin''' (''jenever'' or ''genever''), the predecessor of English gin.  It's available in two types, called ''oude'' (old) and ''jonge'' (young), which have nothing to do with aging, just the distillation style.  The more traditional \"old-fashioned\" ''oude'' is sweeter and yellowish in colour, while ''jonge'' is clearer, drier and more akin to English gin.\n\n* '''Beerenburg''' (''Beerenburg''), is an alcoholic drink, made by adding herbs to jenever. It has an alcohol percentage of around 30%. The original Beerenburg was made halfway through the 19th century with a secret mixture of spices of the Amsterdam spice merchant Hendrik Beerenburg, to whom it owes its name. Despite it being \"invented\" in Amsterdam, it is considered typically Frysian.\n\n===Tea and coffee===\n\nDutch drink black or green '''tea''', and it comes in many different tastes, from traditional black to fruit infusions etc. Luckily, if you're British, you get the teabag served with a cup of hot (but never boiling) water, so you can make your own version. Milk in your tea is almost unheard of and given only to children. Sugar or occasionally honey is often served with it to add by yourself.\n\nCoffee is almost compulsory when you are going to visit people. One of the first questions when coming through the door is often \"Koffie?\" and it is served in small cups (a half mug) with cookies. \n\nIf you're from the States or Canada, you can drink one cup of Dutch '''coffee''' in the morning and add water the rest of the day!  If you order 'koffie verkeerd' (which means \"coffee the wrong way 'round\") you get a cup of more or less half milk and half coffee, more like the French 'café au lait' or the Italian 'caffe latte'.\n\n===Hot chocolate===\n'''Hot chocolate''' with whipped cream is a winter tradition in the Netherlands. It really fills you after a cold walk. In the summer you can also get it in every decent bar, however sometimes it's made from powder as opposed to the traditional kind (regular chocolate melted and mixed with hot milk), and tastes like the best drink you've ever had.\n\n== Drugs ==\n{{infobox|Gapers (Black Moors Head)|[[Image:Van-der-Pigge-Haarlem.jpg|thumb|upright|Gaper on Van der Pigge shop in [[Haarlem]] ]]These are an ancient symbol for a pharmacy in the Netherlands. They look like people yawning (Gapers means Yawners in Dutch), but really they have their mouths open to take medicine. Sometimes a pill can be seen on their tongue. These symbols were once common in the Netherlands, especially in Amsterdam. Today they are very rare on buildings.\n\nUsually the head is of a black man or Moor. This is because in the 15-17th centuries, pharmacists would travel through the country with an assistant trying to sell their medicines. Before an audience the pharmacist would give a pill to his assistant. These were often Moors. The assistant would pretend to be much better.\nSo pharmacies became known by the assistant's head.\nToday some bars and restaurants are named after Gapers. There is also a large collections of them in the '''Netherlands Drugstore Museum''' in [[Maarssen]].\n}}\nThe Netherlands is renowned for its liberal '''drug policy'''. While ''technically'' still illegal because of international treaties, '''personal use''' of (soft) drugs are regulated by the Ministry of Justice under an official policy of ''gedogen''; literally this means ''to accept'' or ''tolerate'', legally a doctrine of non-prosecution on the basis that the action taken would be so highly irregular as to constitute selective prosecution. This does '''not''' mean the Dutch are all permanently high; in fact drug usage is much lower in the Netherlands than it is in countries with more restrictive policies. Much of the clientèle of the ''coffeeshops'' (see below) are in fact tourists. Be sure you are among like-minded people before lighting up a spliff. However: it is customary to smoke only inside coffee shops or in private places; using drugs in public streets and being excessively high is considered impolite, so, try to maintain a certain discipline.\n\nIf you are 18 or older, you are allowed to buy and smoke small doses (5 g or less) of cannabis or hash. For this you have to visit a '''coffeeshop''', which are abundant in most larger towns.  Coffeeshops are not allowed to sell alcohol. Minors (those under 18) are not allowed inside. Coffeeshops are prohibited from explicit advertising, so many use the Rastafarian red-yellow-green colours to hint at the products available inside, while others are more discreet and sometimes almost hidden away from plain view.\n\nWhen the Dutch ''gedoogbeleid'' (\"tolerance policy\") began in the 1970s, coffeeshops were dumpy little places where a few hippies sold pot to each other from shoe boxes in their basements. Today, for better or worse, coffeeshops have grown into extremely sophisticated businesses that serve thousands of customers monthly. Their success, however, is not without controversy; some coffeeshops are operated by organized crime syndicates and serve as money-laundering operations, and many Dutch consider their presence, and the accompanying throngs of foreigners, to be a nuisance. This has caused a backlash; now many coffeeshops have closed and magic mushrooms are (mostly) banned. The \"wietpas\" (\"weed pass\"), which used to be a mandatory pass to be able to buy weed, is no longer in use. It was introduced in 2012 to prevent foreigners from buying drugs, as to reduce the problem of drug tourism. This problem, however, still exists and has led to local laws in major cities in the southern provinces of [[Limburg (Netherlands)|Limburg]], [[North Brabant]] and [[Zeeland]] preventing non-Dutch citizens from entering a coffeeshop. Since failing to comply with the law can mean instant closure and criminal charges, coffeeshops enforce this strictly. When in doubt, ask the bouncer. If rejected, do not make a scene: no really means no. Do not try to get others to buy drugs for you, this will get you in trouble with law enforcement. While it has become harder for foreigners to buy weed in the Netherlands, the use of drugs is still legal, also for foreigners. \n\nBeware that cannabis sold in the Netherlands is often stronger than varieties outside, so be careful when you take your first spliff.  Be particularly wary of cannabis-laced pastries (\"space cakes\") as it's easy to eat too much by accident &mdash; although there are also unscrupulous shops that sell space cakes with no weed at all.  Wait ''at least'' one hour after eating!\n\nHallucinogenic (\"magic\") mushrooms, once legal, are banned as of December 1st, 2008. However, \"magic truffles\", which contain the same active ingredients as magic mushrooms are still technically legal and are sold in some Amsterdam head shops.\n\nIt is forbidden to drive any motorized vehicle while impaired, which includes driving under the influence of both illegal and legal recreational or prescribed drugs (such as cocaine, ecstasy, cannabis and mushrooms) as well as alcohol, and medication that might affect your ability to drive.\n\nBuying soft drugs from dealers in the streets is always illegal and is commonly discouraged. The purchase of other (hard) drugs such as  ecstasy, cocaine, or processed/dried mushrooms is still dealt with by the law. However, often people who are caught in possession of small amounts of illegal drugs for personal use are not prosecuted.\n\nThe act of consuming any form of drugs is legal, even if possession is not. If you are seen taking drugs, you may theoretically be arrested for possession, but not for use. This has one important effect; do not hesitate to seek medical help if you are suffering from bad effects of drug use, and inform emergency services as soon as possible of the specific (illegal) drugs you have taken. Medical services are unconcerned with where you got the drugs, they will not contact the police, their sole intention is to take care of you in the best way possible.\n\nAt some parties, a \"drug testing desk\" is offered, where you can have your (synthetic) drugs tested. This is mainly because many pills contain harmful chemicals in addition to the claimed ingredients; for example, many pills of \"ecstasy\" (MDMA) will also contain speed (amphetamines). Some pills don't even contain any MDMA at all. The testing desks are not meant to encourage drug use, since venue owners face stiff fines for allowing drugs in their venues, but they are tolerated or 'gedoogd' since they mitigate the public health risks. Note: the desk won't return the drugs tested.\n\nPlease note that there are significant risks associated with drug use, even in the Dutch liberal climate\n* while marijuana bought at coffeeshops is unlikely to be hazardous, hard drugs like cocaine and heroin and synthetic drugs like ecstasy are still illegal and unregulated. These hard drugs are likely to be in some way contaminated, especially when bought from street dealers.\n* some countries have legislation in place that make it illegal to plan a trip for the purpose of committing illegal acts in another jurisdiction, so you might be apprehended in your home country after having legally smoked pot in the Netherlands. It should go without saying (but many people each year run afoul of this nonetheless) that before leaving the Netherlands ensure that you have absolutely ''no'' drugs-related matter in your luggage, in your pocket, etc. If you used enough that your clothes have picked up an odour, you may wish to consider running them through the laundry before packing or wearing them for the flight home.\n\n==Sleep==\nA wide range of accommodation is available, concentrated on the major tourist destinations. They include regions popular for ''internal'' tourism, such as the [[Veluwe]]. In non-touristy areas, accommodation may be very limited.\n\nPrices are generally high. Budget accommodation starts at around €20 per person and prices go upwards from there. Seasonal demand affects availability and can cause prices to rise dramatically, especially in Amsterdam.\n\nOfficial Dutch '''Youth [[Hostels]]''' are called \"Stayokay\" [https://www.stayokay.nl/en], but they are not as widespread as in Great Britain. Also there is no kitchen available for guests, so either you eat what's on menu or you eat out.  Besides the Official Dutch Youth Hostels there are plenty of other hostels spread around the country. Popular are The Flying Pig Hostels [http://www.beachhostel.nl] in Noordwijk and Amsterdam, which do provide a kitchen for one's own use and they have a liberal smoking policy.\n\nAnother option is staying at a '''bed & breakfast'''. There is a wide choice in the big cities, but there are also plenty to be found in the smaller towns and villages. Prices are generally €40-100, depending on the number of occupants and the season.  Bed & breakfasts may not offer all the facilities that bigger hotels do, but the service is generally friendly and personal. Also, many bed & breakfasts are to be found along popular hiking trails and cycling paths.\n\nShort-term '''apartment rental''' is available in cities, but may not be legal. While most have a 3 night minimum stay, the process of making reservations and checking in is generally identical to that of staying in a hotel, the notable exception being that most require a credit card deposit, and the balance payment in € on arrival.\n\n'''Vacation rental homes''' are popular in the Netherlands, especially in rural areas. These small homes come in broad varieties: they can be simple or luxurious, individual places or part of large parks with lots of identical homes and they are operated by private owners as well as large chains.  Traversia has the largest collection of vacation rentals in the Netherlands, by Dutch owners [https://www.eurocottage.com/en/Holland]. Large chains of vacation rental home parks are Center Parks and Landal Greenparks. Where privately owned options can sometimes provide a more authentic, local experience (e.g. located in old, timber-framed houses in [[South Limburg]]), the parks will offer additional services, restaurants and swimming pools. In most cases, you have to book at least a weekend. Although generally not very cheap, they have kitchens and therefore allow for self-catering.\n\nIf you are travelling by bicycle or by foot, there is a list of 3600 addresses where you can stay at private homes with bed and breakfast for no more than € 18,50 per person per night, although you must also pay € 9 for membership of this scheme. It is called Vrienden op de fiets [http://www.vriendenopdefiets.nl/].\n\n==Learn==\nThe Netherlands has many universities. The country has recently converted their own titles into the bachelor/master system.\nThere are two types of tertiary education:\n* Universities (focussing more on theoretical knowledge, aka \"Universiteit\")\n* Universities of Applied Sciences (focussing more on practical knowledge, aka \"Hogeschool\", despite the usual English name, not universities according to Dutch law)\nThe Times Higher Education Supplement ranks 11 universities among the top 200 in the world.\n\nEnglish speaking students will have no problems finding suitable courses. A total of 1,456 courses are taught entirely in English.\nThere is also the added advantage that most locals under the age of 30 are reasonably able in English.\n\nFor international students, several scholarships are available.\nThey can be found on the Nuffic website [http://www.nuffic.nl/international-students]. Here you will also find information regarding courses, institutions, housing, formalities, culture, traineeships and possible difficulties.\n\n==Work==\nWork opportunities for those from outside the European Union are very restricted. Only when an employer can prove they've searched in the EU, they are allowed to hire a non-EU citizen. Official policy is to deter all non-EU immigration, unless there is an economic necessity.\n\nCitizens of certain non-EU countries are permitted to work in the Netherlands without the need to obtain a visa or any further authorisation for the period of their 90 day visa-free stay - for more information see the 'Get in' section above.\n\nStudents from other European countries are eligible for study financing only when they have a fixed 32 hour/month work contract or when they have lived in the Netherlands for five years.\n\nSince 2005, the Dutch law enables what they call “knowledge immigration” the idea is to allow local companies to “import” foreign employees to work in the Netherlands. The process is straightforward and takes between 4 to 10 weeks.\n\nThere are also specialist websites for English and non-Dutch speakers looking to work in the Netherlands and they are a often a good place to start: Octagon Recruitment; [http://www.bluelynx.com Blue Lynx - Employment by Language]; Undutchables; Unique; and [https://www.expatjobs.eu/ Xpat Jobs]; are all useful resources.\n\n==Stay safe==\nThe Netherlands is generally considered a safe country. However, be alert in Amsterdam, Rotterdam, The Hague and other large cities that are plagued by pickpockets and bicycle theft, violent crimes are very rare. \n\nPolice, ambulance and fire brigade have one '''general emergency number 112'''. There is one police force, organized in 25 police regions. Visitors will deal with mostly the regional police. Some specialized forces, such as the railway police and the highway police on main roads, are run by a separate national force (highway police being the KLPD - ''Korps Landelijke Politie Diensten'', and railway police being the ''spoorwegpolitie''). When calling '''112''', if you can, advise on what emergency services what you need. When you need police but there is no life in danger or crime being executed, you call +31900-8844, with this number they will come quickly but without sirens. If you want to report a crime anonymously [http://www.meldmisdaadanoniem.nl/english/report-crime-anonymously/](e.g. because you are in fear of reprisals or a confrontation with the perpetrator) you can call +31800-7000. \n\n'''Border controls and port and airport security''' are handled by a separate police force, the Marechaussee (or abbreviation 'KMar' - ''Koninklijke Marechaussee''), a gendarmerie. They are an independent service of the Dutch armed forces (making them a military service, not a civil one). '''City guards''' have security tasks among their duties in most cities such as issuing parking and litter fines. They often have police-style uniforms to confer some authority, but their powers are limited. For instance, only the police carry a gun.\n\n'''Prostitution''' in the Netherlands is illegal since 1988 if the prostitute consents. Pimping or otherwise exploiting women against their will is a crime. Illegal prostitution in hotels can be raided by the police and the client as well as the prostitute can be fined or be put in jail. Hotel personnel are obligated by law to notify the police if they suspect these kinds of illegal activities. Having sex with a minor (18 for prostitutes, 16 for other people) is also illegal. \n\nEuropean Network against Racism, an international organisation supported by European Commission reported that, in the Netherlands, half of the Turks reported having experienced '''racial discrimination'''. The same report points out a \"dramatic growth of '''Islamophobia'''\" and '''anti-Semitism'''. These attitudes are however almost entirely to do with migration concerns, and, being people famed for their tolerance, the Dutch are very unlikely to treat visitors any differently based on their ethnicity.\n\n'''Unsafe parts of cities'''\nIn the larger cities, certain areas are considered unsafe at night. A few are also unsafe in daylight (but only relatively so; the chances of you getting in trouble in one of these areas are still very small):\n* Amsterdam: Kolenkitbuurt, Overtoomse Veld, Amsterdam-Zuidoost, Osdorp\n* The Hague: Morgenstond, Schilderswijk\n* Deventer: Heechterp/Schieringen, Rivierenwijk\n* Eindhoven: Woensel West\n* Leeuwarden: Heechterp/Schieringen\n* Maastricht: Noord-Oost\n* Nijmegen: Hatert\n* Rotterdam: Bloemhof, Hillesluis, Oude Noorden, Oude Westen, Pendrecht, Spangen, Tarwewijk, Tussendijken\n* Utrecht: Kanaleneiland, Overvecht\n* Zaanstad: Poelenburg\n* Tilburg: Broekhoven, Kruidenbuurt, Stokhasselt\n\n==Stay healthy==\n\n*The Netherlands has some of the best 'tap water' in the world. It is even considered to be of similar or better quality than natural mineral or spring water and is distributed to every household and controlled by 'water authorities'. Food (either bought in a supermarket or eaten at a restaurant) shouldn't pose any problem either. The health care system is up to par with the rest of Europe and most cities have hospitals where usually most of the staff speaks English (at least all medical staff). In general, it's a case of common sense.\n\n*In summer, open air recreational (mainly fresh water) swimming areas might suffer from the notorious blue algae, a rather smelly cyanobacteria which when it dies, releases toxins into the water. When these occur, a signpost at the entrance to the area or near the water should tell you so by stating something like \"waarschuwing: blauwalg\". If in doubt, ask someone.\n\n*When walking or camping in forests and dunes be aware of ticks and tick-carrying diseases such as Lyme disease. It is advisable to wear long sleeves and to put trousers into your socks.\n\n*Prostitution in the Netherlands has been legalized to a certain degree, but even when indulging into these practices at brothels or other locations in the Netherlands where sex is sold do always use a condom since STDs are still a problem in this industry.\n\n==Respect==\n\nThe Dutch are among the most informal and easy-going people in Europe, and there are not many strict social taboos to speak of. It is unlikely that Dutch people will be offended simply by your behaviour or appearance. In fact it is more likely that visitors themselves will be offended by overly ''direct'' conversation. Nevertheless, the standards for ''overt'' rudeness and hostility are similar to those in other western European countries. If you feel you are deliberately being treated offensively, then you probably are.\n\nThe exception to this openness is personal wealth. It is considered vulgar to for instance reveal the height of your salary, so asking somebody about this will be considered nosy and will probably just get you an evasive answer. Likewise, it's not advisable to be forceful about your own religion or to assume a Dutch person you've met is a Catholic or a Calvinist, since most people do not adhere to any faith at all, and the country has a long, proud history of cultural and religious tolerance. In urban areas it is not considered rude to ask somebody about this, but you'll generally be expected to be entirely tolerant of whatever the other person believes and not attempt to proselytize in any way. Openly religious behaviour is usually met with bewilderment and ridicule rather than hostility. An exception is the Dutch Bible Belt which runs from Zeeland into South Holland, Utrecht and Gelderland, and consists of towns with many strong Dutch Reformed Christians, who are more likely to be insulted by different religious views. Openly nationalist sentiments are likewise viewed with some suspicion among the general public, though there are a number of nationalistic celebrations like King's Day (''Koningsdag'', April 27th) and during football championships. Mostly though, these nationalistic celebrations are mostly used as an excuse to party together rather than being true \"nationalistic\" events.\n\n===Social etiquette===\n\n====Meeting and parting====\nWhen meeting and parting for the first time, shaking hands is the default position between both men and women. When someone is introduced, he/she will shake hands and state his/her name. At the next meeting, shaking hands is not necessary, but in business situations it is common.\n\nIn the Netherlands, cheek-kissing is in certain regions and social circles a common way of greeting among women and between women and men.It is only done among people who know each other rather well. Men don't kiss other men on the cheeks. Men and women, and women among each other, will do it more often.  Two men will generally shake hands. Kissing is particularly suitable for informal occasions, and is also common practice when congratulating someone. Hand shaking is more appropriate for formal occasions. The cheek-kissing is not compulsory. If someone does not want to be kissed, he or she extends the hand for a handshake. This will not be considered odd or rude.\n\nDutch people will kiss three times alternating right and left cheeks. This could lead to awkward situations for Anglo people, being used to just two kisses. It is alright or sometimes even more acceptable to just press the cheeks to each other instead of actually kissing. Also, always kiss on the cheeks and never give air-kisses. Often there will not be an actual kiss, but rather the touching of the cheeks against each other. Kisses are never supposed to be wet kisses.\n\nPhrases saying hello or goodbye differ between regions, but are generally understood everywhere. However, the use of dialectal forms, for example the Brabantic \"houdoe\", Limburgish \"haije\", Gronings \"moi\", and the Frisian \"'goeie'\" links the speaker to that region.\n\n====Addressing people: formal and informal====\nDutch people quickly start calling people by their first name. In the Netherlands, a younger person, a child, a relative, a friend, or an acquaintance are addressed with an informal \"je/jij\" (\"you\"). The formal \"u\" is used to address people one does not know, or is only slightly acquainted with. \"U\" is also used to address a higher-ranking businessperson, although it can soon be replaced by the informal \"je.\"\n\nWhen meeting someone in the Netherlands for the first time, they are generally called sir or madam, but one will soon be asked to refer to them by their first name. In other countries, it takes much longer for people to associate on a first name basis. There is no special rule that tells how to deal with this, it is safe to follow the lead of the other person. When one introduces him/herself with just their first name, it is safe to assume that they prefer to be addressed with the informal \"jij/je\".\n\nThe Dutch do not use titles when they speak to someone. In writing, one can state the title, but only in an official letter. The only exception is the Dutch King and Queen, which will always be referred to as His and Her Majesty. However, the current King, Willem-Alexander of the Netherlands, has stated that people can address him in any way they feel comfortable with.\n\nWhen making a phone call, always state name (and, if appropriate, company name). Even when one calls a cab, order a pizza, or ask for information, it is polite to mention one's name.\n\nWhen receiving a call, one does the same: pick up the phone and state the name. When a Dutch person answers the phone, he/she will identify him-/herself by stating their first name and/or last name. The name is usually preceded by \"met\" (\"You're speaking with.\") The caller is expected to identify him- or herself as well, before starting the conversation or asking to speak to another person.\n\nWhen making a phone call, first ask if the call is convenient. If it isn't a convenient time, offer to call back later. It is best not to make personal calls before 09:00 or after 22:00 (9:00 am/10:00 pm). On Sundays, one is expected not to call before 10:00. It is also better to avoid dinner time (18:00–19:30, 6:00-7:30 pm).\n\n====Table customs====\nWhen invited to a lunch or dinner, the Dutch will make it clear that you are their guest and that they intend to pay the bill, otherwise expect to \"Go Dutch\" and pay your fair share. No one will be embarrassed at splitting the bill.\n\nA waiter or waitress is beckoned by slightly raising a hand, making eye-contact or calling \"Ober\" (\"Waiter\") or \"Mevrouw\" (\"Waitress\"), but not too loudly. Snapping fingers is considered very rude.\n\nIt is also considered rude to leave the table during dinner, even to go to the bathroom. During a long dinner, one may leave the table between courses to visit the bathroom. It is polite to ask if one may be excused. When one has finished eating, one places the fork and knife next to each other at the 3:15 position on the plate with the sharp end of the knife towards oneself and the tips of the fork down. When invited for a meal in someone's home, people are expected to eat all the food on their plate. It's better to take multiple portions of food rather than too much at once and not eating all of it (which is considered wasteful or a sign that the food didn't taste well). The Dutch will invite only very close friends and relatives they feel close to for a home dinner. It might take a long time of friendship before this will happen or it might never happen at all.\n\nTable manners are important to the Dutch and if one breaks this etiquette, the Dutch might make remarks about it. During the entire meal, the fork is always held in the left hand when used. Knife and spoon are held in the right hand. The knife is not put down after the carving of the meat/fish. Both knife and fork are used together to eat. The napkin is placed on the lap. Eating with one's mouth open, burping, smacking, and making other eating noises are considered uncivilized. Putting new food in the mouth, drinking or speaking while there's still food in the mouth is considered rude. The Dutch frown upon breaking these basic rules. Bread is allowed to be eaten by hand. Soup is eaten with a spoon and not to be drank. Becoming tipsy is only acceptable when the dinner is held with close friends. When one does not wish to eat certain foods, it is appreciated when the host is told in advance.\n\nIn the Netherlands, men and women are equal, which means that women enjoy the same privileges as men. Enjoying lunch or dinner with a (male or female) friend will very often end up in Going Dutch (splitting the bill). When one invites someone, or if one is invited, it is only in corporate situations to be expected that the one who does the inviting pays for dinner. Otherwise bills will be split up, even sometimes when people are on a date. It is a way of showing that one is independent and self-reliant, which is highly valued in the Dutch society and insisting to pay the bill for the other party might be considered slightly offensive by the other party.\n\nIn the Netherlands, everyone receives a basic salary, tipping is optional. For example:\n* in a hotel, €1-2 to a porter, room service, or cleaning lady at the time of service.\n* in restaurants and cafés, 5-10% of the total bill. Leaving some small change on a restaurant table is common. Most Dutch restaurants and cafés collect all the tips received during the evening and split the amount among everyone working that evening (also kitchen/cleaning staff). If one is not satisfied with services rendered, he/she does not have to tip.\n* tips are generally not expected in bars, but are not uncommon.\n\n===Body Language===\n*The Dutch are reserved and don't touch in public or display anger or extreme exuberance.\n*Wearing sunglasses or covering the face otherwise while speaking to someone is considered extremely rude (the only exception being during the Dutch [[Carnival in the Netherlands|Carnival]]).\n*The Dutch expect eye contact while speaking with someone.\t\n*Spitting is considered very rude.\n*Keep your hands out of your pockets while talking to someone or shaking hands.\n\n===Corporate Culture===\n*The Dutch take punctuality for business meetings very seriously and expect that you will do likewise; call with an explanation if you are delayed.\n*Lateness, missed appointments, postponements, changing the time of an appointment or a late delivery deteriorates trust and can ruin relationships.\n*Exchange business cards during or after conversation. No set ritual exists. Business cards in English are acceptable.\n*The Dutch are extremely adept at dealing with foreigners. They are the most experienced and most successful traders in Europe.\n*The Dutch tend to get right down to business. Business negotiations proceed at a rapid pace.\n*Presentations should be practical, factual and never sloppy.\n*An individual's cooperation and trust are valued over performance. One-upmanship is frowned upon.\n*The Dutch tend to be direct, giving straight \"yes\" and \"no\" answers.\n*The Dutch are conservative and forceful and can be stubborn and tough negotiators. They are willing to innovate or experiment, but with minimal risk.\n*Companies are frugal and careful with money. Business is profit-oriented with the bottom line being very important. However, the Dutch are not obsessed with numbers.\n*Strategy is cautious and pragmatic, usually involving step-by-step plans. Preparations are made to improvise the plan, if needed. Strategy is clear and communicated to all levels.\n*In many companies the decision-making process is slow and ponderous, involving wide consultation. Consensus is vital. The Dutch will keep talking until all parties agree.\n*Once decisions are made, implementation is fast and efficient.\n*In the Netherlands, commitments are taken seriously and are honored. Do not promise anything or make an offer you are not planning to deliver on.\n\n====Miscellaneous====\nWithin Dutch society nudity is less sexualized as in for example the Anglosphere and resembles more the views of other Northern European cultures on nudity. Saunas, gyms and swimming pools are often visited by families and therefore always mixed. (In public saunas keeping one's clothes or bathing suit on is strictly forbidden. It is considered inappropriate and unsanitary, therefore it is good manners to undress. Nudity is the norm.) Some saunas do offer special men-only or women-only evenings. At the beach and on the terraces along it, the Dutch are as sparsely clothed as possible. Do not get offended by this because to the Dutch this kind of beach dress is completely normal. Women, also older women, may also (sun) bathe topless on most beaches in the Netherlands. The Netherlands has some nudist beaches.\n\nWeddings can range from small private affairs to elaborate parties, depending on the preferences of individuals. Dutch law only recognizes weddings as legally binding when performed by a government official, but a church ceremony may be included in the wedding festivities. Most people have a civil wedding, often conducted in the town hall. In the Netherlands there is a statutory requirement for couples intending to marry to formally register that intention with officials beforehand; allowing people who may object, time to learn of the intended marriage. This process is called \"ondertrouw\".\n\nThe majority of the Dutch are irreligious and religion is in the Netherlands generally considered as a very personal matter which is not supposed to be propagated in public.\n\nThe Dutch avoid superlatives. Compliments are offered sparingly, and to say that something is \"not bad\" is to praise it. \n\nA person who never offers criticism is seen as either being simple-minded or failing to tell the truth. A foreigner need not worry too much about saying something the will hurt feelings. The Dutch will argue, but seldom take offense.\n\nDutch humor is subtle rather than slapstick.\n\nThe Dutch speak directly and use a lot of eye contact. To a foreigner, them may appear abrupt, but it is just their manner of communicating.\n\nDo not call the Netherlands \"Holland.\" Holland is a region within the Netherlands.\n\nThe Dutch value privacy and seldom speak to strangers. It is more likely that they will wait for you to make the first move. Don't be afraid to do so.\n\nSmoking is prohibited in many areas. Always ask before lighting up.\n\nDo not discuss money or prices or ask personal questions.\n\nDon't compare the Dutch language to German, or state any similarity between Dutch and German people. For many Dutch this is a quick way to cause offence.\n\n===Gay and lesbian travellers===\n\nAs mentioned above, the Netherlands is quite liberal when it comes to '''homosexuality''' and by far is considered to be '''one of the gay-friendliest countries in the world.'''  The Netherlands has a reputation of being the first country to recognize same-sex marriage, and openly displaying your orientation wouldn't cause much upset in the Netherlands. However, even a gay friendly country like the Netherlands has room for some criticisms of homosexuality, but this varies depending on where one travels. Regardless, with violence and discrimination against gays being rare as well as the legal status of same-sex marriage in the Netherlands, this country may be considered a '''gay utopia''' and should be safe for gays and lesbians (except sometimes in religious neighbourhoods in the major Dutch cities, after big football matches or in demonstrations if there is a violent attitude in general). Be careful with openly kissing though, as it is not accepted, not even for hetero couples.\n(Be very careful, as in recent times incidents with Gay/Lesbian couples are on the rise due to \"hate-crimes\" done by individuals. Be alert when walking at night or through parks. If you do not trust it, do not walk hand-in-hand or be \"openly gay\". People have been hospitalized.)\n\n==Contact==\nThe international calling code for the Netherlands is '''31'''. The outbound international prefix is '''00''', so to call the US, substitute '''001''' for '''+1''' and for the UK  '''0044''' for '''+44'''.\n\nThe cellular phone network in the Netherlands is GSM 900/1800. The cell phone networks are operated by KPN, Vodafone and T-Mobile; other operators use one of these 3 networks. The networks are high quality and cover every corner of the Netherlands. With the exception of some low-end service providers, all mobile operators support GPRS. \nKPN, Vodafone and T-Mobile offer UMTS (and HSDPA) service in almost all parts of the country.\n\nThere are few public phone booths left in the Netherlands. They are mostly found at train stations. Telfort booths accept coins, whereas most KPN booths accept only prepaid cards or credit cards. Some new public phones have been installed which accept coins again.\nBe aware of public phones in a more public area as well as the same types in a more public-private area, where tariffs (per unit or amount of calling time) can differ.\n\n(National) Directory Inquiries can be reached -since 2007- on '''1888''', '''1850''' and various other 'Inquiry-operators'. Rates differ by operator, but are usually rather high, more than &euro;1 per call, as well as per-second charges. \n\nInternational Directory Inquiries can be reached on 0900 8418 (Mon-Fri 8AM-8PM, €0.90 per minute).\n\nPhone numbers can also be found on the Internet, free of charge, on Telefoonboek.nl [http://www.telefoonboek.nl/], De Telefoongids.nl [http://www.detelefoongids.nl/] and for opening times visit Openingstijden.nl [http://www.openingstijden.nl/] or OpeningstijdenGids.nl [http://www.openingstijdengids.nl/].\n\n0800 numbers are toll-free and for 09xx numbers are charged at premium rates. Mobile phones have numbers in the 06 range, and calls to cell phones are also priced at higher rates.\n\nIf you're bringing your own (GSM) cell phone, using your existing plan to call (or receive calls) whilst in the Netherlands can be very expensive due to \"roaming\" charges. Receiving phone calls on a cell phone using a Dutch SIM card is free in most cases; charges apply if you're using a foreign SIM card, as the call is theoretically routed through your country of origin. It's cheaper to buy a pay-as-you-go SIM card to insert into your GSM phone, or even to buy a very cheap pay-as-you-go card+phone bundle. For example: lyca [http://www.lycamobile.nl/], lebara [http://www.lebara.nl/], Ortel Mobile [https://www.ortel.nl/nl/] and vectone [http://www.vectonemobile.nl] are providers that specialize in cheap rates to foreign countries. [http://www.amatus.nl/] targets those travelling through multiple countries.\n\nTo enjoy '''cheap international calls''' from the Netherlands you can use low-cost dial-around services such as Qazza [http://www.qazza.nl], BelBazaar [http://www.belbazaar.nl/], pennyphone [http://www.pennyphone.nl/], SlimCall [http://www.slimcall.nl/], telegoedkoop [http://www.telegoedkoop.nl/], beldewereld [http://www.beldewereld.nl/], teleknaller [http://www.teleknaller.nl]Dial-around services are directly available from any landline in the Netherlands. No contract, no registration is required. Most dial-around services offer USA, Canada, Western Europe and many other countries at the price of a local call so you can save on your phone expenses easily. They also work from public payphones.\n\nInternet cafés can be found in most cities, usually they also provide international calling booths. Many public libraries provide Internet access.\nWireless Internet access using Wi-Fi is becoming increasingly popular and is available in many hotels, pubs, stations and on Schiphol, either for free, or at extortionate prices through one of the national \"networks\" of hotspots.\n\n[[Category: Countries]]\n[[Category: Netherlands]]\n\n[[WikiPedia:Netherlands]]\n[[Dmoz:Europe/Netherlands/]]\n[[World66:europe/netherlands]]\n[[wts:Category:Netherlands]]\n\n{{isPartOf|Benelux}}\n\n{{usablecountry}}\n{{countryguide}}\n{{hasDocent|Lisette}}\n{{hasDocent|CheeseCrisps}}\n\n[[ar:هولندا]]\n[[ca:Països Baixos]]\n[[de:Niederlande]]\n[[eo:Nederlando]]\n[[es:Holanda]]\n[[fi:Alankomaat]]\n[[fr:Pays-Bas]]\n[[hu:Hollandia]]\n[[it:Paesi Bassi]]\n[[ja:オランダ]]\n[[nl:Nederland]]\n[[pl:Holandia]]\n[[pt:Holanda]]\n[[ro:Ţările de Jos]]\n[[ru:Нидерланды]]\n[[sv:Nederländerna]]\n[[zh:荷蘭]]"
        }
    }
}