{
    "parse": {
        "title": "New Zealand",
        "pageid": 684,
        "wikitext": {
            "*": "{{pagebanner|New Zealand Banner.jpg}}\n\n{{quickbar\n|image=Mount Cook and Lake Matheson.jpg\n|caption=Mount Cook and Lake Matheson\n|location=New Zealand in its region.svg\n|flag=Flag of New Zealand.svg\n|capital=[[Wellington]]\n|government=parliamentary democracy\n|currency=New Zealand dollar ($, NZD)\n|area=267,710km²\n|population=4,919,080 (November 2018 estimate)\n|religion=unspecified/none 43%, Anglican 17%, Roman Catholic 14%, Presbyterian 11%, Methodist 3%, Pentecostal 1.7%, Baptist 1.3%, other Christian 9%, other 3%\n|language=official: English, [[Māori phrasebook|Māori]] and New Zealand sign language\n|callingcode=+64\n|tld=.nz\n|timezone=UTC +12 (DST +13)\n|electricity=230V, 50Hz (NZ plug)\n|emergencies= dial '''111'''\n}}\n[http://www.newzealand.com '''New Zealand'''] is a country of stunning and diverse natural beauty: jagged mountains, rolling pasture land, steep fiords, pristine trout-filled lakes, raging rivers, scenic beaches, and active volcanic zones. These islands are one of Earth's most peculiar bioregions, inhabited by flightless birds seen nowhere else such as a nocturnal, burrowing parrot called the kakapo and kiwi. '''''Kiwi''''' are not only one of the national symbols – the others being the silver fern leaf and koru – but also the name New Zealanders usually call themselves.\n\nThese islands are '''sparsely populated''', particularly away from the North Island, but easily accessible. There are sparklingly modern visitor facilities, and transport networks are well developed with Airports throughout the country and well maintained highways. New Zealand often adds an adventure twist to nature: it's the original home of jet-boating through shallow gorges, and bungy jumping off anything high enough to give a thrill.\n\n'''Māori''' culture continues to play an important part in everyday life and government and corporate symbolism with abundant opportunities for visitors to understand and experience both the history ''and'' present day forms of Māori life.\n\n==Understand==\nNew Zealand has been called \"''God's own country''\" and the \"''Paradise of the Pacific''\" since the early 1800s. \n\n''New Zealand'' is sometimes known, both in the indigenous [[Maori phrasebook|Māori language]] and by Pakeha, as '''Aotearoa''', translated as ''Long White Cloud''. \n\n===Geography===\nConsisting of two main islands - imaginatively named '''North Island''' and '''South Island''' and many smaller ones in the South Pacific Ocean, this archipelago lies 1,600km (1,000&nbsp;mi) south east of [[Australia]]. \n\nNew Zealand is the '''fifth largest''' wholly island nation on earth, its land area surpassed only by Australia, Indonesia, Japan and the Phillipines; NZ's maritime Exclusive Economic Zone (EEZ) is fifteen times larger, being exceeded only by Australia in the preceding list.\n\nWith a population of nearly 4.5 million in a country larger than the United Kingdom, many areas are sparsely settled. \n\nBe sure to allow sufficient time to travel in New Zealand. Distances are larger than you probably think and many roads wind along the coast and through mountain ranges (particularly on the [[South Island]]). It's rewarding to tour for three or four weeks on each of the main islands, although you can certainly see some of the highlights in less time.\n\nAustralians often call NZ \"''The Shaky Isles''\" because of frequent seismic activity. Lying on the margin of two colliding tectonic plates (the Pacific and Indo-Australian), earthquakes are common, particularly in the southwest of the South Island and in the central North Island, and the North Island's scenery is marked by several active and dormant volcanic cones. The largest lake, Lake Taupo drained by NZ's longest river, the Waikato River, lies in a caldera created by a super-volcanic eruption 26,500 years ago. The volcano underneath is dormant rather than extinct. Recording more than 14,000 earthquakes a year (with only about 150 usually felt) schoolchildren regularly undertake earthquake drills as in Japan.\n\n[[Auckland]], with a population of around 1.5 million people, is the largest city in [[Polynesia]]. Indeed, many small pacific nations, such as the [[Cook Islands]], [[Niue]] and [[Tokelau]], have more of their national population living in Metro Auckland than in their home islands! (<small>[http://www.stats.govt.nz/browse_for_stats/people_and_communities/pacific_peoples/census-snapshot-pacific-peoples.aspx NZ Government Statistics]</small>.) This makes for some interesting shopping and ethnic eating opportunities.\n__TOC__\n\n===Settlement and history===\nNew Zealand was the last significant land mass on earth to be settled by humans. [[Cook Islands|East Polynesian]]s reached New Zealand about 700 years ago in a series of tremendous oceanic canoe voyages to begin settlement of what was to become New Zealand - some 46,000 years after Australia. Their populations grew rapidly and led to the extinction of many unique species of flightless birds, including all 9 species of Moa, some of which grew to about 3.6m (12&nbsp;ft) in height with neck outstretched and weighed about 230kg (510&nbsp;lb) . Over time their culture in these colder lands diverged into the unique '''Māori''' that the artists of Captain Cook recorded.\n\nDutch explorer Abel Tasman, in 1642, was the first non-Polynesian to sight the [[Nelson Bays|North West coast]] of the [[South Island]] of New Zealand.(There is a claim, disputed by most historians, that a Portuguese expedition led by Cristovao de Mendonça beat him to it over a hundred years before in 1521-1524). Tasman named his find ''Staten Landt'' (on the assumption that it was connected to Staten Island, Argentina at the south of the tip of South America) and this appeared on maps from as early as 1645.<br /> \nHis two ships stopped to take on fresh water in [[Golden Bay]], but were attacked by Māori and four of his men and several Māori were killed there - causing him to name it \"Murderer's Bay\". Leaving the South Island by sailing up the west coast of the North Island, he mapped a small portion of the coastline; Dutch cartographers re-named this known part as ''Nova Zeelandia''.\n \nAs part of a dedicated voyage of scientific discovery, Yorkshireman James Cook, a Captain of the Royal Navy, circumnavigated the North, South and Stewart islands in 1769 and charted their coasts. A few people of European and US origin, mostly sealers, whalers, traders and missionaries, settled during the next 80 years, some taking local wives.\n\nIn 1840, with the assistance of missionaries, Māori signed different versions of the Treaty of Waitangi and there have been arguments as to the meaning of the Maori version ever since. More intensive European (Pākehā) settlement began that same year. Initially annexed to the colony of [[New South Wales]], New Zealand was split off to form a separate colony in 1841. A series of land wars between 1843 and 1872, coupled with political manoeuvring and the spread of European diseases, broke Māori resistance to Pākehā land settlement, but left lasting grievances. In recent years the government has sought to address long standing  Māori grievances, but this is a complicated and rancorous process. In 2005, the  Māori Party was formed, in part in response to the Government's law on the Foreshore and Seabed but also to promote an independent  Māori perspective at a political level.\n\nWhen the six British colonies federated to form Australia in 1901, New Zealand decided not to join the federation. Instead, the British colony of New Zealand became a self-governing dominion in 1907. It was offered complete independence under the 1931 Statute of Westminster, although it did not adopt this until 1947. All remaining constitutional links with the United Kingdom were severed with the passing of the New Zealand Constitution Act by both parliaments in 1986, though Queen Elizabeth II in right of New Zealand remains the Head of State (with a local Governor-General (appointed only after local advice) as her representative in New Zealand. \n\nNew Zealand supported the United Kingdom militarily in the Boer War of 1899–1902, as well as both World Wars. It also participated in wars in Malaya, Korea and Vietnam under various military alliances, including the ANZUS treaty with Australia and the United States. More information about New Zealand's military history can be found at the [http://www.armymuseum.co.nz/ National Army Museum].\n\nNew Zealand's population has strongly opposed the testing and use of nuclear weapons. The prospect of nuclear armed US warship visits meant that its Parliament enacted anti-nuclear legislation in the mid-1980s. After consultations with Australia, the US announced that it was suspending its treaty obligations to New Zealand until US Navy ships were re-admitted to New Zealand ports, stating that New Zealand was \"a friend, but not an ally\". Military relations were not repaired until 2010.\n\nNew Zealand is now a socially enterprising, vigorous and independent nation with a widely-travelled and well-educated population of more than 4 million. \n\nMore than one million New Zealanders were born overseas. Of the other 3 million native \"Kiwis\", one in four (one in three between ages 22 and 48) have recently left  \"Godzone\" for more favourable economic opportunities abroad (often to [[Australia]] where \"Kiwis\" uniquely don't need a visa).\n\n===People===\n[[File:NZ Realm of New Zealand.png|thumb|upright=1.7|The Realm of New Zealand]]\nThis former British colony has a population mainly of European descent but with an important indigenous Māori minority, a rapidly growing Asian minority, and smaller minorities of Polynesians, and people from the Americas and Africa.\n\nThis page is mainly about the core of New Zealand; see our separate pages about other parts of the '''''Realm'' of New Zealand''': [[Cook Islands]], [[Niue]], [[Tokelau]], [[Ross Dependency]].\n\n===Time zones===\nThe [[Chatham Islands]], 800km (500&nbsp;mi) east of Christchurch, keep Chatham Islands Standard Time (CIST) by adding twelve hours and forty-five minutes to Coordinated Universal Time (UTC) resulting in UTC+12:45.\n\nThe main islands are 12 hours ahead of Greenwich Mean Time ('''''UTC+12''''' = NZST = New Zealand Standard Time) and 20 hours ahead of Pacific Standard Time (PST). \n\nDaylight Saving ('''''UTC+13''''' = NZDT = New Zealand Daylight Time) begins on the last Sunday in September and ends on the first Sunday in April.\n\n===Sport===\nSome visitors think the national religion in New Zealand is rugby union!\n\nThe all-conquering national team, the '''''All Blacks''''', generally play matches at home during June through to September, mainly in ''The Rugby Championship'' (formerly the ''Tri Nations'') against [[South Africa]], Australia and [[Argentina]].\n\nThe two main rugby union competitions are ''Super Rugby'' (a regional competition incorporating regional teams from South Africa and Australia) and the domestic ''ITM Cup'' (formerly the National Provincial Championship from 1976 to 2005, and Air New Zealand Cup from 2006 to 2009). The Super Rugby season begins in February and normally ends in August (in Rugby World Cup years, the season ends in July); the ITM Cup starts in July and runs through to October. \n\nOther popular sports include soccer, rugby league and netball in winter, and cricket in summer.\n\n===Climate===\nNew Zealand has a temperate climate - winters are fairly cold in the south of the South Island but mild in the north of the North Island. The nature of the terrain, the prevailing winds and the length of the country lead to sharp regional contrasts. Maximum daytime temperatures sometimes exceed 30&deg;C (86&deg;F)and only fall below 0&deg;C (32&deg;F) in the elevated inland regions. Generally speaking, rainfall and humidity is higher in the west than the east of the country due to the north-south orientation of the mountain ranges and the prevailing westerly/north westerly winds.\n\nPart situated in the Roaring Forties, unsheltered areas of the country can get a bit breezy, especially in the centre, through Cook Strait and around [[Wellington]]. The winds seem to be stronger around the equinoxes.\nIn the winter, southerly gales can be severe but they also bring snow to the ski-fields and are usually followed by calm clear days.\n\n<table border=1>\n<tr><td>Temperatures in (°C)</td><td>Jan</td><td>Feb</td><td>Mar</td><td>Apr</td><td>May</td><td>Jun</td><td>Jul</td><td>Aug</td><td>Sep</td><td>Oct</td><td>Nov</td><td>Dec</td></tr>\n<tr><td>[[North Island (New Zealand)|North Island]]</td><td>23</td><td>24</td><td>23</td><td>20</td><td>17</td><td>15</td><td>14</td><td>15</td><td>17</td><td>18</td><td>20</td><td>22</td></tr>\n<tr><td>[[South Island (New Zealand)|South Island]]</td><td>22</td><td>22</td><td>19</td><td>17</td><td>14</td><td>11</td><td>11</td><td>12</td><td>15</td><td>17</td><td>19</td><td>21</td></tr>\n</table>\n\nNew Zealand is one of the most difficult countries in the world in which to forecast the weather. Although the weather is changeable, there is certainly more sunshine and warm temperate temperatures to enjoy in summer. It is not uncommon, especially on the South Island, to experience four seasons in one day.\n\nNew Zealand is a small country surrounded by ocean. A complicating, but often beneficial factor on the day-to-day weather, is the steep mountain range running down the spine of New Zealand orientated in a southwest-northeast direction. These mountains often shelter eastern parts of the country from an onslaught of westerly winds and rain.\n\nThe weather is mostly influenced by fast moving weather systems in the strong westerly winds, which are often referred to as the roaring forties, that predominate over southern parts of the country and seas to the south. There tends to be a seven day cycle associated with these westerlies as a cold front sweeps over the country associated with a couple of days rain, somewhere over the country. Often though these westerlies are disrupted by large high pressure systems or by storm systems.\n\nDuring the summer and early autumn months from about December to April, the westerlies tend to move south giving more settled weather. Always be prepared for a change though. Also, during this time, random weather systems from the tropics can make their presence felt, mainly over the North Island, with a period of warm wet windy weather.\n\nIn the Winter, May to August, the weather tends to be more changeable. Cold fronts often bring a period of rain to western areas followed by a cold wind from the south bringing snow to the mountains and sometimes to near sea level over eastern parts of the South Island. When the weather turns cold and wet in the east, to the west of the mountains it will be fantastic. At this time of the year it is not uncommon for high pressure systems and clear skies to park over the whole country for long periods bringing crisp frosty nights and mornings followed by cool sunny days.\n\nIn spring, from August to November, the westerly winds are typically at their strongest – these are called the equinoctial westerlies. It tends to rain more in western areas, and especially on the South Island, at this time, while in the east, warm dry winds can give great cycling weather. Once again though, a cold front and its accompanying south winds can give you a taste of winter at any stage.\n\nThe [http://www.metservice.co.nz/ Metservice] has weather forecasts.\n\n==Regions==\nNew Zealand is a very diverse country with many different regions that are well worth seeing.\n\n{{Regionlist\n| regionmap=NZ regions.png\n| regionmaptext=Regions, major cities and other destinations in NZ\n| regionmapsize=375px\n\n| region1name=[[North Island]]\n| region1color=#5ab05e\n| region1items=\n| region1description=Mild, with scenery ranging from sandy beaches, through rolling farmland and forests to active volcanic peaks with bubbling mud pools.\n\n| region2name=[[South Island]]\n| region2color=#969464\n| region2items=\n| region2description=Huge beech forests, great beaches, large glaciers, spectacular mountains and fiords, a motorcyclist's mecca.\n\n| region3name=Offshore Islands\n| region3color=#be7676\n| region3items=[[Stewart Island]], [[Chatham Islands]], [[Sub-Antarctic Islands (New Zealand)|Sub-Antarctic Islands]]\n| region3description=The other, more wild, islands of New Zealand, ranging from the nearby and accessible Stewart Island to the remote, uninhabited islands of the Kermadecs and the windswept Sub-Antarctic.\n}}\n\n==Cities==\nHere are nine of the most prominent settlements from north to south:\n<!--Lists of Cities and \"Other destinations\" are limited to 9.-->\n* [[Auckland]] — \"The City of Sails\", the largest conurbation, with over a million in the metropolitan area\n* [[Hamilton (New Zealand)|Hamilton]] — 128 km (80 mi) south of Auckland and leafy capital of the rich and fertile Waikato on the banks of the mighty Waikato River\n* [[Rotorua]] — famous for  Māori culture, geysers and beautiful hot pools.\n* [[Napier]] — \"Art Deco capital of NZ\", destroyed by an earthquake in 1931 and rebuilt in this style. Famous as a wine region, especially Bordeaux style reds and Cape Kidnappers. Renowned golf course, gannet breeding grounds and wildlife sanctuary.\n[[Image:WellingtonPanorama.jpg|right|thumb|Cable car above Wellington]]\n* [[Wellington]] — the national capital, known as \"The Windy City\" - Parliament, the Beehive and the wonderful, totally free and exciting ''Te Papa'' museum.\n* [[Nelson (New Zealand)|Nelson]] — safe and friendly, with New Zealand's highest sunshine hours, surrounded by coastal and mountain scenery, three national parks, vineyards and orchards. Well known for its thriving arts culture and varied cuisine emphasising local produce.\n* [[Christchurch]] — still the \"Garden City\" and the \"Air Gateway\" to Antarctica even after the recent and continuing earthquakes. The third largest conurbation with a neat International Airport\n* [[Queenstown (New Zealand)|Queenstown]] — adrenalin and adventure capital of the world, where you can ski, skydive, bungy jump, jet-boat, and thrill yourself to your heart's content\n* [[Dunedin]] — the \"Edinburgh of the South\", proud of its [[Scotland|Scots]] heritage, Southern Albatross colony, and its wonderful tramping tracks; all within a short drive from the CBD\n\n==Other destinations==\nNew Zealand has a wealth of national parks, rural areas and other out-of-the-way places that are worth a visit. Nine of the best are listed below (in alphabetical order); you'll find many more as you browse our pages!\n<!--Lists of Cities and \"Other destinations\" are limited to 9.-->\n* [[Abel Tasman National Park]] — golden sand beaches, kayaking and the Abel Tasman Coastal Track\n* [[Aoraki Mount Cook National Park]] — lots of hiking opportunities and New Zealand's highest mountain\n* [[Bay of Islands]] — pretty spot in the North Island with historical significance\n* [[Coromandel Peninsula]] — rugged coastline with plenty of beaches and hiking opportunities just one and a half hours from Auckland\n* [[Milford Sound]] — beautiful fiord in Fiordland National Park\n* [[Taupo]] — trout fishing and adventure activities in the central North Island\n* [[Tongariro National Park]] — three volcanoes, two skifields and one of the most popular hikes in the country\n* [[Westland National Park]] — home of the Franz Josef and Fox Glaciers\n* [[Wanaka]] — two beautiful lakes and the gateway to Mt Aspiring National Park, hiking, mountain biking, kayaking, canyoning, rock climbing\n\n==Get in==\nArrivals are by air or occasionally by sea (cruise ships into Auckland, Wellington, Nelson or Christchurch and the occasional private yacht. It is still just possible to book or even hitch a ride on the regular freighter circuits).\n\n===By plane===\nNew Zealand is a long way from anywhere else in the world, so for most visitors, the only practical way to enter New Zealand is by air. Even the shortest flights between Australia and New Zealand take over 3 hours.\n\nIn order of traffic, international gateways are at Auckland, Christchurch, Wellington, Queenstown and Dunedin.\nAuckland services more than 20 destinations and a dozen airlines, and there are direct connections from Christchurch to [[Sydney]], [[Melbourne]], [[Brisbane]] and [[Singapore]]. The others are largely restricted to flights from Australia. If you take a flight via Australia, make sure that you have a transit visa, [http://www.border.gov.au/Lega/Lega/Form/Immi-FAQs/do-i-need-a-visa-to-transit-through-australia if you need one], or you'll be turned back.  \n\nDue to its large Polynesian and Melanesian expatriate communities, New Zealand has extensive direct flight options to and from South Pacific nations such as [[Samoa]], [[Fiji]], [[Tonga]] and the [[Cook Islands]].\n\nDeparture tax is now included in the ticket price when flying out of New Zealand. Previously, you were required to pay departure tax separately before reaching airport security.\n\n=== Passports, visas and documentation ===\n\n{{infobox|Minimum validity of travel documents|* New Zealand citizens (and permanent residents) and Australian citizens (and permanent residents) need only present a passport which is valid on the dates they arrive in and depart from New Zealand.\n* If you are another national entering NZ as a visitor, student or temporary worker, you must present a passport valid either for at least 3 months beyond the date you intend to depart NZ, (or for 1 month beyond the date you intend to depart NZ if the issuing government has consular representation in NZ that is able to issue and renew travel documents - you should check with your passport issuing authority before travelling).\n* More information about the minimum validity of travel documents is available at [http://www.dol.govt.nz/immigration/knowledgebase/item/1166 Immigration New Zealand].}}\n\nForeign nationals of the following countries/territories can enter New Zealand '''visa-free''' as a ''visitor'' as long as they present a valid passport:\n\n'''Indefinitely:''' Australia (both Australian citizens and permanent residents)\n\n'''For up to 6 months:''' United Kingdom (British citizens and other British passport holders who produce evidence of the right to reside permanently in the UK)\n\n'''For up to 3 months:''' All '''European Union''' member states, [[Andorra]], [[Argentina]], [[Bahrain]], [[Brazil]], [[Brunei]], [[Canada]], [[Chile]], [[Hong Kong|Hong Kong SAR]] (including British National (Overseas) passports), [[Iceland]], [[Israel]], [[Japan]], [[Kuwait]], [[Liechtenstein]], [[Macau]], [[Malaysia]], [[Mexico]], [[Monaco]], [[Norway]], [[Oman]], [[Qatar]], [[San Marino]], [[Saudi Arabia]], [[Singapore]], [[South Korea]], [[Switzerland]], [[Taiwan]], [[Uruguay]], [[United Arab Emirates]], [[United States]] and [[Vatican City]]\n\nWith the exception of Australian citizens and permanent residents, entry as a visitor does '''not''' permit employment in New Zealand.\n\nFor more information, check the [http://glossary.immigration.govt.nz/VisaFreeCountries.htm list of Visa Free Countries]. All these visa waivers, including the one for Australians, can be refused. In particular, potential visitors with criminal records or who have been refused entry to or deported from any country should check with Immigration New Zealand if they need to apply for a visa.\n\nVisitors from countries not in the visa-free list or those wishing to stay longer than the maximum visa-free period for their nationality will need to apply for an appropriate visa. Check the [http://www.immigration.govt.nz/migrant/ Immigration New Zealand] web page for details.\n\nIf you require a visa to enter New Zealand, you might be able to apply for one at a British embassy, high commission or consulate in the country where you legally reside if there is no New Zealand diplomatic post. For example, the British embassies in [http://www.ukba.homeoffice.gov.uk/countries/serbia/commonwealth-bots/?langname=null Belgrade] and [http://www.ukba.homeoffice.gov.uk/countries/libya/commonwealth-bots/?langname=UK%20English Tripoli] accept New Zealand visa applications. British diplomatic posts charge £50 to process a New Zealand visa application and an extra £70 if Immigration New Zealand requires the visa application to be referred to them. Immigration New Zealand can also decide to charge an additional fee if they correspond with you directly.\n\nIf entering NZ as a visitor you must be able to show a  ticket to an onward destination (or evidence of onward travel arrangements such as a private jet or yacht) or you will be refused entry if you do not immediately agree to buy such a ticket at that airport. This requirement does not apply to Australian citizens or permanent residents.\n\nFor those who need a visa and are travelling in a group (having the same travel plans and itinerary), it may be better to apply for the considerably cheaper [http://www.immigration.govt.nz/migrant/stream/visit/visitors/specialvisitors.htm Group visa]. When applying for such a visa, apart from individual application forms, a separate group visa application form (only one form for the entire group) should also be submitted.\n\n=== Quarantine ===\nNew Zealand has very strong bio-security laws. \n\nNew Zealand's economy is based on agriculture and importing even small quantities of food, as well as unprocessed animal or plant materials is tightly controlled. These restrictions are designed to prevent the introduction of foreign animal and plant diseases and pests.  Do not think you can get away with bringing items in by not making a truthful declaration, ''all'' hand and checked luggage will be x-rayed on arrival and checked with specially trained sniffer dogs as part of the entry procedures.\n\nTake care with any items of food that you have obtained during your travel, many people have been caught and heavily fined after they did not declare fruit, etc  they were given as part of an in-flight meal and kept for later consumption.  The best advice is to declare any items you think may cause problems - bio-security control border staff may confiscate and destroy the item, but you will not have to pay a fine or face criminal prosecution and a jail term.  Even if you haven't declared an item on your arrival card, you can still advise staff of any items of contraband when you get to the customs and quarantine check without incurring a fine. If you have difficulty with the arrival card, most airline staff are able to assist you ''before'' arrival.\n\nThere are air-side amnesty bins available to cater for accidental importation. Items that must be declared include: any kind of food; any plant material; any animals, animal material or biological specimens; dirty or soiled sports gear, footwear, and used camping gear and anything that may have been in contact with soil, been used on a farm or has been used with animals. If declared, the owners of dirty items are often required to clean them thoroughly. Expect random inspections by sniffer-dogs - you may need to have your luggage inspected if you have had food in it recently that the dogs can smell.\n\nCommercially-packaged or processed food is usually allowed through, but you can still be fined if you do not declare them. If you are unsure, it is always best to declare any questionable items as the immigration officers will be able to tell you what needs to be cleaned or disposed of before entry. Some items, such as wooden souvenirs, may be taken for sterilization or fumigation before being released to you after payment of a fee.\n\nOn the spot fines of $400 are issued for not declaring controlled items. The law provides for deliberate breaches to receive a fine of up to $100,000 or a prison term of up to five years. \n\nImportation or possession of most recreational drugs, including cannabis, is illegal and results in arrest. If found guilty, you will be heavily fined and/or imprisoned, after which you will be deported and prohibited from coming back to NZ.\n\n==Get around==\n\n===By plane===\nDomestic flights in New Zealand are often cheaper than driving or taking the train, especially if crossing between the North and South Islands. \n\nAirlines operate an electronic ticket system. You can book on-line, by telephone, or through a travel agent. Photo ID will be needed for travel.\n\nCheck-in times are usually at least 30 minutes prior to flight departure. Cabin baggage and personal scanning is routinely conducted on services from the major airports that have jet landings. [[Nelson]] and other regional airports are still without these security theatricals.\n\n*[http://www.airnewzealand.co.nz '''Air New Zealand'''] has the most extensive domestic network, serving most cities over 20,000 people, with jet services between main centres and smaller aircraft elsewhere. Free economy baggage allowance is 7kg carry-on with 1 piece of checked baggage weighing 23kg costing $10 if pre-booked. Flights are reliable except when weather plays a factor.\n*[http://www.virginaustralia.com '''Virgin Australia'''] flies between Australia and many major cities in New Zealand. They code share with Air New Zealand for the domestic routes.\n*[http://www.jetstar.co.nz '''Jetstar'''] is a budget no-frills carrier, filling most Qantas routes. Jetstar offers flights between various major centres in New Zealand\n*[http://www.soundsair.com '''Sounds Air'''] offers a range of flights between the lower North and upper South islands.\n*[http://www.canterburyaviation.co.nz/charter-flights.html '''Canterbury Aviation'''] Provides point to point private charter flight services to destinations throughout New Zealand any day of the week within daylight hours. Travel without flight connections or waiting times - increased flexibility and departure times to suit you.\n\nSunair offers flights between various regional North Island centres.\nAir Chathams offers flights between the Chatham Islands, Pitt Island and the mainland cities.\n\nWellington Airport is particularly prone to the effects of high wind. Sometimes flights can be cancelled for several hours and even on calmer days. \n\nAuckland, Christchurch, Queenstown and Wellington airports have timetabled buses to the airport. Regional airports generally have only on-demand shuttle services and taxis.\n\n===By bike===\nYou can bring your own bike, as well as hire a bike in some of the larger cities. \n\nAuckland, Wellington and Christchurch have special facilities for re-assembling bikes that have been crated.\n\nYou must wear a helmet while riding, otherwise you will be fined on the spot. When hiring a bike you should be supplied with a helmet. Remember to ride on the left. You cannot ride on motorways in New Zealand, so be aware that the only bridge over the Auckland Harbour is a motorway, so you'll have to take a ferry or cycle around the harbour.\n\nRiding bikes in New Zealand can be fun, but be aware that because of the geography and small number of people cycling between towns there are very few cycle lanes and limited shoulder space on roads. \n\nMost \"Kiwis\" are good drivers but do not allow sufficient clearance when passing you. Be prepared for the large distances between towns and cities and the generally windy weather. While some areas of New Zealand are flat, most tourists cycling in New Zealand will find that they need to be able to cope with long periods of cycling up hills, especially in the Coromandel. Be prepared for any weather, and to experience four seasons in one day.\n\nSeveral tour operators incorporate cycling, with tours such as [http://www.pedaltours.co.nz/ Pedal Tours] as well as specialist cycle tour companies like [http://www.advsouth.co.nz Adventure South] and [http://www.naturalhigh.co.nz Natural High].\n\nThere is now a [http://www.nzcycletrail.com/ network of cycleways] being built around New Zealand, with some safe and beautiful routes.\n\n[[Nelson_(New_Zealand)|Nelson]] has both the most daily cyclists and some of the best recreational cycle trails such as the '''Dun Mountain Cycle Trail'''. [[Nelson_(New_Zealand)#Understand|Nelson certainly enjoys some of the best weather in New Zealand]]\n\n===By bus===\nBuses are a relatively cheap and environmentally friendly way to get around New Zealand; however, services even between major towns are usually only once per day. Most roads in New Zealand are quite narrow and winding (when compared to the highways of the USA), and travelling a long distance in a bus can be a safe and relaxing way to travel. Buses can sometimes be full, so it can pay to book a few days in advance. Booking in advance on some lines can get you great bargains.\n\n* [http://atomictravel.co.nz/ '''Atomic Shuttles'''] operate a no-frills shuttle service in parts of the South Island.\n\n* '''Backpacker buses''': [http://www.kiwiexperience.com/ KiwiExperience Backpacker Bus], [http://www.straytravel.com/ Stray Travel Bus] and [http://www.magicbus.co.nz/ MagicBus] offer bus trips around New Zealand where you can get on and off as you please.\n\n* [http://www.flyingkiwi.com/ '''Flying Kiwi'''] New Zealand’s original adventure bus tour company. Trips range from 3-27 days and cover both islands. The tours focus on enjoying the outdoor beauty and excitement of New Zealand with numerous hiking, cycling and activity options. There are also options to take extended breaks in your favourite places. Discounts are available for holders of YHA, VIP, ISIC and NOMADs cards.</listing>\n\n* [http://www.intercity.co.nz/ '''InterCity'''] New Zealand’s national bus company, with services connecting over 600 destinations nationwide. Operates InterCity, Newmans Coach Lines and also operates a modern fleet of vessels and coaches to operate [http://www.greatsights.co.nz/ GreatSights New Zealand], [http://dolphincruises.co.nz Fullers GreatSights Bay of Islands] and [http://www.awesomenz.com/ ''awesomeNZ.com'']. Tickets can be purchased from the InterCity ticket counters at bus stations or i-SITE information centres. A discount is given to students or youth-hostel membership card holders (eg: BBH, YHA, Nomads, ISIC). Fares start from $1 (plus a booking fee) on all InterCity’s national services. Free WiFi on all buses.\n** [http://www.travelpass.co.nz/ '''Travelpass'''] - A transport pass offered by InterCity. Brings together an extensive range of “hop on and off” fixed itinerary passes, based on the most popular touring routes throughout New Zealand. National passes include the Interislander ferry as well as a scenic boat cruise in Milford Sound. Passes are valid for 12 months. \n**[http://www.flexipass.co.nz/ '''Flexipass'''] - Utilising the combined national networks of InterCity, Newmans and GreatSights, Flexipass is sold in blocks of time, just like a prepaid phone card, and enables the holder to travel anywhere on the company’s network. Passes start at 15 hrs, which is enough to travel from Auckland to Wellington in the North Island. Flexipass hours can also be used to travel on the Interislander ferry [http://www.interislander.co.nz/] and on Fullers GreatSights Bay of Islands dolphin watching cruises and tours [http://www.dolphincruises.co.nz/] to Cape Brett and the famous \"Hole in the Rock\". Passes can also be on sold and are valid for 12 months.\n\n*[http://www.kiwiexperience.com/ '''Kiwi Experience'''] New Zealand's first hop-on/hop-off bus travel company, Kiwi Experience offers 32 different travel passes across their travel network on both the North and South Islands. Bus passes start from 2 days tours up to 29 days and must be used within a 12 month period. Kiwi Experience also offers 'guaranteed accommodation' for the first night at every destination, as well as a 'best price' guarantee on activities and a range of [http://www.kiwiexperience.com/SiteCollectionDocuments/PDFs/KiwiExperience-Discounts-2013-14.pdf exclusive discounts].\n\t\n*[http://westcoastshuttle.co.nz '''West Coast Shuttle'''] provide daily transport from Greymouth to Christchurch (via Arthur's Pass) return. They provide comfortable travel at affordable prices.\n\n===By campervan===\nSee also: '''[[Renting a motorhome in New Zealand]]'''\n\n===By car===\nSee also: '''[[Driving in New Zealand]]'''\n\nYou can reach most of New Zealand's sights in a normal, two-wheel-drive car or camper van. The volume of traffic is normally low and drivers are usually courteous. \n\nTraffic drives on the left in New Zealand.  \n\nOutside of cities roads are usually only one lane in each direction and undivided.  Typical New Zealand highways are one lane in each direction, so allow time to be caught behind slower moving traffic until it is safe to overtake.  Expect drivers behind you to become impatient if you don't keep up with the speed limits, so pull over and let them pass when it's safe to do so.\n\nTo legally drive in New Zealand you need to be at least 16 years of age and hold a valid drivers licence from your home country. If you plan on staying and driving for more than a year, you need to get a New Zealand licence.\n\n====Rideshare====\nRideshare and carpooling is increasing in New Zealand as petrol prices rise and people recognise the social and environmental benefit of sharing vehicles and travelling with others. While some systems are quite informal, others have trust systems which give greater security when choosing a ride.\n\n* [https://www.roadmate.co.nz/ '''RoadMate'''] is a free carpooling app connecting drivers with empty seats to people travelling the same way for a one-off journey or a daily commute.\n\n====Rental====\nCar rental firms range from the familiar multi-national big brands through to small local car rental firms. The advantage of the big name rental firms is they can be found throughout New Zealand and offer the biggest and newest range of rental vehicles. The disadvantage is that generally they are the most expensive. Occasionally rental firms offer free rental in the direction from south to north due to the majority of tourists travelling in the opposite direction, creating a deficit of cars in the north.\n\nAt the other end of the scale are the small local operators who typically have older rental cars. Whilst you may not end up driving this year's latest model the advantage is that the smaller car rental firms can be substantially cheaper, so leaving you more money to spend on the many exciting attractions New Zealand offers. Between these extremes you will find a wide range of NZ car rental firms catering to different needs and budgets.\n\nOther things to note are that you drive on the left in New Zealand and that most car hire firms require you to be over 20, hold a full licence and you need an International licence or certified translation if not in English.\n\nSelf-drive holidays are a great way to travel around New Zealand as they offer independence, flexibility and opportunities to interact with the locals. A number of companies offer inclusive self-drive holidays with rental car & accommodation, pre-set itineraries or customised to suit your interests.\n\n====Purchase and sale====\nIf you want to have a extended holiday in New Zealand, and you would prefer to have your own transport it may be cheaper to buy a car or van and resell it just before leaving. If you use this method travel across Cook Strait can be expensive.  If purchasing a car for $500 or less it may be cheaper to buy and sell a car in each island separately. In addition to the usual ways to look for a car (newspapers, accommodation noticeboards, car markets etc) New Zealand's biggest on-line auction website Trademe [http://www.trademe.co.nz/] has many listings. Another option is the Sell Buy Swap [http://www.sellbuyswap.co.nz] South Island website. You can also try the backpackers car market [http://www.backpackerscarmarket.co.nz/] where there are usually people selling their cars off cheaply. Car auctions can also be a suitable option if you are looking to buy a car. Turner's Auctions [http://www.turners.co.nz/] have regular auctions and are in larger cities. Look out for \"Repo\" auctions, where the cars being sold are as a result of repossession. Should any previous ownership problems have existed, these will have been resolved before auction commences. \n\nThe following things need to be checked in order to safely purchase a vehicle in New Zealand:\n\n* there is no debt on the vehicle. In NZ, if a loan of money is used to purchase a vehicle, then the debt is associated with that vehicle even if it is sold, in which case the new owner then has the problem of the debt. Selling a vehicle with debt associated with it in NZ is illegal. Checking for debt is an easy process as a central register is kept. Carjam is an inexpensive service [http://www.carjam.co.nz/]. PPSR is the official register of security interests in New Zealand [http://www.ppsr.govt.nz/cms]\n\n* the vehicle has not been stolen. Contact the police with the registration plate and VIN (vehicle identification number).\n\n* legally, the vehicle must have a Warrant of Fitness valid for at least 30 days (unless advertised \"as is, where is\"). The expiry date will be written on the inside of the car window sticker.\n\n* the Registration expiration date is not in the past. This label is usually on the left side of the car windscreen\n\n* the vehicle needs a physical check for faults, there are companies in main centres that provide this service.\n\nWhen you sell a vehicle it is very important to go to a Postshop outlet to record the transfer otherwise any subsequent speeding fines, parking tickets, etc will be recorded in your name.\n\nCar insurance is not compulsory in New Zealand but at least third party insurance is recommended. Diesel vehicles have additional requirements, as diesel is significantly cheaper than petrol but there are additional charges based on distance travelled.\n\n===By motorcycle===\nNew Zealand is a motorbike rider's dream country! Motorcycle rentals of many makes are available throughout New Zealand.\n\n[http://www.motorbiketours.co.nz '''South Pacific Motorcycles'''] offer motorbike rental and motorbike tours (Harley-Davidson, BMW, Honda, Triumph & other late-model motorcycles)as well as self-guided motorcycle tours and based in Christchurch in the South Island, motorcyclists have easy access to some of the best motorcycling in the world.\n\n[http://www.justridemotorbiketours.com '''Just Ride Motorbike Tours & Rentals'''] based out of Auckland, have a range of short duration \"mini tours\" that can fit in with your other holiday plans, as well as longer guided tours throughout the North and South Island. With a range of Triumph, Aprilia, Motto Guzzi and Ducati motorcycles they focus on the joy of riding the bike as much as the enjoyment of the countryside.\n\n===By hitch hiking===\n[[Tips for hitchhiking|Hitch hiking]] around New Zealand is generally quite easy. However, it is illegal to hitch hike on the few motorways (except on the on-ramps) and illegal for motorists to stop there to pick you up. Try to get out of the middle of town, especially where public transport operates. Wear your pack and look like you're touring the country rather than just a local looking for a lift. \n\nYou have as much chance of being picked up by another tourist as a local, particularly in tourist areas. Alternatives for travellers include organizing shared rides through hostels, or using an on-line ridesharing resource like Jayride [http://www.jayride.co.nz] which aims to make the process safer.\n\n===By rail===\n''See also: [[Train travel in New Zealand]]''\n\nBoth Auckland and Wellington have commuter rail services. These services are operated by [http://www.at.govt.nz/ AT Metro] in Auckland and [https://www.metlink.org.nz Metlink] in [[Greater Wellington]].\n\nInter-city rail passenger services are operated by [https://www.greatjourneysofnz.co.nz/ Great Journeys of New Zealand]. The focus is on popular tourist trains, which pass through spectacular scenery and have a running commentary, panoramic windows and an open-air viewing carriage.\n\n* '''The Northern Explorer''' - between Auckland and Wellington. This modern train now runs 3 days each way per week; southbound on Monday, Thursday and Saturday and northbound on Tuesday, Friday and Sunday. One of the world's most scenic rail journeys.\n\n* '''The Capital Connection''' - Commuter service leaves from Palmerston North to Wellington in the morning, returning in the evening. \n\n* '''The Coastal Pacific''' - from Christchurch to Picton (via Kaikoura) and return daily. Travels along the rugged north-east coast of the South Island. Meets the Picton-Wellington ferry. ''This service is temporarily out of operation as an effect of track damage caused by a major earthquake in 2016''.\n\n* '''The TranzAlpine''' - from Christchurch to Greymouth and return daily. Classed as one of the world's great train journeys, this trip crosses the South Island, passing through spectacular mountain scenery, some of which is inaccessible by road, as well as the 12 km Otira tunnel. Many visitors disembark at [[Arthur's Pass National Park]] and spend four hours exploring the mountains before catching the return train.\n\nMost New Zealanders prefer to drive or fly, as train fares are comparatively expensive. Trains are more suited to tourists as they are more scenic and more comfortable than other forms of travel. Very modern carriages equip all KiwiRail Scenic trains with automated commentary and most other features found on long distance trains.\n\nBook online at [https://www.greatjourneysofnz.co.nz/ greatjourneys.co.nz.] Cheapest fares only shown online when using a New Zealand IP address. Wait till you arrive, use a proxy service or book by phone.\n\n===By boat===\n\n*'''Cook Strait''' (Wellington - Picton)\nTo get your car between the North and South Islands you will need to take a ferry across Cook Strait. There are several sailings daily between Wellington and [[Picton (New Zealand)|Picton]], but be prepared for a delay or a change in sailing times if the weather is stormy. Two companies run ferries here; '''[http://www.bluebridge.co.nz Bluebridge]''' and  '''[http://www.interislander.co.nz Interislander]'''.\n\n*'''Auckland'''\n**[https://www.fullers.co.nz '''Fullers and 360 Discovery'''] operate ferry services from central Auckland to Gulf Harbour, Waiheke Island, Coromandel and various pest-free conservation islands in the Hauraki Gulf, as well as commuter services to various wharves in Auckland's inner harbour.\n**[http://www.sealink.co.nz '''SeaLink'''] operates car ferry services to Waiheke, Great Barrier and Rakino islands, and a high-speed ferry service to Pine Harbour. \n**[https://www.belaire.co.nz/ '''Belaire Ferries'''] operates from downtown Auckland to Rakino Island and Hobsonville (West Harbour).\n\n*'''Wellington'''\n**[http://eastbywest.co.nz/timetables/ '''East By West'''] operates ferry services daily between central Wellington, Matiu Somes Island, Seatoun and Days Bay.\n\nA number of communities are served by boat, rather than road, while charter boats are available for expeditions in several places. There are regular sightseeing cruises in several tourist destinations, particularly in the Southern Lakes and Fiordland area.\n\n==See==\n[[File:Lake Ohau Lodge lupin field, NZ.jpg|thumb|Wild lupins growing on Lake Ohau near the Southern Alps on the South Island.]]\n[[File:Milford Sound at Sunset.jpg|thumb|Milford Sound]]\n\n=== Mountains, lakes and glaciers ===\nIt can be said that in New Zealand it's the countryside that's magnificent, and perhaps no more so than the '''Southern Alps''' of the South Island.  In the Mackenzie Country of [[Canterbury (New Zealand)|Canterbury]], the snow-capped jagged peaks rising above turquoise lakes have provided the inspiration for many a postcard. Tucked in behind is the country's highest peak, [[Aoraki Mount Cook National Park|Aoraki Mount Cook]]. The lakes and mountains continue south, becoming a stunning backdrop for the towns of [[Wanaka]], [[Queenstown]] and [[Glenorchy]].\n\nAnother region where mountain meets water with striking effect is [[Fiordland National Park]] where steep, densely forested mountains rise from the sea. The most accessible, and possibly most beautiful spot, is [[Milford Sound]]. The road in is spectacular and the view even more so when you arrive. \n\n'''Glaciers''' may not be the first thing that comes to mind when you think of an island in the South Pacific, but New Zealand has several. The most notable are the Fox and Franz Josef glaciers in [[Westland National Park]]. These glaciers are unique in how close they get to sea level and are sustained by the enormous amount of precipitation that falls on New Zealand's west coast.\n\n=== Volcanoes and geysers ===\nNew Zealand is a geological hotspot and has many dormant and active '''volcanoes, geysers and hot springs'''.  The best place to start is [[Rotorua]], where the smell of sulphur lets you know you're close to the action. The surrounding countryside has many parks with geysers and hot springs, and Mount Tarawera, the site of one of New Zealand's more famous eruptions, lies a short drive away.\n\nSouth of Rotorua is [[Taupo]] and Lake Taupo, which was formed in a massive volcanic explosion thousands of years ago. Beyond Lake Taupo is [[Tongariro National Park]], dominated by its three volcanoes, Tongariro, Ngauruhoe and Ruapheu.  All three mountains are still active (Ruapehu last erupted in 2007) and Ruapehu has a crater lake that can be viewed with a bit of hiking. Ngauruhoe is famous for filling in as Mt. Doom in the ''Lord of the Rings'' trilogy.\n\nNorth of Rotorua is [[Whakatane]], with tours to '''White Island''', a volcanic island just off the coast. The island is truly a different world with its smoke plume, green crater lake and the pohutukawa trees clinging to a fragile existence on the volcanic rock.\n\n=== Flora and fauna ===\nBeing so remote, New Zealand has very unique plants and animals.  One of the most impressive is the '''kauri''' tree, one of the biggest species of tree in the world. Few of these giants are left (a result of overlogging), but a visit to the '''Waipoua Forest''' in [[Northland]] will afford a glimpse.\n\nThe beaches of the South Island, particularly [[The Catlins]] and the Otago Peninsula, are good places to see marine animals such as '''penguins, seals and sea lions''' in their natural habitat. The Otago Peninsula is also noted for its albatross colony.\n\nUnfortunately, many of New Zealand's most unique animals are endangered and can only really be seen in captivity. This includes the '''kiwi''', a common national symbol, the flightless takahe and the tuatara (a small lizard-like reptile believed to have existed at the time of the dinosaurs).\n\nNew Zealand's National Parks are maintained by the Department of Conservation (DOC) and various local governments. Access is usually free but may be restricted in some parks during some parts of the year due to weather (avalanche risk) or farming (lambing season). It is best to check with local tourist information centres for up to date information on park access.\n\nProposals to eradicate or otherwise heavily manage non-native animals are contentious issues in New Zealand. The most common pest management tools are poisonous baits. These are delivered through ground bait stations or, more cost effectively (though controversially), by helicopter drops. Department of Conservation and OSPRI/TBfree NZ provide pesticide summaries that include warnings, maps of the areas affected, and which poisons have been used. These pest summaries are updated regularly on their websites.\n\n===Urban fare===\nWhile the countryside is the main attraction of New Zealand, you'll need to visit a few cities to see the truth of that. [[Auckland]] is a pleasant city with its waterfront districts like the Viaduct Harbour and Mission Bay, old volcanoes (Mt Eden and One Tree Hill), a handful of museums and the Sky Tower, the tallest free-standing building in the Southern Hemisphere. The more interesting architecture and the fine Te Papa museum can be found in [[Wellington]], the nation's capital. [[Napier]] is worth a stop for its Art Deco CBD, and Christchurch was interesting for its English character along the banks of the River Avon before the destruction wreaked by earthquakes. [[Nelson (New Zealand)|Nelson]] is the arts, crafts, pottery and craft brewing capital and has the only European style cathedral left standing (called \"Christ Church Cathedral\"); it doesn't hurt that Nelson has great beaches and is surrounded by three national parks.\n\n===Itineraries===\n* [[Nine days in New Zealand's North Island]]\n* [[Two weeks in New Zealand's South Island]]\n* [[Eighteen Day Small Group Tour Covering Both Islands]]\n\n==Do==\n[[File:New Zealand mountain ranges.jpg|thumb|upright=1.3|Snow capped mountain ranges in New Zealand as seen in ''Lord of the Rings'']]\nOutdoor and adventure activities include:\n* Abseiling [[Waitomo]]\n* Aerial sightseeing (helicopter and fixed-wing)\n* Birdwatching\n* Black water rafting (cave rafting)\n* Boat Tours\n* Bungy Jump Queenstown, Auckland, Lake Taupo - the modern bungy jump was invented here by New Zealander A.J. Hackett.\n* Canoeing and kayaking on rivers and lakes\n* Canyoning\n* Caving Waitomo, Nelson, South Island West Coast, [[Te Anau]]\n* Climbing\n* Diving\n* Dolphin Watching [[Auckland]] \n* Fishing - trout (some of the finest trout-fishing in the world), salmon, marlin, broadbill, sharks and many other salt-water species\n* Fly by wire (invented here)\n* Four-wheel driving\n* Gliding - [[Omarama]] is one of the best places in the world for gliding\n* [[Golf]] - New Zealand has over 400 registered golf courses, from local clubs to internationally renowned resorts, offering uncrowded golfing and superb scenery.\n* Hang-gliding\n* Heli-hiking at [[Fox Glacier]] \n* Hiking - New Zealand has a number of national parks and other wilderness and forested areas, much of which is managed by the [http://www.doc.govt.nz/ Department of Conservation]. The activity known in other countries as hiking, trekking or bush walking is known as [[tramping in New Zealand]] and is a very popular activity for visitors and locals. \n* Horse trekking\n* Hot-air ballooning\n* Hunting - several species of deer, wild pig (wild boar), tahr, chamois, goat, wallabies (they are protected in Australia but a pest here), game birds.\n* Ice-climbing\n* Jetskiing\n* Kite surfing\n* ''Lord of the Rings'' Tours  that show the actual locations used in the filming.\n* Luge (on concrete not ice) Auckland, Queenstown, Rotorua.\n* Mountaineering - this was the training ground for Sir Edmund Hillary, one of the first two people to climb Mt Everest.\n* Mountain biking\n* Museums\n* Nature tours\n* Paragliding/Parapenting\n* Quad biking\n* Rafting\n* Rap jumping\n* River jetboating - the Hamilton jet was invented by New Zealander William Hamilton.\n* Rockclimbing\n* Rugby - the national game. Major tournaments include the ITM Cup, featuring domestic teams; Super Rugby, featuring regional teams from New Zealand, Australia and South Africa; and The Rugby Championship, in which the national team, the All Blacks, plays the national teams of Australia, South Africa and Argentina.\n* Sailing - New Zealand has produced many world-champion yachties and is the only country apart from the US to have won and successfully defended yachting's ultimate prize, the America's Cup.\n* Scuba diving and snorkelling, especially down to the sunken ''Rainbow Warrior'' at Matauri Bay, not far from [[Kerikeri]].\n* Sea kayaking [[Abel_Tasman_National_Park|Abel Tasman Marine Reserve]]\n* Shark cage diving [[Kaikoura]]\n* Skiing and snowboarding including heli-skiing Queenstown\n* [[Skydiving]]\n* Surfing\n* Swimming with dolphins [[Kaikoura]], [[Bay of Islands]]\n* Swimming with seals\n* Whale watching [[Auckland]]\n* Whale watching [[Kaikoura]]\n* White water rafting [[Fox Glacier]]\n* White water sledging / dam dropping \n* Windsurfing\n* Zoos\n* Zorbing (invented here) Agrodome in [[Rotorua]]\n\n==Talk==\n'''English''', '''Māori''' and '''New Zealand Sign Language''' are the official languages of New Zealand. English is universal and is officially written with Commonwealth (British) spelling.\n\nNew Zealand English is one of the major varieties of English and is different enough from other forms to justify the publication of the Oxford New Zealand English dictionary. \n\nWord usage may also differ occasionally, in potentially embarrassing ways for the traveller. Several words that Americans may consider offensive, or have euphemisms for, are considered acceptable usage. For example: A New Zealand ''bathroom'' refers to a ''room'' containing a ''bath'' while the other facilities (containing a WC) that an American might refer to as a ''bathroom'' or ''washroom'' are known as a ''toilet'' or \"loo\". The American habit of \"bleeping\" swear words from broadcasts is considered quaint and rarely done in local programming. The New Zealand broadcasting media are unusually tolerant of swear words when used in context. \n\nThe New Zealand accent is somewhat nasalised with flattened vowel sounds and vowel shifting. New Zealanders consider their accent to be markedly different from the Australian one and are often offended when mistaken for or confused with Australians. New Zealand terminology and slang are also different from Australian usage. Americans find New Zealand accents easy to understand, so do Australians and Brits. Some European languages find it slightly harder and Asians may find it rather hard to understand; New Zealanders are quite happy, however, to repeat what they just said if necessary.\n\n'''Māori''' is spoken by a minority of both Māori and language learners. Māori is available as a language to study in at many educational institutes. The Māori language is spoken by some, but by no means all, Māori plus a few non-Māori, especially in the far north and east of the North Island. Many place names are in Māori and for the traveller some knowledge of Māori pronunciation is could useful but is not essential as European and Māori pronunciations of the same place can be quite different. \n\n'''New Zealand Sign Language''' (NZSL) was given status in 2005 as an official language of the country. It has its roots in British Sign Language (BSL), and is also closely related to Auslan (Australian Sign Language). Users of BSL or Auslan may find NZSL intelligible, as they share a large portion of vocabulary, plus the same two-handed manual alphabet. On the other hand, users of languages in the French Sign Language family, which also includes American and Irish Sign Languages, will not be able to understand NZSL. The vocabulary is quite different, and languages in that family use a one-handed manual alphabet.\n\nSee also: [[Māori phrasebook]]\n\n===Common expressions===\nGenerally, New Zealand English expressions follow British English. However, New Zealand English has also borrowed much from Māori and there are a number of other phrases that are not commonly encountered elsewhere or may confuse the visitor.\n\n* '''Bach''' (pronounced \"batch\") - Holiday home; often by the beach and comprised of fairly basic accommodation. In the South Island often called a crib.\n\n* '''Pot Luck''' - (see also \"Ladies a plate\") means each attendant of the event should bring a plate of ''food'' to share with the other guests.\n\n* '''BYO''' - Bring Your Own. A restaurant may not have a liquor licence but it is okay to bring your own wine to enjoy with your food, but they often charge a small corkage fee.\n\n* '''Clayton's''' - (rarely used) An item that lacks full functionality or is a poor imitation of the real thing. From the name of the unsuccessful non-alcoholic whisky that was briefly marketed during the late 1970s/early 1980s under the catch phrase ''The drink you're having when you are not having a drink.''\n\n* '''Dairy''' - Convenience store; corner shop.\n\n* '''Entry by gold (or silver) coin (donation)''' - The admission charge to an event, exhibit, gallery or museum is by making a payment of a coin in the appropriate metal, often in the donation box at the door. The gold coins in NZ are the $1 and $2 coins, while silver are the 20c and 50c coins. (See also \"Koha\" below). \n\n* '''Half Pie''' - Usually a job or task not performed to satisfaction (cf Māori ''Pai'' = good)\n\n* '''Jandals''' - Flip-flops to most of the world. \n\n* '''Kiwi''' - Almost universally used for a \"New Zealander\"; named after a flightless bird that lays the largest egg relative to body size and is a national emblem. This is '''not''' a derogatory term with many New Zealanders happily referring to themselves as ''Kiwis''.\n\n===Slang expressions===\nIf you don't understand, just ask and then most \"Kiwis\" will explain...\n\n* '''Barbie''' - Short for barbecue \n\n* '''Bro''' (pronounced more like \"bru\") - Short for brother but used by males to address other males.\n\n* '''Bush''' - Forest. Usually meaning a native forest as opposed to a plantation forest.\n\n* '''Choice!''' - Cool, great.\n\n* '''Chur''' - Thanks or Choice. Sometimes used as Chur Chur, which can also mean Christchurch.\n\n* '''eh?''' - sometimes used at the end of a statement to change it to a question, similar to Canadian usage.\n\n* '''Gumboots''' - Wellington Boots or Rain Boots\n\n* '''mint''' - in tip top condition.\n\n* '''munted''' - broken.\n\n* '''oi''' - hey. Can be meant as a warning or jokingly, originated in England.\n\n* '''pash''' - french kiss.\n\n* '''Sweet as!''' - Cool, good thing, No problem. Often abbreviated to just 'sweet'.\n\n===Māori words and expressions===\n* '''Kia Ora''' - Hello, welcome, literally good health. Often used as an utterance of agreement, especially during speaking at a hui.\n\n* '''Haere Mai''' - A greeting to a person arriving, while '''Haere Ra''' is a salutation to one leaving.\n\n* '''Hui''' - A meeting or gathering to discuss and debate issues in traditional  Māori fashion.\n\n* '''Iwi''' - A Māori tribe or people, sometimes known as a ''Waka'' (canoe), as some iwi are named after the ocean going canoes that brought their ancestors to New Zealand.\n\n* '''Koha''' - A Māori term for gifts or donations. Often an exchange of gifts takes place. (Sometimes the admission signs say, \"Entry Koha\", meaning gold coin or what you feel like donating.)\n \n* '''Kai''' - Food. Common with both Māori and non-Māori.\n\n* '''Marae''' - A traditional Māori meeting or gathering place. Also a community centre.\n\n* '''Pākehā''' - The Māori word for New Zealanders of non-Māori descent, generally thought to have arisen from a  Māori story about spirit creatures called 'pakepakeha'. Many New Zealanders do not refer to themselves as Pākehā with some finding it offensive, others however see the name as part of their unique identity.\n\n*'''Powhiri''' - A  Māori ceremonial welcome. Especially to a marae, but now also may take place at the start of a conference or similar large meeting in New Zealand.\n\n* '''Whanau''' - A  Māori (extended) family. Kinfolk. Used often in advertising to alliterate with friends such as 'friends and whanau'.\n\n* '''Wharenui''' - literally ''big house'', is the meeting house on a marae. \n\n* '''Wharekai''' - literally ''food house'', is the dining room and/or kitchen on a marae.\n\n* '''Wharepaku''' - literally ''Small house'' - Toilet\n\n==Buy==\n[[Image:Martyna Zambrzycka Millspaugh (8).JPG|thumb|20 New Zealand Dollars (NZD)]]\nCurrency used in New Zealand is the '''New Zealand Dollar''' (NZD). Other currencies are not readily accepted other than at some of the larger hotels and at banks throughout New Zealand. Attempting to make a transaction in a foreign currency may result in some light hearted bemusement.\n\nThe smallest coin is 10c, since New Zealand reduced the size of its silver (cent) coins in 2006, and eliminated the 5c piece. The 10c piece is a coppery colour similar to a U.S. or UK penny. The 20c piece is silver with a  Māori carving depicted, as is the 50c piece with captain James Cook's ship the Endeavour. The gold $1 features a kiwi, whilst the $2 features a heron. Banknotes come in $5 (orange with Sir Edmund Hillary), $10 (blue with Kate Sheppard), $20 (green with Queen Elizabeth II), $50 (purple with Sir Apirana Ngata), and $100 (red with Lord Rutherford of Nelson).\n\nOn Christmas Day, Good Friday, Easter Sunday, and before 1PM on Anzac Day (25 April), all but a few essential businesses must be closed. While many traders flout this regulation, the matter has for many years been being reviewed by the government. If you are in New Zealand on one of these days, ensure you have all your needs met prior to the date.\n\n===Electronic banking/purchasing===\n\nNew Zealanders are amongst the highest users of electronic banking services in the world. Automatic teller machines (ATMs), locally known as 'the hole in the wall', are available in just about every town, even those without a bank. Most shops have Eftpos (Electronic Funds Transfer at Point Of Sale) terminals for debit and credit cards, so most purchases can be made electronically. Credit cards, especially Diners Club and AMEX (due to the large fees they force on retailers), are not accepted by some merchants with Eftpos, especially smaller food retailers such as dairies, takeaways and cafes that do not serve alcohol. Also smaller retailers may often set a minimum purchase of around $10 when obtaining cash, if they agree to provide cash. Banks offer a wide range of telephone and Internet banking services. If you are going to be in New Zealand for a while it may be convenient to open a New Zealand bank account and set up a local debit card, to avoid carrying a lot of cash around.\n\nNew Zealand is a user of the CHIP and PIN credit card system which uses an electronic chip in the card and the holder's PIN number to allow a transaction to go through. Most merchants also accept the swipe and sign method which is mostly used by U.S. credit card holders; as they have not yet adapted to the CHIP and PIN system. However, automated machines may not accept credit cards without a chip. Therefore, it is recommended that you have enough cash on hand to make purchase. These mainly appear in rural areas. If you are using a credit card with a magnetic strip (no chip embedded) at a staffed stand, then you shouldn't have problems using your credit card. After your card is swiped; the terminal will prompt you for your PIN. Just press \"ENTER\" and your transaction should be approved. After signing the printed receipt, the clerk is required to check that your signature on your credit card matches that of a valid identification before he/she can complete the transaction. This is to minimize fraud. A driver license or passport, from your home country, will suffice.\n\nNote: New Zealand cards can be set to have up to 3 accounts loaded hence the terminal will prompt \"Cheque - Savings - Credit\". Overseas cards will need to use the \"Credit\" option, regardless of card type. \n\n\n\n* Note: The Discover credit card is accepted by a limited number of merchants in Auckland. It is not known whether Discover is accepted in other parts of New Zealand.\n\n===Price negotiation===\n\nBecause of strong advertising laws, the displayed price is normally the purchase price for most goods sold in New Zealand. The principle ''The price stated is the price you pay'' is strongly ingrained in New Zealand culture.\n\nMost retailers will not negotiate on price, though some have a formal policy of matching the competition and will match or even discount their prices for you if you can find a better price for the exact same product elsewhere. However, this seems to be changing as there are stories about people finding appliance and electronics stores very willing to negotiate on price in order to get business, especially if you're looking at high-end items or have a shopping list of multiple high-priced items. Some places you have to ask for a discount, while others have salespeople that offer discounts on pricey goods as soon as they approach you. Other than high end appliance stores haggling is generally viewed as extremely rude. As a customer you are seen as wasting a shopkeeper's time because it is assumed that they have priced the good at a reasonable price and as a shopkeeper you would be wasting the customer's time if you overpriced the item expecting customers to haggle.\n\nIf you are in New Zealand for an extended period of time, the website Trademe provides a similar business model to overseas giant Ebay. However Trademe has a greater focus on Direct Debit based trading and minimal to no fees required upon an item's initial listing.\n\n===Taxes and fees===\nUnless otherwise explicitly stated, NZ prices include GST (Goods and Services Tax, or sales tax) of 15%. \n\nSome shops, especially in tourist destinations, will ship purchases overseas, as exported goods are not subject to GST. Ask about this service before making your purchase. Goods purchased and taken with you will be subject to GST. \n\n\"Visitors to New Zealand must pay GST on all goods and services that they buy in New Zealand. There is no refund of GST available when you leave New Zealand.\" [http://www.ird.govt.nz/international/comingleaving/coming/temp/] \n\nOn public holidays, some establishments such as cafes may charge a ''holiday'' surcharge in the region of 15%, supposedly to cover the cost of employing staff who are working on the holiday. This is a recent development because current holiday legislation requires workers who work on public holidays to be paid at one-and-a-half times their normal wage and be given a equal time off in lieu as a minimum. The legality of this surcharge is questionable if not advertised openly or notified at the time of placing an order and might be challenged if you're feeling brave. This surcharge is already beginning to go out of fashion, as shops generally do a roaring trade on holidays and many consumers don't appreciate this development.\n\n===Tipping===\nIn lodgings, restaurants, and bars the prices charged include the services provided and tips are not expected. Do not be surprised or offended if you receive bemused looks or if your tip is initially refused or questioned as tipping is not practiced by New Zealanders. For some New Zealanders their unfamiliarity with tipping can make them ill-at-ease with it when travelling in countries where it is practised. It can be viewed very negatively by New Zealanders as being made to 'pay twice', or as a form of bribery. Staff in some establishments may risk their job in accepting a tip. Tipjars may be placed on counters, but these are for loose change, you are not expected to place coins in them. It is common practice and polite to donate your spare change from the meal to what ever charity has a collection jar on the counter, and this acts as the standard substitute for tipping.\n\n==Eat==\n\nNew Zealand has a distinctive cafe culture, with arguably some of the best espresso on the planet. Cafes often have excellent food, serving anything from a muffin to a full meal \n\nIn smaller towns food is always available at the local pub/'hotel'/'bistro', although the quality tends to be of the burger-and-chips variety.\n\nFast food/convenience food is fairly easy to come by. Petrol stations often sell pies that can be heated in-store. Fast food is available everywhere, most of the larger chains are represented. There are a number of local burger chains as well, Burger Wisconsin and Burger Fuel are both worth trying.\n\nFish and chips are a local speciality. The fish is often extremely good quality, often supplied by local fishermen. The style is somewhat different to the English style: chips tend to be crisper, and vinegar is never used as a dressing. The menu consists of battered fish portions deep fried in oil together with chunky cut potato chips as well as a range of other meats, seafood, pineapple rings and even chocolate bar. A good meal can often be had for under $5, a bad one for the same price.\n\nLamb is also abundant and often fresh from the farm.\n===Cuisine===\nNew Zealand's cultural majority, mainly British, do not have a definitive and recognisably distinct cuisine that differs markedly from the traditional British cuisine. However there are a number of small differences\n\n*Roast '''kumara''' - the sweet potato (''Ipomoea batatas'') roasted in the same manner as potatoes and often served instead of or alongside. May also be deep fried like potato chips and known as '''kumara chips''' - nice served with sour cream but rarely done well as kumara cooks at a different temperature than potatoes, so it needs a skilled chef for the dish to be done perfectly.\n\n*'''Pavlova''', or '''pav''', a cake of whipped egg whites baked to have a crusty meringue-like outside but soft in the middle, topped with whipped cream and decorated with sliced fruit. The dessert is also common in Australia, there is debate between the two countries as to where it was first invented.\n\n*'''ANZAC biscuits''' - Plain hard biscuits made primarily from oatmeal bound with golden syrup. Originally made for and by ANZAC troops during the First World War. Also found in Australia.\n\n*'''Pies''' - New Zealanders eat large numbers of flakey-pastry meat pies, available from dairys, supermarkets, petrol stations and bakeries. By far, most popular flavours include Steak & Cheese (slow cooked beef with cheddar cheese), Mince & Cheese ( or ground beef for North Americans) and contain things like chicken, lamb, pork, potato, kumara, vegetables, and cheese. Some companies now market ranges of \"gourmet\" pies and there is an annual competition for the best pie in a variety of catagories.\n\n*'''Kiwifruit''' - A plum-sized green fleshed fruit, with fine black seeds in the flesh, originating from China, selectively bred in New Zealand, and first known to the home gardener as the ''Chinese Gooseberry''. Now commercially farmed, with production centred on [[Te Puke]] but in many orcharding areas. Slices often served on pavlova. Known by its full name of kiwifruit and never shortened to ''kiwi'' in New Zealand, as ''kiwi'' are endangered birds or New Zealanders.\n\n*'''Whitebait''' - The translucent sprat or fingerlings of native freshwater fish species that migrate from spawning in the sea each year. After being caught in coastal river mouth set or hand nets during November/December, this highly sought after delicacy is rushed to all ends of the country. Served in a fried pattie made from an egg based batter. May be seasonally available from a local fish and chip shop. Is served without gutting or deheading.\n\nMāori also have a distinctive cuisine:\n\n*The '''''hangi''''' or earth oven is the traditional way that  Māori cook food for large gatherings. Meat, vegetables and sometimes puddings are slowly steam-cooked for several hours in a covered pit that has previously been lined with stones and had a hot wood fire burn down in it.\n\n*'''''Kaimoana''''' (literally: ''sea food'') - particularly shellfish gathered from inter-tidal rocks and beaches as well as '''crayfish''' (rock lobster) and inshore fish caught on a line or with nets. Species such as '''paua''' (blackfoot abalone) and '''toheroa''' have been overfished and gathering restrictions are strictly enforced, while '''green mussels''' are commercially grown and sold live, or processed, in supermarkets. '''WARNING''' While it is extremely common to see people collecting shellfish, crustaceans and other ''kaimoana'', there are a number of rules to be aware of, eg: minimum sizes or daily catch limits, which are usually posted on signs at the approaches to the collecting area. These rules are strictly enforced. If in doubt, check with a local. Rules may be seasonal or all-year catch limits set by the Ministry of Fisheries, or they may be that certain areas are reserved solely for ''tangata whenua'' (local Māori iwi), or a combination. At times, areas may have a prohibition for health reasons.\n\nIn addition to the above, New Zealand cuisine has taken a decidedly international turn over the past decade. Sushi is becoming increasingly popular (albeit in a somewhat different form to the Japanese original), as are many of the cuisines of the pacific rim.\n\n==Drink==\nNew Zealanders have a reputation for enjoying their beer. Although there are now only three major breweries, there are many regional brands, each with their own distinctive taste and staunch supporters.\n\nTake care when and where you indulge in public. New Zealand has recently introduced liquor ban areas--that means alcoholic drinks cannot be consumed or even carried in some streets, such as city centres and popular beaches, at certain times of the day or night. Police can instruct you to empty bottles and arrest you if you do not comply.\n\nThe  New Zealand wine industry has developed into a significant export industry.  New Zealand is now known as one of the top producers of Sauvignon Blanc.  The Hawkes Bay region is well known for its Merlot, Cabernet Sauvignon, Syrah, Chardonnay and more recently Viognier varieties. Marlborough is the largest wine producing region and famous for its Sauvignon Blanc.  Waipara in North Canterbury specialises in Riesling and Pinot Gris. Further south in Central Otago, Pinot Noir is produced in the most concentrated of styles. Many vineyards now offer winery tours, wine tasting and sales from the vineyard.\n\nThe minimum legal purchase age for alcohol in New Zealand is 18, and can only be supplied to under-18s via a parent or legal guardian. It is universal policy for bars and retailers to ask for photo identification from any patron who looks under the age of 25, and the only forms of identification accepted are a valid New Zealand or overseas passport, a valid New Zealand driver licence, or a valid Hospitality Association of New Zealand (HANZ) 18+ card.\n\nCoffee houses are a daytime venue in many of the larger cities and tourist destinations. The cafe culture is notable in the CBD of Wellington, where many office workers have their tea breaks.  Most coffee styles, cappuccino, latte, espresso/short black, long black, flat white, vienna etc, are usually available.  Flat whites are probably the most popular.  Cappuccinos are usually served with a choice of cinnamon or chocolate powder sprinkled on top.  Its usual to request which one you want. Fluffies are a small frothed milk for children, sprinkled with chocolate powder.\n\nBottled water, both flavoured and unflavoured, is available in most shops. Not that there is anything wrong with the tap water, it is just that some town supplies are drawn from river water and chlorinated. Most town supplies are fluoridated. If you do not want to pour your money down the drain, fill your own water bottle from the tap, unless you find it is too heavily chlorinated for your taste. \n\nTap water in New Zealand is regarded as some of the cleanest in the world; it is safe to drink from in all cities, most come from artesian wells or freshwater reservoirs - however, some are from rivers which can be chlorinated to be made safe but do not taste very nice. Some of the water in Auckland comes from the Waikato river, a long river that has its source in Lake Taupo in the centre of the North Island. But by the time it reaches Auckland, it has been treated so that the quality is no worse than that of the Thames in London or the Hudson in New York. Auckland water is also drawn from run-off reservoirs in the Waitakere and Hunua Ranges. Tap water in places such as Christchurch and Hastings is not chlorinated at all as it is drawn from the pure artesian aquifers of the Canterbury and Heretaunga plains.\n\n'''L & P''' or '''Lemon & Paeroa''' is a sweet carbonated lemonade style drink said to be \"world famous in New Zealand\". It is a sold in a brown plastic bottle with a yellow label similar to the traditional brown glass bottles it used to be sold in. Generally one for the kids or parties as it mixes quite well with whisky. It is now manufactured in Auckland by Coca-Cola.\n\n==Sleep==\nNew Zealand offers a wide range of accommodation. \n\nInternational quality '''hotels''' can be found in the major cities. \n\nNew Zealand is also known for its '''luxury lodges''', small professionally run, personally hosted, often architecturally designed lodgings with between 3 and 10 rooms only. With rooms priced between $300 and $800 per night (or more for the top of the market lodges), they offer excellent food and wine, superb comfort, the attention of your New Zealand hosts, assistance with travel and activities and  terrific locations, whether a wilderness setting, quiet urban retreat, river, lake or beach side location. There are a network of at least 100 such accommodations around the country. Per capita, that's probably the highest in the world. They tend to be situated away from cities, though some are right in the heart of the major centres, and can be difficult to get to. At the very top-end, helicopter transfers and private jets help the luxury traveller move between the lodges they've chosen for their visit.\n\n'''Motels''' of a variety of standards from luxury to just adequate can be found on the approaches to most towns. \n\nThere is a wide range of '''[[Hostels|backpackers]]''' accommodation around the country. BBHNZ or [http://bbh.co.nz '''Budget Backpacker Hostels NZ]''' is the largest network with more than 275 hostels throughout the country in 2014. Other hostels include a network of '''Youth Hostels''' that are members of the Youth Hostels Association (48 in 2014), and a network of [http://nomadsworld.com '''Nomads Hostels'''].\n\nBed and Breakfasts are popular with visiting Brits and Swiss as well as '''homestays''', '''farmstays''' and similar lodgings - some of which are in the most unlikely places.\n\nFor '''gay and lesbian''' travellers there are many ''''Gaystay'''' accommodations throughout New Zealand, in the form of B&B's, homestays, farmstays, lodges and clothing optional naturist retreats. A search of the words 'gaystay new zealand' will bring up the appropriate information.\n\nFor uniquely New Zealand accommodation, there are  Māori homestays and tourist-catering marae stays.\n\nThere are a number of commercial camping grounds around the country, as well as camping sites within all of the national parks. One way that many tourists travel around New Zealand is in a self-contained '''campervan''', a motorised caravan or large minibus, that can be driven by anyone who holds an ordinary car driver's licence.\n\nIf you are travelling into the backcountry on foot, the '''Department of Conservation''' has many backcountry huts that can be used under a permit system. Be aware that these may not be available in peak times (but you may still camp at a hut and use its facilities for a reduced rate).\n\nFree camping is also available in many places. Unless there is a \"no camping\" sign it is common to find a tent or hammock pitched for the night in many picnic areas or in a grove of trees off the road. Cycle tourists especially will rarely need to pay for camping, only for showers and laundry. Multi-day camping in these areas is often frowned upon, and in conservation areas camping outside designated areas may attract a fine. A map of over 1500 legitimate camping sites is the I Respect NZ Map [http://rankers.co.nz/respect/].\n\nNew Zealand was one of the first countries in the world after the UK to develop a dense [http://www.wwoof.co.nz/ WWOOF] network. WWOOF is a world wide network where travellers (\"WWOOFers\") stay as volunteers on farms and receive food and accommodation in exchange for half a days help for each night they stay. The [[Nelson Tasman]] region in the South Island is particularly rich in WWOOFing possibilities. [http://www.helpx.net HelpX], which is similar to WWOOF but is not restricted to just organics, originated and has its largest country network in New Zealand.\n[https://www.hovos.com/hosts?a=1&page=1&conti=8&cntry=190 Hovos],host available in New Zealand who are offering services like help with animal care, Gardens, Farming, help in the house, gardening, construction, language practice and much more, in return they are offering free stay and food.\n[http://couchsurfing.org Couchsurfing] is popular in New Zealand with most major centres sporting active forums and groups as well as having hosts all around the nation.\n\n==Learn==\nFor many years, New Zealand schools and universities have educated foreign students from the countries of [[Southeast Asia]] and education has now become a major source of export earnings for the country. In recent years English language schools have been established for students from the region, particularly [[South Korea]] and [[China]], but also many other countries.\n\nEducation in New Zealand is compulsory from age 6 to 16 years, though almost all children begin attending school at age 5 and often stay at school for 13 years, until 17 or 18 years old. ''Primary'' schooling is from ''Year 1-6'' (formerly J1-Standard 4), ''intermediate'' schooling is ''Year 7 and 8'' (formerly forms one and two), while ''secondary'' schooling is from ''Year 9-13'' (formerly forms 3 to 7). In some primary and secondary schools one or both of the intermediate years may be combined with either the primary or secondary years. There are also ''Middle Schools'' which cover the intermediate years and the first two years of secondary, but these are rare.\n\nSecondary schools are also called ''high schools'' (generally Years 9-13) and ''colleges'' (generally Years 7-13). A ''college'' does not refer to universities in New Zealand unlike in some other countries, though some specialised single-subject tertiary training-centres may also be called ''colleges''.\n\nPrimary, intermediate and secondary compulsory schooling is ''free'' for citizens and permanent residents, although some nominal ''fees'' are generally charged to cover consumable materials. Tertiary education is state assisted, with part of the tuition costs funded by the state. International students will need to pay for their education; in some cases this includes a national profit margin.\n\nThe Ministry of Education has established a ''Code of Practice'' that New Zealand educational institutions enrolling ''international students'' need to abide by. This ''Code of Practice'' includes minimum standards for the 'PC 'pastoral care'' of international students. Primary school students, or those age 10 or under, need to either live with a parent or else board in a school hostel. Additionally, older students, who are under age 18, may live in homestays, temporary accommodation or with designated caregivers. Where the institution arranges accommodation for students older than age 18 the code of practice applies to their accommodation situations also.\n\nNew Zealand citizens, permanent residents and refugees can receive financial assistance through loans and allowances, to pay the tuition fees and to attend tertiary education at ''Universities'', ''Polytechnics'', ''Whananga'' ( Māori operated universities/polytechnics) and ''Private Training Providers''. Overseas students will need to pay the full tuition fees and their own living costs while studying at a New Zealand institution.\n\nOverseas students need to have a student visa and a reasonable level of cash to spend in order to undertake a course of study at a New Zealand based educational institution. Visas are generally valid for the duration of the course of study and only while the student is attending the course of study. New Zealand educational institutions will inform the appropriate immigration authorities if a student ceases to attend their enrolled courses, who may then suspend or cancel that student's visa. Educational institutions often also exchange this enrollment and attendance data electronically with other government agencies responsible for providing student assistance.\n\n==Work==\nTo work in New Zealand you need to be a citizen or current permanent resident of either '''New Zealand''' or Australia, or else have a work permit or appropriate visa. If you are intending to work in New Zealand you should obtain a work permit along with any tourist visas you might apply for.\n\nYou will also need to have a '''New Zealand bank account''', as the vast majority of employers pay using electronic banking rather than in cash; an '''Inland Revenue Tax Number''', as ''witholding tax'' or ''income tax'' will be deducted from your wages by your employer; and a '''tax declaration form''', as tax will be deducted at the ''no declaration'' rate of 45% unless you have a tax code. More information about New Zealand's tax system, including appropriate forms, can be obtained from Inland Revenue [http://www.ird.govt.nz]. \n\nThe process of applying for an IRD number is between 8-10 working days. You will need to fill in the IRD number application form, and provide a photocopy of a passport or New Zealand birth certificate. It is possible to apply for the IRD number, then call the department around a week later to request the number by phone, however this will depend on the workload of the processing centres at the time. Calling the IRD requires several forms of ID, it is ideal to be able to provide your passport number and full address when requested.\n\nNew Zealand operates a ''simplified'' tax system that tends to collect more tax than people need to pay because employers pay their worker's tax when they pay their workers. The obligation is then on the worker to claim overpaid tax back, rather than declaring their income and paying any extra tax. Be careful though, if you choose to work in New Zealand and you stay more than 183 days in any 12-month period, your ''worldwide income'' could be taxed. New Zealand has ''double taxation'' agreements with several countries to stop tax being paid twice. A safe rule of thumb is to pay all tax demands and not seek claims for redress on any matter.\n\nBeing a foreigner means that your New Zealand income is subject to local income tax at the fullest levels. Although many people believe that they can collect all their tax back when they leave the country, this is not true. It may be the case that filing an income tax return may result in a small refund if working for only part of the year; however, this is not likely the case. Tax in all its forms in New Zealand amounts to around half of a worker's income. \n\n===Short term===\nSeasonal work in fruit picking and agriculture is sometimes available for tourists such as backpackers. More information about seasonal fruit picking work can be found at Pick NZ [http://www.picknz.co.nz/].\n\nNew Zealand has a number of reciprocal Working Holiday Schemes, which allow people between 18 and 30 to travel and work in New Zealand for up to one year and vice versa. At present young citizens of a number of countries from Europe, South America, North America and Asia can apply. These schemes are enormously popular and in many instances participants can apply to stay in New Zealand longer once they have completed their one year stay. Information on all the various schemes and application details can be found at: [http://www.immigration.govt.nz/migrant/stream/work/workingholiday/]\n\n===Long term===\n\nIf you want to stay in New Zealand long term, you should apply well ahead of time. New Zealand operates a points system for assessing applicants. \n\nRefugee applications should be made before arrival since NZ has a formal refugee induction programme.\n\nThose who turn up in a New Zealand airport arrival lounge without papers, claiming refugee status, may find themselves put on a return flight to their country of origin or in jail awaiting the outcome of legal proceedings.\n\nFor those considering long term stay in Christchurch the Canterbury Development Corporation [http://www.cdc.org.nz/christchurch/ has helpful information] on living and working in Christchurch.\n\n==Stay safe==\nThe emergency telephone number in New Zealand is '''111'''. \n\nAmbulance, Fire, Police, Coastguard and Marine and Mountain Rescue can all be rapidly contacted via this one, '''FREE''', emergencies only number.\n\nThis number (or 112 or 911) also works from mobiles - even when there is no credit available and even if no SIM card is present at all!<br />'''<nowiki>*555</nowiki>''' can also be called for non-emergency traffic incidents from mobiles.\n\nFull instructions are on the inside front cover of every telephone book.\n\n*'''0800161610''' - Deaf emergency fax (connects to police)\n*'''0800161616''' - Deaf emergency textphone/TTY (connects to police)\n*'''0800764766''' - Poisons and hazardous chemicals emergency\n*'''0800611116''' - medical advice (\"Healthline\", run by the Ministry of Health)\n*'''0800808400''' - railway emergencies (KiwiRail Network)\n\n===Crime and security===\nThe level of crime in New Zealand is similar to other western countries. Dishonesty offences, such as theft, are by far the most frequent type of crime. Travellers should take simple, sensible precautions such as putting valuables away out of sight or in a secure place and locking doors of vehicles, even in remote locations, as much of this crime is opportunistic in nature.\n\nViolent crime in public places is generally associated with alcohol or illicit drug consumption. Rowdy bars or drunken crowds in city centres, or groups of youths in the suburbs, are best avoided, especially late at night and in the early morning. New Zealand has one of the lowest recorded rates of gun crime in the world.\n\nThere are occasional disturbing high profile media reports of tourists being targeted in random violent robberies and/or sexual crimes. These crimes tend to happen in more isolated places, where the chances of the offender being observed by other people are low. The chance of falling victim to such misfortune is still low. Although crime statistics reflect an increase in violent crime, the increase is entirely explained by increased detection of family violence, a key focus area for Police. Tourists are unlikely to be affected, as such crimes usually take place in New Zealanders' own homes. \n\nThe [http://www.police.govt.nz '''New Zealand Police'''], a national body, are generally polite and helpful. They regularly conduct drink-drive blitzes, often setting up screening checkpoints all around an area, including all lanes of motorways. Being caught drinking and driving will result in being invited to accompany the officer to a police station, or a roadside Booze Bus for an evidential breath test, blood test, or both. Being found with excess breath alcohol, or refusal to undertake testing will result in an arrest, appearance in Court, with a possibility of time in prison, as well as a hefty fine and disqualification from driving. Fixed and mobile speed cameras as well as hand held and car speed detectors are used frequently.\n\nThe police do not routinely bear guns. Although all police officers are trained to handle firearms, these are normally openly carried only when the situation requires such weapons, such as an armed offender. Usually, the police carry only batons, offender control pepper spray and tasers. However, first response patrols generally have recourse to firearms locked in their vehicle.\n\n===Natural hazards===\n'''Severe weather''' is by far the most common natural hazard encountered in New Zealand. Although New Zealand is not subject to the direct hit of tropical cyclones, stormy weather systems, from both the tropics and the polar regions, can sweep across New Zealand at various times of the year. There is generally a seven to ten day cycle of a few days of wet or stormy weather followed by calmer and drier days as weather systems move across the country. The phrase ''four seasons in one day'' is a good description of New Zealand weather, which has a reputation for both changeability and unpredictability. The phrase is also a popular Kiwi song.\n\nWeather forecasts are generally reliable for overall trends and severe weather warnings should be heeded when broadcast. However both the timing and intensity of any weather events should be assessed from your own location.\n\nYou should always seek advice from the Department of Conservation when trekking in alpine areas. There are annual fatalities of both foreign nationals and New Zealanders caught unaware by the weather.\n\nThere are other natural hazards you may encounter, though far more rarely:\n\n*'''Strong earthquakes''' - New Zealand, being part of the Pacific Ring of Fire, sits astride a tectonic plate boundary and experiences large numbers (about 14,000/year) of small earthquakes every year, a few (about 200/year) are noticeable and the occasional one causes damage and sometimes loss of life. The last ''big one'' causing serious loss of life was on 22 February 2011 10 km south east of Christchurch. It was a 6.3 magnitude with a depth of only 5 km, and the death toll was 185. The latest quake news is reported by GeoNet [http://www.geonet.org.nz/].\n\n*'''Volcanic eruptions''' - New Zealand has a number of volcanoes that are classified as active or dormant. Volcanic activity is monitored by GeoNet.\n\n*There are almost no poisonous or substantially dangerous animals. The katipo and redback are the only two '''venomous spiders''' and bites from both species are extremely rare. Serious reactions are uncommon and unlikely to develop in less than three hours, though you should always seek help at your nearest hospital, medical centre, or doctor. The white-tailed spider can also deliver painful bites but is not considered dangerous to humans. No large mammalian predators are present and no large predatory reptiles. Certain species of '''Weta''' (an insect, that looks a bit like a huge grasshopper or cricket) can deliver a painful but harmless bite.\n\n==Stay healthy==\nNew Zealand has a very high level of ultraviolet radiation and skin cancer, around 40% more intense than you will find in the Mediterranean during the summer. Sunglasses and sunscreen are highly recommended, especially if you are of Celtic descent. The sun's rays are more harmful here than anywhere else in the world and it is very easy to get sunburnt, even in as little as 10 minutes.\n\nVisiting the doctor will cost about $60 and may vary between practices and localities. The New Zealand public hospital system is free of charge to Australian, British and New Zealand citizens but will charge other nationals for treatment received. An exception to this is in the case of any accident when the Accident Compensation Commission (ACC) will pick up the tab. Travel insurance is highly recommended. \n\nNew Zealand has high and equitable standards of professional health care comparable with Sweden or Australia. Tap water is drinkable but precautions should be taken against ''Giardia'' when tramping.\n\n==Respect==\n\n===Social behaviour===\nNew Zealanders are courteous in general, although relatively distant, thus are not easily offended. However, if you get the chance to get to know some of them better, a whole new set of complicated social rules comes into play. In general they are a very warm, sociable and forgiving people. However, many New Zealanders (especially those who have not lived in foreign countries for an extended period of time) are unaware of the peculiarities of their culture. Keep these generalisations in mind:\n\n* Be polite. Always say please and thank you. For example, at a cafe, if you wanted a second fork, it would be considered perfectly ordinary to say to a staff member, \"Excuse me, sorry, could I please have another fork? Thank you.\"\n* It is polite to offer to help out, for example with washing the dishes after a meal. Your initial offer will likely be be denied, at which point you should immediately ask \"Are you sure?\". Offering once and then failing to ask \"Are you sure?\" is considered cheeky at best, rude at worst.\n* The reverse is true: if something is offered to you, the person offering does not necessarily want you to take it. \n* If staying for more than a few days at someone's house, if they are younger than 30-35 it is considered polite to leave a token amount of money, say $20, to 'cover the power bill', especially if you are the guest at a shared flat/apartment/house.\n* Speech is often understated. \"It's all right\" often means it is the best thing ever, depending on the tone of voice. \"It was average\" generally means it was poor. \"He was a bit rude\" often means he was extremely rude.\n* New Zealand society is understood by New Zealanders to be classless and egalitarian; this is mostly true, and largely functions by avoiding having discussions about money or by showing wealth. New Zealanders, even wealthy New Zealanders, tend to behave in a somewhat frugal manner. Don't talk about or show off your money, property, rent or income.\n\n=== Māori culture===\nMāori cultural experiences are popular tourist attractions, and are enjoyed by many people. However, as with any two cultures encountering one another, there is room for misunderstanding. Some tourists have found themselves more confronted than they expected by ceremonial challenges and welcomes. These are serious occasions. Avoid chatter and laughter until it is clear that you are welcome to do so. There is plenty of time to relax later in the proceedings, for example when the hangi (food) is lifted from the ground.\n\n==Contact==\n\n===Internet===\nInternet access is expensive and metered. It's available in cyber cafes and there are many of these in the major cities but avoid cyber cafes without using a trusted and reliable Anti-virus application.\nHourly rates are usually in the range of $4-8, with cheaper rates of around $2-4 at cyber cafes within the main city centres. \n\nMany public libraries have public Internet access. There may be a charge - although that is changing. The Auckland City Public Library 1gb a day at no charge. Some providers, such as the Christchurch City Library network, offer free access only to some sites such as Google, the BBC and Al Jazeera and those in the \".nz\" top level domain. [[Nelson]] Library [http://www.nelsonpubliclibraries.co.nz/] has unlimited free Wi-Fi and 23 free terminals.\n\nThe Aotearoa People's Network (APN) has been working to bring Internet access (both wired and Wi-Fi) to all libraries and these connected libraries are good places to check your e-mail and do some research.  \n\nVouchers for '''Wi-Fi''' access can be bought from many Starbucks cafes, and many McDonalds have free Wifi for paying customers. It is becoming more common for Wi-Fi to be provided at hotels and motels using vouchers, but it is seldom free as part of your room rate. Wireless Hotspots are located in many cities and towns all over New Zealand from dedicated Wireless providers from whom you can buy connect time. Many camping holiday parks also have such services available.   \n\nBoth the airport and CBD in Wellington have free Wi-Fi but the airports at Christchurch and Auckland both charge a fee for wireless service in their terminals.\n\n===Telephone===\nNew Zealand has a well developed and ubiquitous telephone system. The country's main phone company, Spark (previously Telecom), claims (as of 2009) to have about 4000 payphones in NZ which can be easily identified by their yellow and blue colours. All of them accept major credit cards and a variety of phonecards available from retailers. You may have to look hard for a payphone that accepts coins. Free Wi-Fi also.  \n\n* The country code is '''64'''. New Zealand telephone numbers can be looked up [http://www.whitepages.co.nz online]. \n\n* The emergency telephone number from ''all'' telephones is '''111'''<br />(you may need to use a prefix, usually '''1''', to get an outside line from business systems). An emergency services call is normally answered with a voice request to choose Police, Fire or Ambulance; respond as appropriate and you will then be switched to the requested service. (Other common international emergency numbers like 112, 911 and 999 may also work, but don't rely on it.)\n\n====[[Mobile phones]]====\nMobile telephone coverage is effectively only national near urban areas. The mountainous terrain means that, outside these urban areas, and especially away from the main highway system, coverage has huge dead patches. \n\nDo not rely on mobile phones in hilly or mountainous terrain - especially in the South Island. \n\nMobile telephone users can call '''*555''' only to report '' '''Non-emergency''' traffic safety'' incidents, such as a breakdown, road hazard or non-injury car crash, to the Police.\n\n=====Carriers=====\nThere are currently three major mobile carriers in New Zealand, with some sub-brands. \n\n*[http://www.spark.co.nz/shop/mobile/ '''Spark'''] operates a 4G and 3G (UMTS) network, nationwide on 850MHz with supplementary 2100MHz in metropolitan areas (the same frequencies as Telstra in Australia and AT&T in the US).  \n\n*[http://www.vodafone.co.nz/mobile/ '''Vodafone'''] NZ operates a 4G LTE network on 700MHz, 1800MHZ and 2600MHz frequencies with wide coverage in over 54 centres, a nationwide 3G (UMTS) network on 900MHz with supplementary 2100MHz coverage, and a GSM network on 900MHz/2100MHz. Vodafone sell a [http://www.vodafone.co.nz/travel-sim/ '''visitor SIM'''] package for travelers.  \n\n*[http://www.2degreesmobile.co.nz '''2degrees'''] operates a 4G LTE (1800MHz and 700MHz in cetral Auckland) and UMTS (3G) network (2100MHz) in most towns with a population of over 1000, with supplementary GSM coverage provided elsewhere by Vodafone. \n\n*[https://www.skinnydirect.co.nz/ '''Skinny Direct'''] In 2016 Skinny Mobile (a no frills provider - wholly owned by Spark) introduced Skinny Direct. Skinny Direct is an online mobile platform offering relatively large data packages, NZ minutes and text in New Zealand, at relatively low prices.\n\n\nAirports and shopping malls will have stores from Spark and Vodafone available for purchasing access and getting information about their networks. Prepay SIM card packs from Spark, Vodafone or 2degrees cost between $5-30, some come with pre-loaded credit.\n\n=== Postal mail ===\nThe national post office is '''New Zealand Post''' [http://www.nzpost.co.nz/]. If you are staying in one place for a while, you can rent a PO Box from them. NZ Post also offer overnight and same day courier services across New Zealand. [http://www.nzpost.co.nz/products-services/receiving-mail/book-an-urgent-overnight-courier]\n\n* <listing name=\"New Zealand Post\" alt=\"Poste Restante\" directions=\"\" address=\"Is available at Post offices across the country\" phone=\"\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">This is an inexpensive service for receiving letters and parcels while you are visiting New Zealand from overseas.</listing>\n\n* <listing name=\"New Zealand Post\" alt=\"Counter delivery\" directions=\"\" address=\"Is available nationally at local PostShop and some PostCentre outlets\" phone=\"\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">Use the Counter delivery service if you need a short term mailing address of up to three months.</listing>\n\nPostcards cost 50c to send within New Zealand (2-3 days) and $1.90 to send internationally (3-10 days). Letters up to DL size (130mm&times;235mm) cost the same as postcards within New Zealand and to Australia and the South Pacific, with letters to other destinations costing $1.90 for economy service (10-25 days), and $2.30 for standard service (6-10 days).\n\n===Media===\n\n====TV====\nFree-to-air digital television has been rolled out and three of the channels are available in HD. Cable television is not well developed, but direct broadcast satellite technology is available across the nation, with both free-to-air ([http://freeviewnz.tv/ Freeview Satellite]) and pay television (through the Sky network).\n\nOne reason often advanced for the continued health, vigour and sheer variety of hobbyist clubs and sport throughout NZ is the mind-numbing banality of most of the Freeview programming. Visitors from Australia and Britain are perplexed by the almost complete lack of documentaries and current affairs programmes and locally produced drama. Even the All Blacks games are not available as they are being played without a seriously expensive Sky subscription.\n\nTwo exceptions to the low-brow line-up are \n#the [http://www.aljazeera.com Al Jazeera English] channel broadcasting news and documentaries and available 24h and \n#[http://www.maoritelevision.com Māori Television] which often shows non-US films with subtitles at weekends\n\nAll hotels and motels will have either Freeview or some Sky channels. \n\n'''Teletext''' no longer provides an information service, but page 801 provides a caption text service for some TV programs which allows hearing impaired people to read subtitles.\n\n====Radio====\nNew Zealand has a large number of radio stations, on both AM and FM, with at least one local station and a number of nationwide network stations broadcast in each major city or town.\n\n*'''National Radio''' is a government funded, non-commercial, ''spoken features'' style national network with some music. It broadcasts news and detailed weather forecasts, generally hourly, with detailed mountain and marine forecasts a couple of times a day on both AM and FM (around 101MHz FM). Operated by [http://www.radionz.co.nz Radio New Zealand].\n\n*'''Concert''' is a government funded, non-commercial, classical music national network.\n\n*There are a number of FM ''visitor information'' stations around the country.\n\n\n{{Outlinecountry}}\n[[Category:Countries]]\n[[WikiPedia:New Zealand]]\n[[Dmoz:Oceania/New Zealand/]]\n[[World66:australiaandpacific/newzealand]]\n\n{{IsPartOf|Oceania}}\n\n{{related|Golf_in_New_Zealand}}\n{{related|Driving_in_New_Zealand}}\n{{related|Tramping_in_New_Zealand}}\n{{related|Renting_a_motorhome_in_New_Zealand}}\n{{related|The_other_1}}\n\n[[de:Neuseeland]]\n[[eo:Nov-Zelando]]\n[[es:Nueva Zelanda]]\n[[fi:Uusi-Seelanti]]\n[[fr:Nouvelle-Zélande]]\n[[hu:Új-Zéland]]\n[[it:Nuova Zelanda]]\n[[ja:ニュージーランド]]\n[[nl:Nieuw-Zeeland]]\n[[pt:Nova Zelândia]]\n[[ro:Noua Zeelandă]]\n[[ru:Новая Зеландия]]\n[[sv:Nya Zeeland]]\n\n[[wts:Category:New Zealand]]"
        }
    }
}