{
    "parse": {
        "title": "Norway",
        "pageid": 65,
        "wikitext": {
            "*": "{{pagebanner|Nordic Countries Banner.jpg}}\n\n{{quickbar\n|image=Lodalen.jpg\n|caption=Lodalen, Stryn, Sogn og Fjordane\n|location=Norway in its region.svg\n|flag=Flag of Norway.svg\n|capital=[[Oslo]]\n|government=Constitutional Monarchy and Parliamentary Democracy\n|currency=Kroner (NOK)\n| area=''total:'' 323,802 km<sup>2</sup><br />''water:'' 19,520 km<sup>2</sup><br />''land:'' 304,282 km<sup>2</sup>\n|population=5,063,709 (April 2013)\n|language=[[Norwegian phrasebook|Norwegian]] (Bokmål and Nynorsk) and [[Saami phrasebook|Saami]]\n|religion= Christianity (mainly Lutheranism), though Norway is widely secular.\n|electricity=230V/50Hz (Schuko (Type F) European plug)\n|callingcode=+47\n|tld=.no\n|timezone=UTC +1 (CET)\n}}\n[http://www.visitnorway.com/ '''Norway'''] (''Norge'') is the westernmost, northernmost—and in fact the easternmost—of the three [[Scandinavia]]n countries. Best known for the complex and deep fjords along its west coast which stretches from the North Sea near [[Denmark]] and [[Scotland]] into the [[islands of the Arctic Ocean|Arctic Ocean]] and has borders with [[Finland]], [[Sweden]] and the northwestern tip of [[Russia]].\n\n==Understand==\n\n===History===\nThe Viking kingdoms of Norway were unified in 872 AD by Harald Fairhair. In the following period, Norwegians settled in many places, such as [[Iceland]], the [[Faroe Islands]] and parts of [[Scotland]] and [[Ireland]], where they founded [[Dublin]]. In the beginning of the 14th century, Norway and [[Sweden]] were unified as the Norwegian king was also elected king of Sweden. At the end of the century, the two countries and [[Denmark]] were unified in the so-called Kalmar Union.\n\nSweden broke out of the union in 1521. Norway remained in union with Denmark until 1814. Only a few months after the declaration of independence, Norway entered into union with Sweden, though it must be noted that this union with Sweden allowed Norway to keep a great deal of independence.\n\nThe union with Sweden lasted until 1905, which is considered the beginning of modern Norway. From 1940 until 1945, Norway was occupied by [[Germany]].\n\n===Geography===\nNorway is on a large peninsula shared with [[Sweden]] in the north of [[Europe]]. In the north, it also borders [[Finland]] and [[Russia]].\n\nNorway is well known for its amazing and varied scenery. The fjords in the west of the country are long narrow inlets, flanked on either side by tall mountains where the sea penetrates far inland. By far the major part of the land is a rocky wilderness, and thus Norway has large, completely unpopulated areas, many of which have been converted to national parks. Even outside the national parks, much of the land is unspoiled nature.\n\nA rugged landscape shaped by the Ice Age, shows forested hills and valleys, mountains, waterfalls, and a long coastline with fjords, islands, and mountains growing directly up from the sea. Norway's highest point is Galdhøpiggen, 2,469m (8,100&nbsp;ft) in the [[Jotunheimen]] region that lies midway between [[Oslo]] and [[Trondheim]], but away from the coast. In the far north ([[Finnmark]]), you will find flatter open spaces. Several of the world's greatest waterfalls are in Norway, particularly in the western fjords and the mountain region.\n\n===People===\nNorway is one of Europe's most sparsely populated countries. With a population of only 5 million people and a land area of 385,802 km<sup>2</sup>, the population density is only 16 inhabitants per km<sup>2</sup>. Most of the population are Norwegians. The indigenous Sami people traditionally inhabit the northern part of Norway, that along with parts of Sweden, Finland and Russia outlines an area known as ''Sapmi'' (or ''Sameland''). Other recognized minorities are the Kven people, Jews, Forest Finns, and Norwegian Romani Travellers. In recent years, immigration, in particular from the European Union, has increased greatly.\n\nNorwegians are shaped by surviving a harsh climate more than war and social hierarchy, and you'll find them to be generally friendly, but stubborn and fiercely individualistic. The people relies on a common understanding of things, with a lot of effort put in common law and regulation but with little hierarchy. A tradition where you don't rely much on a ruler or a fast moving society, but where some neighbours are all you have and you will probably have to depend on at least one of them for your life, and more than once. So it takes time to get to know Norwegians properly. Some misunderstand it as coldness, but the reasons are more skepticism and slowness of change. If you get to know one of these people, you get to know them on the depth. There's little front, they don't have that many people in their circles, so they probably won't trust you all that much unless they get to know you down to your faults. And they don't expect you to rush it either, for desperation is a weakness. But once a friendship is tried and tested, it can be solid and warm. \n\nNorway is no longer formally a Christian country. In 2012, the government separated from the church, leaving the country without an official religion. Before this, almost 85% of Norwegians were part of the national church, even though most Norwegians are nonbelievers and the regular church attendance was, and still is as low as 5%. \n\nNorway has become rather liberal in moral issues and thus similar to neighbours like Denmark and Sweden. Homosexuality is accepted by most people and recently (2008) same-sex marriage was given the same legal status as traditional marriage. For instance, a previous male minister of finance and prominent figure in the conservative party is in partnership with a prominent male business manager. With that said, some parts along the southern and southwestern coast are fairly conservative, especially in the more rural areas.\n\n===Economy and politics===\nNorway's primary income is from the oil and gas industry in the [[North Sea]] which constitutes nearly a quarter of GDP. It also has several other natural resources such as fish and minerals, some industry, and a healthy technology sector. Politically, it's dominated by a widespread and continued support for the ''Scandinavian model'', which means high taxes and high government spending to support free schools, free healthcare, an efficient welfare system and many other benefits. As a result the unemployment rate in Norway is extremely low at about 2 percent.\n\nThe Norwegian people have rejected membership in the [[European Union]] (EU) in two independent popular votes in 1972 and 1994, both times just by a few percent, after being vetoed out of membership by France in the 50s and 60s. However, being a member state of the European Economic Area and part of the Schengen agreement, Norway is closely connected to the EU, and integrated as a full member in most economic matters, as well as in customs and immigration matters. This is of great economic importance to Norway. \n\nAs one of the richest countries in the world and with a strong currency, most visitors should be prepared for greater expenses than at home. In addition, Norway has a very compressed wage structure which means that even the typical low skill work is relatively well paid. Despite the extremely high prices, Norwegians enjoy a purchasing power parity per capita significantly higher than both the US and all EU countries. For the same reason, firms try to keep the number of staff as low as possible, even for low skill service work. On the other hand, many attractions in Norway are free of charge, most notably the landscape and nature itself. Furthermore, you don't have to spend much money on accommodation if you're prepared to sleep in a tent or under the open sky. According to the Norwegian [[right to access]], you may stay for up to two nights in one spot in uncultivated land if you keep away from houses and other buildings and out of the way of other people, provided that you [[Leave-no-trace camping|leave no trace]]. If you move far away from people, you can stay for as long as you want.\n\n===Climate===\n: ''See also [[Winter in Scandinavia]].''\n\nBecause of the gulf stream, the climate in Norway, especially along the coast, is noticeably warmer than what would otherwise be expected at such a high latitude. Almost half the length of Norway is north of the arctic circle. Summers can be moderately warm (up to 30°C), even in northern areas, but only for limited periods. The length of the winter and amount of snow varies.  In the north there is more snow and winters are dark; on the southern and western coast, winters are moderate and rainy, while further inland the temperature can easily fall below -25°C. Even in the southeast, winter temperatures of -10ºC to -15ºC are common. Some mountain areas have permanent glaciers and patches of snow can be found in higher elevations even in the summer.\n\nNorway's hours of daylight, temperature and driving conditions vary greatly throughout the year. Seasonal variations crucially depend on region as well as altitude. Note in particular that the area with midnight sun (north of the arctic circle) also has winter darkness (polar night) when the sun does not rise above the horizon at all. \n\nNorwegian weather is most pleasant during the summer (June to mid-August). If you like snow, go to Norway in December to April. Along the coasts and in southern part of [[West Norway]] there is little snow or frost and few opportunities for skiing, even in winter. In the mountains there is snow until May and some mountain passes are closed until the end of May. If you come in the beginning of May some passes can be still closed, but since the snow is melting very quickly, you will get the possibility to enjoy plenty of waterfalls before they disappear. And in this time the number of tourists is very small. Spring in Norway is quite intense due to the abundance of water (melting snow) in conjunction with plenty of sunlight and quickly rising temperatures (typically in May).\n\n[[Image:Northern lights in Tromsoe.jpg|thumb|[[Northern lights]] (''aurora borealis'') in [[Tromsø]].]]\n\nBe aware that daylight varies greatly during the year. In Oslo, the sun sets at around 15:30 in December. North of the Arctic Circle one can experience the midnight sun and polar night (winter darkness). However, even at Oslo's latitude, summer nights exist only in the form of prolonged twilight during June and July, these gentle \"white nights\" can also be a nice and unusual experience for visitors. The polar (or northern) lights (''aurora borealis'') occurs in the darker months, frequently at high latitudes (Northern Norway) but occasionally also further South.\n\n===Holidays===\nThe major holidays are Easter, Christmas (Christmas Eve, Christmas Day and Boxing Day are all considered holidays), and the \"common vacation\" throughout July. In May there are several holidays including constitution day (17 May) - the main national celebration and an attraction in itself.\n\nPublic holidays (schools and offices closed):\n* 1 January - New Years day \n* Maundy Thursday (Holy Thursday, \"Skjærtorsdag\") \n* Good Friday (\"Langfredag\") \n* Easter Sunday (\"påskedag\") \n* Second day of Easter (Monday) (\"andre påskedag\") \n* 1 May - Labour day \n* 17 May - Constitution Day\n* Ascension Thursday (\"Kristi himmelfart\") \n* Pentecost (Whit Sunday, \"pinsedag\") \n* Pentecost 2ed (Whit Monday, \"andre pinsedag\") \n* 25 December - Christmas Day (\"juledag\") \n* 26 December - Boxing Day (\"andre juledag\") \n\nNote that many Norwegian holidays are celebrated on the day before (Holy Saturday, Christmas Eve etc). On Christmas Eve (\"julekveld\", \"julaften\"), New Years Eve (\"nyttårsaften\"), Holy Saturday (\"påskeaften\") and Saturday before Pentecost (\"pinseaften\") shops close early. Norwegians also celebrate midsummer at St. John's day on June 24 by making a bonfire late evening the day before - \"St.John's Eve\" (\"St.Hansaften\" or \"Jonsokaften\").\n\n==Regions==\n{{Regionlist\n| regionmap=Norway regions map.png\n| regionmaptext=Norway regions\n| regionmapsize=350px\n\n| region1name=[[East Norway]]\n| region1color=#80afdc\n| region1items=\n| region1description=actually southeast, the region surrounding the capital [[Oslo]], where the largest number of people live, also a agricultural region with many people who live off farming.\n\n| region2name=[[Middle Norway]]\n| region2color=#94e38f\n| region2items=\n| region2description=with the ancient city of [[Trondheim]]\n\n| region3name=[[Northern Norway]]\n| region3color=#f9d99a\n| region3items=\n| region3description=also with great fjords, the midnight sun, the ancient Sami culture and the city of [[Tromsø]] \n\n| region4name=[[South Norway]]\n| region4color=#dc8080\n| region4items=\n| region4description=the gentle coastline with [[Kristiansand]]\n\n| region5name=[[West Norway]]\n| region5color=#dc7fdf\n| region5items=\n| region5description=with the famous fjords and the cities of [[Bergen]] and [[Stavanger]]\n\n| region6name=[[Svalbard]]\n| region6color=#a7976e\n| region6items=\n| region6description=Arctic islands near the polar ice. Not part of the [[Schengen Area]], it has its own border control and an entirely visa-free policy for all nationalities.\n\n| region7name=[[Jan Mayen]]\n| region7color=#777777\n| region7items=\n| region7description=A desolate, mountainous and volcanic island in the Arctic Ocean, partially covered in glaciers with some moss and grass.\n\n| region8name=[[Bear Island]]\n| region8color#8a84a3\n| region8items=\n| region8description=A purely isolated island surrounded by the silent ocean, ready for adventurers and people out of comfort zone, partially covered in ice and grass with polar bears.\n}}\n\n==Cities==\n<!-- Please do not change this list without first discussing your proposed change on the talk page. Cities lists are limited by Wikitravel policy to NINE, capital goes first.-->\n* [[Oslo]] - the capital and largest city of Norway, with museums of national importance, a beautiful setting and lively nightlife and cultural scene\n* [[Ålesund]] - a splendid Art Nouveau centre in the very western outskirts of Norway\n* [[Bergen]] - Once the capital of Norway, old Hanseatic trading centre with a rich culture and dramatic scenery, Norway's second largest city. Wonderfully cute wooden buildings, a magnificent mountain setting and tons of nightlife and atmosphere. This is your gateway to the western fjords. The city has been dubbed \"the rainiest city in Europe\" with an average of 250 days of rainfall a year. Bring an umbrella.\n* [[Bodø]] - The gateway to the magnificent Lofoten islands and Saltstraumen, the worlds strongest maelstrom\n* [[Kristiansand]] - The jolly capital of the South\n* [[Stavanger]] - The fourth largest city, and the third largest urban area. Commercially important due to the oil business. The wooden, cobbled central area is one of the most charming places in Norway. Home to one of Norway's medieval churches, you can also visit Iron Age homes, stone age caves, and sites where the Viking kings used to meet at Ullandhaugtårnet. Stavanger is where Erik the Red was born. \n* [[Tromsø]] - A magnificent, modern cathedral and absolutely no polar bears roaming the streets\n* [[Trondheim]] - Famous for its stunning cathedral (Nidarosdomen).Wonderful riverside wharfs, wooden buildings and the best student nightlife in Norway give beautiful, leafy Trondheim its charm.\n<!-- Please do not change this list without first discussing your proposed change on the talk page. City lists are limited by Wikitravel policy to NINE, capital goes first.-->\n\n==Other destinations==\n* [[Atlanterhavsveien]] - \"The most beautiful road in the world\". A unique road connected with spectacular bridges surrounded by the wilderness of the Atlantic Ocean.\n* [[Jostedalsbreen]] - The largest glacier on the European mainland.  \n* [[Jotunheimen]] - A majestic landscape and home of Norway's highest mountains.\n* [[Lofoten]] - Experience the midnight sun in this traditional fishing district in the northern province with islands and mountains.\n* [[Nordkapp]] - This cliff is the northernmost point of continental Europe. Excellent place to experience the midnight sun.\n* [[Sognefjorden]] - Glaciers, mountains and picturesque towns are but a few of the sights on the Sognefjord. [[Flåm]] and [[Nærøyfjorden]] (also a [[UNESCO World Heritage]] site) are parts of the mighty Sognefjorden system.\n* [[Trollheimen]] - A unique mountain area north west of Norway. East of the [[Atlanterhavsveien]]. Tourist cabins [[Trollheimshytta]], [[Gjevilvasshytta]] and [[Jøldalshytta]] can provide a wonderful experience of Norway's mountains.\n\n==Get in==\n\n===Entry requirements===\n{{infobox|Minimum validity of travel documents|* EU and EFTA citizens, as well as non-EU citizens who are visa-exempt (e.g. New Zealanders and Australians), need only produce a passport (or national ID card for EU/EFTA citizens) which is valid for the entirety of their stay in Norway.\n* Other nationals who are required to have a visa (e.g. South Africans), however, must have a passport which has '''at least 3 months' validity''' beyond their period of stay in Norway in order for a Schengen visa to be granted.}}\n\n{{Schengen}}\n\nCitizens of Andorra, Argentina, Australia, Brazil, Brunei, Canada, Chile, Costa Rica, Croatia, El Salvador, Guatemala, Honduras, Israel, Japan, Macedonia*, Malaysia, Mexico, Monaco, Montenegro*, New Zealand, Nicaragua, Panama, Paraguay, San Marino, Singapore, South Korea, United States, Uruguay, Vatican City, Venezuela, as well as holders of Hong Kong SAR or Macau SAR passports are permitted to work in Norway without the need to obtain a visa or any further authorisation for the period of their 90 day visa-free stay. However, this ability to work visa-free does not necessarily extend to other Schengen countries. \n\nBe keenly aware that Norway is not a member of the European Union. This means, especially if arriving by plane, that all persons entering Norway, regardless of point of origin, may be subject to customs controls at the port of entry. Information on duty-free allowances and regulations can be found on the [http://www.toll.no/default.aspx?id=3&epslanguage=en Norwegian Customs Website].  This has implications for air travellers (see the next section).\n\n===By plane===\nNotice that if you have a domestic connecting flight, customs clearance usually takes place at the airport of '''first''' arrival to Norway, not in the final destination. This means that you have to pick your luggage, go through the customs, check it in again, and pass through the security once more before taking the connecting flight.  This is the case '''even if your flight originates elsewhere in the Schengen area'''.  In big and busy airports such as Oslo, this is quite a nuisance, and can be time-consuming. There are two ways to avoid his: Either select connections that avoid the final domestic leg, or make sure that your Oslo transfer uses the \"Connecting Norway\" solution.\n\n====Oslo====\n'''Oslo Airport, Gardermoen [http://www.osl.no/Default.aspx?rqcall=index.asp%3flanguagecode%3d9/]''' ({{IATA|OSL}}) is the biggest airport in the country and the main international hub, 60 km north of [[Oslo]]. The airport is served by many major international and all domestic airlines. \n\nThe airport has scheduled flights to around 140 destinations abroad and 24 destinations in Norway. From the United Kingdom there are direct services to Oslo Gardermoen from: \n\n*Manchester (Scandinavian Airlines)\n*Aberdeen (Eastern Airways)\n*Birmingham (flyBe)\n*Edinburgh (Norwegian Air Shuttle)\n*London Heathrow (Scandinavian Airlines and British Airways)\n*London Gatwick (Norwegian Air Shuttle)\n\nFrom Ireland:\n*Dublin (Scandinavian Airlines, Norwegian Air Shuttle)\n\nFrom the United States:\n* Boston (Norwegian Air Shuttle)\n* Fort Lauderdale (Norwegian Air Shuttle)\n* Los Angeles (Norwegian Air Shuttle)\n* Miami (Scandinavian Airlines)\n* New York JFK (Norwegian Air Shuttle)\n* New York Newark (United, Scandinavian Airlines)\n* Oakland (Norwegian Air Shuttle)\n* Orlando (Norwegian Air Shuttle)\n* San Juan (Norwegian Air Shuttle)\n\n\nFrom Australia and New Zealand, the quickest connection is via Bangkok, Doha or Dubai. Thai Airways flies nonstop from Oslo to Bangkok. Qatar Airways flies 5 times a week from Doha with connections from several destinations in Asia and Oceania. Emirates flies daily nonstop from Oslo to Dubai.\n\n====Sandefjord====\n'''Sandefjord Airport, Torp [http://www.torp.no/?GUID={NI6TH8NaFEzjFhvCqBuzTFC}&lang=en/]''' ({{IATA|TRF}}) is located just north of [[Sandefjord]], 115 km to the south of Oslo, and is Ryanair's destination airport in Oslo. Ryanair now operates another service, from London Stansted to [[Haugesund]] on the west coast.\n\nSandefjord Airport Torp has scheduled flights to 14 destinations in Europe and 3 destinations in Norway.\n\nFrom the United Kingdom there are direct services from:\n* London Stansted (Ryanair)\n* Birmingham (Ryanair)\n* Liverpool (Ryanair)\n* Glasgow Prestwick (Ryanair)\n* Edinburgh (Ryanair)\n\nFrom Ireland:\n* Dublin (Ryanair)\n\n====Moss====\n[http://www.en.ryg.no/ Moss Airport, Rygge] ({{IATA|RYG}}) is located just outside [[Moss]] and approx. 60km south of Oslo. Moss Airport Rygge was closed for civilian traffic in late 2016, but there are plans to reopen the airport at a later date.\n\n*Danish Air Transport [http://www.dat.dk]\n\n====Stavanger====\n'''Stavanger Airport, Sola''' has scheduled flights to/from [[London]], [[Amsterdam]], [[Copenhagen]], [[Frankfurt]], [[Berlin]], [[Paris]], [[Krakow]], [[Madrid]], [[Nice]] and some other European cities.\n\nFrom the United Kingdom there are direct flights from:\n*London Heathrow (Scandinavian Airlines and BMI)\n*London Gatwick (Norwegian Air Shuttle)\n*Newcastle (Eastern Airways, Widerøe)\n*Aberbeen (Scandinavian Airlines, Eastern Airways and Widerøe)\n\n====Bergen====\n'''Bergen Airport, Flesland''' ({{IATA|BGO}}) has scheduled flights to/from major European cities as [[London]], [[Copenhagen]], [[Amsterdam]], [[Berlin]], [[Paris]], [[Stockholm]], [[Prague]], [[Warsaw]] and other cities.\n\nApart from to previously mentioned airports there are domestic flights to [[Trondheim]] and [[Tromsø]].\n\nFrom the United Kingdom there direct flights from: \n*London Gatwick (Scandinavian Airlines and Norwegian)\n*Newcastle (Easter Airways)\n*Edinburgh (Widerøe)\n*Aberdeen (Eastern Airways and Widerøe)\n*Kirkwall (Flybe)\n\n====Trondheim====\n'''Trondheim Airport, Værnes ({{IATA|TRD}}) can be reached by direct flights from several European cities, notably Amsterdam, London and Copenhagen.\n\nFrom the United Kingdom there are direct flights from London Gatwick with Norwegian Air Shuttle.\n\n====Tromsø ====\n'''Tromsø Airport''' ({{IATA|TOS}}) has direct flights from London Gatwick with Norwegian Air Shuttle twice every week.  Nordavia Regional Airlines also operates a flight between Tromsø and Murmansk in Russia.\n\n===By bus===\nSeveral international bus lines run into [[Oslo]] from [[Sweden]], the major operators being Nettbuss Bus4You [http://www.nettbuss.se/] and Swebus. Service to [[Gothenburg]] and [[Copenhagen]] is almost hourly, and faster and cheaper than the train.  \n\nThe minibus service between [[Kirkenes]] and [[Murmansk]] run three times per day. Contact Grenseland/Sovjetreiser (yes, they are actually still called that!) in Kirkenes for booking.\n\nOther coach lines exist between Sweden and [[Bodø]] and [[Mo i Rana]], as well as between Denmark and [[Stavanger]].\n\nMany minibuses offer minibuses, these services are provided from many European countries. From Poland to Norway, [http://nor-way.pl Nor Way] offers good and cheap services.\n\n===By train===\nThere are trains from [[Sweden]] to [[Oslo]], [[Trondheim]] and [[Narvik]], with onwards inland connections. \n\nFor [[Oslo]], daily service from [[Stockholm]] and [[Gothenburg]]. There are local services from [[Karlstad]] as well.\n\nFor [[Trondheim]], the Nabotåget service from [[Östersund]] corresponds with one day and one night service from [[Stockholm]], as well as the train from [[Sundsvall]].\n\nFor [[Narvik]], two trains run daily from [[Stockholm]] via [[Kiruna]]. Both are overnight.\n\nTrain schedules can be found on the website of the Norwegian State Railways [http://www.nsb.no/] and the Swedish Railways [http://www.sj.se/start/startpage/index.form?l=en].\n\n===By car===\nIt is possible to enter by road from [[Sweden]], [[Finland]], or [[Russia]].  In all cases, customs checks are in place and there will be a lane for those with goods to declare (red) and a lane for nothing to declare (green).  Full passport control checks are found in the lone Norwegian-Russian land border crossing between Borisoglebsky and Storskog.  Major roads to Norway include European route E6 which runs through [[Malmö]], [[Helsingborg]] and [[Göteborg]] in Sweden before crossing the border at [[Svinesund]] in the south-east of Norway, E8 which runs through [[Turku]], [[Vaasa]] and [[Oulu]] in Finland before crossing the border at [[Kilpisjärvi]]. There is an enormous number of possible routes and border crossings, but keep in mind that the road standards are not impressive and that speed limits are low.\n\n===By boat===\n\n==== From Belgium ====\nDFDS operates a [[Freighter travel|cargo line]] from [[Ghent]] to [[Brevik]] with limited passenger capacity which is normally for truck drivers. There are departures once or twice a week. Note that the ferry may be scheduled to arrive at Brevik in the middle of the night.\n\n====From Germany====\nColor Line [http://www.colorline.com/] run a daily ferry from [[Kiel]] to Oslo. The ferry leaves Kiel at 13.30 and arrives in Oslo at 09.30, the following day. The ferry terminal in Kiel is on Norwegenkai, which is a short walk across the bridge from Kiel's main railway station (note that the bridge may at times be closed for pedestrians due to ship traffic). At the Oslo end of the journey, the terminal is located at Hjortneskai, which is just west of the city centre. There is a bus from the terminal to the city centre, which departs shortly after passengers disembark (where shortly means that you might miss it if you're not one of the first leaving the boat). You can also get a cab or walk to the city centre (15 minutes walk).\n<br/>[http://www.aida.de Aida] operates cruises, usually from Hamburg, to places in Norway such as Bergen and the fjords.\n\n====From Denmark====\nSeveral companies run from various harbours in Denmark (Frederikshavn, Hirtshals, Copenhagen) to various Norwegian harbours (Oslo, Larvik, Kristiansand, Stavanger, Bergen).\n\n*'''Color Line [http://www.colorline.com/]''' traffic from [[Hirtshals]]  to [[Kristiansand]] and [[Larvik]].\n*'''Stena Line [http://www.stenaline.no/ferge/]''' from [[Frederikshavn]] to [[Oslo]].\n*'''Fjord Line [http://www.fjordline.com/]''' traffic from [[Hirtshals]] to [[Stavanger]] and [[Bergen]].\n*'''DFDS Seaways [http://www.dfdsseaways.com/]''' traffic from [[Copenhagen]] to [[Oslo]].\n\n====From England====\n\nThomson Cruise ships operate from [[Harwich (England)|Harwich]] and visit [[Flåm]], [[Bergen]], [[Molde]], [[Hammerfest]], [[Nordkapp]], [[Tromsø]], [[Lofoten]] Islands, [[Geiranger]] and [[Ålesund]] in Norway. The duration of the cruise varies from 5 days up to 2 weeks. Sailing time from Harwich to south Norway is 1.5 days. \nOnboard the cruise ship there are a number of restaurants, bars, casinos, cinemas and also a stage show to keep you entertained during the journey. There are various classes of cabins available, ranging from shared rooms to singles, doubles and luxury suites.\n\n====From Faeroe Islands and Iceland====\nSmyril Line used to operate a once-weekly service to Bergen. This service now only operates Denmark-Faroe Islands-Iceland.\n\n==Get around==\nNorway is a big country and getting around, particularly up north, is expensive and time-consuming. The best way to see the Norwegian wilderness and countryside is by having access to your own vehicle. This way you can stop wherever you want, admire the view and venture onto smaller roads.\n\n===By plane===\nNorway's craggy coastline makes roads and trains slow, so domestic flights are very popular.  The largest operators are SAS [http://www.sas.no], Norwegian [http://www.norwegian.no] and Widerøe [http://www.wideroe.no].\n\nIt is especially in northern Norway, where towns and cities are fewer and further between, that air travel is clearly the most convenient method to get from town to town. Planes between the small airports are small, and they generally have several intermediate stops along the route to embark and disembark passengers. Unfortunately, it is also in these areas where ticket prices can be most expensive.\n\nFlights in southern Norway are cheaper than in northern Norway, and even though this area has better roads and rail, planes are generally faster than taking the train or bus. There are however no air routes between the cities within 200km from Oslo, use the train or bus for this kind of travel.\n\nIf you plan to fly to the many smaller towns in Northern or Western Norway you should consider Widerøe's Explore Norway Ticket [http://www.wideroe.no/modules/module_123/proxy.asp?D=2&C=362&I=3049&U=Y] (unlimited air travel for 14 days in summer for less than a full price return ticket.).\n\n===By bus===\nAn extensive range of express buses connect cities all over Norway and even most national parks. Nettbuss express [http://www.nettbuss.no/], Nettbuss TIMEkspressen [http://www.nettbuss.no/] and NOR-WAY Bussekspress [http://www.nor-way.no/] are the biggest operators.\n\nBus schedules and frequencies vary greatly, and seating may be limited so plan ahead and book online. For more information check each operator's websites. Some mountain passes are closed all winter, and buses covering these typically run May—Sep only.\n\n===By train===\n[[Image:Flaamsbana.jpg|thumb|The Flåm Railway, running between Myrdal and Flåm.]]\nThe [https://www.nsb.no/en/frontpage Norwegian State Railways (NSB)] operates all railways. Norway's rail network basically connects Oslo to other major cities, there are no rail lines North-South in West Norway between Stavanger and Trondheim, and there are no rail lines North-South in North Norway north of Bodø. These main lines run several times a day:\n\n*Oslo - Kristiansand - Stavanger (runs inland from Drammen to Kristiansand, connections to Arendal and [[Lillesand]])\n*Oslo - [[Skien]] (serving coastal towns south-west of Oslo)\n*Oslo - Bergen (across the mountains via [[Finse]], connections to Flåm)\n*Oslo - Trondheim (Dovrebanen, through [[Lillehammer]] and [[Dombås]])\n*Oslo - [[Sarpsborg]] - [[Halden]]\n*[[Hamar]] - [[Røros]] - Trondheim\n*Trondheim - Bodø (through Trondheim airport, connections to Sweden)\n\nTrains are generally well-maintained and comfortable.\n\nYou can buy a [http://www.scandinavianrail.com Norwegian Rail Pass] or the equivalent [http://www.interrailnet.com/interrail-passes/one-country-pass InterRail One Country Pass] to travel cheap by train through Norway. If your itinerary is fixed and you don't have too many destinations, it might be cheaper to buy 'Minipris' tickets [http://www.nsb.no/ online]. If you book well in advance, you can get one-way tickets for as little as NOK199. When buying online, you can choose ticket delivery at the station or at the train, the latter means you only need to know your seat number, the train steward has your ticket. Their website sometimes does not work for people outside of Norway. In that case you can call their call centre, but be sure to mention that you tried on the website first. Phone reservations normally incur a NOK50 fee per train ticket bought.\n\nFor long-distance trains and night trains, seat reservation is mandatory, but usually can be done on short notice, e.g., at a train station, since the trains are rarely fully booked. Generally, the trains are most crowded at the beginning and end of the weekend, and that means Friday and Sunday evening. Shortly before and at the end of major holidays like Christmas/New Year and Easter, trains are usually very busy. If you try booking for these days at a late time, you may find all the cheap tickets sold out. Furthermore, the seat you reserve may be among the least desirable, that is, facing backwards, without recline, and facing towards and sharing the legroom with other passengers.\n\nNight trains operate Oslo - Bergen, Kristiansand, Bergen, Trondheim and Bodø. With a regular ticket, you will get an ordinary seat, blanket and earplugs. Sleeping compartments are available for an extra of kr 930. If you choose to order sleeping compartment, you pay for the compartment, not the bed: 2 people, same price. This also means that you will never have a stranger in your compartment.\n\nFor NOK90 you can upgrade any regular train ticket to ''NSB Komfort'', the equivalent of first class, which means a little more room for your legs, free coffee, papers and a power socket. Usually the NSB Komfort coach is the last coach in the train and behind the dining coach, resulting in much less through traffic and a quieter environment. Power sockets are starting to become available on regular class on newer trains as well.\nThe regular night train seats have a power plug, too. In some trains there is even free Internet access via Wi-Fi; one just needs to register (giving any 8-digit number as 'phone number').\n\nUnlike much of Continental Europe, Norway does not have a high speed rail system, except for the route between Oslo and its airport. Attempts at implementing high speed trains are under way, but have failed so far. Therefore, a journey between the two largest cities, Bergen and Oslo, takes as much as six and a half to seven and a half hours.\n\nIn eastern Norway, where cities are closer together, there are several people who make a daily commute, and hence many of these cities have more frequent train service with hourly departures much of the day. This includes the cities in the counties of [[Østfold]], [[Vestfold]] as well as [[Gjøvik]], [[Hamar]] and [[Lillehammer]]. In general, these trains do not have seating reservations available, but it is still possible to upgrade to NSB Komfort.\n\nIf you get even closer to Oslo, there are local trains which may have departures as often as every 30 min. Local trains never have seating reservations, nor do they have a first class section. Local trains also operate between [[Bergen]] and [[Voss]] (sometimes to Myrdal), [[Stavanger]] and [[Egersund]] and around [[Trondheim]].\n\n===By boat===\n[[Image:Folkestad ferry.jpg|thumb|The Folkestad ferry in Volda.]]\nCar ferries is an integral part of the road network in coastal regions. Prices and time vary with the length of the crossing and amount of traffic, call 177 for more information or check nearby camping sites for information booklets and timetables. Ferries often have information about other ferries in the region. On the main roads ferries are frequent during daytime, typically every half hour. Reservations are usually not needed, drive to the ferry quay and wait in line until the ferry docks. On main roads tourists typically don't have to worry about timetables as there are frequent departures. Note however that most ferries don't run after midnight or they run only every second hour.\n\nStretches with lots of ferries are desirable when bicycling, as the ferries are cheap for bicyclists and offer an often well-deserved break with a great view. Except for some of the shortest crossings (10 min), ferries typically have cafeterias serving coffee, cold beverages, sandwiches and some hot food. Due to numerous deep fjords and islands, driving in [[West Norway]] and [[Northern Norway]] as a rule (with few exceptions) involves ferries. Although car ferries are very reliable and operate with spare capacity, tourists should allow plenty of time on stretches including ferries. Note that ferries on unusually long crossings (several hours) or ferries crossing open stretches of sea are more frequently delayed or cancelled.\n\nIn regions with lots of fjords and islands, that is along all the coast from [[Stavanger]] to [[Tromsø]], an extensive network of catamaran express boats (\"hurtigbåt\") shuttle between towns and cities, and connect islands otherwise accessible only with difficulty. Service and prices are comparable with trains. Check in advance if you want to bring a bicycle. \n\n[[Image:Hurtigruten - Bergen, Norway.jpg|thumb|Hurtigruten]]\nOne option particularly popular with tourists is [[Hurtigruten]] [http://hurtigruten.com/] ships that hops along the coastline from [[Bergen]] all the way to [[Kirkenes]], taking five and a half days for the whole journey. Cabins are expensive and mandatory for multi-day journeys, but deck fares are more reasonable and there's even a 50% off discount with [[Inter Rail]]. Prices are summed up for all chargeable elements like persons, fuel charge (app. 1/30 of a person), bike (app. 1/20 of a person), car, cabin (app. 125% of a person). Reservations are recommended for cabins and cars; on deck is usually enough space for persons and bikes.\n\n===By taxi===\nTravelling with cab in Norway can be very expensive, and in most cities it's not necessary as bus, tram and train (or even walking) are easier. Taxies are generally safe as long as you choose a licensed taxi (with a white taxi sign on the roof).\nMany cab companies offer apps, and some like Oslo Taxi and partnered taxi companies use the Taxifix app. Some taxi companies offer pre-paid fees to and from the airport. Cab prices can vary a lot between companies.\n\nUber withdrew its regular service from Norway in october 2017. They may only offer some luxury or limo services currently.\n\n===By car===\nNorway has right hand traffic, as the rest of mainland Europe. Driving is generally easy as traffic is calm, and most drivers are disciplined and law abiding, although moderate speeding is common on highways. However, some city centres (such as Bergen and Oslo) may be confusing to navigate for the first time visitor due to many one-way streets. Traffic is generally light except for city centres and a handful of stretches on main roads (notably E18).\n\nGas is expensive, starting at around NOK14.50 per litre (approx. US$9.30 per gallon). In some parts of Norway, the next gas station might be more than 100km away; a small village doesn't always have a gas station even if it is remotely located. Bring a full jerry can and fill up the tank in time. Manual transmission is regarded as standard in Norway and is found in most private cars. If you prefer to rent a car with automatic transmission, make sure to order one. Renting a car is very expensive, but can be essential for easy access to some of the more rural areas, although most areas have a good reliable bus service. If you live in Europe, consider bringing your own, but if you arrive during winter (November - April), be aware that winter tyres are necessary, do not under any circumstance try to drive without, even if you don't expect snow or ice. There's no really reliable weather forecast for these areas, snow and ice can stay a long time on lesser used roads, and steep roads need only a little ice to become difficult. Winter tyres must have a minimum of 3 mm deep grooves. Cars heavier than 3500 kg are required to bring snow chains during winter and whenever snow or ice can be expected, a minimum of 5 mm tread pattern depth is recommended for trucks and heavy cars. This is important as every year, at least a dozen trucks are blocking the roads because they wanted to save some money..\n\n====Carpooling====\nCarpooling that operates in Norway includes:\n\n- joinants.com\n- http://www.samkjoring.no\n\n===By Motorhome / Camper van ===\nSeveral companies hire motorhomes and mini-campers(2 person), that are \"fully equipped\" (beds, small kitchen, fridge, shower, toilet, heating, etc) and as a rough indication they cost about what one might spend on a reasonable hire car and reasonable accommodation - but allow a lot more flexibility.\n\nWhile technically it's not legal to park overnight on the roadside or in rest areas, the practice is so common that it seems to be unenforced.\n\nThere are hundreds of camp grounds that cater to motorhomes (and caravans, or camping with tents - some have huts to rent), and these are well signposted. All have basic facilities (electricity, toilets, hot showers (pay per minute), mostly-flat ground), and some are more equipped (buy fresh food, hire boats, communal kitchens, tourist info, etc). \n\nSome are of the \"industrial\" variety (hundreds of vans, spotless facilities, very straight paths, gravel, not grass, keypads to enter, lots of strict rules, right beside the highway), and others are more... loose - occasional visitors, honour system for payment, idyllic surroundings, lots of grass and space. It's impossible to tell from the signs, so a drive-by might be necessary to see if the campground suits your mood and preferences. \n\nAs a rough guide (August 2011), a night in a campground with electricity costs around NOK200, but ranges from NOK120-300.Showers are usually NOK10 for 4 minutes.\n\nThere are many rest stops on all major and many minor roads, and there's a fantastic system of National Tourist Routes with particularly spectacular rest stops (and facilities). Most of the rests tops have a toilet and picnic table.\n\n===Tolls===\nThere are tollways in Norway, but most tollways are part of (AutoPass [http://www.autopass.no/]). Visitors can register their numberplate for the duration of their visit only, pre-buy NOK300 worth of tolls, and directly debit their (European) bank account or credit card for top ups. Any un-used funds are returned within 90 days. Occasionally, it may be necessary to stop and pay for tolls, but a huge majority are automated (numberplate is photographed while driving under a gantry over the road).\n\nThe tolls differ from those in Stockholm and Gothenburg in that foreign vehicles are NOT exempt. Cases where foreign cars incur unpaid tolls are pursued by Europe-wide toll collection companies.\n\n===Tunnels===\nAny driving in Norway is not complete without tunnels. There are thousands of them, and they are fascinating to those unfamiliar with them. The longest seems to be 24km, but 1-3km is more common. Tunnels are always lit with \"street\" lighting, but are a little narrower than the regular roads. Driving out from a tunnel, over a bridge spanning a deep gorge, back into a tunnel, then down a 12% gradient is something to be remembered!\n\n====Rules and regulations====\nRules and regulations in the traffic are generally the same as in the rest of Europe. Foreign visitors should be aware that police controls are common and that fines are very high, and should take special note of the following rules:\n\n* The give way rule is universal. On roads without the \"Yellow Diamond\" sign, all traffic from your right hand side has the right of way; you must yield to traffic from any road to your right, except from private areas such as parking lots.\n* Buses have priority when leaving a bus stop where the speed limit is 60km/h or less. Trains, trams and light rail have right of way even from the left hand side.\n* Quite a few roads are not wide enough for two cars to meet. Blue signs with a large M indicates a ''passing point''.\n* Headlights are mandatory even during daylight.\n* An EN standard hazard waistcoat is required in the vehicle, reachable from the drivers seat.\n* Pedestrians have the right of way at all marked crossings with no traffic lights. You are required to stop even if the pedestrian is not yet in the crossing, only showing intention to cross. You may be severely fined and your driver's licence may be suspended if you don't. This rule is strictly enforced.\n* The general speed limit is 80km/h in the country side and on motorways (unless indicated otherwise), and 50km/h in urban areas. The speed limit is always a maximum limit, adjusted to population density but not road standards. Which is important, as keeping strictly to the speed limit can make your car fly if you don't adjust to the terrain. The driver is also expected to adjust speed downward to a safe level in for instance fog, heavy rain or snow, as there are no hard and fast rules. On the other hand, it's considered rude to drive slow to enjoy the view when there's other cars behind you, this can provoke dangerous drive-bys. If you drive a slow car, please use open spaces besides the road to let other cars pass by now and then. And take a rest when you need to, that's what resting areas are made for.\n* Don't drink and drive. Your blood alcohol concentration must not exceed 0.02 ‰. One small beer can be enough. This rule is strictly enforced and violators risk an enormous income-based fine, a long (or even indefinite) suspension of the driver's licence and prison time.\n* On typical Norwegian two-lane road with a narrow shoulder, overtaking is only allowed on long straights with plenty of visibility. Overtake only if really necessary, consider alternatives like taking a short break.\n* Using one's vehicle horn is considered impolite and may result in a fine unless used for an emergency.\n* Right turn on red is illegal.\n* White line in the road means the lanes go in the same direction, yellow line means the lanes go in opposite direction. Less used roads may have no line at all, keep to the right side at passing traffic but otherwise it isn't so strict. Which means, watch out at the turns.\n\n====Roads and driving conditions====\n[[Image:Vikafjellet.jpg|thumb|Road RV13 over Vikafjellet. Note that this picture is taken mid June!]]\n'''Norwegian roads''' have varying quality. The main roads are the European highways indicated with an \"E\" in front of the number. For instance '''E6''' is the main north-south corridor from Sweden via Oslo to Kirkenes in the very east of Northern Norway. European highways connect cities, regions and countries. '''E18''' connects Kristiansand and towns in South Norway to Oslo and Sweden. '''E16''' connects Bergen to Oslo (via Flåm and Voss), road 7 is an alternate route to Bergen (via Hardangervidda). '''E39''' is the coastal main road from Kristiansand via Stavanger, Bergen and Ålesund to Trondheim. The E-roads are excellent for navigation. Other main roads (national highways, \"riksvei\") have low one- or two-digit numbers, the most important of these are indicated with white fonts on green background (as opposed to black on white for most highways). Note however that the importance of the road does indicate quality: even the E's may have narrow and slow sections. \n\nAsphalt cover on Norwegian roads is usually coarse and doesn't get very slippery when wet as can be experienced in some other countries. Note however that studded winter tyres tend to eat asphalt during the winter leaving deep tracks (or furrows). This can make the car sideways unstable, particularly in high speed, and if filled with water tyres may float on the water making the car difficult to control (as if driving on ice or snow). When driving downhill steep mountain roads it is best to use a low gear and let the engine control the speed. Brakes can overheat causing the brake fluid to boil.\n\n'''Moose/elk''' (\"elg\") and red deer can run onto the highway particularly at dusk and dawn so take extra care if driving at those times, particularly through forest. Red deer can also jump onto the highway without warning, particularly in Western Norway during late autumn and winter, special \"crossing points\" have been constructed several places, be aware. Reindeer may happen to walk on the road in Northern Norway. Note the warning signs. These warning signs will also, with few exceptions, specify for how long a distance there is an increased risk of animals crossing the road. The elk, the most dangerous animal on the roads, is most active at full moon, after heavy snow fall and at dusk/dawn.\n\nDriving a car in '''winter''' conditions may be a real challenge without proper training and experience, this particularly applies to mountain passes all over Norway as well as other roads in Northern Norway. The golden rule for driving on snow, ice and slush: ''don't rush''. Braking distance increases dramatically, increase distance to the car in front of you from the standard 3 seconds to a 5-6 seconds or more. Inexperienced drivers should drive very careful until they get used to the conditions and the car, experienced drivers always \"feel\" the contact between tyres and road. A number of mountain roads are frequently closed temporarily during bad weather, and the authorities routinely issue road information on radio, TV and internet. During blizzards on some roads you are only allowed to drive in a line behind a heavy snowplough, a method called \"kolonnekjøring\", you are then obliged to wait at a gate or sign until the snowplough arrives. Always obtain specific information about mountain roads the day and hours before going. Don't hesitate to ask locals or call '''175''' for last minute information, as Norwegians are generally comfortable with driving on snow and ice. Always bring enough clothes and food, always calculate plenty of time. Be prepared to cancel or postpone trips in winter. \n\nSome mountain passes, including popular roads around [[Geiranger]] are totally closed during winter (typically Nov-May). Other mountain roads may be closed for shorter periods (several days or only one night) during bad weather. These roads are always '''closed during winter''' (\"vinterstengt\"):\n* Road 55 Sognefjell (Nov-May)\n* Road 51 Valdresflya (Dec-Apr)\n* Road 63 Geiranger (Nov-May)\n* Road 63 Trollstigen (Oct-May)\n* Road 13 Gaularfjell (Dec-May)\n* E69 Nordkapp (North Cape) (Oct-Apr)\n\nVisitors frequently underestimate '''distances and driving time''' in the Norwegian landscape. Key distances by car:\n* Oslo-Bergen 500km/ 8h\n* Oslo-Stavanger 540km/ 8h\n* Oslo-Trondheim 500km/ 8h\n* Trondheim-Bodø 700km/ 12h\n* Oslo-Geiranger 450km/ 7h\n* Oslo-Flåm 350km/ 5h\n* Bodø-Tromsø 600km/ 10h\n* Bergen-Geiranger 400km / 7h\n* Bergen-Flåm 170km/ 3h\n* Ålesund-Trondheim 300km/ 6h\n\n===By bicycle===\nThe bicycle seat is one of the best ways to experience the landscapes of Norway. The sport is becoming increasingly popular in Norway, especially since the success of Norwegian cyclists like Thor Hushovd. As a result, Norwegians generally have a very positive attitude to bicycle tourists, so you'll have a lot of small talk. Norwegians themselves prefer to ride on nice or even expensive bicycles: in most cities good bicycle shops can be found.\n\nYou'll find quite a number of travel diaries online. Only few specific cycle tracks exist, mostly in the big cities, and they are not fully interconnected. Except for densely populated areas, they can mostly be ignored. You can safely use almost every road, as speeds are relatively low and the vast majority of drivers are responsible and patient. Cycling is banned on motorways and in most tunnels, but there is often an alternative route where cycling is allowed - even if this might involve a detour or a ferry ride in some of the more wild parts of the country.\n\nIn most of Norway, cycling can be physically challenging, due to steep climbs and strong winds. Your equipment should be lightweight and aerodynamic. You will need a wide range of gears: a ratio of 39-27 for a strong cyclist without luggage or even 22-32 for a normal cyclist with luggage is necessary on many slopes. Your brakes should be of high quality and you'll need spare brake pads when doing a trip of more than a few days. Lights are necessary because of the many tunnels. Because of the winds, it is advisable to avoid wide panniers and loose fitting clothes. A lightweight recumbent should be considered as a serious option for those experienced with this type of bicycle, especially when cycling south to north.\n\nThe roads are generally paved well, although gravel roads are sometimes unavoidable. As long as you don't go off-road, you will not need suspension or grooved tyres.\n\nBecause of the long distances and numerous hills, bicycle tourists are advised to plan well and be prepared to use public transport for the less interesting stretches. Special attention should be given to tunnels, as some of them are forbidden for cyclists, as are a few roads. An  [http://www.cycletourer.co.uk/maps/tunnelmap.shtml on-line map of tunnels]. The tourist information also has a map of those forbidden routes. When hiring a bike, you can consult the person that lends you the bike concerning the track you want to take. In many cases, signposts indicate the route for cyclists and pedestrians around forbidden roads or tunnels. Some of the high speed tunnels have bus stops a short distance from the entrance where you can board special buses equipped with bike racks to transport you through the tunnel. Buses usually run hourly and the departure times are posted.\n\nFerries take bikes for free or minimal charge, on trains you've to pay a fee and in buses, bikes are sometimes forbidden and in all other cases only transported if there's enough space (no fee or same like a child). The [http://www.syklistene.no/ Norwegian Cyclist Association] offers information.\n\n===By thumb===\nHitchhiking in Norway is best on the the routes from Oslo-Trondheim (E6), Oslo-Kristiansand (E18) and Kristiansand-Stavanger (E39). However, near the cities these are now motorways and it is not possible to stand at the road itself. Hitchhiking is not that common in Norway. If hitchhiking is ever safe, it's pretty safe in Norway, however it's difficult to get a lift and it may be very slow.\n\nWhen waiting make sure to stand in a place where the vehicles can see you and have a safe opportunity to stop. Ferry ports and main fuel stations are good places to try. Stretches with low speed limit (50-60) is generally better than high speed as drivers find it more cumbersome to make a halt. Drivers of heavy trucks in particular prefer to keep a steady speed. Roadside cafeterias where truckers have a break can be good place to ask for a lift.\n\nGood hitchhiking spots from major cities are:\nOslo to:\nBergen and the mountains- if you're daring, try Oksenøyveien (see Kristiansand), but be aware that most cars continue southwards to Drammen. Rather catch the Timekspressen bus, direction Hønefoss, to Sollihøgda.\nTrondheim and the north- is getting more difficult as motorway development continues. The best bet inside Oslo is bus stop Ulvenkrysset. Get the metro to Helsfyr, then bus 76, 401 or 411 for one stop. Further outside, to avoid the local traffic, you are best off at the Shell gas station at Skedsmovollen, bus 845 and 848 from Lillestrøm train station.\nKristiansand and the south: Few spots beat the bus stop Oksenøyveien, connected by bus 151, 251 and 252. You may be dropped in Sandvika by cars heading towards Hønefoss and the mountains/Bergen. Carry a sign.\nSweden along E6: Highway all the way, except close to the centre. Try the bus stop Nedre Bekkelaget, bus 81 and 83.\nSweden along E18: You may try Nedre Bekkelaget, but as most traffic continue towards Strömstad and Gothenburg, you should rather catck the Timekspressen bus 9 to Østensjø stop, just after the Holstad roundabout. \n\nBergen to:\nOslo - Get local train to Arna and try near the entrance to Arnanipa tunnel.\nNorthwards - Go by bus to Vågsbotn in Arna, and try hithing a ride close to the Hjelle bakery.\nSouthwards - Get the light rail to Nesttun, then nearly any bus for three stops to Skjoldskiftet. Hitch southwards along E39.\n\nTrondheim to:\nOslo - Get bus 46 to the shopping centre City Syd, then go under the E6 and try your luck at City Syd E6 stop. Soon, the city tax on buses will be extended past the Klett roundabout, if this is in effect you should go to the bus stop just after the roundabout at any Melhus-bound bus and try your luck there.\nMolde/Ålesund - Get any Orkanger bus to the stop just after Klett roundabout. Soon, Trondheim city tax will extend to Børsa, after which you should stay on the bus for as long as you can, and hitch a ride from there.\nNorthwards - Get city bus 7 or 66 to Travbanen stop.\nSweden - To be sure to hitch only on cars going towards Sweden, get a train or bus to Stjørdal and hitch on the E14.\n\nIn general, looking polite and friendly is a good trick. Asking cars in line at a ferry quay (if travelling along the coast) is a very good idea, and may bring you very far. Hitching rides from Molde all the way to Bergen are not unheard of, but don't bet on it.\n\nIn general though, you can really get to anywhere from anywhere by thumb, just in some places it might take a while.\n\n==Talk==\nThere is no ''de jure'' standard spoken '''[[Norwegian phrasebook|Norwegian]]''' (although ''standard østnorsk'', the variety usually taught to foreigners, is the predominant language in much of ''Østlandet'' including Oslo and is the closest thing to a ''de facto'' standard, being widely used in media) and a wide range of dialects is used even in public broadcasting, and there are even two standard ways of writing it, ''bokmål'' and ''nynorsk''. Norwegians learn both at school. The two varieties are very close and mutually intelligible with the two other Scandinavian languages, [[Danish phrasebook|Danish]] and [[Swedish phrasebook|Swedish]]. Of the two standard ways of writing it, bokmål is by far the more common form of writing in most of the country, though nynorsk is prevalent in Western Norway. Overall, bokmål is the preferred written standard for about 85% of the population. \n\nSami is a group of minority languages which have official status in some Northern regions as well as some municipalities further south. Road signs and other public information is then provided in both Norwegian and Sami (note that Norwegian and Sami place names may differ, maps will typically use the Norwegian name). Sami is related to Finnish, but not to Scandinavian languages, and virtually no non-Sami Norwegians speak Sami. \n\nAlmost all Norwegians speak English, and unless you approach someone really old and isolated you should have no trouble whatsoever getting around in English. Officially, 91% of the population speaks fluent English, making Norway one of the most English-proficient countries on the planet where English is not an official language.\n\nGerman and French are spoken by some workers in the tourism industry. However it is better to speak the local language, another Scandinavian language, or English.\n\nForeign films and television programmes are generally shown in their original language with subtitles. Only children's programmes are dubbed into Norwegian.\n\n==See==\n\n'''Northern Lights'''\n\nTromsø is a great place to see the aurora, or northern lights.\n\n'''Midnight Sun'''\n\nTromsø should also be visited during summer to see the midnight sun. The duration of the Polar Day period depends on how far north you are. The further north you go, the longer the period lasts and the earlier it begins. The North Cape, Bodø, and Lofoten are ideal to experience the Midnight Sun. The frequency and intensity of Northern Lights coincide with high solar sunspot activity, that cycle in approximately eleven-year intervals. \n\n'''Fjords'''\n\nNorway is widely recognized for its plethora of fjords (even the word \"fjord\" is Norwegian). Two of Norway's most prominent fjords, Nærøyfjord and Geirangerfjord have received a UNESCO world heritage site listings, due to their outstanding natural beauty and scenery. Other notable mentions are Lysefjord, Oslofjord, and Sognefjord. \n\n'''Lofoten Archipelago'''\n\nLofoten, is an archipelago north of the Arctic circle. During the summer the islands have 24 hours of daylight. It is a great place to cycle, rock climb or mountaineer. Reinebringen is a popular hiking destination due to the stunning panoramic view from its peak.\n\n==Do==\nA great introduction to Norway is the one-day Norway in a Nutshell [http://www.norwayinanutshell.no] package on a single ticket from Oslo or Bergen into the mountains, with a boat trip through the fjords. You can break the trip at several interesting cabins for walking or just admiring the view, and even hire a mountain bike for part of the journey. One of the highlights of the 'Norway in a Nutshell' package is Flåmsbana [http://www.flaamsbana.no/eng/Index.html], a 20km railway that's one of the steepest in the world. Along the way you'll see beautiful mountains, rivers, valleys, waterfalls, and other beautiful sights on your way to the town of Flåm.\n\nAnother great way of experiencing and learning all about Norway is by going on a guided excursion. '''Norway Excursions'''[http://www.norwayexcursions.com] provides all sorts of excursions, from sightseeing to hiking. A local guide will take you to the most interesting and beautiful places and tell you all about the fjords and mountains, history and culture of the particular region you visit. \n\n'''Norway Travel Guide'''[https://norwaytravelguide.no] provides detailed information on everything relating to travelling in Norway and services with great value and insider tips on what to do and see while in Norway They offer you to contact with locals all over Norway who can help you out with everything you need for your trip.\n\n===Hiking===\nNorway has endless opportunities for hiking in its wide wilderness, from easy walks in Oslo's city forest to alpine climbing in Jotunheimen or [[Troms]]. A number of areas are protected as national parks, but most the country is equally attractive and available to the public.\n\nIn Norway, travellers enjoy a [[right to access]], which means it is possible to camp freely in most places for a couple of days, as long as you're not on cultivated land and provided you are at least 150m away from houses and farm buildings. Don't leave any traces and take your rubbish away for recycling. \n\nDen Norske Turistforening (DNT) [http://www.turistforeningen.no/english/] (''The Norwegian Mountain Touring Association'') operates many staffed and self-service mountain cabins, marks mountain routes, offers maps and route information, guided tours, and several other services for mountain hikers in Norway.\n\nMountainous areas are popular among both Norwegians and tourists. Why not visit Galdhøpiggen (2469), the highest mountain in Norway, or join a [[[[musk ox safari]]]] in Dovrefjell!\n\nFor maps, bypass Google Maps, whose coverage of Norway is poor, and try the national mapping agency's [http://www.norgeskart.no/ Norgeskart.no] site, which concords with their excellent printed hiking maps.\n\n===Skiing===\nBoth [[cross country skiing|cross country]] and [[alpine skiing]] are popular sports in the winter, and the largest areas, [[Trysil]],[[Hafjell]] or [[Hemsedal]] for example, compete well with the [[Alps]]. Telemark is also a nice area to ski in. (The birth place of cross country ski.) Voss, Geilo and Oppdal are other major ski resorts. Around Oslo there is large park ideal for cross-country skiing. In Stryn, at Galdhøpiggen and at Folgefonna there alpine ski centres that are open in summer only (May-September), offering unique opportunities for alpine skiing in T-shirt and short pants.\n\n===Cycling===\nIn Norway, you can rent, virtually everywhere, a bicycle. Cycling routes exist usually near bigger cities; you can find some tours at Cycle tourism in Norway [http://bike-norway.com/]. Some roads and tunnels are forbidden for cyclists as they are life-threatening; read the section [[Norway#By_bicycle|By bicycle]] above. Some city dumps may have a special section where you can pick up discarded bicycles (and other stuff) for free. The charity thrift-stores (FRETEX/ELEVATOR/NMS Gjenbruk)sometimes stock used bicycles.\n\n==Buy==\nThe Norwegian currency is the ''Norwegian crown'' (''norske krone'', in Norwegian), sometimes abbreviated to just the two letters ''kr'' placed after the amount. A 1/100th ''krone'' is called ''øre''. When you need to disambiguate the Norwegian ''krone'' from other krone (eg: the Swedish or Danish ''krone''), use the official three-letter abbreviation '''NOK''' placed before the amount with no space. As of August 2018, there are about NOK9.54 to one euro.\n\nCoins come in 1, 5, 10, and 20 kroner. Paper notes come in NOK50, NOK100, NOK200, NOK500, and NOK1000 banknotes.\n\nATMs in Norway are called ''Minibank''. There is no problem locating an ATM in urban areas. At main airports and Oslo Central Station, you can withdraw euros, dollars, pounds sterling, Swedish, Danish and Norwegian kroner. Nearly all stores, with the exception of some grocery stores, accept major credit cards such as MasterCard and Visa (bring your passport or driver's license, as you are required to identify yourself when using a credit card). If you buy something in a store, you can often ask to get some extra cash. Debit cards are the most common payment method with mobile payment on the rise. Do understand that Norway is technically well-developed and that many people no longer use cash on a daily basis. Banks and politicians alike are pushing to allow stores to refuse cash as payment, but as of 2017 shops are still required by law to accept cash. For withdrawals of more cash than NOK 10 000, you will have to go to a bank. The bank is required to document what you intend to use the money for (they will ask you). This is part of anti money laundering and to prevent tax evasion. \n\n===Costs===\nNorway is an expensive country.  While it is possible to travel in Norway on a limited budget, some care must be taken. Because labour is costly, anything that can be seen as a \"service\" will in general be more expensive than you expect. Travel costs can also be a killer, because gas is heavily taxed, the country is large and distances long. So a rail or air pass can save you a lot of money. \n\nAs rules of thumb, subsisting on under NOK500/day will be difficult even if you stay in hostels and self-cater, with NOK1000/day allowing a more comfortable mid-range lifestyle and over NOK2000/day needed for good hotels and restaurants.\n\nTake care when buying alcohol and tobacco. It will most certainly be more expensive than you expect. A 400 or 500&nbsp;mL beer in a pub or restaurant will cost around NOK80 whilst a 500&nbsp;mL can of 4.7% beer in a supermarket costs about NOK30. Cigarettes cost about NOK115 for a pack of 20, and a bottle of 500&nbsp;mL Coke will usually cost NOK20. On the positive side: Norway has good quality tap water. Buying bottled drinking water is unnecessary and hugely expensive. Some Norwegians drink straight from streams when hiking, but periodic outbreaks of Tularemia makes this a bit risky.\n\nFast food restaurants like McDonalds and Burger King are also more expensive than in most countries due to the labour costs. A large Big Mac meal (\"Big Mac Meny\") will set you back around NOK100, and the same goes for a Double Whopper with Cheese meal. Also, keep in mind that most bakeries, fast food chains, and other types of restaurants that offer takeout, charge more if you eat it at the restaurant than if you take it with you, due to differences in the VAT rate.\n\nIn Norway, waiters are not dependent on tips from customers as they are in the US, as they are well paid. However, tipping is not unusual (and increasingly usual) in mid- to high-end cafés and restaurants, but only if you feel you have been treated well. If you do decide to tip, somewhere around 10% is common. Or you can round off upwards. Tipping cab drivers is usual if you travel for more than NOK200, but you will get no reaction from the driver should you choose not to tip, so this may be a new experience to American and English tourists. Tipping is never considered offensive, but not tipping is also rarely frowned upon.\n\nIf you are a bit careful about your expenses a daily budget of around NOK1500 (€190) per day is not unrealistic.\n\nYou can save some money by bringing supplies. Be aware of the strict Norwegian border regulations, which allow a maximum of 200 cigarettes or 250g of tobacco, 1 litre of hard alcohol and 1.5L of wine and 2L of beer OR 3L of wine and 2L of beer OR 5L of beer. As a general rule, tobacco, alcohol and meat will be comparatively expensive. Vegetables, flour, baby articles, car supplies (oil, window wiper fluid and so on), and clothes will have (almost) the same price as in neighbouring countries, or even be cheaper.\n\nWhen in Norway do as the Norwegians do, and venture into Sweden for supplies, when you have the opportunity.\n\n===Money exchange===\nIt is possible to exchange money in most banks near tourist information offices, in the post-office or withdraw the money in local currency from the ATM. In some places, however, they don't handle cash in the banks so the only way to exchange money is in the post offices where the exchange fee might be up to NOK75 (€9.50, USD12.20)!\n \nYou will get the best rate when you withdraw money from the ATM or simply pay with a credit card. Note that the country is currently upgrading to a new system using computer chips embedded in the card and a pin number. Credit cards with magnetic strips are still accepted throughout the country; however, you will have to let the merchant know that the you do not have a pin code you need to sign instead. It is also important to note that sometimes a merchant system will not allow signatures, so it is a good precaution to have cash on hand to pay if needed.\n\nFor example (August 2009) the exchange rate in the bank was NOK8.75 for €1 (taking into consideration that it is not possible to exchange an amount of more than NOK5000 per one transaction and there is a commission of NOK100 for each transaction); in the tourist information office the exchange rate was 7.28 (no commission), by withdrawal from ATM the rate was 7.74 (taking into consideration all the bank commissions).\n\n===Shopping===\nOpening hours in Norway are better than they used to be, though many smaller stores still close early on Saturday (13:00 or 15:00 is typical) and nearly everything is closed on Sundays. Grocery stores (particularly in the cities) have long opening hours frequently until 22:00 or 23:00 on weekdays. You'll often see opening hours written as \"9-21 (9-18)\" on doors, meaning 09:00 to 21:00 weekdays, 09:00 to 18:00 Saturday. The grocery market is dominated by a handful of chains covering most of Norway: Rimi, Rema 1000, Kiwi, Prix and Bunnpris are low price shops with a narrow selection of items; Meny, ICA Supermarked and Spar have wider selection and better quality at a slightly higher price; Coop Mega and Ultra have fewer shops and higher prices.\n\nConvenience stores, notably the major chains '''Narvesen''' and '''Mix''' (all over the country), '''Deli de Luca''' (Oslo, Stavanger, Bergen and Trondheim only) and '''7-Eleven''' (bigger cities only), are open from early morning until late at night every day, with 24 hour service in the biggest cities. All over the country you will find gas-stations, '''Statoil''', '''Shell, fresh/selected''', '''YX''' (HydroTexaco) (these days turning into 7-eleven with gas) and '''Esso, On the Run'''. Virtually all gas-stations serve fast-food, especially sausages, hamburgers, pizza, and so on. The gas-stations have long opening periods, and the bigger stations in cities and near bigger crossroads are open 24 hours. Convenience stores and gas stations are relatively expensive.\n\nMost big cities have over the years been almost exclusively dominated by shopping malls. Although you do have shopping streets like Karl Johans Gate in Oslo, Strandgaten in Bergen and Nordre gate/Olav Tryggvasons gate in Trondheim, you are bound to find malls around the country by Thon Gruppen and other major companies. Norway is also home to Scandinavia's biggest mall - Sandvika Storsenter - located 15 minutes outside Oslo by train. In Oslo you have Byporten Shopping Senter, Oslo City and Gunerius located right next to Oslo S train station and Paléet and Arkaden Shopping in Karl Johans Gate, as well as several malls and shopping centres a bit further out.\n\nGetting \"good deals\" and bargaining is frowned upon, and the caterers are not authorized to give you a better price. The price you see, is the price you pay. Although asking for a discount is perfectly OK, getting one will in most cases never happen. If you plan on buying tax-free, a good practice is to bring with you the necessary forms.  Most stores will have these forms at hand themselves but it is a good precaution. Also, if you pay with credit card, you might have to sign the receipt which will require some form of ID, drivers license and passport are both OK. This is due to the strict nature of money transactions.\n\nPrices are almost always including VAT and other taxes, so the price you see is the price you pay. If a business primarily caters to other businesses, prices may be stated excluding VAT with a sign that says \"eks MVA\" (opposite being \"ink mva\". MVA = merverdiavgift, meaning VAT). The MVA is currently 25% for goods, 15% for food items and 12% for some services (cab, hotel stays, cinema tickets). MVA was previously known as merverdiomsetningsavgift, shortened to \"moms\" and you may hear or see \"moms\" used informally.\n\n==Eat==\n[[Image:AiLofoten DryCod 01.jpg|thumb|Cod drying in the wind, a common (and smelly) sight along the coast]]\n[[Image:Dinner Fiskebullar.JPG|thumb|Fit for a Viking: ''fiskeboller'' (fish balls) in cream sauce with potatoes, grated carrots and a smattering of bacon]]\n\nTraditional Norwegian \"farm\" food is made by whatever can grow in the northern climate, be stored for a year until new crops come out, and contain enough energy for you to do hard work.   Regional variances in traditional food are huge and hence, and what is thought to be \"typical traditional\" for one Norwegian might be totally unknown to another.  Typical examples are variations of yeasted and unyeasted bread and other forms of bakery, porridges, soups, inventive uses of potato, salted and smoked meat, and fresh, salted or smoked fish.  Dried cod (''tørrfisk'') and salted cod (''klippfisk'') are staples of coastal communities in the north and can be seen drying on outside racks in spring and summer.  The national dish of Norway is ''fårikål'', a stewed casserole of lamb's meat and cabbage. \n\nFiner traditional food is usually based on hunted animals or fresh fish.  Steak, medallions and meat balls from game, deer, reindeer and elk are highly appreciated foods with international reputation, so are fresh, smoked and fermented salmon varieties as well as a host of other fish products. Traditional pastries like ''lukket valnøtt'' (marzipan-covered whipped cream cake) are other original contributions to international cuisine.  Cheese of various types is common, but one particularly Norwegian favorite is ''geitost'' (goat-cheese), which is technically not a cheese but a type of fudge without all the sugar and cream but with various amounts of goat milk. The milder, more common varieties are made mostly of cow milk and bears a remarkable similarity to smooth peanut butter in colour, texture and taste. The stronger varieties are made purely of goat milk and considered an acquired taste.\n\nToday, Norwegians use plenty of sliced bread for almost any meal except dinner, whereas recipes for hot meals will be taken from almost anywhere in the world, including of course the traditional kitchen, but seldom the most extreme examples. Lunch usually consists of some bread and snacks instead of a warm dish but this is then compensated by eating well at dinner time.\n\nStrawberries, raspberries and other berries are exceptionally tasty in Norway during the summer season. This is due to the cool summers – together with the long days – which allows the berries to grow slower, thus intensifying the concentration of aromatics in the berries.\n\nNorwegians are also known for eating a lot of frozen pizza. \n\n===Places to eat===\n{{infobox|Whale anyone?|Yes, Norwegians eat whale. However, it's very seldom found in most ordinary restaurants, and chances are it might be overly expensive.  Young Norwegians did not grow up with eating whale because of the moratorium in the 1980s.  Although whaling started up again in the early 1990s, whale is no longer a staple food as it once was in the coastal areas. Norway only allows a limited catch of the minke whale as this specific species is not regarded endangered.}}\n\nEating out is '''expensive''', with fast food starting from 50 kr and sit-down meals in a decent restaurant nearly always topping NOK200 or more for a main course.  Even a take-away sandwich and a coffee at a gas station may cost you up to NOK70(€9, USD11.50). One way to cut costs is '''self-catering''', as youth hostels and guesthouses often have kitchens for their guests.  Supermarkets and grocery stores are not hard to find, even in the smallest village there is usually more than one grocery store. The largest chains are Coop, REMA 1000, Meny, Kiwi and Joker. Breakfast is often hearty and buffet-style, so pigging out at breakfast and skipping lunch is also an option. Buy/bring a lunchbox before attending breakfast, as most of the bigger hotels will allow you to fill it up for free from the breakfast buffet for eating later in the day.\n\nFor a cheap quick snack Norwegian-style, look no further than the nearest grill or convenience store, which will dish up a sausage (''pølse'') or hot dog (''grillpølse'') in either a hot dog bun (''brød'') or wrapped in a flat potato bread (''lompe'') for around NOK20-30.  However prices can soar as high as NOK50 if you buy at the right (read wrong) places.  In addition to ketchup and mustard, optional toppings include pickled cucumber (''sylteagurk''), fried onion bits (''stekt løk'') and shrimp salad (''rekesalat'').  To get the most for your money, order a (''kebab i pita'') which is lamb meat roasted on a spit then fried when you order, served together with vegetables in a pita bread.  This tastes great, is extremely filling and can be found for as little as kr 50 in central Oslo and Bergen. Outside, you will have to stick with your grillpølse.\n\nThe new Nordic cuisine has gained a lot of fame and attention. Most of these restaurants are in the upper segment. The most famous in Norway is probably Maemo, a three star restaurant located downtown Oslo. Others worth a visit are Kontrast and Bokbacka.\n\n===Vegetarians===\nVery few Norwegian cuisine restaurants have vegetarian meals on the menu, but will make something if asked, with varying success. Some of the few chains of stores/restaurants where you will always have a vegetarian option is Peppes Pizza, Dolly Dimple's, Egon, SubWay and Esso/On the run (spinach panini).\n\n===Allergies and diets===\nIf you have allergies like lactose intolerance and gluten allergy, going to Peppe's Pizza, Dolly Dimple's, Subway and Burger King are good suggestions. But if you want to eat somewhere a little fancier, asking the maître d' at the restaurant is always good practice. In some cases, if it is not on the menu, they might be able to accommodate you anyway.\n\nAs the regulations for food is extremely strict in Norway, the ingredients for anything you buy is always printed on the packages, and if you ask, you will always be told what is contained in the food you order.\n\n===Food safety===\nFood safety is very good in Norway. Salmonella is very rare compared to other countries, and health officials inspect restaurants at a regular basis. Also tap-water is usually very nice; Voss water from Vatnestrøm in [[Aust-Agder]] is actually exported abroad, including to the USA.\n\n==Drink==\n{{infobox|Aquavit|Aquavit (Norwegian: ''akevitt'') is a distilled beverage of about 40% alcohol originating in the Nordic countries and Germany. Norwegian aquavit, however, is distinguished from other aquavits in that they are always made from potatoes, and that they are aged in used sherry casks. Recipes remain secret, but most Norwegian aquavits are spiced with caraway and anise. There are at least 27 different Norwegian aquavits, suitable to different kinds of food, in drinks or as avec. Aquavit is especially popular with traditional food for Christmas. The classics are Lysholm Linie (a nice all-round aquavit to go with not too heavy food), Løiten Linie (with salted and smoked meat), Gammel Opland (all-round, especially good with traditional ''lutefisk'') and Simers Taffel (to go with herring), you should also try Gilde Non Plus Ultra (as avec) if you enjoy the taste. The \"Linie\" aquavits have in fact travelled across the Equator twice while aging!}}\n\nNorway is often described as a \"dry\" country because alcohol is highly priced and a glass of wine/beer in a restaurant is in the range of NOK80.  When in cities/towns with many students (Oslo/Bergen/Trondheim/Tromsø in particular), you can very often find prices to be lower.  Ask at your place of accommodation or young people in the streets for hints and tips on where to go. Beer can be bought at supermarkets, however wine and stronger alcoholic beverages have to be purchased in state owned liquor stores (Vinmonopolet [http://www.vinmonopolet.no]). The price of alcohol, however, does not stop the locals from having a good time. They are often found drinking and carrying on in local street parties and on their porches.\n\nThe high prices are most likely part of the reason why the tradition of holding '''vorspiel''' and '''nachspiel''' before going out for a night on the town is very popular in Norway. The words derive from German and can be translated as \"pre-party\" and \"after-party\". If going out on the weekend, it is not unknown for Norwegians to gather at a friend's house and not depart for a chosen night-time venue until after midnight. So if you've seen Norwegian drinking culture abroad and are shocked by the empty bar/club at 22:00, call your Norwegian friend and ask where the vorspiel is. It's likely to be a whole lot of fun. Clubs tend to fill up around midnight-01:00. However, this is normally the case on weekends only; during weekdays, you will often find Norwegians sitting in bars enjoying a couple of beers or a bottle of wine.\n\nYou must be at least 18 years old to purchase beer/wine and 20 years old to purchase spirits (alcohol levels of 22% and above) in Norway.\n\nTechnically, drinking in public is prohibited. This law is very strict, and encompasses even your own balcony if other people can see you! Luckily, the law is very seldom enforced, and Norwegians indeed do drink in parks. There are calls for modifying the antiquated law, and recently, there has been a debate in media: most people seem to agree that drinking in parks is alright as long as people have a good time and remain peaceful. However, if you bother others and get too intoxicated or a policeman happens to be in a bad mood, you may be asked to throw away your alcohol, and in a worst-case scenario, fined. Drinking openly in the street is probably still considered somewhat rude, and it would be more likely to bring the police's attention than a picnic in a park, and is advised against. Having a glass of wine in an establishment that legally serves alcohol at the sidewalk, of course, is not a problem.\n\nBe careful about urinating in major cities like Oslo if you're drunk, as fines for public urination can be as high as NOK10,000 (USD1750)! However, this is normally not a problem if you urinate in a place where you cannot be seen, such as a couple of yards into the woods. Public intoxication is also something you should be a bit careful with, especially in the capital [[Oslo]]. In smaller towns the police will have no problem giving you a night in the local jail if they think you are disrupting peace and order.\n\nIn Norway, all '''alcohol''' with a volume percentage of under 4,75% can be sold at regular shops. This means you can get decent beer all over the place. The price varies, but imported beer is usually expensive (except Danish/Dutch beers brewed in Norway on licence like Heineken and Carlsberg). '''Shopping hours''' for beer are very strict: The sale stops at 20:00 every weekday, and at 18:00 every day before holidays (incl. Sundays). Since the sale is decided in the local council, it may vary, but this is the latest times decided by law. This means the beer will have to be PAID before this time. If it's not paid, the person behind the counter will take your beer, and tell you \"Sorry pal, too late!\". Don't argue with them. The clerk or even the shop can get in severe legal trouble if caught, or the cash register will refuse to let them scan the items. On Sunday, you can't buy alcohol anywhere except bars/pubs/restaurants.\n\nFor strong beer, wine and hard alcohol, you will have to find a '''Vinmonopolet''' branch. The state shop have a marvellous choice of drinks, but somewhat expensive. The general rule is that table wines are more expensive than in nearly any other country. Expect NOK 80-90 for a decent, \"cheap\" wine. However, as the taxation is based on the volume of alcohol per bottle rather than the initial cost, you can often find more exclusive wines at comparably lower prices than in private establishments in other countries. Vinmonpolet is open until 17:00 M-W, 18:00Th-F, and 15:00) on Saturday. \nAs mentioned, Vinmonopolet offers a good selection of both famous and rarer liquors, and the staff tend to be quite knowledgeable about trends, brands and what food it goes well with, and the advise is free. They also offer a selection of wine tasting classes and information campaigns to give new experiences.\n\n'''Beers'''\nNorwegian beer isn't the best in the world, but it's certainly worth trying.  The brands you are most likely to see in pubs are Ringnes, Hansa, Aass and Frydenlund (accompanied by a vast array of imported drinks). In northern Norway, Mack and Nordlandspils are the commenest beers. There are also craft brew available from Nøgne Ø and Haandbryggeriet, some of which are of very high quality. Other varieties are available at places such as Mikrobryggeriet (Bogstadveien), Lorry's (Parkveien) or Beer Palace (Aker Brygge) all in Oslo.\n\n==Sleep==\nA single hotel room (always book ahead for weekdays) should cost you from around NOK800 and up (special offers are common and cheaper), but you can find reasonable cheap lodgings in camping huts (NOK300-600, space for entire family), mountain cabins (NOK150-300 per person), youth [[hostels]] (NOK150-250 per person), etc. Most of these will require you to make your own food, bring your own bedsheets, and wash before leaving.\n\nFor longer stays (one week or more) consider renting an apartment, a house or a high quality cabin. Several agencies offer reservations on houses or cabins owned by farmers or other locals. This type of accommodation is frequently more interesting than a standard hotel.\n\nAirbnb is worth checking out for experiences and deals.\n\n==Work==\nCitizens of countries belonging to the European Union, plus [[Iceland]], [[Liechtenstein]] and [[Switzerland]], do not require a permit and are free to live and work in Norway for up to 3 months (some restrictions apply for recent members of the European Union). In addition, citizens of a number of non-EU countries are permitted to work in Norway without the need to obtain a visa or any further authorisation for the period of their 90 day visa-free stay (for more information, see the 'Get in' section above).\n\nYou may start from the local office of the public agency NAV [http://www.nav.no/], to get legal advise and a list of available jobs. Note that even though the unemployment rate in Norway is very low (2.5%)[http://www.indexmundi.com/norway/unemployment_rate.html] , short-term employment may be hard to find. (Certainly when not fluent in a Scandinavian language.) If you decide to move there you have to fill in a \"Residence Permit\" which lasts for 3 years before it needs to be renewed.\n\nSalaries range NOK15,000-35,000 (UD$2,500-5,700/€2,000-3,500) per month (2012).\n\n==Stay safe==\nNorway has a low crime rate. The most likely crimes for tourists to experience are car break-ins and bicycle theft. Pickpockets do also tend to be an increasing problem in urban areas in the summer season, but it's still nothing like in larger cities in Europe. It is always a good idea to look after your belongings, this includes never leaving valuable objects visual in your car and locking your bike safely.\n\nPenalties for possessing, using, or trafficking in illegal drugs in Norway are severe, and convicted offenders can expect long jail sentences and heavy fines. Although this is entirely dependant on which type of drug you get caught with. Cocaine and amphetamine for example will land you a much harsher punishment than possession of cannabis will. Also, possession will not land you a punishment anywhere near as severe as trafficking will, but this depends on the mood of the officers you encounter, as it is in most other countries. In Norway, driving under the influence (defined generally as 0.02% Blood Alcohol Content) could land you immediately in jail.\n\nSingle women should have few problems, although ordinary street sense is advised after dark. Especially the inner east side of Oslo has become more dangerous during night hours over the last decade. Even so, there are still relatively few violent crimes.\n\nNorway is one of the countries with the least corruption in the world. Police and other authorities cannot be bribed, and travellers are strongly advised against attempting in any form of bribery.\n\n[[Image:Warning sign polar bears.jpg|thumb|Warning - polar bears. \"Applies to all of Svalbard\".]]\n\nThe greatest dangers to tourists in Norway are found in nature. Every year, quite a few tourists get hurt, even killed, in the mountains or on the seas, usually after given, unheeded warnings. For example, do not approach a glacier front, big waves on the coast, or a big waterfall unless you know what you're doing, and do not walk on glaciers without proper training and equipment.\n\nNorway has few dangerous wild animals. Car crashes with the mighty moose or the smaller red deer account for the bulk of wild animal-related deaths and injuries. Also note that in some rural districts, sheep, goats, cows or reindeer can be seen walking or sleeping on the road. \n\nSpecific rules and precautions apply to [[Svalbard]], where you should never travel outside [[Longyearbyen]] without someone in your party carrying a weapon. The polar bears on Svalbard are a real and extremely dangerous threat for the unprepared. In the summer, during the tourist season, there are more polar bears here than humans. They are strong, quick if they want to, curious, and have no fear of people, but will mostly shy away at the sound of a gunshot. Still, it's one of the few areas polar bears can survive on when there's no frozen waters to hunt from during summer, and they're protected as an endangered species. Svalbard is a fragile, dry arctic tundra with large parts almost untouched by humans. Both growth and decay is extremely slow here, so all activity is under management. The current recommendation is that non-local visitors participate on organized tour arrangements only. Breaking the law, disturbing wildlife or being reckless can land you a fine and/or deportation from the archipelago. That said, if you come well prepared with common sense, the visit will be one of the most memorable you've ever had. The nature, scenery and history of Svalbard is simply breathtaking. \n \nAs for other wild animals on mainland Norway, there are not much more than a few extremely rare encounters with brown bear and wolf in the wilderness. Contrary to popular belief abroad, there are ''no polar bears'' in mainland Norway, let alone polar bears walking city streets. The Scandinavian brown bear is peaceful and will generally run away from humans. In any case it is extremely unlikely that tourists will even see a glimpse of one of the around 50 brown bears remaining in Norway. Norwegian wolves are not dangerous to humans. In general, there is no reason worry about dangerous encounters with wild beasts in Norway. \n\nWhen hiking or skiing, be prepared for a sudden shift in the weather, as these can happen very quickly in Norway. If unsure about conditions, ask locals or go on a guided tour. Norwegians develop a common sense on security, and may give warnings but won't, essentially, protect you from ignoring them. You are expected to manage on your own in the wilderness, so only the most common tourist spots have fences or warning signs. Even at the most dangerous places. Norwegian nature can be a safe place to enjoy if you take time to develop the necessary skills to handle it, but lives are lost when people think too much of themselves and lack the training. Nature is full of surprises, so the most important preparations are done through trips that don't look all that exciting on the outset, but will have yet another list of things you've never been into before. Keep in mind that avalanches are common. Unless you know exactly what you're doing, stay in marked slopes when skiing. If you think you know what you're doing, think twice. Only in the first three months of 2011 12 people were killed in avalanches in Norway.\n\nIf you plan to cross the mountains by car (for instance by driving from Oslo to Bergen) in the winter season, it is imperative that you are prepared for the journey. The conditions are harsh. Always keep a full tank of fuel, and keep warm clothes, food and drink in the car. Make sure your tires are good enough and suited for winter conditions (studded or non-studded winter tires, \"all-year\" tires are not enough), and that you have the sufficient skills for driving in snowy and cold conditions. Roads are often closed on short notice due to weather conditions. For advice on conditions and closed roads, call 175 in Norway or check the online road reports [http://www.vegvesen.no/Trafikkinformasjon/Reiseinformasjon/Trafikkmeldinger] (in Norwegian only) from the Norwegian State road authorities. Remember that not all parts of the roads have cellular phone coverage.\n\n[[Image:Norwegian police.jpg|thumb|250px|Norwegian police car.]]\n\nNorway has a unified police force (\"politi\"). The police is the government authority in areas like crime, national security, major accidents, missing persons, traffic control, passports and immigration control. Most cities have municipal parking officers, these do not however have any authority beyond fining and removing vehicles.\nCommercial areas are mostly guarded by private companies. They generally act as public service, peaceful and friendly, but are well connected in case anything happens. Anyone may hold anyone for the purpose of immediately getting hold of police, but they have no special rights.\n\nIt's generally considered good practice to help others in case of need, and basic rescue training is part of school education. The country is too sparsely populated to always have to wait for someone with a license, and no one can sue anyone for a honest effort. Robberies happen and there's reason to be wary in public areas, but it's still good practice to call for police or for an ambulance.\n\n{{infobox|Emergency Numbers|\n* Before calling, find, if possible, the exact position\n# '''Police ☎112'''  \n# '''Fire ☎110'''\n# '''Emergency Medical Services ☎113''' \n# If you are unsure which number to call, ☎112 is the central for all rescue services and will put you in contact with the correct department.\n# For non-emergencies, the police is to be called on ☎02800. \n# The hearing impaired using a '''text telephone''' can reach the emergency services by dialing 1412 \n=== Road assistance ===\n# Falck  ☎02222\n# Viking ☎06000\n# AAA members may call NAF on ☎08505\n}}\n\n==Stay healthy==\n* The water quality and distribution in Norway is excellent and tap water is always drinkable (except on boats, trains etc). There is no need to buy water bottles for consumption at home/indoors.\n\n* The hygiene in public kitchens are very good, with frequent controls by the food authority (\"Mattilsynet\"). Food poisoning rarely happens. \n\n* Norway can get relatively warm in the summer, but be prepared to bring warm clothes (sweater, windbreaking/waterproof jacket), as they might come in handy. It's hard to predict the weather, and in summer, you may experience severe weather changes during your stay. \n\n* Tourists hiking in the high mountains (above the forest) should bring sports wear for temperatures down to freezing.  \n\n* Norway has a high density of pharmacies. Nose sprays and standard pain killers (paracetamol,  aspirin) can also be purchased in grocery stores and gas stations.\n\n* The '''sun''' is generally not as strong as in southern Europe. Keep in mind that in cool conditions (low temperatures or wind) you don't feel that the sun burns your skin. The air is often very clear and clean in the North and UV-levels can be high despite the low sun. Also keep in mind: the sun is stronger in the high mountains, radiation is multiplied on or near snow fields as well as water surfaces. Even when it's cloudy the light can be strong on snow fields. Do not underestimate the power of the Nordic sun! Bring sunglasses when you go to the high mountains, when you go skiing in spring and when you go to the beach.\n\n* In southern Norway there are '''ticks''' (''flått'') that appear in summertime. They can transmit Lyme's disease (borreliosis) and more serious TBE (tick-borne encephalitis) through a bite. The risk areas for TBE are mainly along the coast from Oslo to Trondheim. Although incidents are relatively rare and not all ticks carry diseases, it's advisable to wear long trousers rather than shorts if you plan to walk through dense or tall grass areas (the usual habitat for ticks). You can buy special tick tweezers from the pharmacy that can be used to remove a tick safely if you happen to get bitten. You should remove the tick from your skin as quickly as possible and preferably with the tick tweezers to reduce the risks of getting an infection. If the tick bite starts to form red rings on the skin around it or if you experience other symptoms relating to the bite, you should go visit a doctor as soon as possible. Since ticks are black, they are more easily found if you wear bright clothes. \n\n*There's only one type of venomous snake in Norway: the European adder (hoggorm), which has a distinct zig-zag pattern on its back. The snake is not very common, but lives all over Norway up to the arctic circle (except for the highest mountains and areas with little sunshine). Although its bite hardly ever is life-threatening (except to small children and allergic people), be careful in the summertime especially when walking in the forests or on open fields. In the unlikely event that one encounters the adder, the most common and effective advice to simply stomp hard on the ground (not on the adder!). The adder will feel the vibration and seek to get away, as it will only attack if all its attempts to avoid contact fail. If you are bitten by a snake, seek medical assistance. The probability of being bitten is however very small, as the adder is very shy of humans. \n\n'''Contact'''\nFor minor injuries and illness, go to the local \"Legevakt\" (emergency room/physician seeing patients without appointment). In cities this is typically a municipal service centrally located, be prepared to wait for several hours. In rural districts you typically have to contact the \"district physician\" on duty. For inquiries about toxins (from mushrooms, plants, medicine or other chemicals) call the national Toxin Information Office at 22 59 13 00. Information about your rights as foreign is available at the Norwegian goverment pages in English [https://helsenorge.no/foreigners-in-norway/healthcare-benefits-during-a-temporary-stay-in-norway].\n\n==Respect==\nNorwegians are generally open-minded and tolerant and there are few, if any, dos and don'ts that foreign visitors need to keep in mind.\n\n=== Cultural Overview ===\n* Norwegians may be mistaken as unwelcoming, but it is important to understand that Norwegian culture and society is built upon trust, humility, sincerity and honesty. For this reason, small talk doesn't come very easy and even making contact with strangers is uncommon, such as talking with fellow passengers on the bus, is uncommon.\n* Norwegians are direct communicators. Norway is a society that reveres honesty and trust, and for this reason they are generally scrupulous about honesty in communication. Jante's law, an important cornerstone of Norwegian culture, encourages humility and for this reason it is demonstrated in other people's mannerisms to not confront or criticise someone who they think is doing something wrong. Once you get past a certain barrier, you will find other people open and candid with you.\n* Norwegian as a language is very straightforward. If asked for a favor, you are likely not to hear a \"please.\" On the other hand, Norwegians say \"takk\" (\"thank you\") for almost anything, including, for example, receiving change back from cashier or bus driver. It is customary to thank the cook for the food (\"takk for maten\") in a private home. The reply will be \"velbekomme\" or \"værsågod\". The once-common use of the polite pronoun is nowadays extremely rare, and so is polite phrases and words in everyday situations, so don't be surprised if a Norwegian speaking a foreign language forgets themselves and use a very familiar language.\n* The Norwegian culture is, in some aspects, very informal, and Norwegians usually address each other by first name only, except perhaps in official meetings. The informal culture is, however, not equivalent of that in southern parts of Europe; showing up late for meetings is considered rude, and so is talking loud, being too personal with strangers, and losing your temper. Although you may get away with arriving \"fashionably late\" at dinners in someone else's home, this is certainly not expected and should be limited to no more than fifteen minutes. It is customary to take off your shoes when entering a Norwegian home - particularly in the winter.\n* Norwegians can also be perceived as somewhat patriotic. It is common to use the flag in private celebrations (such as anniversaries and weddings), and many will also fly the flag on public holidays, and violating the flag rules is frowned upon. Most Norwegians will speak warmly of their country, in particular about subjects such as nature, sports, and the country's economic success.\n\n=== Helpful Hints ===\n* '''Avoid the need to prove yourself or show off your accomplishments.''' Norway is an egalitarian society that prides itself on respecting people for who they are, not where they come from.\n* '''Avoid criticising the country or the culture.''' Norwegians in general are very proud of their country and making any kind of negative remarks, no matter how major or minor, can be taken negatively. However, it is also considered good form to be proud of your own country as long as the discussion doesn't turn too competitive.\n* '''Norwegians tend to loosen up with drink.''' Don't be surprised if the seemingly cold Norwegians lighten up tremendously with drink. That said, there is also an expectation that what was said when drunk is not lightly brought up when sober. That can lead to akward situations. \n* '''Avoid confusing Norwegians with Swedes or Danes.''' This can lead to some amused reactions and corrections.\n* '''Norwegians are egalitarian.''' Women generally receive the same kinds of benefits and privileges as men do, and Norwegian women generally don't expect or assume that doors will be held or special treatment purely for being women. \n* '''Do not bargain or haggle.''' Prices in Norway are fixed, and attempting to bargain or haggle in any way is incredibly disrespectful to vendors, and it will more than likely result in puzzled or angry looks. It is also usually out of the control of clerks to give discounts. \n* '''Do not be afraid of discussing news topics.''' Norwegian media covers a lot of issues from around the world, and Norwegian people in general have some very strong political opinions, including that of their own country. Be prepared for lengthy conversations should you choose to engage in political discussions. This can be an ice breaker.\n* '''Respect other people's personal space.''' Never stand too close to someone, back slap or put your arm around anyone except if they're your good friends. \n* '''Do not discuss religion.''' As in the rest of Scandinavia, religion is a strictly private manner.\n* '''Tipping isn't mandatory.''' Anywhere. You can choose to tip if you want to, but you have no obligation to do so.\n\n==Cope==\n\n===Numbers, times and dates===\nNorwegians use a comma as the decimal sign, eg: 12,000 means 12 (specified with three decimal places) not 12 thousand, whereas 12 000 or 12.000 means 12 thousand. \n\nNorwegians use both 24 and 12 hour system; often the 12 hour system when speaking and the 24 hour system in writing. Norwegians don't use am/pm to indicate morning or afternoon. In Norwegian \"half ten\" (\"halv ti\") means half past nine, when speaking to a person not fluent in English better not use this form to avoid misunderstanding. Dates can be seen abbreviated in a number of ways, but the order is always DATE-MONTH-YEAR, for instance 12.7.08 (or 120708, 12/7-08 or 12.07.08; the first and latter being the only ''correct'' forms) is July 12, 2008. Monday is considered the first day of the week, while Sunday is the last. In timetables, weekdays are thus often indicated by numbers 1 (Mon) through 7 (Sun). Norwegian calendars will also indicate the number of the week 1 through 53. Timetables for public transport often use the abbreviation Dx67, meaning \"all days except Saturday and Sunday\".\n\nNorway uses the '''metric''' system only. A Norwegian mile, ''mil'', is exactly 10km. Land is commonly measured in decares (''dekar'' or ''mål''), and equals 1000m². There is overall limited knowledge of Imperial or US measures, although most younger Norwegians will be somewhat familiar with US weight and distance measures. Few Norwegians will be able to convert from Celsius to Fahrenheit, and weather forecasts use metric units. However, many modern cell-phones have conversion programmes which can be used to understand the metric system.\n\nIn Norwegian there is usually no concept of a ''ground floor'' as in the UK (or ''Erdgeschoss'' in German); instead, the entrance level of a building is called the first floor (''første etasje'') like in the US. Levels are then counted 1, 2, 3 etc.\n\nFirst time visitors not familiar with the country tend to plan a trip in Norway from city to city. Although Norway has many nice cities the country's main attraction is the land itself, the nature, the landscapes, the wilderness, as well as a number of man-made sights in rural districts, notably road constructions and cultural treasures such as the stave churches. Unlike many other countries in Europe, a trip to Norway should ideally be planned according to types of landscapes to visit as well as a selection of cities. Norway is wide country with long distances and complex topography, and travellers should not underestimate distances.\n\nIf '''purchasing a house''' and business in Norway do check all legal documents (''kjøpekontrakt/takst'')and maps (''grensekart'') are correct. Ask for information in the native language you are used to. Make sure the Estate Agent is registered with NEF.\n\n==Contact==\nMobile phone coverage is universal in urban areas and generally also good in rural Norway, though on occasion some rural valley areas might be badly covered. \n\nEven in the most remote mountain cabins, as long as they are staffed, you will usually be able to send a postcard.  \n\n===Internet===\nNorway has excellent 4G+ or 4G coverage. Even in rural areas you will mostly find 3G or better. For citizens of EU, additional roaming costs should not apply. If you plan to go hiking in the mountains you may experience 2G or no connection at all. Also, mountains may cause local radio shadows where you will have no signal at all. Most of the coastline has good coverage. It is however recommended to bring a VHF radio when sailing.\n\nMost Norwegian households are connected to the Internet in some way (mostly broadband), making cybercafés hard to find outside major cities, due to a relatively small market. Most public libraries have free public access to the internet, but a limited number of computers and limited opening hours. As of May 2015, free Internet appears to be available in all 7-11 and Deli de Luca convenience stores, no purchase required.\n\nHowever, if you bring a laptop with a wireless connection you will find wireless internet zones just about everywhere(gas stations, city centres, cafés, shopping centres, hotels etc), be prepared to pay for it though. It is not unusual for hotels to have a terminal for guest use. Around 60% of camp grounds have wifi internet, but if it's crucial for you, best to ask before paying for your camping space.\n\nAs of August 2011, Telenor (national telecoms provider) sells prepaid wireless 3G internet dongles for computers (NOK700, about €100), NOK150 buy-in must be purchased with the dongle itself, that comes with NOK50 credit and 300Mb of data to be used in 4 days. Then, another NOK150 purchase must be made for 15 days unlimited internet access. 3G speeds are very usable, and if 3G service is not available the dongle steps down to 2G (not so much fun). Of course, these prices and conditions may change quickly. There is a mobile phone shop at Oslo airport (land side) that sells phone equipment.\n\n==Further reading==\n\n===Classical Travel Journals from Norway===\nW. Matthiue Williams: Through Norway With a Knapsack (1859)\n\nMary Wollstonecraft: Letters written during a short residence in Sweden, Norway and Denmark (1796)\n\nThomas Malthus:  Travel journal from Norway (1799)\n\nSamuel Beckett: The fjords and folk of Norway (1915)\n\nW.C. Slingsby: Norway: the Northern Playground (1904)\n\nDhiravat na Pombejra: A Month in Norway: King Chulalongkorn's travels July-August 1907.\n\nRobert Everest: A journey through Norway, Lapland, and part of Sweden : with some remarks on the geology of the country, its climate and scenery. (1829)\n\nLees, James A. and  Clutterbuck, Walter J: Three in Norway (by two of them)  (1912)\n\n\n\n[[ca:Noruega]]\n[[de:Norwegen]]\n[[eo:Norvegio]]\n[[es:Noruega]]\n[[fi:Norja]]\n[[fr:Norvège]]\n[[hi:नॉर्वे]]\n[[hu:Norvégia]]\n[[it:Norvegia]]\n[[ja:ノルウェー]]\n[[nl:Noorwegen]]\n[[pl:Norwegia]]\n[[pt:Noruega]]\n[[ro:Norvegia]]\n[[ru:Норвегия]]\n[[sv:Norge]]\n[[wts:Category:Norway]]\n[[zh:挪威]]\n\n[[WikiPedia:Norway]]\n[[Dmoz:Europe/Norway/]]\n[[World66:europe/norway]]\n\n{{isPartOf|Scandinavia}}\n\n{{outline}}\n{{countryguide}}"
        }
    }
}