{
    "parse": {
        "title": "Pakistan",
        "pageid": 698,
        "wikitext": {
            "*": "{{pagebanner|Pakistan Banner.jpg}}\n\n{{warningbox| Despite consistent reduction in terrorism related fatalities (https://www.thenews.com.pk/latest/244460-Terrorist-attacks-in-Pakistan-continue-to-decline-report), some foreign governments still advise against travel to Pakistan. The Government of Pakistan maintains heightened security measures, especially in major cities, and these measures may vary from day to day. Certain areas in the tribal regions and the Afghanistan-Pakistan border are considered active war zones by the Pakistani military and therefore will not be accessible to both locals and foreigners. Do not try to illegally get into these areas as this could turn out to be fatal or may result in kidnapping for ransom. Make sure to obtain up to date information before you leave. For more accurate information refer to country links below. \n\n|us=https://travel.state.gov/content/passports/en/alertswarnings/pakistan-travel-warning.html\n|canada=https://travel.gc.ca/destinations/pakistan\n|ie=https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/pakistan/\n|de=https://www.auswaertiges-amt.de/de/pakistansicherheit/204974\n|australia=http://smartraveller.gov.au/countries/asia/south/pages/pakistan.aspx\n|nz=https://www.safetravel.govt.nz/pakistan\n|uk=https://www.gov.uk/foreign-travel-advice/pakistan\n}}\n{{quickbar\n| image=Lahore Fort.jpg\n| caption=Lahore Fort, Lahore\n| location=Pakistan in its region (claimed hatched).svg\n| flag=Flag of Pakistan.svg\n| capital=[[Islamabad]]\n| government=Islamic Federal Republic\n| currency=Rs. Pakistani rupee (PKR)\n| area=881,913&nbsp;km²\n| population=212,742,631 (2017 census)\n| language=[[Urdu]] (official, national) 8%, English (official, government), Punjabi 48%, Sindhi 12%, Seraiki 10%, Pashto 8%, Balochi 3%, Hindko 2%, Brahui 1%, Burushaski and others 8%\n| religion=Muslim 97%, Hindu, Christian, Buddhist, Sikhs and others 3%\n| electricity=230V, 50Hz (Europlug & old British Plug)\n| callingcode=+92\n| tld=.pk\n| timezone=UTC+5 (UTC + 6 in summer)\n}}\n\n[https://www.tourism.gov.pk/ '''Pakistan'''] (Urdu: '''پاکستان''') is a large country (1.5 times the size of France) in [[South Asia]] at the crossroads of [[Central Asia]], [[East Asia]] and [[South Asia]]. Located along the Arabian Sea, it is surrounded by [[Afghanistan]] to the west and northwest, although [[Tajikistan]] is separated by the [[Wakhan Corridor]], [[Iran]] to the southwest and also shares maritime boundary with [[Oman]], The [[Republic of India]] is to the east, and [[China]] to the northeast. It is strategically located astride the ancient trade routes of the [[Khyber Pass|Khyber]] and [[Bolan Pass|Bolan]] passes between the countries of [[South-Central Asia]] and rest of [[Southern Asia]].\n\n==Understand==\n===History===\nThe history of Pakistan traces back to the beginnings of human life in Southern Asia. Pakistan is home and heir to the famous Indus Valley civilization, which is amongst the oldest in the world. The earliest archaeological traces of Ancient Pakistanis are from 7000 BC in Mehrgarh, which grew to be the \"Indus Valley Civilization\". By 3300 BC, this civilization had well-planned towns and well-laid roads, but gave no evidence of weapons or fortifications. This declined and disintegrated around 1900 BC, possibly due to drought and geological disturbances. Most historians say that the Vedic people, or Aryans, were later migrants, who encountered a civilization in decline and perhaps hastened that decline. According to this view, the Vedic people eventually occupied most of North India, while the descendants of the Indus Valley cultures moved south and gave rise to the Dravidian culture. The minority view challenges this Aryan Migration theory, claiming that the '''Indus Valley people''' were in fact the ones who compiled the Vedas. \n\nPrior to the 1st of November in 1857 colonial rule the area of Pakistan was the area from which the Muslims ruled over Central and Southern Asia for over 1,000 years. Because Pakistan was India it thus became part of the Imperial Indian Empire, both the countries share some of the history in the region but separated in 1947 in favour of self-rule due to state-led suppression of Muslims in British India.\n\nThe official name of Pakistan was used after the Independence and partitions of Bengal and the Punjab provincial regions within the former (British) India into the two sovereign nation-states of [[Republic of India|Modern India]] (Hindustan) and [[Pakistan]] in 1947. However, the word Pakistan was first used by Ch. Rehmat Ali back in 1933 in his declaration, ''Now or Never'' - calling for its separation from the Empire. Afterward, British-ruled India was divided into the Islamic Republic of Pakistan. A dispute over the Occupied territory of [[Indian-administered Kashmir]] is ongoing between [[Republic of India]] and [[Pakistan]] ever since 1947, three direct wars have been fought and over for this geostrategic Himalayan region respectively.\n\n===Terrain===\nPakistan is one of those few countries in the world which has every kind of geological structure. It has the sea, desert (Sindh & Punjab), green mountains (North West Province), dry mountains (Balochistan), mountains covered with ice, rivers, rich land to cultivate (Punjab & Sindh), water resources, water falls, forests etc. Khyber Pakhtunkhwa and Gilgit-Baltistan contain the mountain ranges of the Himalayas, the Karakoram, and the Hindu Kush. Pakistan's highest point is K2, at 8,611m which is the second highest peak in the world. The Punjab province is a flat, alluvial plain whose rivers eventually join the Indus River and flow south to the Arabian Sea. Sindh lies between the Thar Desert the Rann of Kutch to the east, and the Kirthar range to the west. The Balochistan Plateau is arid and surrounded by dry mountains.  Pakistan experiences frequent earthquakes, occasionally severe, especially in north and west.\n\n===Climate===\nMostly hot, dry desert; temperate in northwest; arctic in north.  Flooding along the Indus after heavy rains (July and August). Fertile and sub humid heat in the Punjab region. [http://www.onepakistan.com/weather/ '''Seasonal climate and daily weather''']\n\n===Holidays===\n* '''Eid-ul-Fitr''' - the largest holiday of the year, it celebrates the start of the holy month of Shawwal. Food is the highlight, and if you're lucky you'll be invited into a private home for a feast. Businesses close for at least a couple days if not a week.\n\n* '''Eid-ul-Azha''' - the festival of sacrifice, commemorates Abraham's willingness to sacrifice his son\n\n* '''Eid-e-Milad-un-Nabi''' - Birthday of the Prophet Muhammad (S.A.W.W), varies according to Hijera calendar\n\n* '''Pakistan Day''' - March 23\n\n* '''Labour Day''' - 1 May\n\n* '''Independence Day''' - 14 Aug\n\n* '''Defense Day''' - 6 Sep\n\n* '''Quaid-e-Azam's deathday''' - 11 Sep\n\n* '''Quaid-e-Azam's birthday''' - 25 Dec\n\n* '''Ramadan''' - the 9th and holiest month in the Islamic calendar. Muslims fast every day for its duration and most restaurants will be closed until the fast breaks at dusk. Nothing (including water and cigarettes) is supposed to pass through the lips from dawn to sunset. Foreigners and travellers are exempt from this, but you should still refrain from doing it in public.\n\n==Regions==\n\n{{Regionlist\n\n| regionmap=Map of Pakistan.png\n| regionmaptext=Map of Pakistan\n\n| region1name=[[Azad Kashmir]]\n| region1color=#56ada7\n| region1items=\n| region1description=Pakistan-administered portion of the Kashmir region\n\n| region2name=[[Balochistan]]\n| region2color=#a78379\n| region2items=\n| region2description=the largest and most remote province, its lack of infrastructure can make for rough traveling. Most foreign visitors here are just passing through from Iran, stopping briefly in Quetta\n\n| region3name=[[Federally Administered Tribal Areas]]\n| region3color=#b383b3\n| region3items=\n| region3description=this area is mostly off-limits to foreigners, and is not under the control of Provicial Government instead affairs are federally administered through Governor of NWFP. Home to the legendary Khyber Pass, and the gun making city of Darra Adam Khel.\n\n| region4name=[[Gilgit-Baltistan]]\n| region4color=#d5dc76\n| region4items= formerly known as the '''Northern Areas'''\n| region4description=home to some of the world's tallest mountains, it's brimming with dramatically fantastic landscapes and can easily compete with Nepal for trekking opportunities\n\n| region5name=[[Islamabad Capital Territory]] \n| region5color=#b10013\n| region5items=\n| region5description=The capital area encompasses Islamabad, the Margalla Hills and the ancient ruins of [[Taxila]]\n\n| region6name=[[Khyber Pakhtunkhwa]]\n| region6color=#d5b66b\n| region6items=formerly known as the '''North-West Frontier Province'''\n| region6description=Home of the rugged Pashtuns, for some it's forbidding and mysterious... yet below the surface are some of the most hospitable people in the country\n\n| region7name=[[Punjab (Pakistan)|Punjab]]\n| region7color=#71b37b\n| region7items=\n| region7description=The most populous and agriculturally fertile region in the country and home to many historical shrines and mosques\n\n| region8name=[[Sindh]]\n| region8color=#4da9c4\n| region8items=\n| region8description=Most visitors head for Karachi or the ancient ruins of Moenjodaro.\n\n}}\n\n==Cities==\n{{Ramadandates}}\n\nPakistan has many cities and towns. Below are '''nine''' of the most notable. Other cities are listed under their specific regions.\n<!-- PLEASE DO NOT ADD MORE THAN 9 CITIES, IF YOU DISAGREE WITH THIS LIST OF NINE, PLEASE DISCUSS CHANGES ON TALK PAGE FIRST -->\n* [[Islamabad]] - The Federal capital, a relatively new planned city with a much more laid-back feel than the rest of the country's cities\n\n* [[Karachi]] - the Financial capital and the largest city of the country, it's an industrial port city and the provincial capital of [[Sindh]] \n\n* [[Lahore]] -  City of the Mughals, bustling and a very historical city that shouldn't be missed.\n\n<!-- PLEASE DO NOT ADD MORE THAN 9 CITIES, IF YOU DISAGREE WITH THIS LIST OF NINE, PLEASE DISCUSS CHANGES ON TALK PAGE FIRST -->\n<!-- PLEASE DO NOT ADD MORE THAN 9 CITIES, IF YOU DISAGREE WITH THIS LIST OF NINE, PLEASE DISCUSS CHANGES ON TALK PAGE FIRST -->\n\n* [[Faisalabad]] - A major city in [[Punjab (Pakistan)|Punjab]], famous for its textile industry\n\n* [[Multan]] - The City of Saints, famous for blue pottery, ornamental glasswork, and Khussa - a type of shoes\n\n* [[Quetta]] - a large, beautiful and slightly unruly city in the southern state of [[Balochistan]], you'll pass through here en route to or from [[Iran]]\n\n* [[Muzaffarabad]] - Capital of [[Azad Kashmir]] and a very picturesque city\n<!-- PLEASE DO NOT ADD MORE THAN 9 CITIES, IF YOU DISAGREE WITH THIS LIST OF NINE, PLEASE DISCUSS CHANGES ON TALK PAGE FIRST -->\n* [[Peshawar]] - Capital city of the [[Khyber Pakhtunkhwa]], it is the gateway to the [[Khyber Pass]] and is one of the ancient walled cities of Pakistan. It used to be the capital of Gandhara civilization at one stage and the civilization stretched till [[Japan]]\n\n* [[Sialkot]] - The city of sports goods, famous for its exports industry, one of the oldest cities in the region\n<!-- PLEASE DO NOT ADD MORE THAN 9 CITIES, IF YOU DISAGREE WITH THIS LIST OF NINE, PLEASE DISCUSS CHANGES ON TALK PAGE FIRST -->\n\n==Other destinations==\n[[Image:Nanga_Parbat.jpg|thumb|Nanga Parbat]][[Image:Godwin_Austen.jpg|thumb|K2 or Mt.Godwin Austen]]\n\n* '''[[Karakoram Highway]]''' &ndash; part of the historic [[Silk Road]], it's the main artery running north to [[China]]. \n\n* '''[[Hunza Valley]]''' &ndash; one of the more stunning and popular parts of the high mountain areas, some liken it to paradise on Earth. Supposedly the setting for James Hilton's Shangri-La, and the valley lives up to that reputation. \n\n* '''[[Skardu]]''' - is a major tourism, trekking and expedition hub in Gilgit–Baltistan. Popular among trekkers and mountaineers from around the world due to Mount K2. It is also famous for its Shangrila resort and ancient forts such as Kharphocho, Shigar and Khaplu.\n\n* '''[[Murree]]''' - a popular Himalayan hill station, one hour drive from Islamabad\n\n* '''Mountain peaks and glaciers''' &ndash; [[Gilgit-Baltistan]] is home to some of the highest mountains in the world, including K2, Rakaposhi and Nanga Parbat, and offer incredible trekking opportunities. In an area of about 500 kms in width and 350 kms in depth, is found the most dense collection of some of the highest and precipitous peaks in the world, boasting more than 700 peaks above 6000 metres, and more than 160 peaks above 7000 metres.\n\n* '''Kalasha Valleys''' &ndash; witness the decline of a truly unique culture in [[Chitral District]]\n\n* '''Deserts''' &ndash; Pakistan is home to the Thar desert in [[Sindh]] and the Cholistan desert in the [[Punjab (Pakistan)|Punjab]], which it shares with neighboring India.\n\n* '''Beaches''' – Pakistan is home to some of the worlds most beautiful beaches located between [[Karachi]] and [[Gwadar]] along Makran coastal highway. The [[Makran Coastal Highway]] is well known as one of the most scenic drives starting from [[Karachi]] and going all the way to the Iranian Border. The route takes nine hours to complete at a leisurely pace with no stops. Other popular beaches include French Beach, Hawksbay to name a few. \n\n* '''Archaelogical treasures''' &ndash; the country's rich history has left many things to explore; [[Taxila]], [[Moenjodaro]], [[Thatta]] and [[Harappa]] are some of the more famous\n\n''See also: [[Sacred sites of the Indian sub-continent]]''\n\n==Get in==\n\n===Visas===\n\n{{VisaRestriction|Entry will be refused to citizens of [[Israel]], except those with diplomatic passports. Israeli stamps and visas usually pose no problems for entry into Pakistan, though you may be subject to more stringent questioning by immigration officers.}}\n\n[[Image:Lansdowne_Bridge_of_Rohri.jpg|thumb|Lansdowne Bridge of Rohri]][[Image:Headmarala_-_Sialkot.jpg|thumb|Headmarala , Sialkot ]][[Image:Biafo_Glacier.jpg|thumb|Biafo Glacier, Karakoram Mountains]][[Image:Dudiptsar_Lake.jpg|thumb|Dudiptsar Lake, Kaghan Valley, Khyber-Pakhtunkhwa, Pakistan]][[Image:Saiful_Muluk.jpg|thumb|The epic Lake Saiful Muluk]][[Image:Kachura_Lake.jpg|thumb|Kachura Lake]][[Image:Shangrila_Resort_at_Skardu.jpg|thumb|Shangrila Resort at Skardu in Pakistan]][[Image:Kamalban_Pakistan.jpg|thumb|Kamalban, Pakistan]][[Image:Yarkhun_Valley.jpg|thumb|Yarkhun Valley, Chitral]][[Image:Angoori_Road.jpg|thumb|Angoori Road, Murree]]\n\nThe Government of Pakistan derives its economy of foreign currency revenues by requiring  visas from almost all nationalities. These are usually easier to obtain in your home country, though recently the individual missions around the world have been given more authority to issue visas without checking with Islamabad, which should help in getting applications turned around quicker.\n\nPakistan recently introduced an online visa portal [https://visa.nadra.gov.pk] for the citizens of 175 countries that would allow travelers to submit their details, documents and make online payment to get the e-visa in seven to ten days. This service is currently in its pilot phase and available for the citizens of China, Turkey, United Arab Emirates, United Kingdom and Malaysia.\n\nNationals of [[Iceland]] and the [[Maldives]] may enter visa-free for stays of up to 3 months. Nationals of [[Nepal]] and [[Samoa]] may enter visa-free for 1 month. Nationals of [[Tonga]] and [[Trinidad and Tobago]] do not need a visa, and can stay for an unlimited amount of time.\n\nRecently, a list of \"Tourist Friendly Countries\" (TFC) was announced that are eligible for one month visas on arrival if they travel through a [http://www.tourism.gov.pk/travel_guide.html designated/authorised tour operator] who will assume responsibility for them while in the country. Any extensions of this type of visa must also be done through the tour operator. They include: [[Austria]], [[Belgium]], [[Canada]], [[China]] (PRC), [[Denmark]], [[Finland]], [[France]], [[Germany]], [[Greece]], [[Iceland]], [[Italy]], [[Japan]], [[Luxembourg]], [[Malaysia]], [[Netherlands]], [[Norway]], [[Portugal]], [[Singapore]], [[South Korea]], [[Spain]], [[Sweden]], [[Thailand]], [[United Kingdom]] and [[United States]].\n\nNationals of [[Turkey]] with valid visa for the Schengen Area, United Kingdom or the United States can obtain a visa on arrival.\n\nNationals of most other countries (and those not wanting to travel with a tour operator and group) need to apply in advance for a visa, which is usually issued for 30-90 days depending on nationality and where you apply. Double-entries are sometimes given, but be clear and persistent that you need this when applying.\n\n[[India|Indian]] nationals can apply for 30 day tourist visas but must travel in a group through an authorised tour operator. Visitor visas to meet relatives or friends are more easy to obtain, and come with some restrictions. Religious visas are granted for groups of 10 or more for 15 days.\n\nNationals of Afghanistan are refused entry if their passports or tickets show evidence of transit or boarding in India. \n\nHolders of Taiwan passports are refused entry except in airport transit.\n\n'''Business visas''' are now being issued for up to 5 years, multiple entry, as soon as 24 hours before arrival.\n\nThe Pakistan Consulate in [[Istanbul]] does not issue visas unless you are a resident of [[Turkey]], although it may be possible in [[Ankara]].\n\nThe consulate in [[Zahedan]] in [[Iran]] no longer issues visas, head for the embassy in [[Tehran]].\n\nThe High Commission for Pakistan in [[New Delhi]] issues visas with varying degrees of difficulty, taking at least 1 day (and sometimes several) to process the application. Applications are only accepted in the mornings c. 09:00-11:00. Arrive early and expect the process to take a few hours and possibly a few return visits. Window 5 is for foreign tourist and business visas (under the big white sign). \n\nPeople of Pakistani origin living overseas are granted 5 year multiple entry visas (along with their spouses), good for single stays of up to 1 year. Visas aren't required at all if they are holding a Pakistan Origin Card (POC) or a National Identity Card for Overseas Pakistanis (NICOP).\n\n===By plane===\n[[Karachi]], [[Lahore]], and [[Islamabad]] are the main gateways to Pakistan by air. However, there are 134 airfields in Pakistan. Six other international airports are in [[Quetta]],[[Gawadar]], [[Peshawar]], [[Sialkot]], [[Multan]], [[Rahim Yar Khan]] and [[Faisalabad]].\n\n* '''Jinnah International Airport''' in [[Karachi]] [http://www.karachiairport.com/] is served by many international airlines, including Air Arabia, Air China, Biman Bangladesh Airlines, Cathy Pacific, Etihad, Emirates, Flydubai, GMG Airlines, Gulf, Qatar Airways, Saudi Arabian Airlines, SriLankan Airlines, Iran Air, Iraqi Airways, Malaysia Airlines, Oman Air, Thai Airways , and Turkish Airlines . It's also the main hub of the national carrier \"PIA\"and 2 private airlines (Air Blue and Shaheen Air).\n\n* '''Allama Iqbal International Airport''' in [[Lahore]] [http://www.lahoreairport.com.pk/] has been completely renovated with a new terminal for international arrivals and departures. Many airlines are currently operating to the airport including Emirates, Etihad Airways, Qatar Airways, Gulf Air, Pakistan International (PIA), Saudi Arabian Airlines, Thai Airways, Kuwait Airways, Oman Air, Uzbekistan Airways and two private airlines from Pakistan. \n\n* '''Islamabad International Airport''' [http://www.islamabadairport.com.pk] is a brand new terminal opened on 3rd May 2018 replacing the old Benazir Bhutto International Airport in Rawalpindi. Once notoriously bad, the new airport terminal is equipped with modern facilities for passengers. There are many airlines operating into [[Islamabad]] including many of the above with Ariana Afghan Airlines, Kam Air, Kyrgystan and China Southern Airlines. \n\nWhatever airport you arrive (or even depart), airport staff are certain to demand a bribe, especially from foreigners.  Beware of anyone who insists on helping you- they won't be so friendly when demanding you pay them.  Furthermore, there is NO special airport tax due at check-in, despite what your check-in clerk might tell you.\n\n===By train===\nPakistan has train links with India and Iran, though none of these trains are the fastest or most practical way to enter Pakistan. Should speed be a priority it is better to take the bus, or if you are really in a hurry, to fly, however the trains are sights in their own right. '''From [[India]]:'''\n* ''The Samjhauta Express'' runs on Tuesdays and Fridays between [[Delhi]] and [[Lahore]] via the [[Attari]]/[[Wagah]] border crossing. This is the most common option chosen by travellers, however, tourists should be aware that after recent terrorist attacks on the train, which caused many a casualty and strained relationships between the two neighbours, it is strongly advised that you take taxis or buses to and from the border instead.\n* ''The Thar Express'' runs from [[Bhagat ki Kothi]] in the Indian state of [[Rajasthan]] to [[Karachi]] in Pakistan's Sindh province. This route restarted in February 2006 after 40 years out of service, but is '''not''' currently open to foreign tourists.\n'''From [[Iran]]''': There is only one link, from [[Zahedan]] to [[Quetta]].\nPakistan has train links with India and Iran, though none of these trains are the fastest or most practical way to enter Pakistan. Should speed be a priority it is better to take the bus, or if you are really in a hurry, to fly, however the trains are sights in their own right. Nowadays Pakistan Railways is going through recession. The number of trains has been lessened and trains don't usually reach the destinations in time.  \n===By car===\nFrom ancient times people have been travelling through Pakistan using the Grand Trunk Road and the [[Silk Road]] that run through Pakistan and into the [[South Asia|Indian subcontinent]]. It's a rewarding but time consuming way to see this part of the world. New highways have been developed and the country is due for an expansion in its highway network. A world-class motorway connects the cities of [[Peshawar]], [[Islamabad]], [[Lahore]], and [[Faisalabad]]. \n\n'''From [[China]]:'''\nPakistan is connected to China by the [[Karakoram Highway]], a modern feat of engineering that traverses a remarkably scenic route through the Karakoram and Himalayan mountains.  Plans are in place for this highway to be expanded from its current width of 10m to 30m as a result of the increase in trade traffic due to Gwader port opening.\n\n'''From [[Afghanistan]]:'''\n* The [[Khyber Pass]] connects [[Peshawar]] to [[Jalalabad]] and [[Kabul]] and requires an armed escort and a permit to travel through the tribal regions between [[Peshawar]] and the border. Onward travel from the border to [[Kabul]] is of questionable safety, check the current situation locally.\n* The [[Bolan Pass]] connects [[Quetta]] to [[Kandahar]] and is considered '''very dangerous'''. This route is '''not''' currently open to foreign tourists, and is only open to locals and aid workers.\n\n===By bus===\n'''From India''': While there is international service running from [[Delhi]] to [[Lahore]] it is just as fast, much more flexible, and much cheaper to take the journey by stringing together local transport and crossing the border on foot.  As of October 2009, the bus was Rs. 1500.  The journey details can be found here:  http://dtc.nic.in/lahorebus.htm.  You cannot buy the ticket on the spot, rather you will need to show up a few days before at Delhi Gate with photocopies of your Pakistani and Indian visas.  The bus leaves at 6 a.m. but you will need to be at Delhi Gate at 4 a.m. to check in for it.\n\n'''From China''': You can take a bus from [[Kashgar]] over the [[Karakoram Highway]] to Pakistan.\n\n'''From Iran''': Via the [[Mijva]] border in [[Iran]] which is half an hours drive from [[Zahedan]]. The Pakistani border town is called [[Taftan]] and has facilities of immigration, customs, hotels etc.\n\n==Get around==\n\nGetting around the country has become ''much'' easier in recent years with the completion of some motorways, and an increase in private airlines. \n\n===Maps===\nThere are three good online maps for Pakistan; [https://www.google.com/maps/place/Travelo+Pakistan/@24.9027839,67.0721716,15z/data=!4m5!3m4!1s0x0:0x28625da3d6ac49a5!8m2!3d24.9027839!4d67.0721716 Travelo Pakistan Map], [http://maps.naqsha.net/ Naqsha], and [http://maps.google.co.uk/ Google Maps].  Whilst the cities are well covered, roads in rural areas are not, with many minor roads missing - Google Maps in particular has a worrying habit of marking dried up river beds as minor roads, so if exploring out in the sticks it is a good idea to use Google Earth to double check your route.\n\nNelles produces a good printed map of Pakistan - this map and others are available in Saeed Book Bank in F7 markaz in [[Islamabad]] - and at cheaper prices than available online from Western booksellers.\n\n===By plane===\n'''Pakistan International Airlines''' (PIA) [http://www.piac.com.pk] serves numerous domestic destinations and is the only airline to serve the three airports in the north of interest to trekkers or climbers: [[Chitral]], [[Gilgit]], and [[Skardu]].  There are usually two flights from Islamabad to these cities daily, but they are often canceled due to bad weather, and often over-booked &mdash; show up early to guarantee a seat.\n\nOther domestic carriers include '''Shaheen Air International''' [http://www.shaheenair.com] and '''Airblue''' [http://www.airblue.com].\n\n===By train===\nPakistan Railway [http://www.pakrail.com/] provides passenger rail service. The stations tend not to have their timetables in English, but sales agents can usually explain everything to you.  There are several different classes of fares depending on amenities.  Foreign tourists and students with an ISIC card can get 25% and 50% discounts, respectively, by first visiting the PTDC (Pakistan Tourism Development Corporation) office, getting q verification certificate there, and bringing it with them to the train's commercial ticket office (which is different from the regular ticket office, but usually close by).\n\n===By bus===\nA large portion of travel between cities in Pakistan is carried out by bus. Travelling between Karachi and any of the country's other major cities by bus may take days, travel by bus is often the cheapest and most convenient alternative. The Daewoo Sammi company [http://daewoo.com.pk] runs a regular bus service between several major cities, with air-conditioned buses and seats booked one day ahead. While rather unexpensive, they are still almost five times as expensive as the cheap and uncomplicated rides offered by minibuses or larger buses between the major bus stations of the cities. Northern Areas Transport Corporation (NATCO) [https://www.natco.gov.pk] runs buses between Islamabad and Gilgit-Baltistan region. Fares are often (though not always) paid directly on the bus, there is no aircondition, and sometimes very little knee space, but you get where you are going all the same, and I have never met with anything but kind interest and friendly conversation on my many rides. Buses leave almost incessantly from the major bus stations for all the major cities, and many smaller locations, so booking ahead is neither possible nor necessary on the simpler buses. When travelling between major cities, smaller buses are to be preferred over the larger ones, as the larger ones tend to take up passagers along the way, and therefore travel more slowly.\n\nThe situation is similar for local transport. While the organization of local transport may look a little different between cities, there is usually an active bus service running through the city, with varying levels of government control.\n\n===By rickshaw===\nFor local transport within cities, auto rickshaws are a cheap and flexible alternative. A development of the bicycle rickshaw, the auto rickshaw is a small vehicle powered by a two-stroke or four-stroke engine. The original gasoline versions constantly emit a stuttering noise and foul blue-black smoke, but many are opting for the ''CNG'' (compressed natural gas) versions, which are less polluting and a little quieter. Blue-and-yellow auto rickshaws take passengers, other colors tend to be privately owned. Always negotiate a price before entering the rickshaw.\n\nRickshaws are banned in the capital Islamabad.\n\n===By ride sharing/taxi cab services===\nCompanies like [https://www.uber.com/en-PK/ Uber] and [https://www.careem.com/ Careem] offer ride sharing/taxi cab services at an affordable price. They are often cheaper than conventional taxi cabs and have a fix fare rate. You don't need to negotiate the fare beforehand with the drivers which is a big plus. These companies offer their services in almost every major city like Lahore, Karachi, Quetta, Peshawar, Islamabad and Rawalpindi etc. Beware that you do need an Internet connection and their mobile apps installed on your phone to avail their services. You can pay the fare either by cash or by your credit card. If you want to travel even more cheaper within cities you can use bike sharing services like [http://www.bykea.com bykea] which allow you to travel on a motorcycle. They offer their services in Lahore, Rawalpindi and Karachi.\n\n==Talk==\nHighly '''Persianised''' form of [[Urdu phrasebook|Urdu]] is and shall be the \"National language\" and is spoken throughout Pakistan as a ''lingua franca''. In addition to Urdu most Pakistanis speak their regional languages or dialects such as [[Punjabi phrasebook|Punjabi]], [[Pothohari phrasebook|Pothohari]], [[Sindhi phrasebook|Sindhi]], [[Pashto phrasebook|Pashto]] (Pushtun), [[Balochi phrasebook|Balochi]], [[Saraiki phrasebook|Saraiki]], [[Shina phrasebook|Shina]], [[Burushaski phrasebook|Burushaski]], [[Khowar phrasebook|Khowar]], [[Wakhi phrasebook|Wakhi]], [[Hindko phrasebook|Hindko]] etc.\n\nPakistani English is designated as the \"Official language\" used in all government and most educational purpose and business entities, and is also understood and spoken at varying levels of competence by many people around Pakistan, especially the upper classes and people who have gone through higher levels of education, and those residing in the larger cities.\n\n==See==\n[[Image:Katas_Raj_Temple.jpg|thumb|Katas Raj Temple]] [[Image:Hingol_National_Park_of_Baluchistan,_Pakistan.jpg|thumb|Hingol National Park]][[Image:Cold_Desert_of_Skardu_in_Pakistan.jpg|thumb|Cold Desert of Skardu in Pakistan]][[Image:Saindak_and_Reko_Diq_-_The_Land_of_Gold_and_Copper.jpg|thumb|Saindak & Reko Diq: The Land of Gold & Copper]][[Image:The_Great_Trango_Tower.jpg|thumb|The Great Trango Tower, 6,286 m (20,608 ft)]][[Image:Rohri_to_Quetta.jpg|thumb|Bridge over a river on the railway track from \"Rohri to Quetta\"]][[Image:Astola_Island.jpg|thumb|Astola Island]]\n* <see name=\"Karachi\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">Observe the wonders of Karachi, Pakistan's former capital and its largest city, situated on the shores of the Arabian Sea. The magnificent Quaid-e-Azam's Mazar, the mausoleum of the founder of Pakistan, is made entirely of white marble with impressive north African arches. Other places to visit are the National Museum, Dream world (Amusement & Water park, hotel & golf), Alladin (Amusement & Water Park), Hill Park, Port Grand (Food Street), I.I. Chandrigar Road, PAF Museum, Maritime Museum, Arena and the beach at Clifton & DHA.</see>\n\n* <see name=\"Shah Faisal Masjid (Mosque)\" alt=\"\" address=\"Islamabad\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"\">A majestic white building comprises four 88m (288ft) minarets and a desert tent-like structure, which is the main prayer chamber and can accommodate 1 hundred thousand worshippers. is closed to the public for inside view these days, but you can enjoy its outside view .\n</see>\n* <see name=\"Mountains, including K2, Nanga Parbat\" alt=\"\" address=\"\" directions=\"\" phone=\"\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">Pakistan boasts some of the highest mountains in the world in Kashmir, including the famous Nanga Parbat and the second-highest mountain in the world, K2. The Baltoro Glacier and the Batura Glacier are the largest outside the polar regions.</see>\n* <see name=\"Peshawar\" alt=\"\" address=\"Khyber Pakhtunkhwa\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"\">The city was in ancient times surrounded by high walls with 20 entry gates. Much of the surrounding area is still under the jurisdiction of tribal law. These areas can only be visited with a permit from the relevant authorities.</see>\n* <see name=\"The Khyber Pass\" alt=\"\" address=\"Afridis\" directions=\"\" phone=\"\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">Visit the legendary 1,067m- (3,501ft-) high break in the sheer rock wall separating Afghanistan and Pakistan.</see>\n* <see name=\"Chitral\" alt=\"\" address=\"Hindu Kush Mountains north of Peshawar\" directions=\"\" phone=\"\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">Visit this wild and beautiful area of Pakistan. It is inhabited by the Kalash people, the last of the non-Islamic tribes of Kafiristan. This valley is noted for its hot springs and trout-filled rivers.</see>\n* <see name=\"Swat Valley\" alt=\"\" address=\"East of Chitral\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"\">An area of wild mountains and fantastic alpine scenery. In ancient times, it was home to the famous Gandhara school of sculpture, a manifestation of Greek-influenced Buddhist forms. The ruins of great Buddhist stupas, monasteries and statues remain. It also boasts popular mountain retreats such as Miandam and Mingora.</see>\n* <see name=\"A Cricket or Polo Match\" alt=\"\" address=\"\" directions=\"\" phone=\"\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">Some of the most popular sports in Pakistan. Polo is particularly popular in the northern towns of Gilgit and Chitral.</see>\n*<see name=\"Khewra Salt Mines\" alt=\"\" address=\"\" directions=\"Lahore - Islamabad Motorway (M-2) cuts through the centre of the Salt Range, with exit points at Kallar Kahar and Lillah\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">Located near Kallar Kahar about 160 kilometres from Islamabad and 260 kilometres from Lahore on the Islamabad-Lahore (M2) Motorway, Khewra Salt Mines are the world's second largest salt mine. A tourist train runs inside the mine tunnels and passes through some incredible sculptures & structures made up of salt. There is also a twelve-bed therapy centre inside the mine called the Khewra Asthma Clinic, which have the reputation of having healing powers owing to health benefits of its micro-climate. Shops inside the mine sells crafted lamps, sculptures and ornaments made up of salt.</see>\n\n==Do==\nPakistan is a world class destination for trekking and hiking. Horse riding is also very affordable, cycling opportunities abound. You can also shop to your heart's content, in massive range of markets and bazaars without worrying about your budget, as a recent survey by Times Newspaper (UK) found Karachi as the world's cheapest city.\n*<do name=\"Tour de Pakistan\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">Participate in Tour de Pakistan. Its a bicycle race held every two years covering more than 1,648 kilometres (1,024 mi) from Karachi to Peshawar. It is the longest cycling race in Asia.</do>\n*<do name=\"Helicopter Tours\" alt=\"\" address=\"5-A The Mall, AWT Plaza, Rawalpindi\" directions=\"\" phone=\"051-9272400-4\" url=\"http://askariaviation.com/\" hours=\"\" price=\"\" lat=\"\" long=\"\">Enjoy the scenic beauty and mountain valleys of Pakistan through a helicopter. Askari Aviation provides aviation services of helicopter and aircrafts for adventures and safaris. They have several itineraries on their website and each trip starts from Islamabad.</do>\n*<do name=\"Sightseeing in Pakistan\" alt=\"Hunza Explorers\" address=\"Islamabad\" directions=\"\" phone=\"+92 321 4364658\" url=\"http://hunzaexplorers.com\" hours=\"\" price=\"\" lat=\"\" long=\"\">Hunza Explorers is leading tour company in Pakistan, they organize tours, treks, Safaris and Expeditions throughout the country. </do>\n\n\n==Buy==\nThe national currency of Pakistan is the rupee ('''PKR'''). Coins are issued in 1, 2, and 5 rupee denominations while banknotes come in 10, 20, 50, 100, 500, 1000, and 5000 rupee values.\n\n'''ATMs''' exist in most areas and accept major credit cards. \n\n* You can buy very cheap '''garments, bed sheets, shirts, T-shirts''', It is to be mentioned that many world renowned brands like Adidas, Levis, Slazenger, HangTen, Wal-Mart etc get their products prepared from [[Faisalabad]] which has got one of the largest textile industries of the world. You can find cheap products of these brands at local stores. You can get a pair of Levis jeans (or any other good brand for that matter) at a very reasonable price ranging between 1400-2500 PKR (16-29 USD). \n* Buy '''leather goods''' like shoes, jackets and bags.\n* Buy '''sports goods''' like cricket bats, balls, kits, footballs, sports wear and almost anything related to sports you can imagine. You will not find such high quality equipment at such low cost anywhere else. To mention, [[Sialkot]] produces 90 percent of the world’s sports goods and is the largest provider of sports equipment to FIFA for the World cup.\n* Pakistan produces economical and high quality '''musical instruments'''. You can even get an acoustic guitar for as low as 2000 PKR (23 USD).\n* Buy '''surgical instruments''' \n* Buy '''computer accessories''' \n* Buy '''Chinese goods''' especially Electronics & Cameras which are re-exported from Pakistan and is cheaper than other parts of the world.\n* Buy Arabian, Afghan, Iranian and Pakistani '''carpets'''\n* Buy '''Wood Carvings''' such as decorative wooden plates, bowls, artwork, furniture, and other miscellaneous items.\n* Buy '''Jewellery''' such as necklaces, bracelets etc are very inexpensive in Pakistan.\n* Buy '''gems, handicrafts''' (Ajrak from [[Sindh]], Blue pottery from [[Multan]], Clay pottery from [[Karachi]]), '''glassware, brassware, marble products, crystal works and antiques''' Also buy '''pashmina, rugs, wool-shawls''' or '''wraps''', which can cost anywhere between $15 to as much as $700. Remember to bargain. \n* Buy '''Books'''\n* Buy '''souvenirs''' such as decorative items from Sea Shells.\n* For '''food stuffs''' go to any super store like Dmart, Makro, Metro, Hyperstar. Good Quality and inexpensive local products include Swat honey, Biscuits, local made chocolate.\n* Buy '''home accessories''' \n* Buy '''Kitchen Utensils''' and '''Cutlery'''\n* For '''art''' lovers, get in touch with a local to take you around. There are so many art galleries in [[Karachi]], [[Lahore]], [[Islamabad]] that are worth visiting and each will offer a completely different range of artwork, style and pricing. All the facilities should be visited if you are an art lover.\n* Buy cheap '''video games''' and '''movies''' for a couple of cents.\n\n==Eat==\nPakistani food mainly consists of various kinds of kebabs eaten with either flatbread or rice.  Food tends range from mild to spicy depending on where you are and who your cook is. So state your preference before beginning to eat. In general, most of the food that you find in the high end hotels is also available in the markets (but European-style food is generally reserved for the former). Note: your definition of spicy may easily vary from the restaurant you order your food from, so tread lightly.\n\n*The types of flatbread (collectively referred to as Naan are:\n** Naan - A soft and thick flat bread that often requires special clay ovens (tandoor) and cannot be properly made on home stoves.\n** Roti/Chapatti - A homemade bread, much thinner than naan and usually made out of unrefined flour, and which is ready in minutes.\n** Paratha - An extremely oily version of the roti.  Usually excellent if you're going out to eat, but beware of health concerns; often it is literally dripping with oil because it is meant to be part of a rich meal. Paratha is more declicious if you cook it in pure oil like \"desi ghee\". \n** Sheer Mal - This is a slightly sweetened, lightly oiled bread that has waffle-like squares punched in it.  It is often considered the most desirable bread and is a delicacy to most people.  Often paired with nihari. Another breakfast version of sheermal is very much like the Italian Panettone (albeit in a flat naan-like shape) with added dried fruits and candy.\n** Taftan - Much like the 'sheer mal' but with a puffed-up ring around it. \n\nAs you might have noticed, 'Naan' is usually used to pick up liquid and soft foods like shorba and beans.  Forks and knives not commonly used during meals in Pakistan (unless someone is eating rice or is dining out).  Attempting to cut a naan with a knife  may elicit some amusement around you. Watching others may help.\n\n*Types of 'kababs' (mainly made of Beef or Lamb):\n** Seekh Kabab (سيخ کباب) - A long skewer of minced beef mixed with herbs and seasonings.\n** Shami Kabab (شامي کباب) - A round patty of seasoned beef and lentils, softer than seekh kababs.\n** Chapli Kabab (چپلي کباب) - A spicy round kabab that is a specialty of Peshawar.\n** Chicken Kabab (مرغ کباب) - A popular kabab that is found both with bone and without.\n** Lamb Kabab (کبابِ برہ گوشت) - The all lamb meat kabab is usually served as cubes.\n\n*More Pakistani Foods:\n**Roasted Chicken (whole) (مرغ بريان) - A whole chicken roasted. Very famous around Pakistan.  You'll see them on the rotisserie while driving on Lahore streets. Also known as 'charga' locally.\n**Biryani (برياني) - A dish with mixed pieces of chicken and rice.  It smells nice from the saffron and other seasonings added.\n** Chicken Tikka - Barbequed chicken with a spicy exterior.  Looks like a huge, red chicken leg and thigh. For all meat lovers.  Is available most anywhere.\n** Haleem - Thick stew-like mix of tiny chunks of meat or chicken, lentils and wheat grains.\n** Nihari - Thick gravy made from local spices. Is made with both chicken and beef. Is oily and spicy. Available mostly everywhere.\nThere are too many shorbas, or sauces/soups, to enumerate.  However, you should know of the most common ones. \n\n*'''Vegetarian'''\n** Daal - Yellow (made of yellow/red lentils) or brown (slightly sour) lentil \"soup\". Usually unspiced.  Common to all economic classes.\n** X + ''ki sabzi'' - A vegetarian mixture with 'X' as the main ingredient.\n\n*'''With Meat'''\nMeat is a major ingredient in most dishes. The variety is endless, but here are a few examples: \n** Aloo Gosht (Potatoes and Meat) - Chunks of potato and goat meat in gravy.  Levels of spice vary.  One example of a generic dish that includes most things + Gosht(meat).\n** Nihari- Beef simmered for several hours. A delicacy often eaten with ''Nan'', ''Sheer Mal'', or ''Taftan''.  Few people will have this available without spice.  Eat with lemon, fried onion and caution: it is one of the spiciest curries.\n** Paye -  or 'Siri Paye' is a stew of goat/beef/mutton bones (typically hooves, skull) and bone marrow. Extremely nutritious and generally eaten for breakfast with naan. \n\n*'''Desserts'''\n** Enjoy a variety; ice cream can be found in an abundance of flavors such as the traditional pistachio flavoured Kulfi;  \n** Falooda (فلودہ) is tasty rosewater dessert.  Traditional ice-cream known as 'kulfi' mixed with vermicelli, pistachio nuts and flavored with rose-water. Most ice-cream shops have their own versions.\n** Shirini or Mithai: is the generic name for a variety of sweet treats in Pakistan. The sweets are extremely popular in Pakistan and called different things depending on where you go.  '''Eat small chunks at a time''', eating large pieces can be rude and will generally be too sweet.\n** Kulfi is a very traditional made ice-cream mixed with cream and different types of nuts.\n** If you want to go to some ice-cream parlors, there are some good western ice-cream parlors in Lahore like \"Polka Parlor\" \"Jamin Java\" \"Hot Spot\". For traditional ice creams, the 'Chaman' ice cream parlor across town is quite popular.\n\nA part from local restaurants, international fast food chains have also popped up throughout Pakistan. They include, KFC, Pizza Hut, McDonalds, Subway, Nandos, Mr.Cod, Papa Johns, Dominoes etc. You are also prone to finding more European chains than North American.\n\n==Drink==\nThe legal drinking/purchasing age of alcoholic beverages is '''21'''..\n\nTap water can be unsafe for drinking. However, some establishments have water filters/purifiers installed, in which case the water is safe to drink. Packed drinking water (normally called mineral water in Pakistan) is a better choice. \n\nThe taste of the water is said to be very good in the north-eastern side of Pakistan, especially in Swat, Kaghan and Gilgit. Ask for bottled water wherever possible, and avoid anything cold that might have water in it.\n\n* Tea (or ''Chai'' as it is referred to in Pakistan) is popular throughout the country. \n**Both black and green tea (Sabz chai or qahvah) are common and are traditionally drunk with cardamom and lots of sugar. Lemon is optional but recommended with green tea.\n**Kashmiri chai is a milky tea with almonds and nuts added to give additional flavour. This tea is very popular during weddings and in the cold season.\n* Coffee is also available in all cities.\n\nIn the warmer southern region, sweet drinks are readily available throughout the day.  Look for street vendors that have fruits (real or decorations) hanging from their roofs.  Also, some milk/yogurt shops serve ''lassi''.  Ask for ''meethi lassi'' for a sweet yogurt drink and you can also get a salty lassi which tastes good and is similar to the Arabic ''Laban'' if you are having \"bhindi\" in food or some other rich dish. There is also a sweet drink called Mango Lassi which is very rich and thick, made with yogurt, mango pulp, and pieces of mango.\n\nBeing a Muslim country use of alcohol (both imported and local) is not allowed openly in the country. It is available to non-Muslim foreigners at licensed bars in most top end hotels. The local alcoholic beer is called 'Murree Beer. It is illegal for Muslims to buy, possess or consume alcohol in Pakistan.\n\n==Sleep==\nPakistan, as a middle income country with a sizeable middle class and significant domestic tourism industry has a decent range of hotels covering all price ranges.  International tourists often are disappointed by the cleanliness of Pakistani hotels - bedding is often clean but bathrooms can be a bit grungy. Currently Pakistan is facing a significant slump in international tourist numbers, in the northern areas in particular you'll find yourself the only guests.\n\n'''Budget''' The cheapest hotels are usually found around busy transportation hubs like bus and train stations. Don't be fooled by an impressive lobby - ask to see the room and check the beds, toilets, lights, etc before checking in. Hot water and air conditioning will be luxuries in this class.\n\n'''Mid range''' covers a wide spectrum of hotels - often listed in your guide book or online. All mid-range places will have a/c and hot water - although check if they have a working generator - air conditioning isn't of much use without electricity!  Always check the room before handing over any money - ask for a no smoking room away from the street - and haggle to get a better rate.  PTDC (government run) hotels fall in to the mid range section and warrant a special mention - often these places are the oldest hotel in town, in an excellent location, but the facilities will be showing their age. They are still a good option however, and discounts can be negotiated.  Mid range prices are around Rs2,000 - Rs6,000 per night.\n\n'''Top end''' covers the Serenas [http://www.serenahotels.com/], Pearl Continentals [http://www.pchotels.com.pk] and Marriotts [http://www.marriott.co.uk/Pakistan].  The Serena hotels are almost always excellent, whilst the Pearl Continental hotels are more patchy (eg the one in [[Rawalpindi]] is a bit grungy whilst the one in [[Muzaffarabad]] is very nice. At top-end places security is very visible, with small armies of security guards stationed around the perimeter.  Prices are from Rs6,000 and up, with the big city luxury hotels charging at least Rs10,000 a night.\n\n'''Government rest houses''' [http://www.paklinks.com/gs/culture-literature-and-linguistics/70484-rest-houses-to-visit-in-pakistan.html] are mentioned in numerous guide books and are located in rural and mountainous areas for local civil servants to use on their travels, with many built pre-independence and exuding a quaint English charm. Back in the day the adventurous tourist could book these places for the night for Rs1,000 or so, and have a lovely time.  But the tourist slump means that the forestry departments who run these places don't bother any more - phones will go unanswered - tourist information offices won't have any details etc. so count yourself lucky if you manage to arrange to stay in a Government rest house.\n\n'''Solo female travelers''' are at a disadvantage when it comes to hotels. All budget and many mid-range places will be the sole reserve of men, in particular in the cities - and hotel owners may be uncomfortable with the idea of an unaccompanied women staying at their hotel. Hence you may be forced to stay at the upper-mid range and top end places - which will eat through your budget that much quicker.\n\nNote that in some places the term \"hotel\" in Pakistan is reserved for simpler establishments, with \"Guest House\" referring to medium-sized establishments where the standard is typically higher. Also note that restaurants are also called \"hotels\", creating a fun potential for confusion.\n\n==Stay safe==\nPakistan has endured several bomb attacks over the last few years against security forces, so called ''western institutions'' (e.g the Marriott Hotel in Islamabad) and has seen the public assassination of former prime minister Benazir Bhutto upon her return from exile. Attacks typically increase when there is military action against the Taliban and the ordinary traveller should not venture into the tribal areas. It's a fairly hospitable country but social protests tend to turn violent and political demonstrations are always sensitive. Before travelling you should check with your embassy about off-limits areas, the latest political and military developments and keep a close eye on current issues with independent news sources.\n\nStay away from military convoys as they are a potential target for suicide bombing. Similarly, going near military or intelligence facilities can be dangerous.\n\nCarrying firearms can land you in police custody, except if you get a special permit from a relevant authority.  \n\t\nUse common sense and a healthy dose of courtesy when in conversation with Pakistanis. Kashmir is a particularly sensitive topic and best avoided altogether. Discussion about religion and Islam should remain respectful and positive &mdash; some Pakistanis are not tolerant of other religions, and if theirs is spoken about negatively, it could result in violence.\n\t\nThe line of control between Pakistan-administered Kashmir and the Indian state of Jammu and Kashmir is off-limits for foreign tourists, though domestic tourists can visit Azad Kashmir without any restriction (but should keep their identity cards with them).\n\t \nThe [[Federally Administered Tribal Areas]] & all regions near the sensitive Afghan border '''should not be visited at any time''' by foreign tourists, as the Pakistan government has '''little to no authority''' in these areas and cannot aid you in an emergency. If you do have reason to visit, seek expert guidance, including that of your embassy, who can advise you on the special permissions required.\n\t \nPeace has returned to [[Swat Valley]] and the army holds full control with lots of Foreign Nationals working in the form of NGOs. Road infrastructure was destroyed due to the 2010 floods but the army does massive efforts to restore the infrastructure.  [[Balochistan]] is considered dangerous and not fit for travellers due to increased kidnappings of foreigners.\n\t \nProstitution has no legal recognition in Pakistan. Moreover despite growth of male prostitution, homosexuality is outlawed in the nation. Under Section 377 of the Pakistan Penal Code, whoever voluntarily has \"carnal intercourse against the order of nature with any man, woman or animal\" shall be punished with imprisonment for a term which shall not be less than two years nor more than ten years, and shall also be liable to a fine. Penetration is sufficient to constitute the carnal intercourse necessary to the offence described in this section. Arrests for homosexuality are inevitable - at least until bribes are paid in rural areas and capricious in many metropolitan areas- as evidenced by a vibrant gay nightlife existing in some conurbations.\n\nAvoid going out at night especially in the city of Karachi that is notorious for its high crime rate, though it has decreased significantly in the past few years.\n \t\t \t\nFinally, be aware of '''sensitive areas'''. You may see road signs in English saying 'no foreigners allowed beyond this point' - for example on the road to Kahuta near Islamabad. If you see and need to pass one of these signs at the very least stop at the nearest police station and see if they will let you pass (speaking Urdu is an advantage here), or turn back and find another route. Typically, restricted areas are those with nuclear or military installations nearby. Kahuta, southeast of Islamabad, and the Sakesar hill station near the Amb temples in the Salt Range are two restricted areas the visitor may stumble across. Getting caught in a restricted area will mean a lot of wasted time, embarrassment and the possible involvement of your embassy.\n\nProtests can occur without warning in the country. As a result, there is heavy security present in the larger cities. Avoid the protests at all costs as they can turn into riots which can sometimes end up deadly.\n\n==Stay healthy==\nVisitors are strongly advised to refrain from drinking tap water; many Pakistani locals themselves drink boiled or purified water. Take every precaution to drink only boiled, filtered or bottled water. Tap water is known to contain many impurities. Ice is usually made from regular tap-water, and may be even harder to avoid. Fresh milk from the carrier should be boiled and cooled before consumption. Non-pasteurized dairy can spread tuberculosis so be careful of people with hacking coughs. Haleeb Milk and Olpers are trusted brands and are available at most grocery stores.\n\nTake precautions against malaria spread by mosquitoes. Avoid getting bitten and if you plan to stay in a place where malaria is common take prophylactic medication. The risk of getting Malaria decreases with higher altitudes.\n\nSummers are very hot, so be careful to stay hydrated. Temperatures range between 40 and 50°C in June and July, but as soon as the monsoon rains set in during August and September, things cool to around 30°C but with high levels of humidity.\n\nDo not eat food that has been lying out for some time, as high temperatures speed up deterioration. Avoid posh restaurants with only a sporadic clientèle.\n\nSome Pakistani dishes can be very spicy! Always notify your host, cook or waiter if you can not stomach very spicy food.\n\nBeware of the dengue fever in the summer, especially during the monsoon (Jul-Sept). It is caused by mosquitoes and can be fatal. The most widespread outbreaks of dengue are expected in the Punjab province.\n\n==Respect==\nPakistanis pride themselves on their tradition of hospitality to guests (Urdu: ''mehmanawazi'', Pashtu: ''milmastia'', Punjabi: ''puranadari''). When entering a house, you will often be showered with tea, sweets and gifts &mdash; it's considered ungrateful to refuse these. Finishing a meal involves a delicate balance.... cleaning your plate will invite more to be served, while leaving too much may be a sign you didn't care for it. Aim for leaving just a little, announcing you're full, and heavily praise the food.\n\nMost of the Pakistani women don't usually interact with strangers. So, don't get embarrassed if they avoid communicating with you. \n\nBusiness tends to move slowly, and will often be preceded by a lot of socializing, tea drinking, and meeting of the family. Rushing to the point may be considered rude, and even sour the deal.\n\nPakistan is a conservative country and it is advisable for women to wear long skirts or trousers in public (Pakistani women wear the traditional shalwar kameez. But in the big cities, women wearing jeans and khakis is not very uncommon sight, especially in casual settings, shopping malls and around picnic spots). Dress codes for men are more lax, though shorts are uncommon. Men should ''never'' shake hands with or touch a woman they don't know very well.\n\nAs with most of South Asia, you should use your right hand for eating, shaking hands and giving or receiving everything (including money), and reserve your left hand for handling shoes and assisting in toilet duties.\n\n==Contact==\n{| cellpadding=3 cellspacing=0 border=1 align=right\n|-\n! Calling from || Price || Syntax || Example\n|-\n| Same city || Local || align=right| ''number'' || align=right| 12345678\n|-\n| Same circle || Local || align=right| '''92'''-''area code''-''number'' || align=right| 92-51-12345678\n|-\n| Different circle || STD || align=right| '''0'''-''area code''-''number'' || align=right| 051-12345678\n|-\n| Overseas || ISD || align=right| '''+92'''-''area code''-''number'' || align=right| +92-51-12345678\n|}\n\nThe '''country code''' for Pakistan is +92 if you are calling from outside Pakistan. Phone numbers are seven digits long with two digit city code in larger districts, and six digits long with three digit city code in smaller districts, for a total of nine digits as a standard nationwide (except for Azad Kashmir). All mobile numbers, however, are seven digits long and begin with a four digit city code \"03XX\", where XX indicates the cellular provider.  Thus Pakistani mobile numbers are linked to one particular cellular provider, NOT one particular city as in some other countries.  Therefore the city prefix should not be dialled in addition to the cellular prefix. As in many countries, omit the initial zero when dialing a city or cell code from outside Pakistan and prefix the '92' country code after dialling your country's international access code. Thus Telenor™ cell number 7654321 dialled from the USA/Canada would be 011-92-345-7654321 and Peshawar landline 2345678 dialled from France or the UK would be 00-92-91-2345678. The international access code for outgoing calls from Pakistan is 00.\n\n[http://www.ptcl.com.pk PTCL] offers landline and wireless phone services.\n\n'''Public Call Offices''' can be found all over the country. You will find a PCO in nearly 50% of the general stores where there is usually someone who operates the phone and fax. Fees will be charged according to the time spent, and you will pay when you have finished your call.\n\n===Cell phone===\nMajor providers of mobile phone service (GSM) are:\n\n*[http://www.mobilinkgsm.com '''Mobilink''']\n*[http://www.telenor.com.pk '''Telenor''']\n*[http://www.ufone.com '''Ufone''' ]\n*[http://www.waridtel.com '''Warid''' ]\n*[http://www.zong.com.pk '''Zong - China Mobile''' ]\nOne very convenient feature is that all Pakistani cellular operators use the GSM platform, so that cellular handsets nationwide are freely interchangeable between providers.\n\n===Internet===\n'''Cybercafes''' can be found on virtually every street corner and the rates are as low as Rs 30-50 per hour. They usually don't have a normal operating system, so don't be too impatient! LCD Monitors, Windows 7 are usually installed and most of the cafes have an internet connection with a decent speed (usually 4Mbps to 20Mbps).\n\n\n3G mobile services have been launched in 2014 Pakistan by four operators (Mobilink, Ufone, Zong, Telenor). 4G has also been launched in 2014.\nThe number of 3G and 4G users in Pakistan reached 56.08 million by the end of June 2018, said Pakistan Telecommunication Authority (PTA).\n Normally a 3G 4G enabled SIM card will give you 25MBPS to 56MBPS speed and will cost your around 20$ per month for unlimited data plans. If you need higher speeds while on the go, try the Jazz 4G Zong 4G Telenor 4G PTCL EVO Char G USB modem; it will cost around 20$ per month for 100gb data at 9MBPS (http://ptcl.com.pk/pd_content.php?pd_id=204), but be sure to check the coverage map on PTCL's website before you buy. Its available in almost all cities but the quality of service may vary.\n\nThere are '''Wi-Fi hotspots''' all over Pakistan, in hotels, malls, cafes and restaurants.\n\n===Postal & Courier===\nPostal & Courier companies can easily be found across Pakistan. Some popular postal & courier companies include TCS [http://www.tcscouriers.com], Leopards [http://www.leopardscourier.com], Pakistan Post [http://www.pakpost.gov.pk], DHL [http://www.dhl.com.pk/en.html], Fedex [http://www.fedex.com/pk] etc. For money transfer, you can use Money Gram or Western Union, both have partnered with local banks and money exchange companies to ease transfer of money and you can go to any bank branch to avail their services. \n\n\n\n{{isPartOf|South Asia}}\n\n\n[[de:Pakistan]]\n[[eo:Pakistano]]\n[[es:Pakistán]]\n[[fi:Pakistan]]\n[[fr:Pakistan]]\n[[hi:पाकिस्तान]]\n[[hu:Pakisztán]]\n[[it:Pakistan]]\n[[ja:パキスタン]]\n[[nl:Pakistan]]\n[[pl:Pakistan]]\n[[pt:Paquistão]]\n[[ru:Пакистан]]\n[[sv:Pakistan]]\n[[wts:Category:Pakistan]]\n\n\n[[WikiPedia:Pakistan]]\n[[Dmoz:Asia/Pakistan/]]\n[[World66:asia/southasia/pakistan]]\n\n{{hasDocent|Webkami}}\n{{usablecountry}}\n{{related|Sacred_sites_of_the_Indian_sub-continent}}"
        }
    }
}