{
    "parse": {
        "title": "Paraguay",
        "pageid": 687,
        "wikitext": {
            "*": "{{pagebanner|Paraguay Banner.jpg}}\n{{cautionbox|The CDC has identified [[Paraguay]] as an affected area of the Zika outbreak. Pregnant women are advised to be cautious as the virus can lead to birth defects. Adults affected by the virus experience fever, rash, joint pain, and conjunctivitis (red eyes) typically lasting a week.  You can learn more by visiting [http://www.cdc.gov/zika/index.html the official CDC website].}}\n\n[http://www.senatur.gov.py/index.php?language=2 '''Paraguay'''] is a landlocked country in [[South America]] bordering [[Argentina]], [[Bolivia]], and [[Brazil]]. The country is very wealthy in natural resources despite its small size, but unfortunately it has endured decades of political instability, leading it to be one of the poorest and least developed countries in South America. \n\n==Understand==\n{{quickbar\n| image=Asuncion Cathedral.jpg\n| caption=Asuncion Cathedral, Asunción \n| location=Paraguay in its region..svg\n| flag=Flag of Paraguay.svg\n| capital=[[Asunción]]\n| government=Constitutional republic\n| currency=Guarani (PYG)\n| area=406,752km²<br />''water: 9,450km²<br />land: 397,300km²''\n| population=6,349,000 (2009 estimate)\n| language=[[Spanish]], Guarani\n| religion=Roman Catholic 90%, Mennonite, and other Protestant\n| electricity=220V, 50Hz (European plug)\n| callingcode=+595\n| tld=.py\n| timezone=UTC-4\n}}\nColonized for 3 centuries by the [[Spain|Spanish]], since the 1500s, Paraguay has managed to keep a lot of its indigenous character and identity. Nowadays, the ''mestizos'' (Spanish + Amerindian) account for more than 80% of the country's 6 million inhabitants and Guarani is, side by side with Spanish, the country's official language.\n\nIn the past, Franciscan and Jesuit missions mingled with the Guaranis' dream of '''Yvy maraë´y''', a land without evil, and produced singular societies. The '''ruins''' of the Jesuit Missions of La Santisima [[Trinidad (Paraguay)|Trinidad de Parana]] and Jesus de Tavarangue, [[UNESCO World Heritage List|UNESCO World Heritage sites]], and several villages throughout the country, are witnesses to that peaceful past.\n\nParaguay has had a very troubled history. Being one of the richest countries in the 1800's (and the only one in America to have railways transportation at that time) before the disastrous War of the Triple Alliance (1865-70). Paraguay, facing the allied forces of Argentina, Brazil, and Uruguay, lost two-thirds of all adult males and much of its territory including their coast with the sea. It was also the scene of the first ever attempt at Communism when 700 people sailed from Balmain, in Sydney, Australia in 1893 to found \"New Australia.\"  A split occurred soon after arrival when some of the arrivals started mingling with the local ladies who were suffering a lack of men due to the  War of the Triple Alliance.  Two-thirds of the immigrants eventually returned to Australia but around 2000 Paraguayans can trace their heritage to Australia. In the Chaco War of 1932-35, large, economically important areas were won from Bolivia. The 35-year military dictatorship of Alfredo Stroessner was overthrown in 1989, and, despite a marked increase in political infighting in recent years, democratic governors have been in power since then.\n\nAfter World War II Paraguay received many immigrants, who fell in love with the hospitality and decided to stay and call Paraguay their home. Therefore, is common to find colonies of Germans, Russians, Italians, French and Spanish people in the country areas of Paraguay.\n\nModern Paraguay is largely based upon political uncertainty and economic hardship. Since the early 1980s, Paraguay has been making the difficult transition to a more modern market economy. While [[Asuncion]] is filled with new economic prospects and construction, much of the country remains underdeveloped.\n\nIn recent years, Paraguay has been seeing a more politically and economically stable situation, with little to no uncertain events. The prospects of change seem better than ever.\n\n*National holiday: Independence Day, 15 May (1811)\n\n===Geography===\nWith an area of about 406,000km² Or 157,048 mi²  Paraguay is divided into two regions: Oriental and Occidental by the [[Paraguay River]]. Despite being landlocked, the country is bordered and criss-crossed by navigable rivers.\n\nThe Tropic of Capricorn also crosses the country from East to West and determines a more tropical climate to the North and subtropical to temperate climate to the South.\n\n===Economy===\nParaguay has been recently ranked by several research studies as the cheapest country in the world, measured through Purchasing Power Parity. Prices, measured in dollars, euros or pounds sterling are very low. \n\n; '''Economy - overview''' : Paraguay has a market economy marked by a large informal sector. The informal sector features both re-export of imported consumer goods to neighboring countries as well as the activities of thousands of micro-enterprises and urban street vendors. Because of the importance of the informal sector, accurate economic measures are difficult to obtain. A large percentage of the population derives their living from agricultural activity, often on a subsistence basis. The formal economy grew by an average of about 3% annually in 1995-97, but GDP declined slightly in 1998, 1999, and 2000. On a per capita basis, real income has stagnated at 1980 levels. Most observers attribute Paraguay's poor economic performance to political uncertainty, corruption, lack of progress on structural reform, substantial internal and foreign debt, and deficient infrastructure.\n; '''GDP''' : purchasing power parity - $26.2 billion (2001 est.)\n; '''GDP - per capita''' : purchasing power parity - $4,600 (2001 est.)\n\n==Regions==\n\n{{Regionlist\n| regionmap=Paraguay regions map.png\n| regionmaptext=\n| regionmapsize=400px\n\n| region1name=[[Chaco (Paraguay)|Gran Chaco]]\n| region1color=#b5cfa2\n| region1items=\n| region1description=The large, wild, semi-arid plains in the northwest of the country.\n\n| region2name=[[Paraná Plateau]]\n| region2color=#83ae89\n| region2items=\n| region2description=The forested highlands in Paraguay's east, along the Paraná River, home to the second largest city of [[Ciudad del Este]], just over the river from [[Iguaçu Falls]].\n\n| region3name=[[Northern Paraneña]]\n| region3color=#cacf83\n| region3items=\n| region3description=\n\n| region4name=[[Southern Paraneña]]\n| region4color=#b497b4\n| region4items=\n| region4description=Home to the population center of the country, in and around Asunción.\n\n}}\n\n==Cities==\n*[[Asunción]] - the capital\n*[[Ciudad del Este]] - this busy border city is also Paraguay's gateway to the [[Iguazu Falls]]\n*[[Encarnación]] and its Jesuit Missions of La Santisima Trinidad de Parana and Jesus de Tavarangue\n*[[Filadelfia]] - the departmental seat of Boquerón, founded as a Mennonite colony\n*[[Concepción (Paraguay)|Concepción]]\n*[[Villarrica del Espiritu Santo]]\n*[[Pilar]]\n*[[Aregua]] - small town near the capital, famous for its ceramics and lake Ypacarai\n\n==Other destinations==\n\nOutisde Asuncion-\n\nSan Bernardino- (45 minutes)Paraguay´s liveliest balneario, a summer destination for the young and beautiful. Originally settled by German immigrants, you can still see some houses remaining from that period. The Lago Ypacarai used to be known as the blue lake, is no longer blue, but filled with people doing water sports during December-February.\n\nAregua- (45 minutes) laid back town with a nice church and lake. Home to many artists and writers, which have set up nice galleries and museums. Outdoor street market selling colorful ceramics. You can visit the Museo del Mueble, Centro Cultural del Lago and El Cantaro Galería de Arte.\n\nSan Lorenzo (30 minutes)\nMuseo Etnografico Guido Bogiani- indigenous wood carvings and feather pieces. Nice and cheap store selling indigenous handicrafts. Call before going. Located in nearby San Lorenzo, be sure to take a taxi driver who knows the place, as most people in San Lorenzo do not even know of its existence.\n\nEncarnación (4 hours)\nOn the way, stop at ruins and churches along the Jesuit trail. Santa maria de fe is a small town where you can see women embroidering in a sisterhood community.\n\nPilar- (3,5 hours)\nriverside city where the countries biggest cotton manufacturing industry is located. Very relaxed atmosphere.\n\nNueva Australia- Settled by disgruntled and idealistic Australians in October, 1893, this was the first attempt at communism anywhere in the world. About 700 people set up a colony without money or bosses based on the theories of Karl Marx. The tiny town with some of the descendants of the original settlers still exists about 5km West of Villarrica.  Villarrica is an interesting town with a square that comes alive on a Friday night.  very cheap wares sold. A second town, again with descendants, was founded by the same group of Australians at Cosme, 90km South, near Ca azapa.\n\n==Get in==\n\n===Entry Requirements===\nBefore you try to enter Paraguay, you need to check the visa requirements for your country. Most European citizens (EU) generally don't need visas to visit Paraguay for up to 90 days. However US, Canadian, Australian and New Zealand citizens do need visas.\n\nCitizens of the US, Canada, Australia, New Zealand, and Taiwan can apply for a visa on arrival, but only at the International Airport in Ascunción. Fees range from USD 100 to USD 160 in cash, depending on nationality, and the maximum stay on such a visa is 90 days.\n\n===By plane===\nFlights go out from other South American airports to Asuncion on a fairly regular basis.  There are also two daily flights from [[São Paulo]] to Ciudad del Este.\nDirect flights between Miami and Asunción are currently available on a regular basis. Direct flights between Madrid and Asunción are scheduled to start on the first semester of 2014.\n\n===By train===\nCurrently, there is no train service available to and from Paraguay. In the past, Paraguay was connected by a train service to Argentina, but it has been discontinued.\n\n===By bus===\nBus service is available to and from a wide range of South American cities. You can take a bus from Santiago, Chile; Sao Paulo, Brazil; Buenos Aires, Argentina; Cordoba, Argentina; Santa Cruz, Bolivia; Montevideo, Uruguay; Rio de Janeiro, Brazil.  Buses are very modern and some buses have seats that fully recline into beds. In Spanish they are called cama. Semi-cama recline most of the way.\n\nThe bus to and from Bolivia crosses the Chaco. Only one bus company does the trip, from Santa Cruz to Asuncion, with possible stops at Villamontes (Bolivia) or a few kilometers of Filadelfia (Paraguay) but typically for the same price. Beware that tourists should bargain, with minimum prices of 45 US dollars (payable in local currency or in US). The trip takes at least a full day, and easily more. Note that the bus coming from Santa Cruz passes Villamontes at about 2 in the morning.\n\nThe bus from Ciudad Del Este (Paraguay) at the border with Brazil is typically cheaper for going to Rio or Sao Paolo than the bus going from Iguasu (Brazil). To go to Puerto Iguasu (Argentina) many buses cross Brazil (without Brazilian border control) into Argentina for 35 Pesos or 12.000 Guarani (Des 2016). Best visit the border in advance to get an exit stamp for Paraguay because not all buses make a stop, otherwise ask before jumping on a bus.\n\n===By boat===\nA boat travels up the [[Paraguay River]] from Asuncion stopping at many ports to the north of the border with Brazil. Most of these boats weren't designed to carry passengers so expect a sticky crowded experience, but you can buy just about anything on board, even cold beer. Bring something comfortable to sleep on!\n\n==Get around==\n===By taxi===\nTaxis are the most efficient and reliable form of transportation, even though you can probably get there also by bus, or colectivo, as Paraguayans call it. Taxis are expensive compared to other prices in Paraguay, and in Asuncion the fares are determined by the meter. Outside Asunción there are no meters so make sure you decide on a price before you get in. Bargaining on a price may be useful, as tourists have been asked for US$10 for a five minute ride. To prevent any disputes, always ask your hotel concierge how much the real cost of the fare should be.\n\n===By train===\n; '''Railways''' : ''total:'' 971 km <br>''standard gauge:'' 441 km 1.435-m gauge <br>''note:'' there are 470 km of various gauges that are privately owned <br>''narrow gauge:'' 60 km 1.000-m gauge\n\n===By car===\nThere are highways connecting all the major regions of Paraguay, but most of them are one lane each way.  You may hit toll booths along the way.\n\nPolice ('polícia caminera' (road police) ) may pull you over for any reason and some may expect bribes.  If you have committed something wrong, you should pay the fine and always ask for a receipt.\n\nPlease note some tourists have been known to report difficulties dealing with the police on country roads, but that these problems do not generally occur in any of the wealthier areas of the major cities where somewhat 'nicer' relationships with the police are reported. Of course every person's experience in Paraguay will differ and the relations and treatments expected from the Policia will vary with every person's mood, vibe, timing and luck.\n\nTravel safe.\n\n===By bus===\nBuses are the most common public transport. There are many companies running different lines. You must check which one serves your destination.\n* Nuestra Señora de la Asunción [http://www.nsa.com.py/Pasajeros.html]\n* La Encarnacena [http://www.laencarnacena.com.py]\n\n===By Air Taxi===\nLimited infrastructure makes charter air travel a popular mode of transportation.\n\n*Paraguay Jet - Instant Air Taxi Reservations\n[http://ParaguayJet.com]\n\n===By boat===\n; '''Waterways''' : 3,100 km\n; '''Ports and harbors''' : Asuncion, Villeta, San Antonio, Encarnacion\n; '''Merchant marine''' : ''total:'' 21 ships (1,000 GRT or over) totaling 34,623 GRT/36,821 DWT <br>''ships by type:'' cargo 14, chemical tanker 1, petroleum tanker 3, roll on/roll off 3 <br>''note:'' includes some foreign-owned ships registered here as a flag of convenience: Argentina 2, Japan 1 (2002 est.)\n\n==Talk==\nBoth [[Spanish phrasebook|Spanish]] and [[Guaraní phrasebook|Guaraní]] are official. Most people in Paraguay speak Spanish and use of English is very limited. Outside of Asuncion and big cities Guarani is all you will hear. Due to the extensive use of Guarani, even those who have managed to learn Spanish do not always speak it very well.\n\nIn Paraguay, Guarani is almost always spoken as a mix of Guarani and Spanish, known as Jopara, meaning \"mixed\" in Guarani. The number system in Guarani is rarely used, and is almost always replaced with the Spanish number system.\n\nSome basic greetings in Guarani include:\n\nMba'eichapa? = How are you? \n\nIporã       = Good\n\nha nde?      = and you?\n\niporã avei  = good as well\n\n\nIn Paraguay Vos is used instead of Tu. There is a slight change in conjugation but not big enough that you won't be understood using Tu. This Vos is NOT the same as Vosotros. Stems do not change in verbs when using \"vos\", and the ending is always stressed. For example \"tienes\" changes to \"tenés\", \"puedes\" changes to \"podés\", \"vienes\" changes to \"venís\" etc.\n\nIn the northern, and eastern parts of Paraguay, Portuguese is spoken widely. In some places, Nueva Esperanza (80% Portuguese speaking), Katuetè (60%) the majority speak Portuguese, almost always the result of Paraguayan born, or first generation Brazilian immigrants. There are many cases of Paraguayans, who were born during the era of Brazilian immigration who speak only Portuguese at home, although also fluent Guarani, but very little or no Spanish.\n\nThere are also a number of Mennonite communities throughout Paraguay which speak Low German and regular High German.\n\n==See==\n\nCity Center (centro)-\n\nCatedral de Nuestra Señora de Asuncion\n\nCabildo- Cultural Center in the old colonial legislative building near the bay area. www.cabildoccr.gov.py\n\nCasa de la independencia- landmark of the Paraguayan Independence. This is where national heroes gathered to plot against Spanish colonialists in 1811. They marched from here to the Cathedral on Independence Day.\nwww.casadelaindependencia.org.py\n\nPanteon de los Heroes- national memorial site for paraguayan heroes.\n\nPalacio de Lopez- house the Paraguayan government. Very well lit at night.\n\nEstacion Central del Ferrocarril-Paraguay was the first country in South America to have a vapor train. It now houses a museum, but more impressive is the building itself and old wagons. You may be lucky to catch a ride on Sundays to neighbor city of Aregua. This is a tourist ride, the train no longer operates regularly.\n\nTeatro Municipal- recently renovated, check for regular shows. Nice cafe inside, you can eat there even if you don't catch a performance.\n\nManzana de la Rivera- cultural center in an old colonial house. Has a nice outdoor cafe overlooking the Palacio de Lopez\n\nIglesia de la Encarnación- church with a big pipe organ (the only on in Paraguay). Currently in very poor conditions. Served as a hospital during Guerra del Chaco (1932-1935).\n\nMburuvicha Roga- the chief's house in guarani, where the presidential family lives.\n\nCentro Cultural de Artes Visuales Museo del Barro- a very good example of Paraguayan art, dating from pre-colonial ceramics and textiles until very avant-garde contemporary art. More info at: www.museodelbarro.org\n\nCapellania del Migrante- Seminario Metropolitano de Asuncion- very beautiful brick church within a huge lively park where you can see Paraguayans play soccer, tennis and jog. \n\nSunday flea market- along calle Palma, several old men set up their tables selling trinkets, photographs and books. from early morning until noon approximately.\n\nThere is a well in the city of Santani (San Pedro) that does not go dry.  The town's museum also contains a large snakeskin.\n\n==Do==\nCrucero del Paraguay: luxury wooden boat sailing from Asuncion ports to the Pantanal and Chaco area. More info at: www.cruceroparaguay.info\n\nWalk through the historic Asuncion city center- many former grand buildings are suffering from great decay, but if you look past graffiti walls, you can imagine Asuncion's past splendor. At nights, you can take a cab ride and enjoy it fully illuminated. There are many bars, restaurants in this area.\n\nSpend the day or enjoy a picnic at Ñu Guazu- Asuncion's biggest park. Full of ponds, and people playing sports.\n\nVisit the Jardin Botanico- very peaceful place, filled with trees and nice paths. Find a nice shady spot and enjoy a picnic lunch.  Inside the park you can visit Madame Lynch's house, very beautiful example of Paraguayan Colonial architecture.\n\nParaguay Safari and Paraguay Nature: Safaris expeditions in Paraguay for people who want to know and live a wildlife experience. Trained guides in the biology area, with knowledge of the fauna and flora contained in each eco-region of the country. [http://www.paraguaynature.com]\n \nLocated in the hearth of South America, Paraguay combines different kinds of eco-regions like Dry and Humid Chaco, Cerrado Forest, Atlantic Forest and Pantanal \n\nWatch a soccer match at one of Asuncion's stadiums. The classic rivals are Cerro Porteno and Olimpia.\n\nEat a street-side “lomito”- these vendors are located throughout the city, with high concentrations near Casa Rica and the Ñu Guazu. It is a sandwich, with mayo, veggies, cheese and a fried egg. You can choose between beef or chicken. Some also offer lomito arabe (shawarma), hamburgers and chorizo. It is a popular hang out place at nights and after a night of heavy drinking.\n\nDon Vito is Paraguayan fast food at its best. Home of the Paraguayan empanada, they have been in business for over 30 years. The original spot is just behind the Iglesia de San Jose, and if you are lucky enough to be in Paraguay around may-June, you can order a pastel mandi'o, which is make of mandioca and beef. Best enjoyed with a cold pulp, a Paraguayan soft drink made with natural fruit juice.\n\nMercado 4\nwalk past yuyeras, fake DVD street vendors, and Paraguayans sharing terere. Great place to eat, from street stalls selling typical Paraguayan food and deserts to good cheap Chinese places. Most Paraguayans still shop at local produce markets, but you can buy everything at great prices.\n\nTry the stuffed chorizo with garlic roasted in honey, also rabbit meat with the black bean sauce.\n\n==Buy==\n\nThe currency is the guarani (PYG).  As of May 2015, the current exchange rate is 5,082 Guaranies for 1 US Dollar, and 5,595 Guaranies for €1. Always check the exchange rate quotations on the internet or several major newspapers before exchanging money.\n\nPrices in Paraguay are very low and a budget traveller will be able to get by on as little as £8/$12 a day and even less if camping. A clean, single hotel room out of Asuncion should not cost more than US$8.\n\nParaguay has a very rich and diverse craftsmanship, everything from silver filigree (Luque) to cotton fine lace in the form of Ñanduti (Itaugua) is available. Also leather goods with local “repujado” embellishments (Atyra) and ao poi, encaje yu embroidery. Clay ceramic (Ita) and weavery is also very popular, cheap and beautiful. Leather soccer balls are sold and hand made in the town of Quindy.\n\n==Eat==\nParaguayan food is one of the most diverse in south American region. Paraguayans commonly enjoy typical food several times a week all year round. You'll find much of the standard South American cuisine here  with some Brazilian influence as well.  \n\nAlso highly popular are ''empanadas'' (meat/egg stuffed in a pastry and baked) and ''milanesa'' (breaded and fried chicken/beef/fish) - these are considered fast food, and are also found in other countries in the region.  If you order a hamburger at a restaurant, expect it to come topped with a fried egg.  \n\n''Asado'' (BBQ) is great, and prices are quite reasonable - 20000 Guaranis ($4.00 US) will get you an all-you-can-eat buffet at many nice places.  5000 Guarani is enough to pay for a hamburger.  \n\nParaguayan food isn't particularly spicy, so those who can't tolerate spices won't have problems here.  \n\nThere is a lot of traditional food. Chipa-a bread baked in an outdoor oven or \"tatacua\", usually made out of mandioca (manioc) flour.  Mandioca is often substituted for potatoes. Sopa Paraguaya is a form of corn bread are two of the most well known. Sopa means soup, so it is very interesting to be actually eating a solid soup, probably the only one in the world.  Mandioca, or Mandi´o in Guarani (It is similar to a potato, and is normally eaten boiled but can be fried). It is eaten almost everyday by Paraguayans, and many have it growing on their land. Tortillas in Paraguay are different than in other places in Latin America. It is more like a fried dough (made with Paraguayan cheese). Try Sopa So'o if you get the chance--it is Paraguayan cornbread with bits of pieces of meat often marinated with garlic and lime. Mbeju is a mandioca starch and Paraguayan cheese based flatbread. \n\nLido Bar- Paraguayan institution. Sit at the bar and talk to lady waitresses who have been working there for the past decades.\n\nBolsi- similar to the Lido, but with a more “international” vibe.\n\nFiambrería La Alemana- Paraguays biggest German charcuterie. Past the front sales spot is a bar where local taxi drivers and alike come to eat a snack. Incredibly hygienic. Check opening hours.\n\nÑa Eustaquia- traditional Paraguayan food.\n\nLa Vienesa- with many stores located in Asuncion. Traditional french style coffee-bakery and patisserie with a small but cozy neighbourhood restaurant.\n\nLomitos El Gordo - Family restaurant located in San Lorenzo run by Paraguayan personality Gregorio Rojas\n\nHigh end:\n\nTierra Colorada- arguably the best chef in Paraguay, Rodolfo Angenscheidt, has open his own restaurant a little over a year ago. The best local ingredients cooked under culinary perfection. \n\nUn toro y siete vacas- Traditional Paraguayan asado.\n\n==Drink==\nTap water in Asuncion, and for sure Ciudad del Este, is NOT potable! Tap water in the rest of Paraguay should be treated to make it safe for drinking. There have been efforts by PLAN International to bring safe, potable water to communities in rural areas (if there is such water available, it is safe to drink). Ask before drinking water in rural areas however--many Paraguayans will claim their water is safe to drink even if it's not purified.\n\nThe national beverage in Paraguay is called terere and is made from the yerba mate plant.  It is served cold in guampas, which can be made out of wood or of hollow bull horns, and is drunk through a metal straw called a bombilla.  The infusion is prepared by pouring dry yerba into the cup, then adding water: hot water version is known as mate (preferred in Argentina and Uruguay) while the cold water version is known as tereré and is a local favorite. Mate is usually enjoyed in the early mornings and late evenings especially during cold days in winter. Terere is enjoyed year-round, though not during lunch time and past sunset, as many recommend. Still, you can see every type of Paraguayan (from construction workers to business executives) carry their terere set during all times. Often, herbs are added to the tereré water (locally called 'remedios' or 'yuyos', which cure different ailments). For example, adding coconut to one's mate is supposed to help with headaches.  The taste is best described as earthy, like a bitter green tea, and it will take getting used to before you can enjoy it.  Drinking mate or tereré is most definitely one of the social customs of Paraguay. Shops will close around noon for a siesta and for a round of mate/tereré with friends.  If you can get used to the taste and participate, locals will be appreciative.  This drink is also found in other South American countries such as [[Argentina]], [[Uruguay]], and parts of [[Brazil]] and [[Chile]].\n\nBeer is widely available, as are many liquors. The local beer is Brahma or Pilsen. \n\nParaguayan hard liquor is similar to rum and is known locally as caña. It is made out of sugar cane.\n\nPulp is a very popular Paraguayan soft drink. You can buy it a supermarkets or order it in various restaurants and bars. The original is Pulp Naranja, made with real orange juice.\n\nMosto helado is extracted from the sugar cane and very sweet,sometimes mixed with lime juice to make an 'aloja'. You can find street carts selling mosto near the centro area and in the countryside.\n\n==Sleep==\n \t\nGood accommodation will certainly not be hard to find in major towns, and will seem reasonably cheap if the parameter is the dollar or the euro. The exception, however, is [[Ciudad del Este]]. In Ciuded del Este the cheapest accommodation is near the bus station with doubles for less than 10 euro, in an area that is also pleasant in the evening. Cheap accommodation is easy to find, but if you're after something of higher quality and have the money to back it up, then you'll have a better chance in the Argentinian [[Puerto Iguazu]] or the Brazilian [[Foz do Iguaçu]].\n\n==Learn==\n\nAlthough there are few Spanish language learning schools, as far as languages go however, there is a uniquely Paraguayan language called Guaraní. It is an indigenous language spoken widely outside of Asuncion. Most Paraguayans can speak both Spanish and Guaraní. The Guaraní that is spoken is not pure--instead is uses Spanish words as well (especially when the word in Guaraní is more complicated than the corresponding Spanish word). Classes to learn Guaraní are unheard of for foreigners (though in the big cities, students who speak Spanish as their first language can opt to learn Guaraní as a second language). There are books available in stores, though the best way to learn would be to speak to the locals.\n\nAs of September 2016, Duolingo offers a free Guaraní course: https://www.duolingo.com/course/gn/es/aprende-Guaran%C3%AD-(Jopar%C3%A1)-en-l%C3%ADnea .  The only catch is that the course uses Spanish as the base language.\n \nYou can learn local artisanry such as ñanduti embroidery and ao poi at the Instituto Paraguayode Artesanía. Find out more at: www.artesania.gov.py\n\n==Work==\nMost people who live in the rural areas of Paraguay are subsistence farmers. Other people who live in urban areas are marketeers. They sell fish, fruit and vegetables, and other products.\n\n==Stay safe==\nThere are three large cities in Paraguay, and they are generally safer than equivalently-sized cities in many parts of the world, and much more so than Rio de Janeiro, Buenos Aires, or São Paulo. As long as common sense is applied - bearing in mind that as a foreigner you may naturally attract attention - you are unlikely to run into trouble. Personal ID should be carried at all times (ID card/photocopy of passport). The police have a reputation for corruption, and if you are stopped for any reason, they will require ID, and may expect a discreet bribe before allowing you to move on. However, this is more common in rural areas. Women should apply the same policy for being out alone at night as they would in cities in their own country. Loud and/or drunken behaviour in the street is unacceptable and will attract the attention of the police.\n\nCiudad del Este, on Paraguay's eastern border with Brazil, is a shopping hub for people in the region. The city does have a name as a center for illicit activity such as smuggling, money laundering and counterfeiting, but this should not affect your travels. Be alert to pickpockets, and keep bags and wallets safe, as in any other large city. Do not take part, of course, in criminal activity on any level.\n\nParaguay's legal system is based on Argentine and French codes, and Roman law; judicial review of legislative acts takes place in the Supreme Court of Justice.\n\n==Stay healthy==\n\nPiped drinking water from the national water company in Paraguay is not healthy, but fruit, vegetables, fish and meat are of very high quality. Care should naturally be taken to eat freshly-cooked food, and not to eat in clearly unhygienic establishments or from street vendors.\n\nThe two main threats to health are mosquitoes and heat. Use insect repellent, as Dengue fever, transmitted by mosquitoes, is endemic to the region, and a serious illness. Hang a mosquito net over the bed at night if possible. Sunscreen and plenty of water are advised; it is also worth copying the wisdom of the regional habit of staying completely out of the sun from at least midday to 3pm. Paraguayans rise early (4-5am) to do most of the day's work before noon. \n\nStray dogs are not uncommon in some areas - these do not usually bother passers-by, but should nevertheless be avoided. Care should be taken when walking in sandals near loose dirt, as a tiny flea known locally as 'pique' (''Tunga penetrans'') may attach itself to the skin of the foot, especially around the toes. The insect lays eggs under the skin, and this causes tenderness and infection if not taken care of. The usual way to remove 'pique' is to pierce the site with a stitching needle, disinfect the area, and then twist the flea out. Avoid walking barefoot for this reason.\n\nHospital facilities in Paraguay range from very high international standards to the unsanitary and under-equipped. Visitors should always have medical insurance as for any journey, and in case of serious illness attend the best hospital available. When attending small local medical centers in the countryside, it is advisable to take hypodermic needles, surgical gloves with you. The national public hospital in Asuncion has long suffered from severe overcrowding and lack of funding.  Private hospitals in Asuncion, Encarnacion, and Ciudad del Este offer a much higher standard of care, and are well within the budget of most foreign tourists.\n\n==Respect==\nParaguayans in general are warm and hospitable, and are generally curious about foreign visitors. Compared to other South American countries, Paraguay is a more traditional and conservative society.  \n\n=== Social Etiquette and Breaches ===\n* '''Paraguayans in general are inquisitive communicators.''' Due to the relatively small number of tourists and foreigners in Paraguay, local people, particularly outside the capital, may express curiosity about tourist visitors, and find their colouring, dress or manners a cause for comment or even gentle amusement. Do not be offended by this as Paraguayans do not intend to be impolite in any way.\n\n* '''Paraguayans in general are conservative dressers'''. Even amongst the poorest of Paraguayans, most make the effort to be well-groomed. Wearing brightly coloured clothing, or wearing something that stands out may be met with odd looks. \n\n* '''It is considered courteous for men to shake hands whenever they meet'''. Not doing so can be considered rude manners. \n\n* '''In mixed company among friends and peers, it is usual for men and women to give a light kiss on each cheek'''. Not doing so can be considered rude manners. \n\n* '''Never rest your feet on anything else other than the floor'''. It's considered rude manners. \n\n* '''Paraguayans have an intimately quiet way of conversing with one another'''. Shouting or being loud in public is frowned upon, and it's best to follow suit with this in order to not stand out like a sore thumb. \n\n* '''Never lose your temper, confront someone publicly or raise your voice in a conversation'''. It's considered a sign of weaknesses and it will not be appreciated. As a country priding itself on tranquillity, it should not come as a surprise if the locals express disappointment and disgust with it.\n\n* '''Never be afraid to discuss the country or the culture'''. Paraguayans will be more than enamoured by your interest and this can be a good way to break the ice with someone. \n\n* '''Women are treated with an extreme degree of respect'''. Female travellers should not act surprised if their male Paraguayan colleagues or friends go out of their way to avoid offending or confronting them. Male travellers should note that this will also be expected by Paraguayan women too. \n\n* '''Paraguayans do not share the same sense of the importance of keeping to clock time as northern Europeans and North Americans conventionally do'''. Visitors from outside Latin America may find it frustrating at first that schedules and timetables are not followed strictly, and perceive frequent 'lateness'. Flights and intercity buses may not run to schedule. For a Paraguayan to arrive late to a meeting is not uncommon, and should not be considered rude. In contrast, punctuality in foreign visitors is admired.\n\n=== Home Etiquette ===\n* '''Always bring a gift when invited to a Paraguayan home'''. A high-quality gift will be appreciated, but anything that's too expensive may be interpreted as bribery. Showing up empty handed can cause offence to your hosts. \n\n* '''Don't be afraid of gifting a gift from your home country'''. Paraguayans will be very delighted. \n\n* '''Avoid gifting knives and sharp objects'''. In the business world, these are associated with terminating a business relationship and it may cause offence, even if you don't mean it. \n\n* '''Avoid gifting something with a company logo on it'''. It's considered garish and some may interpret it as a sign of bribery. \n\n* '''Always consider giving gifts to your Paraguayan host's children'''. It's very polite manners and it can potentially improve a friendship/existing relationship. \n\n=== Things to avoid ===\n\n==== Politics: ====\n* '''At all costs, do not insult, speak badly of, pass negative judgements about the country'''. Paraguayans in general are very proud of their country and would view any negative sentiments about their country with varying degrees of hostility. Most Paraguayans are aware of their country's problems and will defend against any outsider for doing so. As a general rule of thumb, it's advisable to only praise the country and keep any negative sentiments about it to yourself. If in doubt, always ask.\n\n* '''At all costs, steer clear of discussing internal politics'''. Unless you are very well acquainted with Paraguayan society and culture, offering your opinions about internal politics will come across as uninformed and judgemental. Don't be afraid of discussing politics, but it's advisable to not say something to provoke someone as being a visitor puts you in a delicate position. \n\n==== Sensitive Issues: ====\n* '''At all costs, show extreme respect when discussing the Stroessner years'''. The period remains an emotional subject for many Paraguayans, especially amongst the older generation.\n\n==Contact==\n; '''Diplomatic representation in the US''' : ''chief of mission:'' Ambassador James Spalding<br>''chancery:'' 2400 Massachusetts Avenue NW, Washington, DC 20008 <br>''consulate(s) general:'' Kansas City, Los Angeles, Miami, New Orleans, New York <br>''FAX:'' [1] (202) 234-4508 <br>''telephone:'' [1] (202) 483-6960 through 6962\n; '''Diplomatic representation from the US''' : ''chief of mission:'' Ambassador Liliana Ayalde <br>''embassy:'' 1776 Avenida Mariscal Lopez, Casilla Postal 402, Asuncion <br>''mailing address:'' Unit 4711, APO AA 34036-0001 <br>''telephone:'' [595] (21) 213-715 <br>''FAX:'' [595] (21) 213-728<br>''Website:'' [http://asuncion.usembassy.gov/] \n\n\n\n{{outline}}\n{{Countryguide}}\n\n\n\n[[ca:Paraguai]]\n[[de:Paraguay]]\n[[eo:Paragvajo]]\n[[es:Paraguay]]\n[[fi:Paraguay]]\n[[fr:Paraguay]]\n[[hu:Paraguay]]\n[[it:Paraguay]]\n[[ja:パラグアイ]]\n[[nl:Paraguay]]\n[[pl:Paragwaj]]\n[[pt:Paraguai]]\n[[ro:Paraguay]]\n[[ru:Парагвай]]\n[[sv:Paraguay]]\n[[wts:Category:Paraguay]]\n\n\n[[WikiPedia:Paraguay]]\n[[Dmoz:South America/Paraguay/]]\n[[World66:southamerica/paraguay]]\n\n{{isPartOf|South_America}}"
        }
    }
}