{
    "parse": {
        "title": "Seychelles",
        "pageid": 752,
        "wikitext": {
            "*": "{{pagebanner|Seychelles Banner.jpg}}\n\n\n{{quickbar\n| image=Seychelles 048.JPG\n| caption=Mahé Island\n| location=Seychelles in its region.svg\n| flag=Flag of Seychelles.svg\n| capital=[[Victoria (Seychelles)|Victoria]]\n| government=Republic\n| currency=Seychelles rupee (SCR)\n| area=''total:'' 455 km<sup>2</sup><br />''water:'' 0 km<sup>2</sup><br />''land:'' 455 km<sup>2</sup>\n| population=80,098 (July 2002 est.)\n| language=English (official), [[French]] (official), [[Seychellois Creole phrasebook|Creole]] (official)\n| religion=Roman Catholic 86.6%, Anglican 6.7%, other Christian 2.5%, other 4.1%\n| electricity=\n| callingcode=+248\n| tld=.sc\n| timezone=UTC+4\n}}\nThe '''Seychelles''' [http://www.seychelles.travel/en] are a group of 115 islands, only a few inhabited, in the Indian Ocean that lie off the coast of [[East Africa]], northeast of [[Madagascar]].\n\n==Understand==\nThe Seychelles were disputed between France and Great Britain during the age of colonialism, with Britain ending up in control in 1814 after the Napoleonic Wars. The islands achieved independence in 1976; however, free elections did not occur until 1993. The politics of this island group remain in something of a state of flux, although this should not bother the tourist seeking a relaxing beach vacation.\n\n==Regions==\n===[[Outer Seychelles]]===\nThe Outer Seychelles are corralline and mostly uninhabited. Visitors are rare; travel is via private yacht or remote airstrip on small local planes.\n\n{{Regionlist\n\n| region1name=Inner Seychelles\n| region1color=#8da8e6\n| region1items=''[[#Inner Seychelles|see below]]''\n| region1description=\n\n| region2name=Aldabra Islands\n| region2color=#e8e5ba\n| region2items=\n| region2description=\n\n| region3name=Amirante Islands\n| region3color=#e2f2a4\n| region3items=\n| region3description=\n\n| region4name=Alphonse Group\n| region4color=#bab4c8\n| region4items=\n| region4description=\n\n| region5name=Farquhar Group\n| region5color=#aae4b2\n| region5items=\n| region5description=\n\n| region6name=Southern Coral Group\n| region6color=#d6d1e5\n| region6items=\n| region6description=\n\n}}\n\n[[File:Seychelles regions map2.png|thumb|left|450px]]\n\n<br clear=\"all\" />\n\n===Inner Seychelles===\nThe vast majority of the Seychelles' population lives on these granite islands, home to the bulk of the country's resorts.\n\n{{Regionlist\n| regionmap=Inner Seychelles regions map.png \n| regionmaptext=\n| regionmapsize=240px\n\n| region1name=[[Mahé]]\n| region1color=#4e92bf\n| region1items=Sainte Anne Island, Cerf Island, Marnelle Island\n| region1description=\n\n| region2name=[[Praslin]]\n| region2color=#d46c75\n| region2items=Curieuse Island, Aride Island, Cousin Islands\n| region2description=\n\n| region3name=[[La Digue]]\n| region3color=#568d85\n| region3items=Félécite Island, The Sisters, Marie Anne Island\n| region3description=\n\n| region4name=[[Silhouette Island]]\n| region4color=#d4db75\n| region4items=North Island\n| region4description=\n\n| region5name=[[Inner Corallines]]\n| region5color=#d4db75\n| region5items=Denis Island, Bird Island\n| region5description=\n\n}}\n\n==Cities==\n\n*[[Victoria (Seychelles)|Victoria]] - is the Capital City\n\n* [[Anse Boileau]]\n* [[Anse Royale]]\n* [[Anse Etoile]]\n* [[Beau Vallon]]\n* [[Glacis]]\n* [[Cascade]]\n* [[Takamaka]]\n\n==Other Destinations==\n\n==Get in==\n\nNo visa is required, but Seychellois (pronounced say-shel-wa) authorities make sure you are not entering to stay for good. Therefore, the following items MUST be presented to the immigration officer:\n\n* A passport valid on the date of entry to and exit from Seychelles.\n* Your return ticket.\n* Your hotel voucher.\n* At least 150 USD per day. They will ask for cash, show them. If you have credit cards, show them - you may be asked for the credit balance you have. \n* A statement of good health and a statement that you are not importing plants or infected animals (The flight attendants in your flight will provide you these papers).\n\nVisitors without pre-booked accommodation are likely to be compelled to book one at the airport for the length of their stay before being allowed to leave the airport.  An initial entry permit is granted for 1 month but can be extended for a maximum of 3 months at a time up to a maximum of 1 year in total. See the official travel web-site [http://www.seychelles.travel/en/plan_your_visit/entry_formalities.php].\n\n\n\n===By plane===\nThe only international gateway to the Seychelles is Seychelles International Airport (SEZ) near [[Victoria (Seychelles)|Victoria]]. Air Seychelles [http://www.airseychelles.com]. International service is also available from Addis Ababa (Ethiopian Airlines [http://www.ethiopianairlines.com]), Nairobi (Kenya Airways [http://www.kenya-airways.com]), Dubai (Emirates [http://www.emirates.com]), Abu Dhabi (Etihad [http://www.etihadairways.com]), Colombo (Sri Lankan Airlines [https://m.srilankan.com]), Doha (Qatar Airways [http://www.qatarairways.com]), and regular charter services from Frankfurt (Condor [http://www.condor.com]).\n[[Image:Victoria.jpg|thumb|250px|Centre of Victoria]]\nNow Mihin Lanka of Sri Lanka connect Colombo to Victoria.\n\n===By boat===\nThe strict controls imposed on cruising yachts in the early 1990s have been gradually lifted and rules and regulations are no longer so complicated. However, some restrictions remain in force, mostly for the sake of environmental protection as most of the islands are surrounded by coral reefs near the surface.\n\n==Get around==\n===By plane===\nAir Seychelles [http://www.airseychelles.com/] operates multiple daily flights between Mahe and Praslin.  Over two dozen flights vary in frequency from 15 minute to 2 hour intervals, depending on time of day.\n\nOn Mahe the flights depart from the modest domestic terminal, located just next to the international terminal. The tiny airport on Praslin is modern and comfortable.\n\nAir Seychelles also operates once daily or several times per week between Mahe and the islands of Bird, Denis, Fregate, Desroches and Alphonse.  Assumption Island and Coetivy can be reached by air charter.\n\n===By helicopter===\nZil Air provides charter helicopter flights to/from most of the inner and outer Seychelles islands. It is the only scenic flight operator in the Seychelles. Scenic flights can be booked to cover the main islands of Mahé, Praslin, La Digue and the surrounding smaller islands of (among others) Cousine, Félicité, Grande Seour, Curieuse and Bird Island.\n\n===By boat===\nAs of June 2013, online bookings and e-ticketing has been made possible for trusted ferry operators in the Seychelles by '''Seychellesbookings'''. Cat Cocos and Inter Island ferry offer their routes between Praslin, Mahe and La Digue through this site, making live seat availability and reservation accessible online for the first time. They also offer a range of discounts on Island accommodation, restaurants and activities to complement ferry bookings.\n\nCat Cocos operates 2 catamaran ferries (With a 3rd ferry coming into service in 2013) serving multiple daily crossings between [[Mahe]] and [[Praslin]] and a daily crossing extension to La Digue. The sailing normally takes one hour. Non residents should budget roughly between €90 and €100 per person (price at July 2013) for a same day return ticket from Mahe to Praslin. Tickets can be purchased from the Cat Cocos office, opposite the pier, on the same day before travel subject to availability. Alternatively, e-tickets can be purchased online at Seychellesbookings.\n\nSimilarly, Inter Island Ferry operate a route betwen Praslin and La Digue with 8 daily departures taking only 15mins in crossing time. Tickets cost around €15 for an adult single, and can be purchased at the office or online with Seychellesbookings. Most arrivals at Praslin are timed to coincide with Cat Cocos departures to Mahe.\n\nBelle Serafina, a small schooner ferry makes the passage between Mahe and Praslin or La Digue in 3-4 hours, usually departing weekdays shortly around 12 from Mahe and heading back at 5AM from La Digue to Mahe. In November 2013 the price for the passage was 20 euros. Schedules and routing need to be confirmed by phone.\n\nIt is also possible to take small boats from Mahe direct to La Digue, although departures can be unreliable, there is limited wet weather cover and the journey takes about 3 hours (but that's cheaper than an Indian Ocean Island cruise!)\n\n===By car===\nDriving in Seychelles is on the '''left''' side of the road. The roads on Mahe are low-traffic, mountainous, narrow roads, so caution is generally advised. The roads usually have steep drops or low walls on the side instead of curbs, which can make driving on the narrow roads stressful, especially if driving a large vehicle. If you are used to driving on the right and you arrive on Mahe seriously jet lagged, a taxi to the hotel may be a good idea, even if you eventually plan to rent a car.\n\nThere are also few places where one could pull over to admire the view, study the map or such. Whenever you see a combination of wide curb and an interesting stop, you should take advantage of the situation.\n\nThe traffic situations on the roads can change rapidly. There are no sidewalks, so keep your eyes open for pedestrians. Also you should know that even on narrow winding mountain roads a buss or a truck might be coming at you just behind the next tight turn. Keep to the left and slow down whenever a hairy situation develops. Around Victoria you should also be prepared for sudden traffic jams.\n\nHaving a car is really a good idea and makes life much more simple. For as little as 100 rupees worth of gas you can see the entire island of Mahe in a couple of days, including stops at beaches and whatever else catches your eye. There is free parking in 'downtown' Victoria on Mahe, and if you go with a B&B or self-catering option for accommodations its by far the easiest way to pick up groceries. A car will also allow you access to the stores where locals do their regular shopping, and the prices are more reasonable as compared to the small convenience stores along the beaches. \n\nYou can only rent on Mahé and Praslin. You can find a small car (eg: Hyundai Atos) for around €35-€45 per day, but keep in mind that renters must be at least 21 years old, have a valid driver's license, and have at least three years of driving experience. There are several car hire counters outside the arrivals hall at Mahe international airport, which provides a convenient way to compare prices. Prices can be negotiated, with the better rate available for rental periods of 3 consecutive days or more. The 'excess' payable by the customer in the event of a claim, ranges from €300 to €1000 depending on the company, so choose carefully and ask the right questions.\n\nTaxis are a popular means of transportation for both short trips and day rental and can be obtained almost anywhere. Taxi prices for non-residents (approx. 20 rupees/1.3Euros per km as of Sept 2010) on a relatively long trip, can easily exceed the cost of hiring a small car for a day.\n\n===By bus===\nSeychelles Public Transport Corporation (SPTC) runs daily bus services on the islands of Praslin and Mahe from morning to evening on nearly every available road on the island. The bus usually passes by every 15 minutes.\n\nAlthough the bus will get you there, the schedules aren't tight and the drivers are a bit bold on the very narrow roads if you're a nervous passenger.\n\n==Climate==\nSeychelles is hot and humid, with an average yearly temperature of 84°F (29°C), and average sea temperature rarely dropping below 81°F (27°C). However, the heat is usually mitigated by refreshing sea breezes, especially by the beaches.  The cooler season in Seychelles is during the southeast monsoon season (May to September) and the warmer season is during the northwest monsoon (November to March). April and October are \"changeover months\" between the two monsoons, when the wind is variable. The northwest monsoon season tends to be warmer with more rain, while the southeast monsoon season is usually drier and cooler.\n\n==Talk==\nLanguages spoken in the Seychelles are [[Seychellois Creole phrasebook|Seychellois Creole]], English and [[French]]. With the smallest ability in French or English you'll be able to get around just fine, and a little effort, even a few basic phrases, will assist.\n\n==See==\n\n=== Culture ===\n\nSeychelles is not well-known as culture destination, but those who spend their entire vacation on the beach do miss out on several interesting sights.\n\n* '''The Arulmigu Navasakti Vinayagar Temple''' in Victoria is the centre of Hinduism on the islands. The temple is beautifully decorated and the ceremonies of the temple are interesting to see. Visitors are welcome, and discreet photography is allowed. Footwear should be removed and left in the vestibule. Please turn off your phone and avoid loud talking.\n\n* '''Seychelles Natural History Museum''' in Victoria is small, inexpensive and interesting. Visitors will learn about the unique nature and geology of the islands.\n\n* '''The ruined youth village of Cap Ternay''' is located at the end of a narrow one lane road on Mahe. This quiet and eerily beautiful place is best enjoyed by those who spend a bit of time beforehand reading about the site's history.\n\n=== Nature ===\n\n* '''Vallee de Mai''' on Praslin is a national park and world heritage site, home to amazing flora and fauna, including the world's largest seed: the coco de mer. The remote paths far from the entrance are less crowded and offer the best views, but can be rough and steep. Wear sturdy shoes and bring a water bottle. It is also a good idea to start the visit with a guided tour so that you can fully appreciate the unique features of the park. Entrance fee: Free for residents, 315 rupees (~20Euros) for foreigners (Sept 2010).\n\n* '''Beaches''' on the Seychelles also good for activities other than swimming and tanning. Especially during low tide one can spot interesting wildlife there. Find a deserted beach and move quietly, and you may be rewarded by sightings of ghost crabs, leaping blennys, flying fish and many other species.\n\n=== Beaches ===\n\n==Do==\n'''Visit the beaches'''. Many of the beaches are untouched by man's influence and are refreshingly uncrowded. They offer clear blue skies and a tranquility you will rarely find. A hike along the coastline from Beau Vallon to Anse Major will take about 1.5-2 hours and your reward will be a small deserted beach that's fit for a king. The scenery along the hike is breathtaking. Not all beaches are suitable for swimming depending on the time of year, due to the seasonal winds. Do not ignore warning signs indicating that a beach is hazardous for swimming, no matter how it seems to you.\n\nThe conditions on the beaches depend on the strength and direction of wind, absence or presence of a protective reef and the tide. One should not worry, however, because Seychelles has beaches in abundance, and if the conditions on one beach are not good, a perfect beach may be only 5 minutes drive away.\n\n'''Aldabra Atoll''': The world's largest coral atoll that stretches about 22 miles east to west and encloses a huge tidal lagoon. Aldabra is the original home of the giant land tortoise and tiger sharks and manta rays can also often be seen here.\n\n'''Watersports''': The warm Indian Ocean waters make Seychelles the perfect place for the water enthusiasts.  Explore on board a yacht, power boat, catamaran or sailboat. Windsurfing is also popular and the best time for this activity is usually around May then in October, at the start and end of the trade winds. \n\nScuba diving, snorkeling, and fishing are also extremely popular and can be done almost anywhere in Seychelles. Baie Ternay is superb and easily acccessible by glass bottom boat tour from Beau Vallon beach - leave yourself an empty day and walk the beach for a 'last minute' booking - great deals can be bartered. Snorkeling (provided you have your own gear - some hotels lend masks, snorkels and fins to guests) is FREE and there are many great spots: off some of the small beaches at Glacis, past Mouse Island at Anse Royale, along the reef at Port Launay (near Ephelia Resort). Often spotted are a wide array of tropical fish, sea turtles, eagle rays and more!\n\n'''Land Sports''': Golf, tennis, squash, badminton, horseback riding, biking and hiking are some of the recreational activities available on the Seychelles Islands. Bike rentals and walking tours are great ways to sightsee and since distances are relatively short and the scenery is beautiful, walking is probably the best way to see the smaller islands (La Digue, Praslin), while walking along the main road can be quite intimidating as the roads are narrow and local cars/busses drive quite quickly. On Mahe it is not advised to ride bicycles, and there are no rental shops within sight. Bird watching is also popular and the islands are home to many of the worlds most treasured and rare species of animals.  The best place to do so is Cousin Island which although only 1 km (0.6 miles) in diameter, is home to more than 300,000 birds, but many unique species can be found at ease on Mahe. \n\n'''Nightlife''': Do not miss most popular Nightclub \"Lovenut\" in the centre of Victoria, 100 metres walk from central Taxi station. Also entertaining are \"Tequila Boom\" at (Bel Ombre) and \"Katiolio\" (near Anse Royale) night clubs. \"Katiolio\" was one of the first nightclubs to open on Mahe and boats an open-air that is directly beside the ocean.\n\n'''International Charter Group''':[http://www.barcosbarcelona.com]. Yacht charter and sailing, one of the worlds largest yacht charter companies, can take care of all charter requirements, from bareboat to crewed in the Seychelles. Operating from nine offices worldwide (USA, Spain, UK, Germany, Italy, France, Spain, Switzerland, Caribbean, Honk Kong and Dubai).  \n\n'''Hiking''' There are several maintained hiking routes on the main island of Mahe and a few on Praslin. The Seychelles tourism office has a few descriptions of the hiking routes with maps available to be purchased. Check out openstreetmap [http://www.openstreetmap.org/#map=12/-4.61667/55.45] for some hiking tracks around the islands.\n\nSeychelles also has numerous markets, art galleries and shops, colonial Creole-style plantation houses, and the main island of Mahé has six museums, a botanical garden, and several national monuments. The market downtown Victoria has a good selection of local produce, and spices for sale that are all grown locally and 100% authentic.\n\n==Learn==\n\nThe University of the Seychelles [http://www.usaim.edu/] has a medical degree for Americans.\n\nPublic education has been free and mandatory for a ten years period of primary schooling, for children ages six to 16 since 1980.  Primary education is followed by five years of secondary education. Seychelles does not provide education at university level, but there is a teacher training college and a polytechnic institute, and as mentioned above, the University of Seychelles - American Institute of Medicine does exist.  Because of the absence of higher education facilities, many students study abroad, mostly in the United Kingdom.\n\n==Work==\n\nWorking and doing business in the Seychelles can be difficult due to the the humidity and heat. Forget about wearing a suit or anything resembling one; rather, opt for a light cotton shirt and pants. The atmosphere in the Seychelles is relaxed and it can take a lot of effort to achieve very little. \n\nTourism is one of the most important sectors of the economy. In fact, about 15 percent of the work force is directly employed in tourism, and employment in banking, transportation, construction, and other activities is closely tied to the tourist industry.\n\n==Buy==\nThe islands' currency is the '''Seychelles rupee''' (SCR). To get the best rates, use credit cards as much as possible, and get your cash from ATMs. However, it is also possible to buy rupees from the airport and from several banks. Credit cards and European debit cards are widely accepted, with the notable exception of gas stations. Petrol must be paid with cash.\n\nTrading in foreign currency, long illegal, was legalized in November 2008, and the currency freely floated. This has also wiped out the previously wide-spread black market, which offered up to twice the official rate. The £ buys around 21-22 Rupees on Jan 2012. \n\n===Shopping===\nThe best place for shopping is Victoria, the capital, and more specifically the market at the city centre. There are also a few outlets on the island, Praslin, but few shopping areas on the other islands. Larger hotels have boutiques but shopping in Seychelles is not one of the major attractions.\n\nSmall grocery stores, usually run by the Indian community, are found all over the islands. These are, however, not particularly cheap, and have little or no local flavor. If doing self catering, the large hypermarket at the outskirts of Victoria is an option. The supermarket is boring, but also efficient and inexpensive.\n\nWhile visiting, be sure to buy the classic and traditional Seychelles souvenir, the coco-de-mer, or the 'nut of the sea,' a nut from trees native to the islands in the Seychelles - but this requires an export licence. Other locally made souvenirs, although not as unique, can be purchased like sea shell and pearl jewellery, textiles and straw hats, in addition to needlework & crochet, paintings by local artists and woodwork.\n\n===Tipping===\nMost service providers already include a service charge of 5% - 10%. Tipping is not obligatory in the Seychelles, however, any extra change is greatly appreciated.\n\n==Eat==\nSeychellois cuisine has been greatly influenced by the islands' rich cultures. Creole cooking, varied seafood dishes, coconuts and curries are the most popular.   The main product of the country, fish, is cooked in a variety of ways. Especially the red snapper is very tasty and well known to visitors. \n\nCheapest food: Collect coconuts on the beach and learn how to open their terrible cover (not the shell, that's easy; they have a thick cover of natural fibres; to open it: hit the coconut very strongly many times on the edges, sooner or later the fibres break up).\n\n==Drink==\nSeychelles offers a fantastic nightlife scene that caters to tourists. The active nightlife is mostly located around the larger hotels and in addition to theatres, cinemas and discos, there are numerous fun and trendy restaurants.\n\nIf you enjoy a good beer you must try the local Seybrew beer, it tastes similar to a light Bavarian style beer and is a must to get you through those balmy days. You can save yourself a packet buying the beer from stores on the side of the road like the locals do rather than from hotels. \nA dark Takamaka Rum on the beach under the stars is the best way to end a day on the Seychelles.\n\n==Sleep==\nThe Seychelles are not tolerant of backpackers turning up at the airport without accommodation booked. In such a situation, you will likely be taken to a counter where you will have to book & pay for accommodation for the duration of your trip before being allowed through immigration. Visitors need to provide details of their accommodation on their landing card (Hotel Name, address, phone number), and additionally, being questioned by the immigration officer about their accommodation details (\"Is your booking at hotel <x> confirmed?\" etc..)\n\nMost accommodations are relatively expensive and some islands have only one hotel. In fact, some of the islands aren't even permanently inhabited and accommodation can be found on fewer than 10. Your best bet for a budget bed is renting an apartment or bungalow, which are available at better rates.  Also keep in mind that hotel prices greatly increase and accommodation can be hard to find during the peak seasons from December to January and July to August. Holidays such as Easter can also get very busy.\n\nMost resorts can be found on the main islands of [[Mahe]] and [[Praslin]].  A few (very) high end ones, like the [[North Island (Seychelles)|North Island]], have their own private islands. Additionally, you will find an array of 'small hotels' which can be ideal as a get-together venue with that special feeling of exclusiveness.\n\n<!-- place listings in the island/city articles, not here -->\n*<sleep name=\"AVANI Seychelles\" alt=\"\" address=\"PO Box 626, Victoria, Mahe, Seychelles\" directions=\"\" phone=\" +24 8 4 673 000\" url=\"http://www.minorhotels.com/en/avani/seychelles-barbarons\" checkin=\"at 12.00 pm\" checkout=\"at 10.00 am\" price=\"USD 270\" lat=\"(-4.683192)\" long=\"55.454335\">The Avani Seychelles Barbarons Resort and Spa is located in Mahe, Seychelles with an magnificent sea view. Ideal for couples, the resort offers beautifully designed rooms and suits for your preference.  Main resort activities include water sports, gym, horse riding and traditional cooking classes for tourists.\n</sleep>\n\n\n==Stay safe==\n\nTry to avoid any dark lanes, and always be careful not to leave your bag unattended. Swimming alone on isolated beaches is not advisable. If you sail, avoid bringing valuables; if you have no choice, become adept at finding great hiding places.   \n\nThere is some social activity along a secondary road behind Beau Vallon beach (left from the Boathouse restaurant), but locals mostly seem content to admire their flashy cars and mostly ignore passers-by.\n\nThere are newly instituted tourist police stationed at every beach on Mahe and are easily recognizable by their blue or white golf shirts, with a tourist police badge sewn on.\n\nThey are very friendly and more than willing to help keep a good eye, even though you may not see them. They are honest and freely offer advice. Potential thieves are obvious (mostly due to lurking and just stand out from the locals) and tend to hide just off the beach or across the narrow streets near more out of the way beaches. Jail terms are stiff and are strictly enforced since the island makes lots of money from tourism.\n\nActual tourist scams are very rare, but it is advisable to check all bills at the restaurants and other establishments before paying.\n\n==Stay healthy==\nChikungunya virus is a disease spread by mosquitoes, and causes flu-like symptoms. It is increasing in concern and although it is rare to die from it, the joint pain it causes can last for months. Insect repellent can help deter mosquitoes but not much else can be done as a precaution. The disease is native to East Africa and occasionally is introduced and quickly eradicated.\n\nTap water is safe to drink on Mahe and Praslin, but water quality is variable in undeveloped areas.  It is recommended to drink bottled water only and to avoid bodies of fresh water like lakes, rivers, ponds, etc.\n\n==Respect==\n\nThe attitude towards manners and dressing is generally relaxed, and common sense and common courtesy are usually enough to keep one out of trouble. Shorts and T-shirts can be worn almost everywhere, although very revealing clothing, such as bikini tops, should only be worn on the beaches, especially if one is planning to visit a place of worship. Dress shirt and long trousers are appropriate for a night out in Victoria or for a dinner in an upscale establishment.\n\nNature is a treasured aspects of the islands. Do not litter or disturb wildlife or plants.\n\n==Contact==\n\nThe Seychelles Tourism board is a great point of reference and they will be able to answer any and all questions you might have. Their website is www.seychelles.travel\n\n==Cope==\n\n===Embassies/consulates===\nThere are only six embassies/High Commisions and another dozen or so consulates. The Chinese embassy is an attraction itself while the multilevel, colonial-era Victoria House on the corner of Francis Rachel & State House Streets is home to several of these consulates.\n\n* <see name=\"Belgium\" alt=\"\" address=\"Victoria House, Victoria\" directions=\"\" phone=\"224434\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\"></see>\n* <see name=\"France\" alt=\"\" address=\"Victoria House, Victoria\" directions=\"\" phone=\"382500\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"\"></see>\n* <see name=\"Greece\" alt=\"\" address=\"Victori\" directions=\"\" phone=\"+248 373050\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"+248 373456\"></see>\n\n* <see name=\"India\" alt=\"\" address=\"Le Chantier\" directions=\"\" phone=\"4610301\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"\"></see>\n* <see name=\"Mauritius\" alt=\"\" address=\"Anse aux Pins\" directions=\"\" phone=\"376441\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\"></see>\n* <see name=\"Netherlands\" alt=\"\" address=\"Glacis\" directions=\"\" phone=\"261200\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\"></see>\n* <see name=\"Norway\" alt=\"\" address=\"Victoria House, Victoria\" directions=\"\" phone=\"225366\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\"></see>\n* <see name=\"Sweden\" alt=\"\" address=\"New Port, Victoria\" directions=\"\" phone=\"224710\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"\"></see>\n* <see name=\"Switzerland\" alt=\"\" address=\"Victoria\" directions=\"\" phone=\"371050\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"\"></see>\n* <see name=\"United Kingdom\" alt=\"\" address=\"Oliaji Trade Centre, Victoria\" directions=\"\" phone=\"225225\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"\"></see>\n* <see name=\"United States\" alt=\"\" address=\"Victoria House, Victoria\" directions=\"\" phone=\"225189\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"\"></see>\n\n==Get out==\n\n* Try [[Comoros]], [[Mauritius]], and [[Madagascar]]\n\nMany tourists travel to these alternative destinations because of their similarity and the fact that they do not have as high of prices for accommodation, travel and other daily expenses, which incur in Seychelles due to the island's high exclusivity. Or viewed in another perspective: The Seychelles are small disperse mountainous islands with poor transport infrastructure, prices in the tourism related industry will always remain high as the infrastructure will never be able to cope with mass tourism numbers.\n\nThe common perception of Seychelles only offering an expensive accommodation, however, is an unfortunate one as you truly are likely to find accommodation to fit into almost everyone’s budget. Some establishments will offer you a double room for two persons starting at €65. At this cost you will not have many luxuries, but you will have the Creole hospitality that has made these islands so famous.\n\n{{isPartOf|East_Africa}}\n\n[[ca:Seychelles]]\n[[de:Seychellen]]\n[[eo:Sejŝeloj]]\n[[es:Seychelles]]\n[[fi:Seychellit]]\n[[fr:Seychelles]]\n[[hu:Seychelle-szigetek]]\n[[it:Seychelles]]\n[[ja:セーシェル]]\n[[nl:Seychellen]]\n[[pl:Seszele]]\n[[pt:Seicheles]]\n[[ru:Сейшельские острова]]\n[[sv:Seychellerna]]\n[[wts:Category:Seychelles]]\n\n[[WikiPedia:Seychelles]]\n[[Dmoz:Africa/Seychelles/]]\n[[World66:africa/seychelles]]\n\n{{outline}}\n{{Countryguide}}"
        }
    }
}