{
    "parse": {
        "title": "Slovenia",
        "pageid": 764,
        "wikitext": {
            "*": "{{pagebanner|Slovenia Banner.jpg}}\n\n{{Quickbar\n|image=Ciao 533.jpg\n|caption=Ljubljana\n|location=Slovenia in its region.svg\n|flag=Flag of Slovenia.svg\n|capital=[[Ljubljana]]\n|government=Parliamentary Republic\n|currency=Euro (€)\n|area='''total'''&nbsp;20,273&nbsp;km²\n|population=1,992,690 (2013 estimate)\n|language=[[Slovenian]]\n|religion=Catholic&nbsp;57.8%, Muslim&nbsp;2.4%, Orthodox&nbsp;2.3%, other or unspecified&nbsp;27.4%, none&nbsp;10.1%\n|electricity=230V/50Hz (European plug)\n|tld=.si\n|callingcode=386\n|timezone=UTC&nbsp;+1 '''DST'''&nbsp;UTC&nbsp;+2\n|emergencies=dial&nbsp;'''112'''<br />Police:&nbsp;113\n}}\n\n[http://www.slovenia.info/ '''Slovenia'''] (''Slovenija'') is a member of the [[European Union]], Schengen Agreement and NATO. Not to be confused with ''[[Slovakia]]''. The country lies in South Central Europe in the Julian [[Alps]] at the northern end of the Adriatic Sea, bordered by [[Austria]] to the north, [[Italy]] to the west, [[Hungary]] to the northeast, and [[Croatia]] to the southeast. Despite its small size, this  Alpine country controls some of Europe's major transit routes.\n\nPreviously one of Yugoslavia's six constituent republics, present-day Slovenia became independent in 1991. Historical ties to Western Europe, a strong economy, and a stable democracy have assisted in Slovenia's transformation to a modern state.\n\nIndustry\nSlovenia's main industries include car parts, pharmacy, electronics, electrical appliances, metal goods, textiles and furniture. It has a Mediterranean climate on the coast, continental climate with mild to hot summers, and cold winters in the plateaus and valleys to the east.\n\n===History===\nSlovenes settled the region in the 6th century, when they were incorporated together with Bavarians and Franks. At that time, Christianisation took place. Afterwards, the Slovene lands were part of the Holy Roman Empire, and later they were part of the Austro-Hungarian Empire until the dissolution at the end of World War I in 1918 - when the Kingdom of Serbs, Croats and Slovenes was formed, and turned into a multinational state named Yugoslavia in 1929. After Slovenia was occupied by the Axis powers and later liberated by the Partisans with the help of Western Allies in World War II, Slovenia became a republic in the renewed Yugoslavia, which although communist, distanced itself from Moscow's rule. Dissatisfied with the exercise of power by the majority Serbs, Slovenes succeeded in establishing their independence in 1991 after a short 10-day war. Slovenia acceded to both NATO and the EU in 2004, and joined the eurozone and the Schengen Area in 2007, completing the final steps of accession to the European Union.\n\n===Economy===\nSlovenia became the first 2004 European Union entrant to adopt the euro on 1 Jan 2007 and has experienced one of the most stable political and economic transitions in Central and Southcentral Europe. With the highest per capita GDP in Central Europe, Slovenia has excellent infrastructure, a well-educated work force, and a strategic location between the Balkans and Western Europe. Privatization has lagged since 2002, and the economy has one of the highest levels of state control in the EU. Structural reforms to improve the business environment have allowed for somewhat greater foreign participation in Slovenia's economy and helped to lower unemployment. Slovenia became the first transition country to graduate from borrower status to donor partner at the World Bank in March 2004. Slovenia became an OECD member in 2012. Despite its economic success, foreign direct investment (FDI) in Slovenia has lagged behind the region average, and taxes remain relatively high. The labour market is often seen as inflexible, and legacy industries are losing sales to more competitive firms in China, India and elsewhere. The global recession caused the economy to contract - through falling exports and industrial production - by 8%, and unemployment to rise in 2009. The economic growth resumed in 2010, but dipped into negative territory with the unemployment rate approaching 12% in 2012.\n\n===Culture===\nOlder Slovene cities have historic influences by baroque (Austrian) and Roman (Italian) architectures. Part of both, the countryside and city architecture in the northwest, shares many commonalities with neighbouring Austria, including countless baroque shrines and steeples. The [[Ljubljana]] capital was founded in Roman times; today its university has over 50,000 students.\n\nThe most famous Slovenes include the poet France Prešeren (1800-1849) who penned the Slovene national anthem, and the architect Jože Plečnik (1872-1957) who is credited with Ljubljana's iconic [[#See|Triple Bridge]].\n\n===Terrain===\nFour major European geographic regions meet in Slovenia: the Alps, the Dinaric area, the Pannonian plain and the Mediterranean. Slovenia's highest mountain, the three-peaked Triglav, is depicted on the national flag. Main tourist attractions include the famous caves with their decor of stalactites and stalagmites in [[Postojna]]. \n\nSlovenia has a 46&nbsp;km long coastal strip on the Adriatic, an alpine mountain region adjacent to Italy and Austria, mixed mountains and valleys with numerous rivers to the east. Slovenia's highest point is Mount Triglav at 2,864&nbsp;m. Natural resources include lignite coal, lead, zinc, building stone, hydropower and forests.\n\n==Regions==\n{{Regionlist\n|regionmap=Slovenia regions map.png\n|regionmaptext=Regional map of Slovenia.\n|regionmapsize=upright=1.8\n\n|region1name=[[Coast and Karst]]\n|region1color=#d5de76\n|region1items=[[Ilirska Bistrica]], [[Piran]], [[Postojna]], [[Sežana]], [[Koper]]\n|region1description=The southwestern side of Slovenia with hills, caves and the coastline.\n\n|region2name=[[Julian Alps]]\n|region2color=#71b37b\n|region2items=[[Bled]], [[Idrija]], [[Jesenice]], [[Triglav National Park]]\n|region2description=The mountainous northwest lakes and Mount Triglav.\n\n|region3name=[[Central Slovenia]]\n|region3color=#8a84a3\n|region3items=[[Kamnik]], [[Kranj]], [[Ljubljana]]\n|region3description=The central region with the capital city.\n\n|region4name=[[Southeastern Slovenia]]\n|region4color=#d09440\n|region4items=[[Dolenjske Toplice]], [[Kočevje]], [[Novo Mesto]]\n|region4description=The southeastern region with Krka and lower Sava rivers.\n\n|region5name=[[Pohorje-Savinjska]]\n|region5color=#b5d29f\n|region5items=[[Savinja and Šalek Valley]],[[Celje]], [[Trbovlje]], [[Velenje]], [[Žalec]]\n|region5description=The northern region with mountains and the Savinja river valley.\n\n|region6name=[[Eastern Slovenia]]\n|region6color=#d56d76\n|region6items=[[Maribor]], [[Ptuj]], [[Murska Sobota]]\n|region6description=The northeastern region with the Drava and Mura rivers, and numerous vineyards.\n}}\n\n==Cities==\n[[Image:TartinjevTrg.JPG|thumb|Piazza Tartini in [[Piran]].]]\nBy size:\n*[[Ljubljana]] — the picturesque, pint-sized capital\n*[[Maribor]] — Slovenia's second largest city\n*[[Celje]] — one of Slovenia's oldest cities\n*[[Kranj]] — largest city in the northwest\n*[[Novo Mesto]] — largest city in the southeast\n*[[Nova Gorica]] — largest city on the Italian border\n*[[Koper|Koper/Capodistria]] — largest city on the Slovene coastline\n*[[Velenje]] — the eighth largest city in Slovenia\n\n==Other destinations==\n\n[[Image:Solčava Panoramic Road, European Destination of Excelence.JPG|thumb|Solčava Panoramic Road, [[Savinja and Šalek Valley]].]]\n\n*[[Logar Valley Natural Park]]  — one of the most beautiful alpine valleys, Lonely Planet described it as \"a land of incomparable beauty\"\n*[[Savinja and Šalek Valley]]  — great place for active holidays, picturesque land of natural parks and Pippi Family Festival\n*[[Bled|Bled]] — mountain lake with an island and a castle\n*[[Divača|Škocjan Caves]] — a [[UNESCO World Heritage Site]]\n*[[Julian Alps]] — hiking, skiing, Nordic walking \n*[[Postojna|Postojna Caves]] — enjoy the 5&nbsp;km ride through giant caves\n*[[Soča Valley|Soča/Isonzo Valley]] — where the emerald-coloured river flows\n*[[The Kolpa River]] — one of the intact [http://www.kolpariver.eu/en rivers] in Slovenia comprised of a 113&nbsp;km long strip of land that borders [[Croatia]]\n*[[Triglav National Park]] — home of the national symbol, Mount Triglav where you can enjoy exploring the Posočje area, canyoning, rafting, paragliding, hiking and mountaineering\n*[[Radovljica]] - tiny picturesque town in the Upper Carniola\n*[[Piran|Piran/Pirano]] - charming picturesque coastal town\n*[[Ankaran/Ancarano]] - pleasant town on Adriatic coast beween Triest and Piran\n\n==Get in==\n\n===Entry requirements===\n{{Schengen}}\n\n===By bus===\nThe [http://www.ap-ljubljana.si/eng/ Ljubljana Bus Station] (''Avtobusna Postaja Ljubljana'') provides composite information about international and airport bus services. Connections between the [[Italy|Italian]] city of [[Trieste]] and nearby [[Koper]] and [[Piran]] are frequent on weekdays. There's also a daily bus trip between Trieste and Ljubljana, and there are trips between [[Gorizia]] in Italy and its neighbor/twin town of [[Nova Gorica]] in Slovenia at least every hour throughout the day, although the trip can also be made on foot. This supplements the railway connection between the Italia and Slovenia, or an alternative entry point from either Trieste or Venice.\n\n===By plane===\nThe Ljubljana Airport (formerly named Brnik) is Slovenia's primary international airport and the hub of national carrier [http://www.adria.si/ Adria Airways], which flies to numerous cities across Europe and offers connections to Southeast Europe. The cheapest air connections are available via easyJet's daily flight from London Stansted Airport in [[England]].\n\nThe [[Ireland|Irish]] AerLingus runs flights from [[Dublin]] to [[Pula]] across the border in [[Croatia]]. Another convenient gateway to western Slovenia is via Italy's [[Trieste]] airport, which is an hour-long drive from Ljubljana via highway. The airport in [[Klagenfurt]], [[Austria]], is also an option. The Italian Treviso Airport, serving [[Venice]] and [[Treviso]], offers alternative entry points to Slovenia.\n\n===By train===\nSlovene railways are well connected to all neighbouring countries, except Italy where railway connections have gaps. The most popular routes connect from [[Vienna]] or [[Villach]] in Austria, from [[Budapest]] in [[Hungary]], from [[Zagreb]] in [[Croatia]]. To get around the poorer railway connection to Italy, travelers can board a train from other points in Italy to [[Gorizia]] and then take a bus, or walk to its neighbouring town [[Nova Gorica]] in Slovenia, where there are regular train lines to Ljubljana. For entries from [[Trieste]], it is advisable to take a bus or a taxi to [[Sežana]] where another train can be boarded.\n\nSeveral international routes and special offers exist for some destinations. Some destinations have tickets on contingency basis that can run out fast, but are usually very cheap, such as [[Ljubljana]] - [[Prague]] line priced €58 for a return ticket (compared to a normal price of €200). For return trips originating in Slovenia, open-dated City Star tickets, which usually require a weekend stay, are usually the cheapest choice. With the [http://www.euro26.org/ Euro26] youth card, a discount can be received on most international lines (the discount does not stack up with other special deals). The same card also applies for all domestic lines, with a 30% discount. \n\n===By car===\nThe [http://www.dars.si/ Slovene highway network] is well connected to all neighbouring countries, with a few poorer connections to Croatia on the Slovenian side. Slovenia requires that all vehicles with a permissible gross weight less than 3.5 tonnes buy a [http://www.dars.si/Dokumenti/Toll/Methods_of_payment/Vehicles_up_to_35_t/Vignette_308.aspx vignette] (road tax) before using motorways or expressways. For passenger vehicles, the vignette costs €15 for a week, €30 for a month, or €110 for a year. For motorcyclists, this costs €7.50 per week, €30 for 6 months, and €55 for a year. Using highways without a valid vignette can result in a fine of €300 or more. Vignettes are usually sold at borders and gas stations. There are posted signs advising a vignette purchase and border agents sometimes pass a flier advising travellers to buy one.\n\n====From Austria====\n*[[Vienna]] → [[Graz]] → [[Šentilj]] → [[Maribor]]\n*[[Villach]] → Karavanke Tunnel → [[Jesenice]]\n*[[Villach]] → Wurzenpass → [[Podkoren]] → [[Kranjska Gora]]\n*[[Klagenfurt]] → Loiblpass → [[Ljubelj]] → [[Kranj]]\n*[[Wolfsberg]] → [[Lavamünd]] → Vič → [[Slovenj Gradec]]\n\n====From Italy====\n*[[Venice]] → [[Trieste]] → Fernetti → [[Sežana]]\n*[[Trieste]] → Škofije → [[Koper]]\n*[[Venice]] → [[Gorizia]] → [[Nova Gorica]]\n*[[Tarvisio]] → [[Rateče]] → [[Kranjska Gora]] → [[Jesenice]]\n*[[Cividale del Friuli]] → Stupizza → [[Kobarid]] → [[Tolmin]]\n\n===By boat===\nA [http://www.kompas-online.net/pages/CruisesFerries/prince.aspx fast ferry] between [[Venice]] and [[Izola]] runs with an irregular schedule mainly during the summertime; the journey takes 3 hr. \n\n[http://www.venezialines.com/ Venezialines] runs another fast ferry each week between [[Venice]] and [[Piran]]. During the summertime, there is a fast craft service operated by Trieste Lines between [[Trieste]] in Italy, [[Piran]] in Slovenia, [[Poreč]] and [[Rovinj]] in Croatia. The portion of the journey between Piran and Trieste lasts 30 min, which is pretty much the same as a journey by car.\n\n==Get around==\nHitchhiking may be your best option to move around for free. Maps can be bought at gas stations for about €10, or at book stores for a slightly lower price. Getting around by car is generally painless when using highways, but those require a purchase of a [[#By car|vignette]]. Travellers may experience tougher times off the highways, or when using public transport. Bus schedules in particular have been slashed, so some planning ahead is required. Services are sparse and limited on Saturdays and Sundays.\n\n===By thumb===\n[[Hitchhiking]] in Slovenia works and is generally safe, but be aware that by hitchhiking you are playing a gambling game as some of the times you may not get a driver who doesn't expect you to kiss his ass for the favor of a free ride. The general rule is if the gut feeling is telling you to not take a ride when someone pulls over to pick you up, just ignore them and keep hitching. Hitchhikers may also have a better experience with female drivers, though they might not be the ones to offer you a ride as often as the male drivers.\n\n===By train===\n{{Infobox|Timetable decoder|D — Monday-Friday<br />\nD+ — Monday-Saturday<br />\nN — Sundays<br />\nNP — Sundays and holidays<br />\nPP — Monday-Friday<br />\nSN — Saturday-Sunday<br />\nŠ — School days<br />\nŠP — School holidays<br />\nV — Every day}}\n\nThe 1,228&nbsp;km long [http://www.slo-zeleznice.si/en/ Slovene Railways] (''Slovenske Železnice'' (SŽ)) train network will get travellers to most destinations in the country, although there are a few gaps in the network and routes can be circuitous, therefore train travel often requires passengers to move to another train in Ljubljana where all Slovene railway lines converge. Trains are usually 30% cheaper than buses, and return discounts are available on weekends. It's advisable to buy tickets before boarding, as there is a surcharge for any tickets bought from the conductor - except if tickets are not sold at the station. A €1.20 surcharge also applies to InterCity trains.\n\nThe railway system has been relatively modernized. The railway station names are typically only visible on station building signs, so figuring out to which station the train is arriving means constantly looking outside the correct window (sometimes it's on the right side, other times it's on the left side). A few newer trains have a voice announcement system that announces to which station the train is arriving. Trains are punctual (except some of the international trains), so travellers should check the expected arrival time and previous station names to be sure where to get off. For figuring out the next train from a station (electronic signboards are rare, but printed schedules are always available): ''odhod'' (yellow) means departure, while ''prihod'' (white) means arrival, although this is usually also indicated in English.\n\n===By bus===\nBuses fill the railway gaps, and are usually a better option for some towns not directly served by train (like [[Piran]]). Some bigger bus stations have electronic [http://www.ap-ljubljana.si/eng/ search engines for schedules and fares].\n\n===By car===\nThe 38,925&nbsp;km long Slovene road network is usually well maintained and signposted. Although travellers may encounter several roads being limited or blocked to traffic due to maintenance work or urgent repairs (especially in wintertime), travelling on main roads usually isn't problematic. There are many taxi services in Ljubljana, as well as car rental services, some of which are [http://www.izzicarhireslovenia.com/ offering older cars] for a lower price.\n\n==Talk==\nThe national [[Slovenian phrasebook|Slovenian]] language is spoken natively by 91.1% of the population, only 4.5% are native speakers of Serbo-Croat, but it is  widely understood. 4.4% (minority communities near the national borders) speak Italian and Hungarian. Spoken English is on the level of other European countries in the nearby region. Many Slovenes also have some knowledge of German, especially in the eastern region. \n\nSlovene schools teach foreign languages from primary school onwards. Students can study two foreign languages (most commonly English and German) by the time they get to grammar school. Grammar schools often teach an optional third foreign language ([[French]], [[Italian]] or [[Spanish]]). While most of the younger Slovenes speak English fluently, older residents are more skilled in [[Serbo-Croatian]] and [[German]], while some of them can also read Cyrillic.\n\nIn conclusion, Slovenian language is a part of Southern-Slavic languages, so in case you don't speak English but do speak other Slavic languages (Especially Serbo-Croatian is widely understood) you can try it, as Slavic languages are very related to each other.\n\n==See==\n[[Image:Ljubljana, Slovenia - The Triple Bridge.jpg|thumb|Ljubljana's Triple Bridge.]]\nThe National Museum of Slovenia in [[Ljubljana]] (Presernova 20, entrance from Muzejska Street), is the oldest and largest Slovene museum. It was founded in 1821. The museum building on the Museum Street was built in 1888. It was the first building assigned solely to Slovene culture. Today, the museum stores a rich collection of valuable objects. The oldest ones date back to the Stone Age, while there are also newer ones that are still used in today's modern times.\n \nThe new building of the [http://www.nms.si/ National Museum of Slovenia] on the (Metelkova, Maistrova Street 1), exhibits collections of the applied art heritage of Slovenia. The permanent exhibition brings together objects of applied arts from the 14th century to the present day.\n\nIn [[Savinja and Šalek Valley]] there are many Slovenian natural and cultural pearls:\n\n*Logar Valley Landscape Park with splendid Rinka Waterfall (90 m),\n*Solčava Panoramic Road with great vistas on Kamnik-Savinja Alps,\n*Cathedral of St Mohor and Fortunat in Gornji Grad (the most voluminous Slovenian chatedral),\n*Snežna jama Cave, the highest tourist cave in Slovenia,\n*Coal Mining Museum with three Velenje lakes.\n\n==Do==\n\n[[File:Raduha Savinja and Šalek Valley Adventure Mosaic Mountaineering in Slovenia.JPG|thumb|Mt Raduha (2062 m) in Kamnik-Savinja Alps, [[Savinja and Šalek Valley]]. ]]\n\nThe mountains and rivers of the Julian Alps and of the Kamnik-Savinja Alps provide the perfect location for skiing, hiking, mountain biking, rafting and kayaking. \n\nThe southern region is an area of numerous caves. \n\nTravellers can enjoy different spa resorts in the eastern region, take a dive in the Adriatic Sea, visit cities, or enjoy the countryside cuisine and local wine. \n\nTravellers can also visit [[Bled]]'s alpine resort and its lake with an island, the massive stalactites and stalagmites in the Postojna caves where the graffiti indicate that the first tourists came there in 1213, pure, picturesque and nostalgic alpine world of [[Savinja and Šalek Valley]], the lively coastal town of [[Piran]], the Soča river, or the Trenta valley.\n\n==Buy==\nStores are friendly and filling stations usually provide free access to toilets, water and quick washing necessities (by the sink).\n\n===Currency===\n{{Euro}}\n\n===Costs===\nPrices are generally high compared to the rest of the [[European Union]]. Some prices vary depending on location. For example, a half-litre beer is usually sold at half the price outside [[Ljubljana]] compared to pub sales inside the city.\n\nA value-added tax (VAT) of 22% (with a reduced rate of 9.5% usually applied to foods and some soft drinks) is charged on most purchases, and is always included in the displayed price tags. Non-EU residents are entitled to get this tax back for purchases over a certain value when the goods are exported. Travellers can ask the cashier to write down their name on a bill, then they can show this bill for tax returns when leaving Slovenia through Ljubljana Airport or any of the main border crossings with [[Croatia]].\n\n===Tipping===\nUsed not to be expected in Slovenia. However, in recent years, tips are becoming more common, especially in some of the areas highly visited by tourists. Common tip is 10-15%.\n\n===Shopping===\nYou can make relatively cheap purchases of groceries and other common supplies in several supermarkets, such as the Slovene supermarket chains of [http://www-en.mercator.si/ Mercator] (international retailer with city-malls with various other smaller local and international stores) and [http://www.tus.si/en/ Tus], or the foreign international supermarket chains of Dutch [http://www.spar-int.com/ Spar], German [http://www.aldi.com/ Aldi] (Hofer) and [http://www.lidl-info.com/ Lidl], Italian [http://www.eurospin.it/ Eurospin], French [http://www.e-leclerc.com/ E. Leclerc] and Hungarian [http://www.cba.hu/?lang=en CBA].\n\nThe standard opening hours are M-Sa 8:00-20:00, with some stores also having opening Su 8:00-10:00 or 15:00.\n\n==Eat==\nThe old saying \"there is no free lunch\" is true in Slovenia. Served foods can be expensive and are commonly not appropriate for vegans, so the best way to get cheap foods to your liking is buying it directly from [[#Shopping|the local supermarkets]]. Lunchtime is the cheapest time to eat in Slovenia. As a tourist, you will always be presented with the full menu, however the majority of restaurants and gostilnas offer something called \"Malice\" (pronounced 'mal-it-ze') which is a lunch menu typically of 2 - 3 courses at a fraction of the cost. In Ljubljana, this tends to be hidden from tourists, so make sure to ask.\n\nAt the top of the list of places to eat in Slovenia is the common restaurant (translated ''restavracija''), followed by common bars (called ''gostilna'' and ''gostišče'') and rustic inns in the countryside. The international McDonalds fast-food restaurants are available in larger cities. Hamburgers are also served in grills and smaller snack bars called ''okrepčevalnica''.\n\n===Cuisine===\nSlovene cuisine is heavily influenced by that of its neighbours, including the Austrian Strudel and Wiener Schnitzel, the Italian risotto and ravioli (including pizza and several sorts of pasta), and the Hungarian goulash. Unique dishes include the air-dried ham (derived from the Italian prosciutto) called ''kraški pršut'', potato dumplings (derived from the Italian gnocchi) called [[Idrija|Idrian]] ''žlikrofi'', a variant of Italian polenta called ''žganci'' and ''ajdovi žganci'' made of buckwheat, Austrian-derived dumplings ''štruklji'' (prepared in 70 different ways of stuffings with sweet fillings, meat or vegetables), and Italian-derived ''jota'' (a type of soup made of beans, sauerkraut, potatoes, bacon, spare ribs and garlic).\n\nThe traditional Slovene cake called ''potica'', which is made by rolling up a layer of dough covered with walnuts, and a cake-like pastry called ''gibanica'', which is made of poppy seeds, walnuts, apples, raisins and cheese, topped with cream.\n\nSlovenes have also adopted several foreign fast foods, such as the Serbian spiced-up hamburger patty pljeskavica, the Bosnian/Serbian spicy meatballs ćevapi, the Bosnian variant of Turkish Börek that is a large flaky pastry stuffed with meat/cheese/apple called burek, and the Arab/Turkish Shawarma called doner kebab.\n\n===Common foods===\n[[Image:Gostilna pri Bundru.JPG|thumb|240px|A bar in Kamnik.]]\nSlovene foods are generally heavy, meaty and plain. A typical three-course meal starts with a soup (often made of beef or chicken) broth with egg noodles, after which a meat dish is served with potatoes and salad with vinegar. Bread is often served on the side. Common mains include cutlets, a sausage and goulash, all usually prepared from pork, lamb and game, and there is also a large choice of fish and other seafood further away from the coast.\n\nOther Slovene foods made of pig include blood sausage, roasts, stuffed tripe, smoked sausage, salami, ham and bacon. Recipes for the preparation of poultry, especially turkey, goose, duck and capon, have been preserved for many centuries. Foods made of chicken and squid are also commonly available.\n\n===Dietary restrictions===\nSlovenia is not the best place for vegetarians, although some inns offer fresh salads and fried vegetables per request. Strict vegans won't find more than a handful of vegan restaurants in the country. However, even the smallest grocery store offers non-meat foods for sale. In the cities, the Mediterranean chickpea staple falafel and 'vegi-burger' can be found on some fast-food menus. Many restaurants in Slovenia offer a 'vegetarian plate', which includes potatoes and fresh or boiled vegetables with 'soya steak'. In coastal cities, local seafoods include fish, squids, mussels and octopus.\n\n==Drink==\nAll restaurants and bars usually sell drinks like beers, wines and spirits. Tap water is drinkable.\n\n===Common drinks===\nThe 'coffee culture' is widespread in Slovenia. 'Coffee' usually stands for a tiny cup of strong Turkish coffee. Coffee with milk or whipped cream is also commonly available.\n\nTea is not as popular, and only sorts of fruit-flavoured and herbal teas are usually available instead of the basic black cup. Tea can also be served with lemon or honey.\n\n===Alcoholic drinks===\nBeer is the most popular tipple in Slovenia. The main two Slovene beer brands are Laško and Union. Common beer amounts sold at pubs range from 'large' (0.5&nbsp;L) to 'small' (0.3&nbsp;L). The Union Radler Grapefruit is also good. There are also few Slovenian craft breweries that have rosen up in the past few years and you can try their beers in some pubs in Ljubljana and other towns.\n\nWines are usually ordered by the deciliter. The western region of Slovenia produces reds and the drier whites (in Italian/French style), while the eastern region produces semi-dry to sweet whites, which cater more to the German/Austrian-type of palate. Local wine specialities include Riesling, Teran (a very dry red from the southwestern Karst region), and Cviček (a very dry/light red from the southeast). \n\nA brandy derived called ''žganje/rakija/šnops'', distilled from various fruits, is very common. Other popular spirits include a honey-sweetened brandy called ''medeno žganje'' or ''medica''.\n\n==Sleep==\nSleeping outside in a public area (outside of designated camping grounds) is not recommended. Aside from the climate's moisture posing a problem, not many Slovenes may be comfortable with seeing homeless people, and sleeping outside in a public place (especially inside a city and especially at night) can get you into trouble.\n\nHowever, Slovenia has a wide variety of high-priced accommodations, including five star hotels, secluded cottages in the mountains, and 'tourist farms' in the countryside.\n\n===Car camping===\nSleeping in your car, though uncomfortable, is a cheap and viable option (especially during the summer season), and you usually won't get bothered in secluded public parking places, though you might not want to stay at the same place longer than a day or two. The free parking places of settlement areas are your best bet, as well as some parking places of restaurants, but you should avoid the more obvious parking areas such as the ones of supermarkets, as those are very often monitored by various securities (especially at night).\n\n===Camping===\nCamping is not permitted in the national parks of Slovenia, but there are various designated camping grounds. It's advisable to come with a camping mat, as travellers will more likely find pitches consisting of small stones instead of comfortable grass.\n\n===Hostels===\nThere are hostels in all of the high-tourist areas in Slovenia. The average price for a basic bed in a dorm ranges from €10 to €20. Some of the student dormitories are converted into hostels in summertime, but these tend to be poorly located and badly maintained.\n\nMountain Huts can be found in [[Triglav National Park]]. Information about these huts can be found at tourist information offices that will also help tourists plan their walks around the area and phone the hostels to book them. The only way to get to these huts is by foot, and the lowest huts are at around 700&nbsp;m altitude. There are clear informational signs stating how long it will take to travel between the huts indicated.\n\n==Learn==\nSlovenia has four universities, located in [http://www.uni-lj.si/en/ Ljubljana], [http://www.um.si/en Maribor], [http://www.ung.si/en/ Nova Gorica] and [http://www.upr.si/ Koper], as well as business schools like [http://www.iedc.si/ IEDC Bled],[http://www.eng.doba.si/ DOBA Maribor] and [http://www.vps.erudio.si/ VPŠ ERUDIO]. The university in Ljubljana is the oldest and largest educational institution in the country, offering three art academies: Theatre and Film; Music; and Fine Arts.\n\n==Work==\nCitizens of the [[European Union]], [[Norway]], [[Iceland]] and [[Switzerland]] can work in Slovenia without the need to apply for a visa. Citizens of some non-EU countries are permitted to work in Slovenia without the need to obtain a visa or any further authorization for the period of their 90-day visa-free stay (see the [[#Entry requirements|'Entry requirements']] section above).\n\nIn general, '''finding a job around Slovenia is next to impossible'''. Although the economic situation has been getting better in recent years, there are so many highly educated people amongst the population and workforce that it is extremely competitive to find a suitable placement. At best, a masters degree or higher is required to be a competitive candidate in the Slovene job market. For this very reason, many Slovenes often work in other countries.\n\nUntil or unless you know enough of Slovene to get by and have plenty of educational certificates, your prospects of finding a job is very limited. But don't be discouraged; If you have a STEM background (i.e. Computer Science, Engineering, etc.), finding a job won't be a major hassle and you generally won't be required to know Slovene.\n\n==Stay safe==\nSlovenia is a relatively safe country to visit. LGBT+ travellers are generally not in danger, although there have been reported attacks in the past. Be cautious in the evening and at night, especially in bigger towns. Some aggression in crowded bars has also been noted.\n\nTo call police, dial 113. There are emergency phones stationed along highways and some main roads. The closest SOS phones can be found by following the signposts, which are usually put right in front of the phone station, so driving slowly is advisable.\n\n==Stay healthy==\nHygiene standards are high and tap water is generally clean and drinkable. '''The nationwide emergency number is 112.'''\n\nIt's advisable to use tick repellents in the woods due to the dangers of widespread Lyme disease and Meningitis. If bitten by one of the two known species of venomous adders in the Julian Alps, you should seek medical help to provide you with antiserums (although these are seldom administered). Tourists may encounter a bear in the forests to the south, though actual attacks are rare.\n\n==Respect==\nSlovenes in general are very friendly and hospitable, sometimes to a fault.\n\n* Slovenia is a highly polycentric country. Although Slovenians are normally indirect communicators, they will change their behaviour to mirror that of the person that they are interacting with. While this may make Slovenes easy to get along with, it can be difficult to know what to expect from them, especially if you are from a country where direct communication is the norm.\n\n* Slovenians have a marvellously intimate, soft-spoken way of conversing with one another. For this reason, Slovenians are very tolerant of differing opinions, even if they may not necessarily agree with them.\n\n* Slovenia is an egalitarian country. For this reason, bragging or boasting about your accomplishments and achievements is taken very negatively. \n\n* It's worth noting that in the business world, Slovenians usually make business decisions based on their personal feelings towards another individual. Therefore, it's advisable to spend some time building your relationship with others, as it may potentially help you some day, especially if you end up in some sort of trouble in the country.\n\n* Do not raise your voice or lose your temper in a conversation as it is considered very rude manners. It is also considered very rude manners to publicly criticise and/or complain about people. \n\n* Although Slovenians have a good sense of humour, it's advisable to refrain from making self-deprecatory, sarcastic remarks as it can be interpreted as putting someone down. If you have an issue with someone or if someone has done something wrong in your opinion, it's best to do it behind closed doors. \n\n* Asking questions pertaining to someone's private life, religious beliefs, political views, and/or salary, especially if it is someone you're not close to, is considered very rude. Slovenes like to separate their business and private lives, and they expect you to do the same. \n\n* Due to a lack of immigration, modern Slovenia is a largely homogeneous society. Since the country has a very small population and a small tourist industry, don't be alarmed or surprised if some people, especially the older and the younger generation, stare at you with immense curiosity if you are of African, Asian or Latin American descent or nationality. \n\n* Slovenes in general are conservative dressers. Wearing something with bright colours and/or strange labelling will result in some odd or confused looks. It's best to follow suit with this to avoid standing out like a sore thumb. \n\n* Slovenes in general have some very strong nationalistic views, and would view any criticisms of their country and expressions with varying degrees of hostility. As a general rule of thumb, keep any negative sentiments about the country to yourself. It's also considered very insulting to mock the national anthem, any local traditions, or desecrate the flag. If you're confused about something, simply ask.\n\n* As in any other place, it's advisable to refrain from commenting on political matters unless you follow Slovene politics ardently. Feel free to ask any questions that you may have, but know the position that being a foreigner puts you in.\n\n==Contact==\n\n===Telephone===\nThe international calling code for Slovenia is 386, the prefix for international calls is 00, and the area code prefix is 0. Some number blocks are reserved for special use: 080 are toll-free numbers, and 090 are expensive commercial services.\n\n[http://en.telekom.si/ Telecom Slovenia] (''Telekom Slovenije'') operates around 3500 phone booths. These require the use of smart cards, which are sold for €3 - €15.\n\n====Mobile====\nMobile networks use the common European frequencies (900 and 1800 MHz). Three mobile companies, the Slovene Telekom Slovenije (formerly Mobitel) (major) and Telemach (formerly Tusmobil), as well as the Austrian Simobil, provide good GSM/HSDPA and LTE coverage. Roaming between European phone companies is becoming cheaper due to the EU regulation setting a maximum of €0.42 per minute for calls made and €0.132 for calls received, while calls to or from non-EU providers remain expensive. Pre-paid GSM SIM cards are widely available in supermarkets, post offices and gas stations.\n\n===Internet===\nSlovenia is covered by over 415,580 internet hosts from several companies, offering services to 1.298 million internet users. WiFi is common in cafes and bars; the service is usually free of charge, however guests may need to ask staff for login details. Some cities such as Ljubljana offer limited free WiFi throughout central areas. Internet cafes are less common, however can be found in cities, and internet access is offered by most hotels and hostels.\n\n===Broadcast media===\nThe national Radio-television Slovenia (''Radiotelevizija Slovenija'' (RTV)) is a public radio and TV broadcaster that operates a system of national and regional radio and TV stations. Slovenia has 35 domestic commercial TV stations (operating nationally, regionally and locally), and more than 75 regional and local commercial and noncommercial radio stations. About 60% of households are connected to multichannel cable TV.\n\n===Post=== \nThe offices of [http://www.posta.si/home Post Service Slovenia] (''Pošta Slovenije'') are very common. They can be found by spotting a black French horn-like sign on a yellow background. Mail delivery takes one day within Slovenia, a few days within Europe, and usually less than two weeks worldwide. [http://www.dhl.com DHL] is also available.\n\n{{IsPartOf|Central Europe}}\n\n{{Outline}}\n{{Countryguide}}\n\n[[ca:Eslovènia]]\n[[de:Slowenien]]\n[[eo:Slovenio]]\n[[es:Eslovenia]]\n[[fi:Slovenia]]\n[[fr:Slovénie]]\n[[hu:Szlovénia]]\n[[it:Slovenia]]\n[[ja:スロベニア]]\n[[nl:Slovenië]]\n[[pl:Słowenia]]\n[[pt:Eslovênia]]\n[[ro:Slovenia]]\n[[ru:Словения]]\n[[sv:Slovenien]]\n\n[[wts:Category:Slovenia]]\n\n[[Wikipedia:Slovenia]]\n[[Dmoz:Europe/Slovenia/]]\n[[World66:europe/slovenia]]"
        }
    }
}