{
    "parse": {
        "title": "South Sudan",
        "pageid": 45884,
        "wikitext": {
            "*": "{{pagebanner|South Sudan Banner.jpg}}\n\n{{quickbar\n| image=Juba sudan.jpg\n| caption=Juda\n| location=South Sudan in its region (claimed).svg\n| flag=Flag of South Sudan.svg\n| capital=[[Juba]]\n| government=Federal Presidential Democratic Republic\n| currency=South Sudanese Pound\n| area=''total:'' 619,745 km<sup>2</sup>\n| population=7,500,000–9,700,000 (2006 est.)\n| language=English (official), Juba Arabic, Dinka, others\n| religion=Christianity, indigenous beliefs 25%, Islam\n| electricity=220-240 V 50 Hz (Indian or UK plug)\n| callingcode= +211\n| tld=none\n| timezone=GMT+3\n}}\n\n{{warningbox| All travel to South Sudan is strongly discouraged, with independent travel being nearly suicidal. Armed conflict is ongoing and violent crime, such as carjackings, shootings, ambushes, assaults, robberies, and kidnappings is common throughout South Sudan, including Juba. US Embassy staff are under a strict curfew, travel in armored vehicles, and are not allowed on the streets alone at any time. Those already in country are advised to leave as soon as it is safe to do so.(May 2018)|australia=http://smartraveller.gov.au/Countries/africa/east/Pages/south_sudan.aspx |us=https://travel.state.gov/content/passports/en/alertswarnings/republic-of-south-sudan-travel-warning.html |uk=http://www.gov.uk/foreign-travel-advice/south-sudan |canada=https://travel.gc.ca/destinations/south-sudan |nz=http://www.safetravel.govt.nz//south-sudan |southafrica= |india= |ireland=https://www.dfa.ie/travel/travel-advice/a-z-list-of-countries/south-sudan/}}\n\n'''South Sudan''' is a country in [[Africa]]. Formerly a breakaway region of [[Sudan]], it became an independent country on 9 July 2011 after a referendum was held in January that year. It borders [[Sudan]], [[Ethiopia]], [[Uganda]], [[Kenya]], [[Democratic Republic of the Congo]], and the [[Central African Republic]].\n\n==Understand==\n\n===History===\nSouth Sudan had been home of semi-nomadic cattle herding peoples for most of its history. Its formal ownership has changed hands from the Egyptians, Ottomans, British and Sudanese. After half a century of ethno-religious conflict South Sudan legally seceded from Sudan on 9 July 2011.\n\n===Geography===\nSince South Sudan is located near the Equator in the tropics, much of its landscape consists of tropical rainforest. South Sudan also has extensive swamp and grassland regions.\n\nThe White Nile, a main tributary of the Nile River, also passes through the country.\n\nThe highest point in South Sudan is Kinyeti at 10,456 feet (3,187 m).\n\n===Culture===\nSouth Sudanese culture varies by ethnicity. Zande, a Bantu people, will have very different language, legend and dance from the Shilluk, a Nilotic people.\n<br clear=\"all\" />\n\n==Regions==\n\n{{Regionlist\n| regionmap=South Sudan regions map.png\n| regionmaptext=\n| regionmapsize=500px\n\n| region1name=[[Bahr el Ghazal]]\n| region1color=#9ccb94\n| region1items=\n| region1description=\n\n| region2name=[[Equatoria]]\n| region2color=#8fa3a0\n| region2items=\n| region2description=\n\n| region3name=[[Greater Upper Nile]]\n| region3color=#b6c797\n| region3items=\n| region3description=\n\n}}\n\n==Cities==\n* [[Juba]]\n* [[Wakanda]]\n* [[Aweil]]\n* [[Bentiu]]\n* [[Bor]]\n* [[Malakal]]\n* [[Yei]]\n* [[Rumbek]]\n* [[Torit]]\n* [[Yambio]]\n\n==Other destinations==\n\n* [[Bandinglio National Park]]\n* [[Boma National Park]]\n* [[Southern National Park]]\n* [[Nimule National Park]]\n\n==Talk==\n\n'''English''' is the official language of South Sudan, and is widely spoken by those who have had the opportunity of going to school.\n\nJuba Arabic - an [[Arabic phrasebook|Arabic]]-based pidgin - is used as a ''lingua franca'' in the city of Juba. However, owing to the presence of many thousands of foreign - chiefly Kenyan and Ugandan - UN and NGO personnel, Juba Arabic is rapidly being supplanted by English and [[Swahili phrasebook|Swahili]]. Since South Sudan was part of Sudan for a century, some South Sudanese are conversant in either Sudanese Arabic or Modern Standard Arabic.\n\nAll indigenous languages are recognised as national languages in South Sudan. Of the indigenous languages, [[Dinka phrasebook|Dinka]] is the most widely spoken language closely followed by [[Nuer phrasebook|Nuer]]. Jur Modo, Bari, Chollo/Shilluk, and Zande are also spoken there.\n\nMost indigenous languages are non-standard macro-languages, variations in dialect and accent are significant so universal intelligibility should not be assumed.\n\n==Get in==\n\nAs South Sudan achieved independence only recently, the immigration rules are still subject to change.\n\nCitizens of [[Botswana]], [[Burundi]], [[Eritrea]], [[Ethiopia]], [[Kenya]], [[Rwanda]], [[Tanzania]] and [[Uganda]] are eligible to obtain a visa on arrival costing between $50 and $100 USD.\n\nAll other visitors must obtain a visa from one of the South Sudan diplomatic missions before departure, unless they are of South Sudani origin. The visa is needed to board an aircraft to South Sudan, and costs $100 USD.\n\nHolders of diplomatic, official, service and special passports issued to nationals of any country can obtain a visa on arrival.\n\n=== By plane ===\n\nMost airlines flying into Juba depart from [[Cairo]] ([[Egypt]]), [[Addis Ababa]] ([[Ethiopia]]), [[Entebbe]] ([[Uganda]]) or [[Nairobi]] ([[Kenya]]) [[Khartoum]] ([[Sudan]]) to/from where you should be able to manage flights to Europe, Asia or the Americas. Flydubai has regular flights from [[Dubai]] to Juba.\n\n==Get around==\n[[Image:Train_Sudan_towards_Wau.jpg|thumb|There is always room on top! Travelling by train towards [[Wau (South Sudan)|Wau]].|320px]]\n\nSouth Sudan has a rainy season which lasts from May to November. The rainy season massively limits roads and other transportation due to South Sudan's roads being dirt tracks and in the rainy season they turn into mud tracks. The only paved roads South Sudan has are in major cities like Juba and Rumbek. The 190 Kilometers from Nimule on the Ugandan Border to Juba has recently been paved. Work is underway to upgrade the road from Juba to Bor.\n\n==See==\n\n===Itineraries===\n\n==Do==\nSafaris to Boma National Park and Nimule National Park. See the parks by 4x4 vehicle or aircraft. See the greatest migration of mammals on the earth in Boma National Park. Contact the following companies for safaris:\n'''Bahr El Jebel Safaris''',\n\n==Eat==\nMost South Sudanese is very similar to Sudanese cuisine. Restaurants for both international and local cuisine can be found in Juba and other major city centers.\n\n==Drink==\nThe drinking/purchasing age of alcoholic beverages is '''18'''.\n\nA Brewery has opened up in Juba, providing the country with Nile Beer.\n\nFresh fruit juices are available throughout Sudan. One of the local juices is \"aradeab\"(tamarind).\n\n==Stay safe==\nStarting in August 2012, Sudan and South Sudan have been fighting along the border of the two countries and traveling to the Sudan-South Sudan border '''is very dangerous and highly discouraged!''' Please be '''very careful''' while you are traveling in this area, so you do not get injured or killed. '''DO NOT EVEN THINK ABOUT''' going across the gated and secured border into Sudan. This is '''highly dangerous''' as well. Updated October 2012, due to continued violent disruptions journalist permits honored by Sudan are sporadically recognized as sufficient identification in South Sudan. Bribing is a possibility, but does not guarantee entry into South Sudan. Islamist groups such as Janjaweed also intermittently operate in the country.\n\nA warning to LGBT travelers:\n\nHomosexuality is ILLEGAL in South Sudan, as in the north. Men found having homosexual sex can be sentenced to up to 10 years imprisonment (Wikipedia: LGBT rights in South Sudan); the penalty for women is unknown (Wikipedia: LGBT rights in South Sudan). If you are gay or lesbian and thinking of travelling to South Sudan, you should take extreme precaution.\n\n==Respect==\nAs with all countries a respect for the native culture is essential. Due to the multi-ethnic demography of South Sudan some people might take offense to being mistaken for others. It is best not to assume a person speaks a particular language or holds particular custom which is representative of another ethnic group.\n\n==Get out==\n\n{{isPartOf|Central Africa}}\n{{outline}}\n{{countryguide}}\n\n[[WikiPedia:South Sudan]]\n\n[[fi:Etelä-Sudan]]\n[[fr:Soudan du Sud]]\n[[ja:南スーダン]]\n[[nl:Zuid-Soedan]]"
        }
    }
}