{
    "parse": {
        "title": "Spain",
        "pageid": 779,
        "wikitext": {
            "*": "{{pagebanner|Spain banner.jpg}} \n\n{{quickbar\n|location=Spain in its region (whole).svg\n|flag=Flag of Spain.svg\n|capital=[[Madrid]]\n|government=Constitutional Monarchy and Parliamentary Democracy\n|currency=Euro (€) \n| area= ''total:'' 505,370 km<sup>2</sup><br />''water:'' 6,390 km<sup>2</sup><br />''land:'' 498,980 km<sup>2</sup>\n|population=47,725,002 (July 2011 est) \n|language=Castilian [[Spanish]] (official) 100%, [[Catalan]] (also official in [[Catalonia]], [[Valencia_(region)|Comunitat Valenciana]] and [[Balearic_Islands|Balearic Islands]]) 17%, [[Galician phrasebook|Galician]] (also official in [[Galicia]])7%, [[Basque]] (also official in [[Basque Country]] and [[Navarra]]) 2%\n|religion=Roman Catholic 72%, none 20% other 8%\n|callingcode=34\n|tld=.es\n|timezone=UTC + 1\n|electricity=230V/50Hz (European plug)\n}}\n\n'''Spain''' [http://www.spain.info] (Spanish: ''Espa&ntilde;a'') is a diverse country sharing the [[Iberia]]n Peninsula with [[Portugal]] at the western end of the Mediterranean Sea. It is the country with the third-largest number of [[UNESCO World Heritage List|UNESCO World Heritage Sites]], after [[Italy]] and [[China]].\n\nSpain is considered an exotic country in Europe due to its friendly inhabitants, relaxed lifestyle, its cuisine, vibrant nightlife, and world-famous folklore and festivities. Among many places worth visiting are Spain's thriving capital [[Madrid]], the vibrant coastal city of [[Barcelona]], the famous \"Running of the Bulls\" at [[Pamplona]], major Andalusian cities with Islamic architecture, like [[Seville]], [[Granada (Spain)|Granada]] and [[Cordoba (city, Spain)|Córdoba]], the [[Way of St. James]] and the idyllic [[Balearic Islands|Balearic]] and [[Canary Islands]].\n\n==Understand==\n\nWith great beaches, fun nightlife, many cultural regions and historic cities, Spain makes a great destination for any kind of trip. A country of large geographic and cultural diversity, Spain is a surprise to those who only know its reputation for great beach holidays. There is everything from lush meadows and snowy mountains to huge marshes and deserts in the south east. While summer is the peak season because of the beaches, those who wish to avoid the crowds should consider visiting in the winter as  attractions such as the Alhambra in Granada and La Gran Mezquita in Cordoba will not be overcrowded.\n\n=== History ===\nOnce the center of a global empire with territories in [[North America|North]], [[Central America|Central]] and [[South America]], [[Africa]] (e.g. [[Equatorial Guinea]] or [[Western Sahara]]), and [[Asia]] (e.g. the [[Philippines]]), contemporary Spain has overcome civil war and fascism in the 20th century to stand proud and centered in itself.\n\n===Immigration===\nSpain holds a historical attachment to its neighbors, [[Andorra]], [[Portugal]] and [[France]], to its former colonies, to former citizens and their descendants, and to a special category of former citizens, namely Sephardic Jews.  \n\nIndividuals from these categories may acquire Spanish citizenship in an accelerated fashion which may or may not require that the individuals reside in Spain, and residency requirements are as short as one to three years depending on the category.  Citizens of countries in the European Union may acquire citizenship after living in Spain for five years.  Citizens of any other country may acquire citizenship after residing in Spain for ten years.\n\nThe population of Spain is growing in large part due to migration from areas that have a historical or linguistic attachment to Spain, such as Latin America [e.g [[Cuba]], [[Ecuador]], [[El Salvador]] and [[Peru]] ], [[Europe]] (mostly Eastern Europe), Africa and Asia.\n\n==Regions==\n\nSpain is divided into ''autonomías'' or autonomous regions, plus two independent cities. Some of the ''autonomías'' - notably the ones which have other official languages alongside Spanish - are regions with their own unique historical tradition. These include the [[Basque Country]] or ''Euskadi'' ([[Basque phrasebook|Basque]]), [[Galicia]] ([[Galician phrasebook|Galician]]), Catalonia or ''Catalunya'', the Valencian region or ''Comunitat Valenciana'', and the Balearic Islands or ''Illes Balears'' ([[Catalan phrasebook|Catalan]]), but also Andalusia. Travelers to these parts of the [[Iberian Peninsula]] should respect their history and language.  The [[Canary Islands]] lie off the coast of [[Morocco]] and are geographically part of Africa, as are the two cities of Ceuta and Melilla.\n\nFor ease of reference, Spain's many regions can be grouped as follows:\n\n{{Regionlist|\n\nregionmap=Spain map.png |\nregionmaptext=Regions of Spain |\nregionmapsize=400px |\n\nregion1name=[[Northwestern Spain]] |\nregion1color=#ae7472|\nregion1items=[[Galicia]], [[Asturias]], [[Cantabria]] |\nregion1description= |\n\nregion2name=[[Northern Spain]] |\nregion2color=#9572bc |\nregion2items=[[Basque Country (Spain)|Basque Country]], [[Navarre]], [[La Rioja (Spain)|La Rioja]] |\nregion2description= |\n\nregion3name=[[Northeastern Spain]]  |\nregion3color=#64bf87  |\nregion3items=[[Catalonia]], [[Aragon]]  |\nregion3description=  |\n\nregion4name=[[Central Spain]]   |\nregion4color=#b1a267  |\nregion4items=[[Community of Madrid]], [[Castile-La Mancha]], [[Castile-Leon]], [[Extremadura]]  |\nregion4description= |\n\nregion5name=[[Eastern Spain]]   |\nregion5color=#add17b  |\nregion5items=[[Murcia (region)|Murcia]], [[Valencia (region)|Valencia]]  |\nregion5description= |\n\nregion6name=[[Andalusia]]   |\nregion6color=#6886be  |\nregion6items=  |\nregion6description=  |\n\nregion7name=[[Balearic Islands]]   |\nregion7color=#009991  |\nregion7items= |\nregion7description=  |\n\nregion8name=[[Canary Islands]]   |\nregion8color=#de7d7d  |\nregion8items= |\nregion8description=  |\n\nregion9name=Autonomous Cities    |\nregion9color=#c9cf7b  |\nregion9items=[[Ceuta]], [[Melilla]]  |\nregion9description=  |\n\n}}\n<br clear=\"all\" />\n\n==Cities==\n\n<!--DO NOT CHANGE THIS LIST without first discussing your proposal on the talk page. There is a hard limit of NINE in cities lists.-->\n\nSpain has hundreds of interesting cities. Here are ten of the most popular:\n\n* [[Madrid]] — the vibrant capital, with fantastic museums, interesting architecure, great food and nightlife\n* [[Barcelona]] — Spain's second city, full of modernist buildings and a vibrant cultural life, nightclubs, and beaches\n* [[Bilbao]] — industrial city, home to the Guggenheim Museum\n* [[Cadiz]] — oldest city in Western Europe with nearly 4,000 years of history, celebrates a famous carnival\n* [[Cordoba (city, Spain)|Cordoba]] — The Grand Mosque ('Mezquita') of Cordoba is one of the world's finest buildings\n* [[Granada (Spain)|Granada]] — stunning city in the south, surrounded by snow capped mountains of the Sierra Nevada, home of La Alhambra\n* [[Seville]] — a beautiful, verdant city, and home to the world's third largest cathedral\n* [[Valencia]] — paella was invented here, has a very nice beach\n* [[Zaragoza]] — fifth largest city of Spain that held the World Expo in 2008\n\n<!--DO NOT CHANGE THIS LIST without first discussing your proposal on the talk page. There is a hard limit of NINE in cities lists.-->\n\n==Other destinations==\n\n<!--Other destinations sections are for non-city/town/village destinations. All municipalities should be removed from this list and replaced with notable other destinations, such as national parks, islands, etc. The list also should not exceed nine items.-->\n\n* [[Costa Blanca]] — 200 km of white coast with plenty of beaches and small villages\n* [[Costa Brava]] — the rugged coast with plenty of seaside resorts\n* [[Costa del Sol]] — the sunny coast in the south of the country\n* [[Gran Canaria]] — known as \"a continent in miniature\" due to its many different climates and landscapes[http://www.enjoycanaryislands.com/gran-canaria.html]\n* [[Ibiza]] — a Balearic island; one of the best places for clubbing, raving, and DJs in the entire world\n* [[La Rioja (Spain)|La Rioja]] — Rioja wine and fossilized dinosaur tracks\n* [[Mallorca]] — the largest island of the Balears, full of amazing beaches and great nightlife\n* [[Sierra Nevada (Spain)|Sierra Nevada]] — the highest mountains on the Iberian Peninsula, great for walking and skiing\n* [[Tenerife]] — offers lush forests, exotic fauna and flora, deserts, mountains, volcanoes, beautiful coastlines and spectacular beaches [http://www.enjoycanaryislands.com/tenerife.html]\n\n<!--Other destinations sections are for non-city/town destinations. All municipalities should be removed from this list and replaced with notable other destinations. The list also should not exceed nine items.-->\n\n==Get in==\n===Entry requirements===\n{{infobox|Minimum validity of travel documents|* EU, EEA and Swiss citizens, need only produce a passport or national identity card which is valid on the date of entry.\n* Other nationals must produce a passport which is valid for the entirety of their period of stay in Spain.\n* More information about the minimum validity of travel documents is available at this [http://www.maec.es/en/MenuPpal/Consulares/ServiciosConsulares/InformacionaExtranjeros/Paginas/REQUIREMENTSFORENTRY.aspx webpage of the Ministry of Foreign Affairs and Cooperation of Spain].}}\n{{Schengen}}\n\nEU, EEA and Swiss nationals who enter Spain on a national identity card, who are under 18 years old and travelling without their parents are required to have written parental consent. For more information, visit this [http://www.maec.es/en/MenuPpal/Consulares/ServiciosConsulares/InformacionaExtranjeros/Paginas/REQUIREMENTSFORENTRY.aspx webpage of the Ministry of Foreign Affairs and Cooperation of Spain].\n\nCitizens of Antigua and Barbuda, the Bahamas, Barbados, Mauritius, Saint Kitts and Nevis and Seychelles are permitted to work in Spain without the need to obtain a visa or any further authorisation for the period of their 90 day visa-free stay. However, this ability to work visa-free does not necessarily extend to other Schengen countries. \n\nWhen entering by air from a non-Schengen country, you will be expected to fill out a brief form which includes an address in Spain, such as a hotel or hostel. This does not appear to be stringently checked, but you will not be allowed in unless an address has been entered.\n\nA stay of longer than 90 days for non-EEA or Swiss citizens almost invariably requires an advance visa. If one stays for longer than 6 months, a residence permit ('''Titulo de Residencia''') must be obtained within the first 30 days of entering Spain.\n\nThere are a number of ways to get into Spain. From neighbouring European countries, a drive with the car or a train ride is feasible; visitors from further away will probably be using air travel.\n\n===By plane===\nSpain's national carrier is '''Iberia'''.\n\nThe busiest airports are [[Madrid]], [[Barcelona]], [[Palma de Mallorca]] and [[Malaga]], followed by [[Seville]], [[Valencia]], [[Bilbao]], [[Alicante]], [[Santiago de Compostela]], [[Vigo]], [[Gran Canaria]] and the 2 airports in [[Tenerife]]. All are listed on the official airport governing body website: [http://www.aena.es/csee/Satellite?pagename=Home&lang=EN_GB]\n\n[[Madrid]], [[Barcelona]] and [[Bilbao]] have the most beautiful airports, designed by famous architects.\n\nLow cost carriers operating to Spain include: '''Vueling''' [http://www.vueling.com], '''easyJet''' [http://www.easyjet.com], '''Ryanair''' [http://www.ryanair.com], '''Blue Air''' [http://www.blueair-web.com], and '''Jet2.com''' [http://www.jet2.com].\n\n'''Warning''': If you buy an e-ticket from Iberia over the internet with a credit card, you may have to show the original credit card upon check-in. If you fail to do so, you will have to purchase another ticket for the same fare, and the original ticket will be refunded many weeks or even months later.\n\n===By train===\n\nThe best option to arrive in Spain by train is the high-speed track from [[France]], connecting [[Paris]] with [[Barcelona]] and further with [[Madrid]]. It takes 6 hours of travel from Paris to Barcelona. Cross-border connections are also frequent on the other end of the border with France, between [[San Sebastian]] and [[Bayonne]]. A more scenic option is to from Toulouse to Barcelona is the regional train TER from Toulouse to Latour-de-Carol, on the border, connecting with a regional spanish train to Barcelona. \n\nTrains from [[Portugal]] are slow and not so frequent.\n\n===By bus===\n\nBus travel in Spain is increasingly an attractive option for people traveling on a tight budget.\n\nThere are lots of private bus companies offering routes to all major Spanish cities. If you want to travel around Spain by bus, the best idea is to go to your local bus station (Apart from [[Madrid]] and [[Barcelona]], most towns and cities have just one) and see what is available.\n\nTraveling by bus in Spain is usually reliable (except on peak holiday days when roads can be very crowded and you should expect long delays on popular routes), coaches are modern and comfortable. You can expect to pay about €8 per 100km.\n\n===By boat===\nFrom the UK, Brittany Ferries offers services from [[Portsmouth]] and [[Plymouth]] to [[Santander]] and from [[Portsmouth]] to [[Bilbao]]. The journey time from [[Portsmouth]] to [[Santander]] is approximately 24 hours.  \n\nFerry services were once run by P&O from [[Portsmouth]] to [[Bilbao]] and from [[Plymouth]] and [[Southampton]] to [[Santander]]. However, P&O no longer operates these routes. \n\nAs well as the UK, Spain is also well connected by Ferry to Northern Africa (particularly [[Algeria]] and [[Morocco]]) and the [[Canary Islands]] which are owned by Spain. Routes are also naturally available to the Spanish Balearic islands of [[Mallorca]], [[Minorca]], [[Ibiza]] and [[Formentera]]. \n\nAnother popular route is from [[Barcelona]] to [[Genoa]]. \n\n* Spain Yatching Group S.L. [http://www.barcosbarcelona.com]. Yacht charter and sailing - INTERNATIONAL YACHTING GROUP, one of the worlds largest yacht charter companies, can take care of all charter requirements, from bareboat to crewed in Spain and Wordwide.\n\n{{related|Ferries in the Mediterranean}}\n\n===Visas===\nSpain is a member of the [[European Union]] and the [[European_Union#Get_around|Schengen Agreement]], which governs its visa policies. No visa is required for citizens of other EU member states, and those of nations with whom the European Union has special treaties. There are no border controls between Spain and other Schengen Agreement nations, making travel less complicated. \n\nAs of May 2004 citizens of the following countries do ''not'' need a visa for entry into Spain. Note that citizens of these countries (except EU nationals) must not stay longer than three months in any 180 day period in any country covered by the Schengen Agreement and they must not work in Spain: Andorra, Argentina, Australia, Austria, Belgium, Bermuda, Bolivia, Brazil, Brunei, Bulgaria, Canada, Chile, Costa Rica, Croatia, Cyprus, Czech Republic, Denmark, El Salvador, Estonia, Finland, France, Greece, Guatemala, Honduras, Hong Kong, Hungary, Iceland, Ireland, Israel, Italy, Japan, Latvia, Liechtenstein, Lithuania, Luxembourg, Macao, Malaysia, Malta, Mexico, Monaco, New Zealand, Netherlands, Nicaragua, Norway, Panama, Paraguay, Poland, Portugal, Romania, San Marino, Singapore, Slovakia, Slovenia, South Korea, Spain, Sweden, Switzerland, United Kingdom, United States, Uruguay, Vatican City and Venezuela.\n\nFor Latin American people, especially those from Bolivia, Colombia, Ecuador, Peru, Paraguay, Argentina, Chile, and Venezuela, you need to have a hotel reservation confirmed, and international insurance for at least 30.000 EURO; if your trip is from 1-9 days you need €514, for each additional day €57 and a return air ticket.\n\n\n\nVenezuelan credit cards are not accepted like funds for immigration due to the currency exchange control in this country.\n\n==Get around==\n\n===By train===\n* '''[http://www.renfe.com RENFE]''' is the Spanish national rail carrier. Long-distance trains always get in time, but be aware that short-distance trains (called ''Cercanías'') can bear long delays, from ten to twenty minutes, and especially in the Barcelona area, where delays up to 30 minutes are not uncommon. To be safe, always take the train before the one you need.\n\nTrains and facilities are clean, services are fast and reliable and prices are on par with those found elsewhere in Western Europe, '''but''' there is one catch. Since absolutely '''all long-distance trains require a reservation''' (not only the high-speed AVEs!) and are booked out long before, especially in the tourist season, getting around Spain by train is rather difficult and planning ahead is essential. If you turn up at the Madrid-Atocha station expecting to buy a same-day AVE ticket to Barcelona or to the costas, you'll be disappointed. On the other hand, passengers in Spain ride in style, everyone seated and no people standing in the aisle. This is in sharp contrast with most other European countries, where compulsory reservations are either non-existent or only required for the highest category of trains.\n\n{{infobox|FEVE|Narrow-gauge, slow, but scenic trains around the northern coast of Spain are operated by another company, '''[http://www.feve.es/es/ FEVE]'''. These trains are a completely separate ecosystem. They require different tickets and are not covered by Rail Passes! The FEVE company was formally merged with RENFE on January 1, 2013, but it'll take some more time until the factual merger completes.}}\n\nIf you'd like to travel by trains, you have the following choices:\n\n* Buy tickets in advance through the RENFE website. They can be significantly cheaper when bought a long time ahead. Fortunately, the RENFE website has seen some major improvements in the recent years, especially its English version, which used to be severely limited. A RENFE ticket can only be bought for a specified train and date. Best price can be achieved by buying approx. one month in advance (of course, discounted tickets are non-refundable). Beware though, that you cannot buy a separate seat reservation without a ticket (if you're travelling on a '''[[European rail passes|rail pass]]''') on the Renfe website. That can be bought easily in Spain at a railway station, but by the time you get into Spain, the train will likely be booked out. It is technically possible to buy Spanish seat reservations (including domestic routest) everywhere in Europe, at any train station selling international tickets, since the railway companies are interconnected, but it's not easy. Imagine explaining to a ticket selling person in, say, Germany or Poland that you want to buy a reservation for a train in Spain! That being said, it is nonetheless possible. Always give the train number (very important!), exact date, departure and arrival points. With these information, buying a reservation abroad should succeed. Alternately, you can buy a seat reservation on the [http://shop.raildude.com/#/ptp/reservations__for_passholders/ RailDude] website. It is a bit more expensive (€10 for a 2nd class reservation), but you'll avoid haggling with railway staff and it is your best option if you're outside Europe.\n\n* Travel only by local trains (''Cercanías'' - suburban trains, or ''Media Distancia'' - medium distance trains). Sadly, '''quite a lot of the Media Distancia trains are subject to compulsory reservations''', too. Always check for each connection whether you require a reservation or not. There are e.g. only 7 daily trains between [[Santiago de Compostela]] and [[A Coruña]] (a relatively short way) which don't require a reservation. All other trains on that route (29 more trains) require a reservation, either being ''Media Distancia'' or ''Larga Distancia'' (long-distance services). Anyway, the main difference is that the ''Media Distancia'' trains do not tend to be booked out weeks before so it is usually possible to buy a reservation minutes before your desired departure.\n\n{{disclaimerbox|'''CAVEAT:''' The RENFE website only accepts those foreign-issued credit cards which have a 2-Step Verification System like those issued by Indian Banks so it will not accept US Banks issued Credit Cards. If however the transaction fails, you can contact your bank, but don't expect a solution. Use a PayPal account instead, or pay about 10 Euros more to buy your ticket from a travel agent.}}\n\nThese facts turn travelling by train in Spain into a nightmare for rail pass holders, and into (at least) a mild nuisance for other travellers. Even young Spaniards don't travel long distances by train very often. They usually ride a bus (when they're on a tight budget or have to travel on a short notice) or fly (when they can book in advance). Flights within Spain are not much more expensive than trains and are well worth looking into, because of the time you save. Just keep in mind that the AVE high-speed train service between Madrid and Barcelona is actually faster than taking a plane, when you factor in all airport transfers and security checks! On the other hand, trains are more comfortable and allow you to take plenty of luggage.\n\n===By bus===\nThe easiest way to get around most parts of Spain is by bus. Most major routes are point to point, and very high frequency. There is a different operator for each route, but usually just one operator per route. At the bus station, each operator has its own ticket. The staff at any of them is usually happy to tell you who operates which route.  The following two are major bus companies serving much of the country:\n* <listing name=\"Grupo Alsa\" alt=\"\" directions=\"\" lat=\"\" long=\"\" address=\"Avenida de América\nIntercambiador 9-A, 28002 Madrid\" phone=\"+34 902 42 22 42\" tollfree=\"\" email=\"\" fax=\"\" url=\"http://www.alsa.es\" hours=\"\" price=\"\"> which also included Continental Auto</listing>\n* <listing name=\"Grupo Avanza\" alt=\"\" directions=\"\" lat=\"\" long=\"\" address=\"\" phone=\"+34 91 272 28 32\" tollfree=\"\" email=\"\" fax=\"\" url=\"http://www.avanzabus.com/\" hours=\"\" price=\"\"> operates the Alosa, Tusza, Vitrasa & Auto Res lines</listing>\n\n... or see [http://www.movelia.es/es/ Movelia.es] (an independent bus booking site) for additional smaller bus lines serving specific autonomous regions or provinces in the country or see the article(s) on a specific city, town, province or autonomous community as to what's there.\n\n===By boat===\nWherever you are in Spain, from your private yacht you can enjoy gorgeous scenery and distance yourself from the inevitable crowds of tourists that flock to these destinations. May is a particularly pleasant time to charter in the regions of Costa Brava, Costa Blanca and the Balearic Islands as the weather is good and the crowds have yet to descend. The summer months of July and August are the hottest and tend to have lighter winds. There is no low season for the [[Canary Islands]], as the weather resembles springtime all year round.\nIf you would like to bareboat anywhere in Spain, including the Balearic or Canary Islands, a US Coast Guard License is the only acceptable certification needed by Americans to bareboat. For everyone else, a RYA Yacht Master Certification or International Certificate of Competence will normally do.\nAlthough a skipper may be required, a hostess/chef may or may not be necessary. Dining out is strong part of Spanish custom and tradition. If you are planning on docking in a port and exploring fabulous bars and restaurants a hostess/cook may just be useful for serving drinks and making beds. Extra crew can take up valuable room on a tight ship.\n\nYacht and boats rentals in Spain [http://www.maritimvs.com], - Costa Brava, Costa Central, Costa Daurada, Majorca, Minorca, Ibiza and Formentera.\n\nLuxury yachts in Spain [http://alquilerdeyatesenibiza.com], - Yacht charter and sailing, one of the worlds largest acht charter companies, can take care of all charter requirements, from bareboat to crewed in Spain. Operating from nine offices worldwide (USA, Spain, UK, Germany, Italy, France, Spain, Switzerland, Caribbean, Hong Kong and Dubai)\n\n=== By car ===\nIn major cities like [[Madrid]] or [[Barcelona]] and in mid-sized ones like [[San Sebastian]], moving around by car is both expensive and nerve-wracking. Fines for improper parking are uncompromising (€85 and up).\n\nHaving a driving map is essential - many streets are one-way; left turns are more rare than rights (and are unpredictable).\n\nGetting around by car makes sense if you plan to move from one city to another every other day, ideally if you don't plan to park overnight in large cities. It also doesn't hurt that the scenery is beautiful and well worth a drive.\n\nThere are two types of highway in Spain: ''autopistas'', or motorways, and ''autovías'', which are more akin to expressways. Most autopistas are toll roads while autovías are generally free of charge. [http://bkpk.me/road-trip-tips-for-spain/] Speed limits range from 50 km/h in towns to 90 km/h on rural roads, 100 km/h on roads and 120 km/h on autopistas and autovías. \n\nIntersections of two highways typically have a roundabout under the higher one--so you can both choose any turn and to start driving in an opposite direction there.\n\nGreen light for cars about to turn is frequently on at the same time as green light for pedestrians: every time you turn, check if the pedestrians' path you cross doesn't also have green light for them.\n\nBetween cities, profesional drivers (bus drivers for example) are required to have some rest every 2 hours they drive--there's a fine if you don't follow.\n\nFilling procedure for gas stations varies from brand to brand. At Agip, you first fill the tank yourself, and then pay inside the shop. Gasoline is relatively inexpensive compared to other countries in the EU and Japan, but still more expensive than in the U.S.\n\nSpeed Limits:\n\nUsually, maximum speed limits are as follows:\nMotorways - 120 km/h;\nFast main roads – 100 km/h;\nOther non-urban roads – 90 km/h;\nUrban towns and cities – 50 km/h.\n\nThe minimum speed allowed on motorways is 60 km/h. Be observant! Some residential roads in Spain have lower speed limits – even 20 km/h. Luckily, all speed limits are adequately indicated on large warning signs in their locations.\n \nSpeeding fines (multas) are high in Spain and depend on the degree to which you exceed the speed limit. On-the-spot fines can reach 600 EUR. Speeding fines must be paid within 60 days. If you pay your fine within a certain amount of time, you may get up to 50% discount.\nSpanish police use numerous static speed cameras and portable radar traps. Static cameras are mainly set on the 120 km/h motorways. They can be occasionally painted in fluorescent yellow with a speed limit on them \n[[https://rental24h.com/driving-in-spain-guide]].\n\n\n==== By thumb ====\n\nSpain isn't a good country for [[Tips for hitchhiking|hitchhiking]].  Sometimes you can wait many hours. Try to speak with people at gas stations, parking lots etc. They are scared and suspicious, but when you show them that they shouldn't be afraid, they gladly accept you and mostly also show their generosity.\nIn the South of Spain, in and around the Alpujarras, hitchhiking is very common and it is also very easy to get a ride. As long as you can speak a bit of spanish and don't look too dirty/frightening, you should be able to get a ride moderately easily.\n\n==== Renting a car ====\nIf you plan to move around large cities or explore further afield  you will find many companies that offer car hire at affordable prices because of the high competition between car rental agencies, consider renting a car with GPS navigation--it will be even easier to drive than having an automobile map.\n\nConsider having full-coverage insurance instead of franchise: other drivers are not always careful parking near other cars, especially when parking space on a street is limited.\n\nSpanish drivers can be unpredictable and some of the roads on the Southern area of Malaga and the Costa Del Sol are notoriously dangerous. \n\nTherefore you will want a car with a fully comprehensive insurance package with includes a collision damage waiver (CDW) and a vehicle theft waiver, as well as liability cover. Many of the car hire companies offer an insurance option where you can choose to reduce your vehicle excess. This means that if you are in an accident you would not be financially liable for the whole excess fee.\n\nChild seats are also available with all vehicles so that any children in your party can travel safely and in comfort.\n\nAir conditioning is a must in the hot Spanish summer months. Nevertheless you should make sure to take water with you at all times.\n\nIf you break down while on holiday you will want a car hire company that gives you the free roadside assistance of trained mechanics. Cars often overheat in Spain while the tires are vulnerable on the hot roads.\n\n'''Avis''' accepts payment in US dollars when you pay by a credit card. If you need to pay when you return rented car, payment is made from deposit you provided by credit card in the beginning--so you don't pay extra money upon return, waiting for weeks for deposit to be unblocked.\n[http://www.sixt.com link Sixt in Spain] is one of the biggest car rental companies in Spain where you will be able to get a rent a car no matter what city you are in Spain.\n\n=== By bicycle ===\nSpain is heaven for cycling, judging by how many cyclists you can see in the cities. Cycling lanes are available in mid-sized and large cities.\nIt must be taken into account that Spain is the second most mountainous country in Europe, and the mountains and hills are from coast to coast. For example, Madrid is between 600 and 700 metres above sea, so if you travel through it by bicycle you have to be in a good shape.\n\n=== By taxi ===\nAll the major cities in Spain are served by taxis, which are a convenient, if somewhat expensive way to get around. That being said, taxis in Spain are more reasonably priced than those in say, the [[United Kingdom]] or [[Japan]]. Most taxi drivers do not speak English or any other foreign languages, so it would be necessary to have the names and/or addresses of your destinations written in Spanish to show your taxi driver. Likewise, get your hotel's business card to show your taxi driver in case you get lost.\n\n==Talk==\n\n\n{{infobox|Many English words have their origins in Latin, which makes it easy for English speakers to guess the meanings of many Spanish words. However, Spanish and English also have a number of false cognates that one needs to be aware of to avoid embarrassing mistakes. <br>\n-'''embarazada''' - pregnant; ''not'' embarrassed <br>\n-'''suburbio''' - slum; ''not'' suburb <br>\n-'''preservativo''' - condom; ''not'' preservative <br>\n-'''bizarro''' - brave; ''not'' bizarre}}\n\nUnsurprisingly, the official and universal language used in Spain is Spanish (''español''), but it is more complicated than that. It is part of the Romance family of languages (others include Portuguese, Galician, Catalan, Italian, Occitan, French, and Romanian) and is one of the main branches of that family. Many people, especially outside Castille, prefer to call it '''[[Castilian Spanish phrasebook|Castilian]]''' (''castellano''). \n\nHowever, there are a number of languages (Catalan, Basque, Galician, Asturian, etc.) spoken in various parts of Spain. Some of these languages are dominant in their respective regions, and, following their legalization in the 1978 constitution, they are co-official with Castilian in their respective areas. Of these, Catalan, Basque and Galician are recognised as official languages according to the Spanish constitution. In the Basque Country and Catalonia, Spanish is more widely spoken than Basque and Catalan, but the regional governments try and encourage the use of both languages in their respective regions. Apart from Basque (whose origins are still debated), the languages of the Iberian Peninsula are part of the Romance family and are fairly easy to pick up if you know Castilian well. While locals in those also speak Spanish fluently, learning a few words in the local languages where you are traveling will help endear you to the locals. Galician is the only language which has a native majority in its region. All Spaniards are functionally bilingual and no-one should have problems communicating in Spanish.\n\n* '''[[Catalan phrasebook|Catalan]]''' (Catalan: ''català'', Castilian: ''catalán''), a distinct language similar to Castilian but more closely related to the Oc branch of the Romance Languages and considered by many to be part of a dialect continuum spanning across Spain, France, and Italy and including the other langues d'oc such as Provençal, Beàrnais, Limousin, Auvernhat and Niçard. Various dialects are spoken in the northeastern region of [[Catalonia]], the [[Balearic Islands]], and [[Valencia (region)|Valencia]] (where it is often referred to as ''Valencià''), east of [[Aragon]], as well as neighboring [[Andorra]] and southern France. To a casual listener, Catalan superficially appears to be a cross of Castilian and French, and though it does share features of both, it is an independent language in its own right.\n\n* '''[[Galician phrasebook|Galician]]''' (Galician: ''galego'', Castilian: ''gallego''), very closely related to Portuguese, Galician is spoken in [[Galicia]] and the western portion of [[Asturias]].  Galician predates Portuguese and is deemed one of the four main dialects of the Galician-Portuguese family group which includes Brazilian, Southern Portuguese, Central Portuguese, and Galician.  While some Portuguese might consider it a dialect of Portuguese, Galicians themselves consider it their own language.\n\n* '''[[Basque phrasebook|Basque]]''' (Basque: ''euskara'', Castilian: ''vasco''), a language unrelated to Castilian (or any other known language in the world), is spoken in the three provinces of the [[Basque Country]], on the two adjacent provinces on the French side of the Spain-French border, and in Navarre.  Basque is unrelated to any Romance language or to any branch of the Indo-European family of languages. It currently remains unclassified and is deemed a linguistic isolate. \n\n* '''[[Asturiano phrasebook|Asturiano]]''' (Asturiano: ''asturianu'', Castilian: ''asturiano'', also known as ''bable''), spoken in the province of [[Asturias]], where it enjoys semi-official protection. It was also spoken in rural parts of [[Leon]], [[Zamora]], [[Salamanca]], in a few villages in Portugal (where it is called Mirandes) and in villages in the extreme north of [[Extremadura]]. While the constitution of Spain explicitly protects Basque, Balearic-Catalan-Valencian under the term Catalan, Galician, and Castilian, it does not explicitly protect Asturian. Still, the province of Asturias explicitly protects it, and Spain implicitly protects it by not objecting before the Supreme Court.  \n\n* '''[[Aragonese phrasebook|Aragonese]]''' (Aragonese: ''aragonés'', Castilian: ''aragonés'', also known colloquially as ''fabla''), spoken in the north of [[Aragon]]. It is only vaguely recognized and not official (as of June 2008). This language is close to Catalan (specially in [[Benasque]]) and to Castilian, with some Basque and Occitan (southern France) influences. Nowadays, only a few villages near the [[Pyrenees]] use the language vigorously, while most people mix it with Castilian in their daily speech.\n\n* '''[[Aranese phrasebook|Aranese]]''' (Castilian: ''Aranés'', Catalan/Aranese Occitan: ''Aranès''), spoken in the Aran Valley and recognized as an official language of Catalonia (not of Spain), alongside Catalan and Castilian. This language is a variety of Gascon Occitan, and as such is very closely related to Provençal, Limousin, Languedoc, and Catalan.\n\nIn addition to the native languages, '''English''' and [[French phrasebook|French]] are commonly studied in school. While most younger Spaniards have studied English in school, due to a lack of practice and exposure, proficiency is generally poor, and most people will not know more than a few basic words. If you are lost, your best bet would generally be young urban people. To improve your chances of being understood, stick to simple words and avoid long sentences.\n\nThat being said, airlines, major hotels and popular tourist destinations usually have staff members who speak an acceptable level of English, and particularly in popular beach resorts such as those in the [[Costa del Sol]], you will find people who are fluent in several languages. English is also generally more widely spoken in [[Barcelona]] than in the rest of the country. As [[Portuguese phrasebook|Portuguese]] and [[Italian phrasebook|Italian]] are closely related to Spanish, if you speak either of these languages, locals would be able to puzzle you out with some difficulty, and as long as you speak slowly, you won't need an interpreter for the most part.\n\nCastillian Spanish differs from the Latin American varieties in pronunciation and other details. There is also a pronoun (\"vosotros\", literally \"you others\", used to address a group of two or more people in the second person) and its associated verb conjugations, rarely used in Latin American Spanish. However, all Latin American varieties are easily understood by Spaniards, and are recognized simply as different versions of one language by the Royal Spanish Academy, the barometer for all things Spanish language.  While some Spaniards believe theirs is the more 'pure' version of Spanish, most Spaniards recognize the reality that there is no 'pure' Spanish, even within their own country. \n\nFrench is the most widely understood foreign language in the northeast of Spain, like [[Alquezar]] and [[Cap de Creus]] (at times even better than English), as most travelers there come from [[France]].\n\nLocals will appreciate any attempts you make to speak their language. For example, know at least the Castilian for \"good morning\" (''buenos días'') and \"thank you\" (''gracias'').\n\n==See==\n\nThe most popular beaches are the ones in the Mediterranean coasts and the Canary Islands. Meanwhile, for hiking, the mountains of Sierra Nevada in the south, the Central Cordillera and the northern Pyrenees are the best places.\n\n===Itineraries===\n* [[Via de la Plata Route]] Historic 800km route from [[Gijón]] to [[Sevilla]].\n* [[Way of St. James]]\n\n===Historic cities===\n\nHistorically, Spain has been an important crossroads: between the Mediterranean and the Atlantic, between North Africa and Europe, and as Europe beginning colonizing the New World, between Europe and the Americas. As such, the country is blessed with a fantastic collection of historical landmarks - in fact, it has the 2nd largest number of UNESCO Heritage Sites and the largest number of World Heritage Cities of any nation in the world.\n\nIn the south of Spain, Andalusia holds many reminders of old Spain. '''[[Cadiz]]''' is regarded as one of the oldest continuously-inhabited cities in western Europe, with remnants of the Roman settlement that once stood here. Nearby, '''[[Ronda]]''' is a beautiful town situated atop steep cliffs and noted for its gorge-spanning bridge and the oldest bullring in Spain. '''[[Cordoba (city, Spain)|Cordoba]]''' and '''[[Granada (Spain)|Granada]]''' hold the most spectacular reminders of the nation's Muslim past, with the red-and-white striped arches of the Mezquita in Cordoba and the stunning Alhambra palace perched on a hill above Granada. '''[[Seville]]''', the cultural center of Andalusia, has dazzling collections of sights built when the city was the main port for goods from the Americas, the grandest of which being the city's cathedral, the largest in the country.\n\nMoving north across the plains of La Mancha into Central Spain, picturesque '''[[Toledo (Spain)|Toledo]]''' stands as perhaps ''the'' historical center of the nation, a beautiful medieval city sitting atop a hill that once served as the capital of Spain before Madrid was built. Not far from the Portuguese border, '''[[Merida]]''' contains well preserved Roman ruins, a UNESCO World Heritage site. North of Madrid and an easy day-trip from the capital city is '''[[El Escorial]]''', once the center of the Spanish empire during the time of the Inquisition; '''[[Segovia]]''', noted for its spectacular Roman aqueduct which spans one of the city's squares; and the beautiful walled city of '''[[Avila]]'''. Further north, culture tourists will enjoy '''[[Burgos]]''', with its beautiful Gothic cathedral and the world famous archaeological site of Atapuerca; '''[[Leon (Spain)|Leon]]''', whose Gothic cathedral was the first national protected building; '''[[Salamanca]]''', known for its famous university and abundance of historic architecture; and '''[[Soria]]''', with the nearby pre-roman archaeological site of Numancia.\n\nGalicia in northwestern Spain is home to '''[[Santiago de Compostela]]''', the end point of the old [[Way of St. James]] (''Camino de Santiago'') pilgrimage route and the supposed burial place of St. James, with perhaps the most beautiful cathedral in all of Spain at the heart of its lovely old town. Northeastern Spain has a couple of historical centers to note: '''[[Zaragoza]]''', with Roman, Muslim, medieval and Renaissance buildings from throughout its two thousand years of history, and '''[[Barcelona]]''' with its medieval [[Barcelona/Ciutat Vella|Barri Gòtic]] neighborhood.\n\nVisitors should be aware of the limited hours and likely entrance fees at many historic Spanish churches.  With entry fees averaging €8, families will need to take the expense of religious sightseeing in Spain into account.  Another important consideration when planning your trip to Spain are the limited hours of access to Spanish churches. Unlike neighbouring countries Italy, France and Germany, churches in Spain are only open for mass once or twice a day and thus, only open to the local worshipping population. While large cathedrals are open all day, these only represent some of the significant christian legacy of Spain.  When combined with the high entry prices and bans on photography levied against you to visit most of the large cathedrals of the country, a trip to Spain to indulge yourself in Christian history can be challenging.\n\n===Art museums===\nSpain has played a key role in Western art, heavily influenced by French and Italian artists but very distinct in its own regard, owing to the nation's history of Muslim influence, Counter-Reformation climate and, later, the hardships from the decline of the Spanish empire, giving rise to such noted artists like El Greco, Diego Velázquez and Francisco Goya. In the last century, Spain's unique position in Europe brought forth some of the leading artists of the Modernist and Surrealist movements, most notably the famed Picasso and Salvador Dalí.\n\nToday, Spain's two largest cities hold the lion's share of Spain's most famous artworks. Madrid's [[Madrid#Museum_Triangle|Museum Triangle]] is home to the '''Museo del Prado''', the largest art museum in Spain with many of the most famous works by El Greco, Velázquez, and Goya as well as some notable works by Italian, Flemish, Dutch and German masters. Nearby sits the '''Reina Sofía''', most notable for holding Picasso's ''Guernica'' but also containing a number of works by Dalí and other Modernist, Surrealist and abstract painters.\n\nBarcelona is renowned for its stunning collection of modern and contemporary art and architecture. This is where you will find the '''Picasso Museum''', which covers the artist's early career quite well, and the architectural wonders of '''Antoni Gaudi''', with their twisting organic forms that are a delight to look at. A day trip from Barcelona is the town of [[Figueres]], noted for the '''Salvador Dalí Museum''', designed by the Surrealist himself.\n\nOutside of Madrid and Barcelona, the art museums quickly dwindle in size and importance, although there are a couple of worthy mentions that should not be looked over:  Many of El Greco's most famous works lie in '''[[Toledo (Spain)|Toledo]]''', an easy day trip from Madrid. ''The Disrobing of Christ'', perhaps El Greco's most famous work, sits in the Cathedral, but you can also find work by him in one of the small art museums around town. '''[[Valladolid]]''' is home to the National Museum of Sculpture, with an extensive collection ranging from the Middle Ages to the 19th century. '''[[Bilbao]]''' in the Basque Country of northern Spain is home to a spectacular '''Guggenheim Museum''' designed by Frank Gehry that has put the city on the map.\n\nBesides the public museums, you will also find some contemporary art treasures in private galleries. A directory containing a major part of them is available at [http://www.consorciodegalerias.es/ Consorcio De Galerias].\n\n==Do==\n\n===Festivals===\nSpain has a lot of local festivals that are worth going to.\n\n* '''Feria de Abril''' ([[Sevilla]] in April/May) - Best fair in the whole Iberian peninsula that attracts thousands of people from all over the world. If you enjoy folklore, flamenco, dancing and drinking, this is your place.\n\n* '''[[Sevilla]]'s & [[Málaga]]'s Semana Santa (Easter)''' - worth seeing. From Palm Sunday to Easter Sunday. Lots of processions occur within that week. '''Holy week''' (Easter Week) - best in Seville and the rest of [[Andalusia]]; also interesting in [[Valladolid]] (silent processions) and [[Zaragoza]] (where hundreds of drums are played in processions)\n\n* '''Córdoba en Mayo''' ([[Cordoba (city, Spain)|Cordoba]] in May) - great month to visit the Southern city\n\n* '''Las Cruces''' (1st week in May) - big flower-made crosses embellishing public squares in the city center, where you will also find at night music and drinking and lot of people having fun!\n\n* '''Festival de Patios''' - one of the most interesting cultural exhibitions, 2 weeks when some people open doors of their houses to show their old Patios full of flowers\n\n* '''Arde Lucus''' - biggest roman recreation festival of Europe, all inside the walled city of [[Lugo]], UNESCO World Heritage. Last weekend on June.\n\n* '''Cata del Vino Montilla-Moriles''' - great wine tasting in a big tent in the city center during one week in May\n\n* '''Dia de Sant Jordi''' - The Catalan must, in April 23th [[Barcelona]] is embellished with roses everywhere and book-selling stands can be found in the Rambla. There are also book signings, concerts and diverse animations.\n\n* '''Fallas''' - [[Valencia]]'s festival in March - burning the \"fallas\" is a must\n\n* '''[[Málaga]]'s August Fair''' - flamenco dancing, drinking sherry, bullfights\n\n* '''San Fermines''' - July in [[Pamplona]], [[Navarra]].\n\n* '''Fiesta de San Isidro''' - May 15 in [[Madrid]] - a celebration of [[Madrid]]'s patron saint.\n\n* '''Carnival''' - best in [[Santa Cruz de Tenerife]], [[Las Palmas de Gran Canaria]] and [[Cádiz]]\n\n* '''Cabalgata de los Reyes Magos''' (Three wise men parade) - on the eve of epiphany, 5th of January, the night before Spanish kids get their Christmas presents, it rains sweets and toys in every single town and city\n\n* '''San Sebastian International Film Festival''' - held annually in [[San Sebastian]], a gorgeous city in the Basque Country, towards the end of September\n\n* '''La Tomatina''' - a giant [http://www.tomatofestivalspain.com tomato fight] in [[Buñol]]\n\n* '''Moros y Cristianos''' (Moors and Christians, mostly found in Southeastern Spain during spring time) - parades and \"battles\" remembering the fights of medieval ages\n\n*85 festivals in Galicia throughout the year from wine to wild horses.\n\n===Holidays===\n* '''New Year's Eve''': There's a tradition in Spain to eat grapes as the clock counts down the New Year, one grape for each of the last twelve seconds before midnight. For this, even small packs of grapes (exactly 12 grapes per pack) are sold in supermarkets before New Year.\n\n===Outdoor activities===\n*'''Vías Verdes''' in: [[Cycling from the Pyrinees to the Mediterranean Coast: a weekend getaway]] \nThis is an experience that combines nature and sport, has 2 contrasting landscapes: the mountainous Pyrenees and the Mediterranean Costa Brava, goes off-the-beaten-track places where few tourists and foreigners go, offers delicious inland Catalan food and finishes by with a swim in the Mediterranean and eating Mediterranean food.\nGreen-Ways, also known as Vías Verdes in Spanish, are old railway tracks that have been recovered and reconditioned for walkers and cyclists. They are an awesome way to discover Spain. They are easy to access and since trains once rolled over these paths, there is no  So it is a great activity for all ages and fitness levels.There are 1,800 kilometres of Vías Verdes all over Spain. There is easy access to Vías Verdes by train. \nIn total, there would be 138 km of cycling for one weekend. The trip starts in the Pyrenees and finishes in the beaches of Costa Brava. Until Girona the landscapes are mountaineous, green, wet and you can feel real nature. You cross small villages and rivers. After Girona the towns become larger and there are some parts that look more industrialized. But as you approach to the end, in Sant Feliu de Guíxols, the scenery becomes more Mediterranean and you start smelling the pine trees and for sure the sea. The hardest part of the trip is climbing to the coll of Santigosa (hill of Santigosa). Along the way there are plenty of opportunities to stay at rural homes and truly experience local living. \nIf you are interested in a trip like this contact: www.spainforreal.com\n\nFor more information about Catalan Green-Ways you can look here:\nhttp://www.viasverdes.com/en/principal.asp\n* '''Canyoning''': see [[Canyoning#Spain|Spain section in the Canyoning article]]\n\n* '''Climbing''' in: [[Los Mallos]] ([[Aragon]]) and [[Siurana]] (near [[Barcelona]])\n\n* '''Whitewater sports''' in: [[Campo]], [[Murillo de Gallego]] ([[Aragon]])\n* '''Hiking''' in Galicia\n* '''Downhill skiing''' There are a lot of downhill skiing resorts in Spain. \n\nSkiing in the northen region of Spain\n\n===Scuba Diving===\nFor a treat, try Costa Brava and the world renowned Canary Islands.\n\n==Buy==\n===Money===\n{{Euro}}\n\nThe euro replaced the Spanish peseta in 2002. A few people may still use the old national currency (166,386 pts = 1 €, 1.000 pts = 6 €) and convert into Euros later. This is much due to the huge presence of peseta, and \"her\" many nicknames in colloquial Spanish.\n\n'''Cash euro:''' €500 banknotes are not accepted in many stores--always have alternative banknotes.\n\n'''Other currencies:''' Do not expect anybody to accept other types of currency, or to be willing to exchange currency. Exceptions are shops and restaurants at airports. These will generally accept at least '''US Dollars''' at a slightly worse exchange rate.\n\nIf you wish to '''exchange money''', you can do so at any bank (some may require that you have an account there before they will exchange your money), where you can also cash in your '''traveller's cheques'''. Currency exchanges, once a common sight, have all but disappeared since the introduction of the Euro. Again, international airports are an exception to this rule; other exception is tourist districts in the large cities (Barcelona, Madrid).\n\n'''Credit cards:''' Credit cards are well accepted: even in a stall at La Boqueria market in [[Barcelona]], on an average highway gas station in the middle of the country, or in small towns like [[Alquezar]]. It's more difficult to find a place where credit card is not accepted in Spain.\n\nMost ATMs will allow you to withdraw money with your credit card, but you'll need to know your card's PIN for that. Most Spanish stores will ask for ID before accepting your credit card.  Some stores may not accept a foreign driving license or ID card and you will need to show your passport. This measure is designed to help avoid credit card fraud.\n\n===Business hours===\nMost businesses (including most shops, but not restaurants) close in the afternoons around 13:30/14:00 and reopen for the evening around 16:30/17:00. Exceptions are large malls or major chain stores.\n\nFor most Spaniards, lunch is the main meal of the day and you will find bars and restaurants open during this time. On Saturdays, businesses often do not reopen in the evening and almost everywhere is closed on Sundays. The exception is the month of December, where most shops in Madrid and Barcelona will be open as per on weekdays on Sundays to cash in on the festive season. Also, many public offices and banks do not reopen in the evenings even on weekdays, so if you have any important business to take care of, be sure to check hours of operation.\n\nIf you plan to spend whole day shopping in small shops, the following rule of thumb can work: a closed shop should remind it's also time for your own lunch. And when you finish your lunch, some shops will be likely open again.\n\n===Clothes and shoes===\n====Designer brands====\nBesides well-known mass brands which are known around the world (Zara, Mango, Bershka, Camper, Desigual), Spain has many designer brands which are more hard to find outside Spain--and may be worth looking for if you shop for designer wear while travelling. Some of these brands include:\n* <listing name=\"Custo Barcelona\" alt=\"\" directions=\"\" address=\"\" phone=\"\" email=\"\" fax=\"\" url=\"http://www.custo-barcelona.com/\" hours=\"\" price=\"\">Headquartered in [[Barcelona]], has stores in [[Bilbao]], [[Ibiza]], [[La Coruna]], [[Las Palmas de Gran Canaria]], [[Leon]], [[Madrid]], [[Marbella]], [[Palma de Mallorca]], [[Salamanca]], [[Tenerife]]. </listing>\n\n* <buy name=\"Kowalski\" alt=\"\" address=\"head office: Ctra. del Leon, km, 2; 03293 Elche\" directions=\"\" phone=\"+34 966 630 612\" email=\"\" fax=\"\" url=\"http://www.kowalski-shoes.com/\" hours=\"\" price=\"\">Designer shoes and sneakers (trademark Herman Monster and others) for women, men and unisex.</buy>\n\n====Department stores====\n* <buy name=\"El Corte Ingles\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"http://elcorteingles.es\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"\">Major national chain that can be found in nearly every city. In most cities, enjoys central location but resides in functional, uninspiring buildings. Has department for everything--but is not good enough for most purposes, except maybe for buying gourmet food and local food specialties. Still very popular with uneducated travelling shoppers - the locals consider it expensive for a department store, though its customer service is well regarded. Tax refund for purchases at El Corte Ingles, unlike most other stores in Spain, can be returned only to a debit/credit card, even if you originally paid in cash.\n\nAlso, given that they usually occupy very large buildings, Corte Ingles stores are usually a landmark in major Spanish cities and are very well connected to the local mass transit networks.</buy>\n\n====Others====\n* <buy name=\"Casas\" alt=\"\" address=\"\" directions=\"\" phone=\"\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">A chain of footwear stores that selects most popular (?) models from a dozen+ of mid-range brands.</buy>\n\n* <buy name=\"Camper\" alt=\"\" address=\"\" directions=\"\" phone=\"\" email=\"\" fax=\"\" url=\"http://www.camper.com/\" hours=\"\" price=\"\">Camper shoes can be seen in most cities in the country.  While it may seem that they are sold everywhere, finding right model and size may be a trouble--so if you find what you need, don't postpone your purchase. Campers are sold both in standalone branded shops, and as a part of a mix with other brands in local shoe stores. Standalones generally provide wider choice of models and sizes; local stores can help if you need to hunt for a specific model and size.</buy>\n\n* <buy name=\"For\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"http://for.es/\" hours=\"\" price=\"\" lat=\"\" long=\"\" email=\"\" fax=\"\">Private national fashion chain featuring many premium brands. Main location is [[Bilbao]]; some stores in [[San Sebastian]] and [[Zaragoza]].</buy>\n\n==Eat==\n[[File:Spanish mix of tapas (7068994247).jpg|thumb|250px|Spanish mix of tapas]]\n[[File:Festa da Istoria 2011 (6089203513).jpg|thumb|250px|Raciones]]\nThe Spanish are very passionate about their food and wine and Spanish cuisine. Spanish food can be described as quite light with a lot of vegetables and a huge variety of meat and fish. The Spanish cuisine does not use many spices; it relies only on the use of high quality ingredients to give a good taste. There are usually a variety of restaurants in most cities (Italian, Chinese, American fast food) if you would like to experience a variety of flavors.   \n\n===Breakfast, Lunch and Dinner times===\nSpaniards have a different eating timetable than many people are used to.\n\nThe key thing to remember for a traveler is:\n* breakfast ('''el desayuno''') for most Spaniards is light and consists of just coffee and perhaps a ''galleta'' (like a graham cracker) or ''magdalena'' (sweet muffin-like bread).  Later, some will go to a cafe for a pastry midmorning, but not too close to lunchtime.\n* \"el aperitivo\" is a light snack eaten around 12:00. However, this could include a couple of glasses of beer and a large filled baguette or a \"pincho de tortilla\".\n* lunch ('''la comida''') starts at 13:30-14:30 (though often not until 15:00) and was once typically followed by a short siesta, usually at summer when temperatures can be quite hot in the afternoon.  This is the main meal of the day with two courses ('''el primer plato''' and '''el segundo plato''' followed by dessert.  ''La comida'' and siesta are usually over by 17:00 at the latest. However, since life has become busier, there is no opportunity for a siesta.\n* dinner ('''la cena''') starts at 20:30 or 21, with most clientèle coming after 21. It is a lighter meal than lunch. In Madrid restaurants rarely open before 21:00 and most customers do not appear before 22:00.\n* there is also an afternoon snack that some take between ''la comida'' and ''la cena'' called '''la merienda'''.  It is similar to a tea time and is taken around 18 or so.\n* between the lunch and dinner times, most restaurants and cafes are closed, and it takes extra effort to find a place to eat if you missed lunch time. Despite this, you can always look for a ''bar'' and ask for a ''bocadillo'', a baguette sandwich. There are ''bocadillos fríos'', cold sandwiches, which can be filled with ham, cheese or any kind of ''embutido'', and ''bocadillos calientes'', hot sandwiches, filled with pork loin, ''tortilla'', bacon, sausage and similar options with cheese. This can be a really cheap and tasty option if you find a good place.\n\nNormally, restaurants in big cities don't close until midnight during the week and 2-3AM during the weekend.\n\n===Breakfast===\nBreakfast is eaten by most Spaniards. Traditional Spanish breakfast includes coffee or orange juice, and pastries or a small sandwich. In Madrid, it is also common to have hot chocolate with \"churros\" or \"porras\". In cafes, you can expect varieties of ''tortilla de patatas'' (see the [[#Spanish dishes|''Spanish dishes'' section]]), sometimes tapas (either breakfast variety or same kind as served in the evenings with alcohol).\n\n===Tapas===\n[[File:Pimientos de Padrón Madrid 2010 0709.jpg|thumb|250px|Pimientos]]\n[[File:Cazuela de Caracoles- 2011.JPG|thumb|250px|Caracoles]]\nThe entry level to Spanish food is found in bars as '''tapas''', which are a bit like \"starters\" or \"appetizers\", but are instead considered side orders to accompany your drink. Some bars will offer a wide variety of different tapas; others specialize on a specific kind (like seafood-based). A Spanish custom is to have one tapa and one small drink at a bar, then go to the next bar and do the same.  A group of two or more individuals may order two or more '''tapas''' or order '''raciones''' instead, which are a bit larger in order to share.\n\n===Pintxos===\nPintxos (pronounced as pinchos) are unique to the '''Basque Region''', and are similar to '''tapas''', in that they are small portions typically served at bars, but with different styles, and traditions, and should not be referred to as tapas. Pintxos are traditionally finger food served on a sliced baguette, or on a wooden skewer, but it's not uncommon to find bars that have dispensed with that tradition, especially for higher end pintxos. Most pintxo bars will have a selection of pintxos to choose from on the bar itself, and some will have an additional menu posted you can order hot made to order pintxos from. In regions known for their pintxos, like '''San Sebastian''', it's not uncommon to find very high end, and well prepared pintxos that would be at home on some of the worlds best restaurant menu's. Pintxo prices are typically relatively inexpensive, and range from &euro;1 - &euro;5, and are usually ordered with a drink (for example: '''Txakoli''', a dry wine, or Kalimotxo, red wine mixed with cola, both common in Basque Region) for an additional &euro;1 - &euro;3. \n\n=== Fast food===\nFast food has not yet established a strong grip on the Spaniards and you will find McDonalds and Burger King only in bigger towns in the usual places.  The menu can be a surprise since it has been customized to appeal to the locals and beer, salads, yogurt (primarily Danone), and wine are prominent. Pizza is increasingly popular and you will find some outlets in bigger towns but it can be their own homegrown franchises, such as TelePizza. In spite of beer and wine on the menu, fast food is often seen as \"kiddie food.\" American franchises generally charge higher prices than in the United States, and fast food is not necessarily the cheapest alternative for eating out.\n\n===Restaurants===\n\n'''Seafood''': on a seacoast, fresh seafood is widely available and quite affordable. In the inner regions, frozen (and poor quality) seafood can be frequently encountered outside few highly reputed (and expensive) restaurants. In coastal areas seafood deserves some attention, especially on the north Atlantic coast.\n\nQuality seafood in Spain comes from Spain's northwestern region of Galicia. So restaurants with the words ''Gallego'' (Galician) will generally specialize in seafood. If you are feeling adventurous,  you might want to try the Galician regional specialty ''Pulpo a la Gallega'', which is boiled octopus served with paprika, rock salt and olive oil. Another adventurous option is ''Sepia'' which is cuttlefish, a relative of squid, or the various forms of ''Calamares'' (squid) that you can find in most seafood restaurants. If that isn't your style you can always order ''Gambas Ajillo'' (garlic shrimp), ''Pescado Frito'' (fried fish), ''Buñuelos de Bacalao'' (breaded and deep fried cod) or the ever-present ''Paella'' dishes. \n\n\n'''Meat products''' are usually of very good quality, because Spain has maintained quite a high percentage of free range animals.\n\nOrdering beef steaks is highly recommended, since most comes from free range cows from the mountains north of the city.\n[[File:Camino, Canary Wharf, London (7794526230).jpg|thumb|250px| \t\n\nThe presa ibérica, being \"Iberico black pig shoulder blade cooked medium-rare and served with pea purée\"]]\nPork cuts which are also highly coveted are those known as ''Presa Iberica'' and ''Secreto Iberico'', an absolute must if found in the menu of any restaurant.\n\n'''Soups''': choice of soups beyond gazpacho is very limited in Spanish restaurants.\n\n'''Water''' is frequently served without a specific request, and is normally charged for--unless it's included in your ''menu del dia''.  If you would like free tap water instead of bottled water, request \"agua del grifo\" (water from the tap).  However, not all restaurants will offer this and you may be forced to order bottled water.\n\n'''Appetizers''' such as bread, cheese, and other items may be brought to your table even if you didn't order them.  You will be charged for them.  If you do not want these appetizers, politely inform the waiter that you do not want them.\n\n'''Tipping''' is not observed in Spain so don't tip (unless there was something absolutely exceptional about the service).  As a result, people from countries where tipping is the norm (primarily the US) may find that waiters are not as attentive or courteous since they don't work for tips. This is less true in major resorts and cities where tipping is common.  Look around at other diners to assess if tipping is appropriate.\n\n'''World-level restaurants''': There are several restaurants in Spain which are destinations in itself, becoming a sole reason to travel to a specific city. One of them is ''El Bulli'' in [[Roses]].\n\n===Tipping and VAT===\n\n'''Service charges''' are included in the bill. You are free to tip if you are very pleased: you would typically leave the small change after paying with a note. Maybe at the most touristy places they expect you to give some extra, but Spanish people do not commonly do it.\n\nVAT is-not-included is a common trick for mid-range and splurge restaurants: always check in menu whether VAT (10%, IVA in Spanish) is included in menu prices.\n\n===Menú del día===\n\nMany restaurants offer a complete lunch meal for a fixed price &ndash; \"menú del día\" &ndash; and this often works out as a bargain. Water or wine is commonly included in the price.\n\n===Food & Wine Tours===\n\nThose looking for some orientation to the rich and diverse culinary traditions of Spain can consider going on a food tour. Options are plentiful in every city, and especially in Barcelona, San Sebastian, and Madrid. A quick Google search will reveal the most popular ones.\n\n===Touristy places===\n\nTypical Spanish food can be found all over the country, however top tourist destinations such as Costa Brava and Costa del Sol have turned all existing traditions upside down. Meaning that drinks are generally more expensive (about double) and quality is at its lowest. It is difficult to find proper Spanish food in the tourist centers. \n\nInstead, you will get Schnitzel, original English breakfast, Pizza, Donner, and frozen fish. However, if you are prepared to look a little harder, then even in the busiest tourist towns, you can find some exceptional traditional Spanish restaurants. If you are on the coast then think fish and seafood and you won't be disappointed.\n\n===Non-Spanish cuisine===\n\nIn most cities you can also find international cuisine such as Italian, Chinese, French, Thai,  Japanese, Middle Eastern, Vietnamese, Argentinian, etc. The bigger the city, the more variety you can find.\n\nFor the past decade there has been a surge in the number of Irish pubs and Japanese restaurants to be found in most cities.\n\n===Specialties to buy===\n* '''Cheese''': Spain offers a wide variety of regional cheeses.\n:*''Queso Manchego'' is the most famous one.\n:*''Cabrales'',''Tetilla'',''Mahon'' are also popular.\n[[File:Camino, Canary Wharf, London (7794527864).jpg|thumb|250px|The chorizo with roasted peppers]]\n* '''Chorizo''': Spain's most popular sausage is spiced cured, made from pork, ham, salt, garlic and pepper and is produced in multitude of varieties, in different sizes, shapes, short and long, spicy, in all different shades of red, soft, air dried and hard or smoked. Frequently contains emulgators and conservatives, so check ingredients if you feel sensitive.\n\n* '''Jamón (air dried ham)''': ''Jamón Serrano'' (Serrano ham): Is obtained from the salt meat of the back legs of the pig and air dried. This same product is given the name of ''trowel'' or ''paletilla'' when it is obtained from the front legs. Also it receives the names of ''jamón Iberico'' (Iberian) and ''jamón of bellota'' (acorn). They are specially famous jamones that takes place in Huelva (Spain), in Guijuelo (province Salamanca), in the Pedroches (province Cordova) and in Trevélez (province of Granada). ''Jamón Iberico'' is made from free range pigs.\n:Judging by Boqueria in Barcelona, ''Jamon Iberico'' starts at &euro;80/kg, and ''Jamon Serrano'' is about &euro;25/kg. One well known chain in Spain is Mesón Cinco Jotas [http://www.mesoncincojotas.com/index_english.htm], which is known by locals for their expensive, but good quality ham.\n\n:Visiting Spain without trying ''Jamon Iberico'' would be considered a crime by most Spaniards. Spaniards treat their ham very seriously and types and qualities of ham vary in a similar way to wine. Quality ham is generally expensive but has little to do with the many cheaper versions available. The diet of the pig is the most important factor in determining the quality of the ham. The least expensive ham comes from pigs fed on normal grains whereas medium grade pigs are raised on a combination of acorns and grains. The top tier pigs are fed exclusively on acorns and their hams are not considered to be the best grade without an \"acorn fed\" stamp. These top grade hams have a rich flavor and an oily texture but to non-connoisseurs, glossiness and the presence of white lines of fat crisscrossing a slice of ham is generally a good indicator of its quality. \n\n\n* '''Morcilla''': Black sausages made from pig blood, generally made with rice or onion. Sometimes flavoured with anise, it comes as a fresh, smoked or air dried variety.\n\n===Spanish dishes===\n[[File:Boquerones Fritos.jpg|thumb|250px|Boquerones Fritos]]\nTypical Spanish dishes include:\n\n* ''Aceitunas, Olivas'': Olives, often served for nibbling.\n\n* ''Bocadillo de Calamares'': Fried battered calamari served in a ciabatta sandwich with lemon juice.\n\n* ''Boquerones en vinagre'': Anchovies marinated in vinegar with garlic and parsley. \n\n* ''Caracoles'': Snails in a hot sauce.\n\n* ''Calamares en su tinta'': Squid in its ink.\n\n* ''Chipirones a la plancha'': Grilled little squids.\n\n* ''Churros'': A fried horn-shaped snack, sometimes referred to as a Spanish doughnut. Typical for a Spanish breakfast or for tea time. Served with hot chocolate drink.\n\n* ''Empanadas Gallegas'': Meat or tuna pies are also very popular in Madrid. Originally from region of Galicia.\n\n* ''Ensaladilla Rusa (Russian Salad)'': This potato salad dish of Russian origin, widely consumed in parts of Eastern Europe and the Middle East, is strangely enough, extremely popular in Spain.\n\n* ''Fabada asturiana'': Bean stew from Asturias.\n\n* ''Gambas al ajillo'': Prawns with garlic and chili. Fantastic hot stuff.\n[[File:Gazpacho 7862.jpg|thumb|200px|Gazpacho]]\n* ''Gazpacho Andaluz'': Cold vegetable soup. Best during the hot weather. It's like drinking a salad.\n\n* ''Lentejas'': A dish made from lentils with chorizo sausage and/or Serrano ham.\n\n* ''Mariscos'': Shellfish from the province of Pontevedra.\n\n* ''Merluza a la Vizcaina'': The Spanish are not very fond of sauces. One of the few exceptions is merluza a la Vasca. The dish contains hake (fish of the cod family) prepared with white asparagus and green peas. \n\n* ''Potajes or pucheros'': Garbanzo beans stew at its best\n[[File:Paella de marisco 01.jpg|thumb|250px|Paella]]\n* ''Paella or Paella Valenciana'': This is a rice dish originally from Valencia. Rice is grown locally in what look like wheat fields, and this is the variety used in paella. The original paella used chicken and rabbit, and saffron ('''el azafran'''). Nowadays varieties of paella can be found all over Spain, many containing seafood. Locals suggest to find true paella in large parties like a wedding in a village, but few restaurants still can compete with it.\n\n* ''Patatas Bravas'': Fried potatoes which have been previously boiled, served with a patented spicy sauce. They are potatoes cut in form of dices or prism, of one to two centimeters of size approximately and that they are fried in oil and accompanied by a sharp sauce that spills on potatoes using hot spices. \n\n* ''Pescaíto frito'': Delicious fried fish that can be found mainly in southern Spain\n\n* ''Pimientos rellenos'': Peppers stuffed with minced meat or seafood. The peppers in Spain taste different than all other peppers in Europe.\n\n* ''Potaje de espinacas y garbanzos'': Chick pea stew with spinach. Typical of Seville.\n\n* ''Revuelto de ajetes con setas'': Scrambled eggs with fresh garlic sprouts and wild mushrooms. Also commonly contains shrimps.\n\n* ''Setas al ajillo/Gambas al ajillo'': Shrimps or wild mushrooms fried in garlic.\n\n* ''Sepia con alioli'': Fried cuttlefish with garlic mayonnaise. Very popular among tourists.\n\n* ''Tortilla de patatas'': Spanish egg omelet with fried potato. Probably the most popular dish in Spain. You can easily assess how good a restaurant is by having a small piece of its potato tortillas. Frequently it is made also with onion, depending on the zone or the pleasure. The potatoes must be fried in oil (preferably of olive), and they are left soaking with the scrambled egg for more than 10 minutes, although better if it is average hour so that they are soaked and they acquire the suitable consistency.\n\n==Drink==\n\n=== Tea and Coffee ===\nSpanish people are very passionate about the quality, intensity  and taste of their coffee and good freshly brewed coffee is available almost everywhere.\n\nThe usual choices are '''solo''', the milk-less espresso version; '''cortado''', solo with a dash of milk; '''con leche''', solo with milk added; and '''manchado''', coffee with lots of milk (sort of like the French ''cafe au lait''). Asking for ''caffee latte'' will likely result in less milk than you are used to--it's always OK to ask for adding extra milk.\n\nRegional variants can be found, such as '''bombón''' in Eastern Spain, solo with condensed milk.\n\n'''Starbucks''' [http://www.starbucks.es] is the only national chain operating in Spain. Locals argue that it cannot compete with small local cafes in quality of coffee and it's frequented mostly by tourists, thought it has become somewhat popular with young \"hip\" people. It is not present in smaller cities but it's basically everywhere in Barcelona or Madrid.\n\n'''Café de Jamaica''' offers many kinds of coffee as well as infusions.\n\n'''Bracafe''' that means 'brasilian coffee' offers high quality coffee.\n\nIf you eat for &euro;20 per dinner, you will never be served a good tea; expect Pompadour or Lipton. It takes some effort to find a good tea if you spend most time of the day in touristy places.\n\n===Alcohol===\nThe drinking/purchasing age of alcoholic beverages in Spain is '''18'''. People under this age are forbidden to drink and buy alcoholic drinks, although enforcement in tourist and clubbing areas is lax. Drinking in the streets has recently been banned (although it is still a common practice in most nightlife areas). Alcohol may not available in some stores between 10 p.m. and 9 a.m. without the store possessing a specific license to sell alcohol.\n\nTry an absinthe cocktail (the fabled liquor was never outlawed here, but it is not a popular drink in Spain).\n\n===Bars===\n\nProbably one of the best places to meet people in Spain is in bars. Everyone visits them and they are always busy and sometimes bursting with people. There is no age restriction imposed to enter these premises. but children and teenagers often will not be served alcoholic drinks.  Age restrictions for the consumption of alcohol are clearly posted at bars but are enforced only intermittently. It is common to see an entire family at a bar. \n\nIt's important to know the difference between a pub (which closes at 3-3:30 a.m.) and a club (which opens until 6-8 a.m. but is usually deserted early in the night).\n\nOn weekends, the time to go out for ''copas'' (drinks) usually starts at about 11 p.m.-1 a.m. which is somewhat later than in North and Central Europe. Before that, people usually do any number of things, have some tapas (''raciones'', ''algo para picar''), eat a \"real\" dinner in a restaurant, stay at home with family, or go to cultural events. If you want to go dancing, you will find that most of the clubs in Madrid are relatively empty before midnight (some do not even open until 1 a.m.) and most won't get crowded until 3 a.m. People usually go to pubs, then go to the clubs until 6-8 a.m.\n\nFor a true Spanish experience, after a night of dancing and drinking it is common to have a breakfast of ''chocolate con churros'' with your friends before going home. (''CcC'' is a small cup of thick, melted chocolate served with freshly fried sweet fritters used for dipping in the chocolate and should be tried, if only for the great taste.)\n\nBars are mainly to have drink and a small ''tapa'' while socializing and decompressing from work or studies. Usually Spaniards can control their alcohol consumption better than their northern European neighbors and drunken people are rarely seen at bars or on the streets.  A drink, if ordered without an accompanying tapa, is often served with a \"minor\" or inexpensive tapa as a courtesy. \n\nSize and price of tapas changes a lot throughout Spain. For instance, it's almost impossible to get free tapas in big cities like Valencia or Barcelona, excluding Madrid where there are several Tapa Bars althought some times are a bit expensive. You can eat for free (just paying for the drinks), with huge tapas and cheap prices at cities like Granada, Badajoz or Salamanca.\n\nThe tapa, and the related pincho, trace their existence in Spain to both acting as a cover (\"Tapa\") on top of a cup of wine to prevent flies from accessing it, and as a requirement of law when serving wine at an establishment during the middle ages.\n\n===Beer===\n\nThe Spanish beer is not too bad and well worth a try. Most popular local brands include San Miguel, Cruzcampo, Mahou, Estrella Damm, Ámbar, Estrella de Galicia, Moritz, Keller and many others, including local brands at most cities; import beers are also available. A great beer is 'Mezquita' (Cervezas Alhambra), try to find it! Also \"Legado de Yuste\" is one of the best beer made in Spain, and is quite extended, but more expensive than a normal 'caña'. \nMost brands offer non-alcoholic beer.\n\nIn Spain, beer is often served from a tap in 25 cl (\"caña\") or 33 cl (\"tubo\") tube glasses. Bigger servings are rare, but you can also ask for a \"corto\", \"zurito\" (round the Basque country) or simply \"una cerveza\" or \"tanque\" (south of the country) to get a half size beer, perfect to drink in one go and get quickly to the next bar while having tapas.\n\nIf you're in [[Zaragoza]] (or [[Aragon]], in general), the Pilsner-type '''Ambar''' (5.2% alc.) and the stronger '''Export''' (double malt, 7.0% alc.) are available. '''Ambar 1900''': Its production began in 1996. The system of fermentation to room temperature is used. '''Marlen''' is a beer of traditional manufacture using malted barley and hops.\n\nWhile beer production has been dominated by big brands, nowadays a new brew appears in the market quite regularly. To date there are around 400 producers of craft beer in Spain, although it represents just a tiny fraction (0.3 percent) of the country beer market, brews are growing like beer-foam. Between 2008 and 2015 it grew 1.600%. The [barcelonaeatlocal.com/hottest-craft-beers-in-spain/ Spanish Craft Beer revolution] is challenging big brands.\n\nParticularly on hot summer days people will drink a refreshing \"clara\" which is a light beer mixed with lemon/lemonade.\n\n===Cava===\n\nCava is Spanish sparkling wine and the name went from Spanish Champagne to Cava was after a long lasting dispute with the French. The Spanish called it for a long time champan, but the French argued that champagne can be made only from grapes grown in the Champagne region in France. Nevertheless, Cava is a quite successful sparkling wine and 99% of the production comes from the area around [[Barcelona]].\n\n=== Cider (Sidra)===\nCan be found in the [[Galicia]], [[Asturias]], [[Cantabria]] and [[Pais Vasco]]. This is slightly different to ciders found elsewhere in the world, since it not carbonated. It is often served in small doses (''culines'') that are poured from great height (called ''escanciar'') in order to give it the feel of a carbonated beverage. This practice is particularly common in Asturias, although nowadays many establishments provide a small machine that makes the slightly difficult process of ''escanciar'' easy to do at your table.\n\n=== Horchata ===\nA milky non-alcoholic drink made of tigernuts and sugar. [[Alboraia]], a small town close to [[Valencia]], is regarded as a best place where horchata is produced.\n\n===Sangria===\n\nSangria is drink made of wine and fruits and usually is made from simple wines. You will find sangria in areas frequented by tourists. Spanish prepare sangria for fiestas and hot summer, and not every day as seen in touristic regions like [[Mallorca]].\n\nSangria in restaurants aimed for foreigners are best avoided, but it is a very good drink to try if a Spaniard prepares it for a fiesta!\n\n===Sherry (Fino)===\n\nThe pale sherry wine around Jerez called \"fino\" is fortified with alcohol to 15 percent. If you would like to have one in a bar you have to order a ''fino''. Manzanilla is bit salty, good as an appetizer. Amontillado and Oloroso are a different types of sherry were the oxidative aging process has taken the lead.\n\n===Wine===\n\nSpain is a country with great wine-making and drinking traditions: 22% of Europe's wine growing area is in Spain, however the production is about half of what the French produce.\n\n'''Regions''': most famous wines come from ''Rioja'' region, less known but also important come from ''Ribera del Duero'', ''Priorato'', ''Toro'' and ''Jumilla'' . The latter are becoming more and more popular and are slightly less expensive than Rioja wines. White, rose and red wines are produced, but the red wines are certainly the most important ones.\n\n'''Grapes''': main red grapes are Tempranillo, Garnacha, Monastrell and Mencia. Primary white grape used is ''Albarino'', and the grapes used in Jerez are: 'Pedro Ximenez and Palomino.\n\n'''Specific names''': ''Valdepenas'' is good value for money. '''Whites''': ''Belondrade Y Lurton'' is regarded as greatest white wine in Spain. ''Vina Sol'' is good as a mass product, with fruity taste.\n\n'''Grades''': Spanish quality wines are produced using an aging process and they have been in a oak barrel for at least one year before they can be labeled Crianza and then spend another two years in a bottle before been sold. Reservas are aged for five years and Gran Reservas are aged for 10 years.\n\n'''Prices''': Spain has seen a tremendous rise in wine prices over the last decade and Spanish wines are not as much of a bargain as they used to be. However you will still find 5, 10 and 20 year old wines at affordable prices especially when compared with similar quality wines from Australia, Chile, France, and the US.\n\n'''Wine bars''': they are more and more popular. In short, a wine bar is a sophisticated tapas bar where you can order wine by the glass. You will immediately see a blackboard with the wines that are available and the price per glass.\n\n'''In a bar''': for red wine in a bar, ask \"un tinto por favor\", for white wine \"un blanco por favor\", for rose: \"un rosado por favor\". In certain bars you have to specify \"un crianza\" (for an aged wine) or \"un Rioja, un Ribera\" (for a wine from Rioja or Ribera de Duero) if you don't want a cheap wine.\n\n'''Wine tourism''': Spain´s wine regions offer many opportunities to enjoy wine tasting at wineries and local food. Most popular wine destinations are Rioja due to its tradition as a red wine producing region, Jerez de la Frontera, due to its proximity to holiday destination and the impressive wineries that specialise in Sherry production and the wine region south of Barcelona in Penedes. Many interesting itineraries and routes are proposed by local wine organisations. List of wine tourism routes in Spain [http://winetourismspain.com/wine-tourism/]\n\n\n'''Wine-based drinks''': young people in Spain have developed their own way to have wine. When having ''botellones'' (big outdoor parties with drink and lots of people), most of them mix some red wine with Coke and drink it straight from the Coke bottle. The name of this drink is ''calimocho'' or ''kalimotxo'' (in the Basque Country and Navarre) and is really very popular... But don't ask for it while in an upper class bar or among adults, since they will most certainly not approve of the idea! As a general rule, any wine that comes in a glass bottle is considered \"too good\" to make ''kalimotxo''.\n\n==Sleep==\n\n{{infobox|What's the difference?|There are three names for hotel-like accommodation in large cities in Spain: ''hotel'', ''hostal'' and ''pension''. It is important not to confuse a hostel with a ''hostal''; a host'''e'''l offers backpacker-type accommodation with shared rooms, whereas a ''host'''a'''l'' is very similar to a guest house and is generally cheaper than a hotel.}}\n\nThere are many types of tourist accommodation, ranging from hotels, pensions and rented villas, to camping and even monasteries.\n\n\"10% VAT is not included\" is a common trick for mid-range guesthouses and hotels: always check the small print when you choose your place to stay. VAT is IVA in Spanish.\n\n===Small villages===\nBesides the coasts, Spain is rich in small tourist-friendly ''inland'' villages, like [[Alquezar]]: with narrow medieval streets, charming silence and isolation, still good selection of affordable restaurants and accommodation.\n\n===Casa rural, the [[bed and breakfasts]] of Spain===\n\nFor a more homely sort of accommodation consider the casa rural. A casa rural is the rough equivalent to a bed and breakfast or a gîte. Not all houses are situated in the countryside, as the name implies. Some are situated in the smaller towns, and they are in virtually every province.\n\nCasas rurales vary in quality and price throughout Spain. They are strictly controlled and inspected.\n\n===Hotels===\n\nMany foreign visitors stay in hotels that have been organised by tour operators who offer package holidays to the popular resorts on the costas and islands. However, for the independent traveller, there are hotels all over the country in all categories and to suit every budget. In fact, due to the well developed internal and foreign tourism markets Spain may well be one of the best served European countries in terms of numbers and quality of hotels. Spain also includes some of the most luxurious hotels in Europe ([http://spaininstyle.co.uk/ Spain In Style]) which are more towards the higher price range for hotels.\n\n===Paradores===\n\nA parador (inn) [http://www.parador.es/english/] is a state-owned hotel in Spain (rating from 3 to 5 stars). These are a chain of hotels founded in 1928 by the Spanish King Alfonso XIII. The unique aspects of paradores are their location and their history. Found mostly in historical buildings, such as convents, Moorish castles (like [[La Alhambra]]), or haciendas, paradores are the exact opposite of the uncontrolled development found in coastal regions like the [[Costa del Sol]]. Hospitality has been harmoniously integrated with the restoration of castles, palaces and convents, rescuing from ruin and abandonment monuments representative of Spain's historical and cultural heritage.\n\nFor example the parador in Santiago de Compostela is located next to the Cathedral in a former royal hospital built in the year 1499. Rooms are decorated in an old-fashioned way, but nevertheless have modern facilities. Other notable paradores are in [[Arcos de la Frontera]], [[Ronda]], [[Santillana del Mar]] (Altamira cave) as well as more than 100 other destination all over Spain.\n\nParadores serve breakfast (about €10) and often have very good local cuisine typical of their region (about €25). \n\nAccommodation prices are good value, when you consider that the hotels are often found in the heart of scenic areas, varying from €85 for a double room to €245 for a twin room (like in [[Granada (Spain)|Granada]]). Two of the most beautiful paradors are in [[Leon (Spain)|Léon]] and [[Santiago de Compostela]].\n\nThere are some promotions available:\n* Over 60 year olds can enjoy a discount.\n* Youngsters under 30 can visit the paradors at a 10% discount. The discount also applies to companions over 30.\n* Two nights half board have a discount of 20%.\n* A dreamweek of 6 nights is cheaper.\n* 5 nights at €42 per person.\n\nThe promotions do not always apply, especially in August they are not valid, and may require advance bookings.\n\n===Hostels===\nThere are plenty of [[hostels]], mostly in Madrid. Prices vary from €15 to €25 per night.\n*'''Xanascat''' [http://www.xanascat.cat] is the National Network of Youth Hostels of Catalonia if you are visiting Barcelona, Girona, Taragona or other locations in the region.\n\n===Apartment rental===\nShort-term, self-catering apartment rental is an option for travellers who want to stay in one place for a week or more. Accommodations range from small apartments to villas.\n\nThe number of holiday rentals available depends on the area of Spain you are planning to visit. Although they are common in coastal areas, big capitals and other popular tourist cities, if you plan to visit small inland towns, you will find casas rurales more easily.\n\n===Camping===\nCamping is the least expensive lodging option.\n\n==Stay safe==\n\n===Police===\n\nThere are four kinds of police: \n\n* 'Policía Municipal' or 'Local' (metropolitan police), In [[Barcelona]]: Guardia Urbana. Uniforms change from town to town, but they use to wear black or blue clothes with pale blue shirt and a blue cap (or white helmet) with a checkered white-and-blue strip. This kind of police keeps order and rules the traffic inside cities, and they are the best people in case you are lost and need some directions. Although you can't ''officially'' report theft to them, they will escort you to 'Policia Nacional' headquarters if required, and they will escort the suspects to be arrested also, if needed.\n\n* 'Policía Nacional' wear dark blue clothes and blue cap (sometimes replaced by a baseball-like cap), unlike Policía Municipal, they do not have a checkered flag around their cap/helmet. Inside cities, all offenses/crimes should be reported to them, although the other police corps would help anyone who needs to report an offense.\n\n* 'Guardia Civil' keeps the order outside cities, in the country, and regulates traffic in the roads between cities. You would probably see them guarding official buildings, or patrolling the roads. They wear plain green military-like clothes; some of them wear a strange black helmet ('tricornio') resembling a toreador cap, but most of them use green caps or white motorcycle helmets.\n\n* Given that Spain has a high grade of political autonomy released to its regional governments, four of them have created regional law forces: the Policía Foral in Navarre, the Ertzaintza in the Basque Country or the Mossos d'Esquadra in Catalonia. These forces have the almost the same competences as the Policía Nacional in their respective territories.\n\nAll kinds of police also wear high-visibility clothing (\"reflective\" jackets) while directing traffic, or in the road.\n\n===Theft===\n\nSpain is a safe country, but you should take some basic precautions encouraged in the entire world:\n\n* Thieves prefer stealth to direct confrontation so it is unlikely that you will be hurt in the process, but exercise caution all the same.  \n*There have been instances where thieves on motorbikes drive by women and grab their purses, so keep a tight hold on yours even if you don't see anyone around.\n* Try not to show the money you have in your wallet or purse.\n* Always watch your bag or purse in touristic places, buses, trains and meetings. A voice message reminding that is played in most of the bus/train stations and airports.\n* Do not carry large amounts of money with you, unless needed. Use your credit card (Spain is the first country in number of cash points and most shops/restaurants accept it). Of course, use it with caution.\n* Beware of [[pickpockets]] when visiting areas with large numbers of people, like crowded buses or the Puerta del Sol(in Madrid). If you report a thief, people are generally helpful.\n* Don't hesitate to report crimes to local police.\n* In general, you must bear in mind that those areas with a larger number of foreign visitors, like some crowded vacation resorts in the East Coast, are much more likely to attract thieves than places which are not so popular among tourists.\n* Avoid gypsy women offering rosemary, refuse it always; they will read your future, ask for some money, and your pocket will probably be picked. Some gypsy women will also approach you on the street repeating \"Buena suerte\" (\"good luck\") as a distraction for another gypsy woman to try to pickpocket you. Avoid them at all costs.\n* A great tourist attraction is the Flea Market (el Rastro) in Madrid on the weekends.  However, as it is nearly standing room only - it is also an attraction for pickpockets.  They operate in groups... be extremely cautious in these tight market type environments as it is very common to be targeted... especially if you stand out as a tourist or someone with money.  Try to blend in and not stand out and you will likely not be at as much risk.\n* Women who carry purses should always put the straps across their bodies.  Always hold on to the purse itself and keep it in front of your body.  Keep one hand on the bottom, as pickpockets can otherwise slit the bottom without you ever knowing.\n* Never place anything on the back of a chair or on the floor next to you, keep it on your person always.\n* If you must use an ATM, do not flash the money you have just picked up.\n\n===Scams===\n\nSome people could try to take advantage of your ignorance of local customs.\n\n* In Spanish cities, all taxis should have a visible fare table. Do not agree a fixed price to go from an airport to a city: in most cases, the taxi driver will be earning more money than without a preagreed tariff. Many taxi drivers will also demand a tip from foreign customers or even from national ones on the way to and from the airport. You might round up to the nearest euro when paying though.\n\n* In many places of Madrid, especially near Atocha station, and also in the Ramblas of [[Barcelona]], there are people ('trileros') who play the \"shell game\". They will \"fish\" you if you play, and they will most likely pick your pocket if you stop to see other people play. \n\n* Before paying the bill in bars and restaurants, always check the bill and carefully scrutinize it. Some staff will often attempt to squeeze a few extra euros out of unsuspecting tourists by charging for things they did not eat or drink, or simply overcharging. This is true in both touristy and non-touristy areas. If you feel overcharged, bring it to their attention and/or ask to see a menu. It is also sometimes written (in English only) at the bottom of a bill that a tip is not included: remember that tipping is optional in Spain and Spanish people commonly leave loose change only and no more than a 5%-8% of the price of what they have consumed (not an American-style 15-20%), so avoid being fooled into leaving more than you have to.\n\n===Other things you should know===\n\n* Spanish cities can be LOUD at night, especially on weekends.\n* All stores, hotels and restaurants should have an official complaint form, in case you need it.\n* The emergency telephone number (police, firefighters, ambulances) is 112. You may call it from any phone at no cost, in case you need to.\n\n===Drugs===\n\nIn Spain possession and consumption of illegal drugs at private places is not prosecuted. Taking drugs in public and possession, for personal use, will be fined from €300 to €3000 depending of the drug and the quantity that you carry on, you will not get arrested unless you have large quantities destined for street sale.\n\n==Stay healthy==\n\n* Pharmaceuticals are not sold at supermarkets, only at 'farmacias' (pharmacies), identified with a green cross or a Hygeia's cup. Nearly every city and town has at least one 24 hour pharmacy; for those that close at  night, the law requires  a poster with the address of the nearest pharmacy, possibly in one of the nearby streets or towns.\n\n* People from the European Union and a few more European countries can freely use the public health system, if they have the appropriate intereuropean sanitary card. That card does not work in private hospitals. Agreements are established to treat people from a few American countries; see the Tourspain link below for more info.\n\n* '''However, do not hesitate to go to any healthcare facility should you be injured or seriously ill, as it would be illegal for them not to treat you, even if you are uninsured.'''\n\n* Though most foreigners tend to think Spain is a warm place, it can be terribly cold in winter, especially in the Central Region and in the North, and in some places it is also rainy in summer. Remember to travel with adequate clothes.\n\n* In summer, avoid direct exposure to sunlight for long periods of time to prevent sunburn and heatstroke. Drink water, walk on the shady side of street and keep a container of sun cream (suntan lotion) handy.\n\n* Most cities have a good water supply, especially [[Madrid]], but you may prefer bottled water to the alkaline taste of water in the east and south.\n\n===Smoking===\nOn 21 December 2010, the Spanish Parliament approved a law prohibiting smoking in all indoor public and work places and near hospitals and in playgrounds, becoming effective on 2 January 2011. Smoking is now banned in all enclosed public spaces and places of work, in public transportation, and in outdoor public places near hospitals and in playgrounds. Smoking is also banned in outdoor sections of bars and restaurants. Smoking is banned in television broadcasts as well.\n\n==Respect==\n\n====Culture and identity====\n\n* Spaniards in general are very patriotic about both their country and the region in which they live. Avoid arguments about whether or not people from Catalonia, Galicia or the Basque Country are Spaniards. Safety is generally not a concern in case you engage in an argument, but you will be dragged in a long, pointless discussion.\n\n* Spaniards are generally very interested in maintaining their linguistic and cultural connections with Latin America. However, most Spaniards are also quick to point out they are Europeans and do not understand the common North American notion that \"Hispanics,\" including Spaniards, are somehow all the same. People from other Spanish-speaking countries or backgrounds may encounter a variety of receptions from being embraced as cultural kin to rejection or apathy.\n\n* Spaniards are not as religious as the media sometimes presents them, but they are and always were a mostly Catholic country (73% officially, although just 10% admit practicing and just a 20% admit being believers); respect this and avoid making any comments that could offend.  In particular, religious festivals, Holy Week (Easter), and Christmas are very important to Spaniards. Tolerance to all religions should be observed, especially in large urban areas like Madrid, Barcelona, Valencia, Seville or Malaga (where people and temples of all beliefs can be found) or different regions in southern Spain, which may have a sizeable Muslim population (which accounts for almost a 4,5% of the country's total).\n\n* Despite being a Catholic majority country, homosexuality is tolerated in Spain and public display of same-sex affection would not stir hostility a majority of the time. In fact, same-sex marriages are legal and recognized by the government and provide legal benefits to same-sex couples. However, a gay friendly country does not always necessarily mean that the Spaniards are friendly to gays: (people in places like Madrid or Barcelona, which are 2 of the largest urban areas in Europe, will obviously have a more open view than those from rural areas). As in any other place, elderly people do usually have far more conservative points of view. Still, violence against gays is rarely heard of and Spain should be safe for most gay and lesbian travelers.\n\n* Avoid talking about the former colonial past and especially about the \"Black Legend.\" Regardless of what you may have heard Spain had several ministers and military leaders of mixed race serving in the military during the colonial era and even a Prime Minister born in the Philippines (Marcelo Azcarraga Palmero). Many Spaniards take pride in their history and former imperial glories. People from Spain's former colonies (Latin America, Equatorial Guinea, the Philippines, Western Sahara and Northern Morocco) make up a majority of foreign immigrants in Spain (a 58%) along with the Chinese, Africans and Eastern Europeans. Equally, Spain is one of the main investors and economic and humanitarian aid donors to Latin America and Africa. \n\n* Bullfighting is seen by many Spaniards as a cultural heritage icon, but the disaffection with bullfighting is increasing in all big cities and obviously among animal activist groups within the country. Many urban Spaniards would consider bullfighting a show aimed at foreign tourists and elder people from the countryside, and some young Spaniards will feel offended if their country is associated with it. To illustrate how divided the country is, many Spaniards point to the royal family: King Juan Carlos and his daughter are avid fans, while his wife and the Heir Prince do not care for the sport. Bullfights and related events, such as the annual San Fermin Pamplona bull-runs, make up a multimillion-dollar industry and draw many tourists, both foreign and Spaniard. In addition, bullfighting was recently banned in the northeastern region of Catalonia and has also been outlawed in several towns and counties all over the country.\n\n* Avoid mentioning the past, such as the former fascist dictatorship of Francisco Franco, who ruled Spain from 1939 to 1975, and especially the Civil War of 1936-1939. Many symbols, pictures, statues and monuments affiliated with the Franco regime have been outlawed and possible fines and jail time could result if you violate these laws. This was a painful past as Franco ruled Spain with an iron fist, executing many Spaniards who violated the anti-democratic laws of the regime. Nonetheless,  one of the best periods of economic growth in Spain was the one that took place during the last years of Franco's regime, so some older Spaniards may have supportive views of Franco's ultranationalist and anticommunist ideology, so talking against Franco in front of them may be considered offensive.\n\n====Socializing====\n\n* It is customary to kiss friends, family, and acquaintances on both cheeks upon seeing each other and saying goodbye. Male-to-male kisses of this sort are limited to family members or to very close friends; otherwise a firm handshake is expected instead (same as in France or Italy). A happy medium is the traditional ''abrazo'' (hug) which is usually done to people that you haven't seen in a long time and/or are very glad to see, regardless of gender (male-to-male is somewhat more common). When somebody expects a hug he/she usually will throw his/her arms towards you: this is more common than you may think, but don't do it with complete strangers as it's probably a ruse to get your wallet.\n\n* Related to this, Spaniards are keen to maintain physical contact while talking, such as putting a hand on your shoulder, patting your back, etc. These should be taken as signs of friendship done among relatives, close friends and colleagues.\n\n* When in a car, the elderly and pregnant always ride in the passenger's seat, unless they request not to.\n\n* While Spaniards may not always be the most punctual people in the world, you should never arrive late to appointments; this will seem very bad to most people. \n\n* If you are staying at a Spaniard's home, bring shoes to wear inside such as slippers. Walking around barefoot in the house is viewed as unsanitary and also an easy way to catch a cold.\n\n* In Spanish beaches it is okay for women to sunbathe topless. This practice is particularly common in tourist areas. Full nudity is practised in \"clothing-optional\" or nudist beaches.\n\n====Eating and drinking====\n\n* During lunch or dinner, Spaniards do not begin eating until everyone is seated and ready to eat. Likewise, they do not leave the table until everyone is finished eating. Table manners are otherwise standard and informal, although this also depends on the place you are eating. When the bill comes, it is common to pay equally, regardless of the amount or price each has consumed.\n\n* When Spaniards receive a gift or are offered a drink or a meal, they usually refuse for a while, so as not to seem greedy. This sometimes sparks arguments among especially reluctant people, but it is seen as polite. Remember to offer more than once (on the third try, it must be fairly clear if they will accept it or not). On the other hand, if you are interested in the offer, politely smile and decline it, saying that you don't want to be a nuisance, etc., but relent and accept when they insist.\n\n* Spaniards rarely drink or eat in the street. Bars will rarely offer the option of food to take away but \"tapas\" are easily available. Especially unheard of until recently was the \"doggy bag.\" However, in the last few years, taking leftovers home from a restaurant, although still not common, has become somewhat less of a stigma than it once was. One asks for \"un taper\" (derived from \"Tupperware\") or \"una caja.\" Older Spaniards are still likely to frown on this.\n\n* Appearing drunk in public is generally frowned upon, though it's somewhat more accepted if you're a foreigner - but drunk rowdy foreigners are a negative stereotype in Spain so try to be respectful.\n\n==Cope==\nAmong Spaniards, lunch time is usually between 13:00 and 14:30, while dinner time is around 21:00. However, in special celebrations, dinner can be as late as 22:00. Almost all businesses close between 14:30 and 17:00, so plan your shopping and sight-seeing accordingly. Shopping malls and supermarkets, however, are usually open from 9:30 to 22:00, and there are several 24 h shops, usually owned by Chinese immigrants.\n\nSpanish cities can be noisy in some areas so be warned.\n\n==Contact==\nThe main mobile network operators in Spain are Yoigo, Vodafone, Movistar and Orange. As in most of Europe voice and data coverage is generally good in urban areas, however it can be patchy in rural locations. OpenSignal provide a [http://opensignal.com/coverage-maps/Spain/ Spain cell coverage map] allowing comparison between all the networks.\n\nWhen using a laptop in an outdoor location,  always be aware of your surroundings and the location of your belongings. Also be aware that even though it is not yet illegal to use unsecured wi-fi signals,  there is work being done on the relevant laws and it may become illegal very soon.\n\n\"Locutorios\" (Call Shops) are widely spread in bigger cities and touristy locations. In Madrid or Toledo it's very easy to find one. Making calls from \"Locutorios\" tend to be much cheaper, especially international calls (usually made through VoIP). They are usually a good pick for calling home.\n\nCheap mobile phones (less than €50) with some pre-paid minutes are sold at FNAC (Plaza Callao if you're staying in Madrid, or El Triangle if you're staying in Barcelona) or any phone operator's shop (Vodafone, Movistar, Orange) and can be purchased without many formalities (ID is usually required). Topping-up is then done by buying scratch cards from the small stores \"Frutos Secos,\" supermarkets, vending points (often found in tobacco shops) or kiosks -- recharging via the internet or via an ATM does not work with foreign credit cards.\n\nTo call home cheap you may opt to buy prepaid calling cards which are widely available in newspapers or grocery stores around the city. Simply ask for a \"tarjeta telefonica\".\n\nWhen travelling in Spain is not easy getting connected, Internet pre-paid cards can be purchased but with few formalities. Wi-Fi points in bars and cafeterias are available after ordering, and most Hotels offer Wi-Fi connection in common areas for their guests. \n\nPrepaid portable WiFi Hot spot service is now available in Spain (provided by tripNETer[http://www.tripneter.com/] and [http://alldayinternetspain.com AlldayInternet] ) which allows the connection to any WiFi device: Smart-phones, Tablets, PCs…\n\nYou can rent a mobile Wi-Fi hotspot (4G/LTE) for short term period at a reasonable price. Some companies such as  My Webspot provide unlimited internet for the duration you need in Spain (from 5€ per day). It is delivered to your hotel or at the airport. A good solution to stay connected, and place international calls with your favorite Apps \n\n===== Question about Spain content =====\nWould you please consider revising the warning at the top of the Spain https://wikitravel.org/en/Spain page?\n    WARNING: The Catalonia region has experienced severe civil unrest...\nIt is, at best, out of date.\n[[User:Chibike|Chibike]] ([[User talk:Chibike|talk]]) 08:35, 4 November 2018 (EST)\n\n\n[[ca:Espanya]]\n[[de:Spanien]]\n[[eo:Hispanio]]\n[[es:España]]\n[[fi:Espanja]]\n[[fr:Espagne]]\n[[he:ספרד]]\n[[hi:स्पेन]]\n[[hu:Spanyolország]]\n[[it:Spagna]]\n[[ja:スペイン]]\n[[nl:Spanje]]\n[[pl:Hiszpania]]\n[[pt:Espanha]]\n[[ro:Spania]]\n[[ru:Испания]]\n[[sv:Spanien]]\n[[zh:西班牙]]\n[[wts:Category:Spain]]\n\n\n[[WikiPedia:Spain]]\n[[Dmoz:Europe/Spain/]]\n[[World66:europe/spain]]\n\n{{IsPartOf|Iberia}}\n{{related|Cycling_in_Spain}}\n\n{{outline}}\n{{countryguide}}"
        }
    }
}