{
    "parse": {
        "title": "Sudan",
        "pageid": 785,
        "wikitext": {
            "*": "{{pagebanner|Sudan Banner.jpg}}\n{{warningbox| '''There is a high risk of terrorist violence in Sudan. In addition, we advise against all travel to Darfur, southern Kurdufan, and all borders except that of Egypt, as these areas are active war zones.'''}}\n{{quickbar\n| image=Jebel barkal sunset.jpg\n| caption=Jebel Barkal\n| location=Sudan in its region (de-facto).svg\n| flag=Flag of Sudan.svg\n| capital=[[Khartoum]]\n| government=Totalitarian state\n| currency=Sudanese Pound (SDG)\n| area=2,505,810km²<br />''water: 129,810km²<br />land: 2.376 million km²''\n| population=37,090,298 (July 2002 estimate)\n| language=[[Arabic]] & English (official), Nubian, Ta Bedawie, diverse dialects of Nilotic, Nilo-Hamitic, Sudanic languages,<br>''note:'' program of \"Arabization\" in process\n| religion=Islam 70% (in north), indigenous beliefs 25%, Christian 5% (mostly in south and Khartoum)\n| electricity=\n| callingcode=249\n| tld=\n| timezone=GMT+2h}}\n\n[http://www.sudan-tourism.gov.sd/en/ '''Sudan'''] (Arabic: السودان ''Al-Sudan'') is the third largest country in [[Africa]] and sixteenth largest in the world, bordering [[Egypt]], [[Eritrea]], [[Central African Republic]], [[Chad]], [[Ethiopia]], [[Libya]], and [[South Sudan]]. Getting a visa for Sudan is an expensive hit-and-miss affair, but if you do manage to get in, and you stick to the safe areas, you will probably have a memorable experience.  The Sudanese people are very hospitable, and you can visit some awesome tourist attractions without even seeing another tourist.\n\n==Understand==\nSudan is afflicted by civil wars which have been raging, on and off, for more than 40 years. When the colonial map-makers divided up Africa, they included in Sudan the predominantly Muslim people of the north (including Nubians), who share much of their history and culture with Egyptians and Arabs, and the largely Christian and Animist Nilotic and Bantu people of the south, who have more in common with the rest of sub-Saharan Africa than with their northern neighbours.\n \nAfter decades of civil war and a transitional period of self rule, South Sudan became independent on 9 July 2011.\nConflicts still linger in the western region of Darfur.\nSince 1989, Sudan has been under the authoritarian rule of Omar Hassan Al-Bashir.\n\nSudan is as geographically diverse as it is culturally; in the north, the Nile cuts through the eastern edge of the Sahara: the Nubian desert, the sites of the ancient kingdoms of Kush and Meroe, and the land of the Seti. Here, agriculture drives the economy. Staple crops include ful (fava beans), dates, tomato, and onion. The East and West are mountainous regions, and much of the rest of the country comprises savannahs typical of much of central sub-Saharan Africa.\n\n==Regions==\n\n{{Regionlist|\nregionmap=Sudan regions map.png |\nregionmaptext= |\nregionmapsize=1 |\n\nregion1name=[[Central Sudan]] |\nregion1color=#80babe |\nregion1items= |\nregion1description= |\n\nregion2name=[[Darfur]] |\nregion2color=#ccbc94 |\nregion2items= |\nregion2description= |\n\nregion3name=[[Eastern Sudan]]  |\nregion3color=#be8080 |\nregion3items=  |\nregion3description= |\n\nregion4name=[[Kurdufan]]   |\nregion4color=#be80a4  |\nregion4items=  |\nregion4description=  |\n\nregion5name=[[Northern Sudan]]  |\nregion5color=#babe80 |\nregion5items=  |\nregion5description=  |\n\n}}\n\n==Cities==\n* [[Khartoum]] &mdash; the national capital, which also consists of Omdurman and Khartoum North (Bahri)\n* [[Madani]]\n* [[Al Ubayyid]]\n* [[Gedaref]] capital of Gedaref state\n* [[Kassala]]  \n* [[Meroe]]\n* [[Nyala]] &mdash; capital of [[Darfur]]\n* [[Port Sudan]] &mdash; Sudan's main Red Sea port\n* [[Addamer]] &mdash; capital of [[Nile River State]]\n\n==Other destinations==\n==Get in==\n{{VisaRestriction|Entry will be refused to citizens of [[Israel]] and to those who show stamps and/or visas from Israel. However, anyone of Sudanese orgin can enter with a visa, even if they are a citizen of Israel.}}\n[[Image:DarfurCamp.jpg|thumb|upright=1.7|Refugee camp near Nyala in South Darfur]]\n===Visa===\nSudanese travel visas are expensive and difficult to acquire for some nationalities in some countries or for people with an Israeli stamp in their passport. It is advisable to obtain a Sudanese visa in your home country if possible. Hours-long waits for customs clearance are not unheard of, and landing in Khartoum can be tricky. Entering or exiting by land usually goes smoothly. Alcohol is forbidden in Sudan, and attempting to import it could bring strict penalties. If you planning to obtain a Sudan visa quickly in Cairo note that it is likely that the Sudanese embassy in Cairo will be closed on Fridays.\n\nCitizens of [[Egypt]], [[Qatar]](for 1 month), [[Syria]](for 1 month) are exempted from needing a visa for entry. Nationals of [[Saudi Arabia]] do not need a visa only if it's for the purpose of business.\n\nCitizens of [[Eritrea]], [[Kenya]], [[Malaysia]], [[Turkey]], and the [[United Arab Emirates]] can obtain a visa on arrival. All except the U.A.E. are if provided that you are arriving from the country that you are a citizen of. Holders of diplomatic or service passports of [[China]] and holders of diplomatic passports of [[Algeria]] can obtain a visa for Sudan on arrival. People of Sudanese origin can obtain visa on arrival regardless of their current nationality.\n=====From Egypt=====\nCairo is one of the easiest places to get one (usually a couple of hours after application), although for a lot of nationalities it costs USD100 (payment is now possible in Egyptian pounds). You will almost definitely need a letter of invitation/introduction from your embassy, and the time this takes varies from embassy to embassy. \n(Jan 2019) For most foreign nationalities visa fee in Cairo is now 150USD bit you only need to bring a pen amd your passport. 2 copies of your passport and one of your egyptian visa will safe you some money and trouble. You get the visa form for free at the counter. The whole procedure starts around 10am, but being there from 9am i a good idea. They do all visas in a day, sometimes the process is finished at 1pm, sometimes up to 3 or 4pm. \n\n* The '''British Embassy''' does not issue letters but will provide a generic letter stating that they do not issue individual letters. It's free but to obtain it you must make an [https://www.consular-appointments.service.gov.uk/fco/#!/british-embassy-cairo/preparing-documents-in-english/ appointment online].\n* The '''Irish Embassy''' charges 85 Egyptian pounds. \n* The '''Canadian Embassy''' does not issue letters, but the Sudanese embassy in Cairo will give visas to Canadians without the letter. This will present problems within Sudan when trying to obtain permits or renew visas, as these can only be obtained with a letter from the Canadian embassy in Khartoum which the embassy will not at this time provide. \n\nIt is possible to obtain a sponsorship for the visa from the Sudanese Cairo embassy and skip the letter from your own embassy, though this depends on who you are dealing with at the embassy.\n\nIt is also possible to obtain a visa in Aswan. Be advised that the Consulate has moved in the last year or two and is now located at 24°03'18.5\"N , 32°52'59.9\"E. As of May 2016, they require a copy of your passport, a copy of your Egyptian visa, 2 photos, and $150. A Photocopy shop may be found nearby to the south east. The process is simple and the people are very helpful and kind. The wait time is up to 5 days. The visa section works Monday, Tuesday, Thursday, and Sunday from 8:30-12:30. In most cases they do immediately ask and look for any evidence you have been in Israel, such as land border crossing stamps. However, this check is inconsistent and if you find yourself in Aswan it is certainly worth a try. They do not ask for any kind of letter of recommendation. This information is current as of 01/17.\n\n=====From Ethiopia=====\nGetting a visa from the Sudanese Embassy in Addis Ababa is extremely unpredictable, although it is cheaper (around USD60). Your name is first sent to Khartoum merely for approval. An official has stated, \"It could take two weeks, it could take two months.\" Once your name has been approved, the visa itself only takes a couple of days. Britons and Americans are generally given more of a run around, but no nationality is guaranteed swift receipt of a visa. Expect to wait a minimum of two weeks for approval. If your trip continues from Sudan to Egypt and you already have your Egyptian visa you may be given a two-week transit visa for Sudan in only a day. The cost is USD100 (USD200 for US citizens). It can be extended in Khartoum (at a hefty cost, though). The British Embassy in Addis Ababa charges a steep 740 birr (over GBP25) for their letter of invitation/introduction. Note that if you DO NOT require Egyptian visa to enter Egypt, Egyptian embassy in Addis Ababa WILL NOT issue letter of prove which Sudan embassy insists. The only way is still to apply Egyptian visa before Sudan visa unfortunately.\n\n=====From Kenya=====\nVisa applications are submitted between 10am and 12pm and visa collected next day between 3pm and 3.30pm. Cost is 5000 Kenyan Shillings (US$50). Letter of support for application can be obtained from own embassy (e.g. British Embassy, charges 8200 Kenya Shillings, turnaround time depends on availability of the Consul who needs to sign the letter). Sudanese Embassy is located in Kabarnet Road, off Ngong Road (10minutes walk from Wildebeest Campsite accommodation in Kibera Road, and near Prestige Shopping Plaza). Note that google, visa hq etc. show the old address (Minet ICDC building), which is not correct. Generally the experience at the Nairobi Sudanese Embassy is less confusing than in Egypt (with its jostling queues at three anonymous but different windows) however as at January 2010 the staff member dealing with the public is extremely unprofessional (even suggests putting false information).\n\nPossibly out of date information: From Kenya - as in Addis Ababa, the Sudanese Embassy in Nairobi sends your name to Khartoum for approval. The time it takes is similarly ambiguous, although the embassy is far more professional and efficiently-run than Addis Ababa's. [http://safarijunkie.com/travel-tips/ways-to-get-visa-for-sudan/ Visa informational Update 2015/ 2016]\n\n===Permits and other legal requirements===\nAll foreigners are required to register within three days of arrival, although this may be done for you by immigration staff at land borders, depending on where you enter the country. You will also need a permit to take photographs and travel to certain areas outside Khartoum.\n\n* To '''register''' in Khartoum, go to the '''Aliens Registration Bureau''' at Shari'a Al Sahafa Zat, Khartoum, close to Sudan University for Science and Technology, with passport sized photos required and SDG500 (July 2016 - USD not accepted). A travel agency can do it for you for 15USD.  Expect to wait at least two to three hours. Most hotels can register you upon payment of a commission.\n* Registration may be done in the Khartoum Airport departure terminal (15.592091, 32.549274), opposite GAD Restaurant. Inside the terminal on the left look for a mirror-esque booth full of policemen. There is also a photocopy shop next to the office which charges 2SDG per copy. Process takes between 15 minutes and three hours depending on how busy it is and how determined you are. As of 01/17 registration costs 385SDG, payable in that currency.\nNote: Ensure your passport recieves a blue sticker before leaving as the police may tell you 'it's done' before it really is.\n* Registration is also possible in Wadi Halfa, and doesn't take more than an hour. Here, you may be approached (particularly if you're in a group) by an English-speaking man who will offer to take your passports and do everything while you wait outside. This is easier than doing it yourself (it is a ping pong procedure between offices/counters/desks etc.) but you'll find the fee he's added to each person's registration cost is 2 to 3 US dollars. It's not really ''that'' difficult. \n*'''Photo and travel permits''' are now a single, combined document and once you are registered (at the border or in Khartoum) they can be obtained for free from the '''Ministry Of Tourism, Antiques And Wildlife''' (please note this is a new address as the office has moved buildings) at Shari'a Bashir Elnefeidi, Al Manshiya, Khartoum (15.598023, 32.577628). Office is closed on Friday and Saturday. One passport photo is required and you may be able to speed things up by obtaining the form from your hotel and completing it beforehand. In this case they will simply stamp and sign it and send you on your way.\nNote: Photo permits are seemingly not enforced and travel permits do not seem to be needed for travel north of Khartoum; the permit is free though and should be acquired if possible!\n\nDo not be tempted to skip registration, as it is very likely to cause problems when you leave the country - you might not be allowed to board your flight! \n\nWhen leaving Khartoum, airport departure tax is now included in the ticket price and does not need to be paid separately.\n\n===By plane===\n'''Khartoum Airport (KRT)''' is the main gateway into Sudan by air though more recently, some airlines have started flying to '''Port Sudan''' Airport.\n\nBetween 2000-2010, three major airlines decided to stop flying to Sudan: British Airways, Lufthansa and BMI. This means that travellers departing from the UK or Germany are no longer able to take a direct flight. \n\n'''Apart from Turkish Airlines' Istanbul-Khartoum route, there are no direct flights operating from Europe. The Americas, Australia and most of Asia, aside from the Middle East also continue to have no direct service. '''\n\nKhartoum Airport is served exclusively by various Middle Eastern and African airlines. The main cities with direct air links with Khartoum are:\n\n*[[Abu Dhabi]] (Etihad, Sudan Airways)\n*[[Addis Ababa]] (Ethiopian Airlines)\n*[[Amman]] (Royal Jordanian, Sudan Airways)\n*[[Bahrain]] (Gulf Air)\n*[[Cairo]] (EgyptAir, Sudan Airways, Ethiopian Airlines, Kenya Airways) \n*[[Damascus]] (Syrian Airlines, Sudan Airways)\n*[[Doha]] (Qatar Airways)\n*[[Dubai]] (Emirates, Sudan Airways, FlyDubai)\n*[[Istanbul]] (Turkish Airlines)\n*[[Nairobi]] (Kenya Airways, Sudan Airways)\n*[[Sharjah]] (Air Arabia)\n\nAn exhaustive list can be found [https://en.wikipedia.org/wiki/Khartoum_International_Airport at the airport's Wikipedia page.]\n\nThe airport is served by dilapidated yellow taxis that will routinely overcharge. Alternatively you can book taxis with a Khartoum taxi company called LimoTrip that use metered taxis and good vehicles at better rates - 00249 183 591 313 or info@limotrip.net.\n\nPort Sudan airport handles flights to [[Jeddah]], [[Saudi Arabia]] and [[Cairo]]. These flights usually begin/end at [[Khartoum]]. There are also twice-weekly connections from Port Sudan to [[Dubai]] operated by flydubai.\n\n===By train===\nThere are no international trains from neighbouring countries into Sudan.\n\n===By land===\nOne way to get in from [[Ethiopia]] is via the border village of [[Gallabat]]. The road crossing from Egypt periodically closes, depending on diplomatic and trading relations between the two countries. Check for information before trying this route.\n\n===By bus=== \nIt's possible to travel from Egypt to Sudan by bus. Buses leave everyday except Friday from near Aswan station. It takes 2 days to get to Khartoum from Aswan. The bus stops overnight in Wadi Halfa. Tickets can be bought from hawkers nears Aswan train station or local hotels. The price depends on your negotiation skills. Anywhere from EGP300-500 seems to be the rate for foreigners. You may be able to get it cheaper by contacting a local Aswan resident through couchsurfing and getting them to purchase the ticket for you. They will tell you the bus leaves at 04:30. The bus will be warming up at this time but it's likely the bus won't leave until close to 07:00.\n\nAs of 01/17, buses now leave Aswan and travel directly to Khartoum via the newly opened border crossing to the west of lake Nasser (22°00'00.0N , 31°09'14.6\"E). These buses take up to 28 hours (depending on border crossing) and thus do not stop in Wadi Halfa. As with the bus above, it leaves between 0430 and 0730 from the Aswan bus station. Tickets may be bought from shops on the southern side of the square in front of Aswan train station for around 500EGP.\n\nThere is no updated information about public transport between Sudan and newly-independent [[South Sudan]]. One travel blogger claims to have travelled from Sudan to South Sudan in 2015.\n\n===By boat===\nThe most reliable way to enter Sudan from Egypt is via the weekly ferry from [[Aswan]] in [[Egypt]] to [[Wadi Halfa]]. Currently it runs on Mondays to Sudan and back on Wednesdays. Prices recently went up to USD33. The boat is old and crowded with people and goods (the best place to sleep is on deck amongst the cargo) but it takes in some magnificent views (including that of Abu Simbel). Food and drink are available on-board. There are frequent ferries from [[Saudi Arabia]].  If travelling from the south, ferry tickets can be purchased at Khartoum's main train terminal in North Khartoum.\n\n==Get around==\n\n===Permits and other legal requirements===\n* Independent travellers in Sudan with their own vehicles, or using public transport require a combined '''Photography and Travel Permit''' to travel to some areas outside Khartoum.\n* Personal vehicles require a separate permit which is issued at land borders and costs SDG150.\n\nA previous version of this guide stated that independent travellers were required to register with police at each town. As of November 2016 this appears to no longer be necessary (although the one-time registration still is). Check with local authorities to be certain.\n\n===By plane===\nApart from Khartoum, there are small airports in [[Wadi Halfa]], [[El Debba]], [[Dongola]], [[Port Sudan]], [[El Fasher]], [[Wad Madani]], [[Merowe]] and [[El Obeid]], all served by  Sudan Airways [http://www.sudanair.com/]. Most flights operate from Khartoum. Be prepared for changing timetables and cancelled flights.\n\nSudan Airways is notorious for its poor safety record and punctuality. It is advisable to avoid Sudan Airways and consider alternative transport.\n\n===By train===\nThere is a weekly train from [[Wadi Halfa]] to [[Khartoum]], which leaves some time after the weekly ferry from Aswan arrives. \"Some time\" can mean anything from a couple of hours to a couple of days but word usually spreads around town before the train leaves. There are a few different options for accommodation, and plenty of simple restaurants. The journey is scheduled for roughly 50 hours, but can vary greatly. To be on the safe side you shouldn't make any other plans for your next 75 hours. You might not be able to find fresh water until you get to Khartoum, so it is advisable to stock up on water supplies before leaving Wadi Halfa. The train makes quite a few stops. Some more planned than others. At the more planned stops you should be able to buy a snack, and if you are lucky take a quick shower in a communal bathroom. \nThere is also a train between Khartoum and Port Sudan, via Atbara, and from Nyala to Er-Rahad in the West.\nFrom Khartoum, trains to Wadi Halfa and Port Sudan depart from the main terminal in Khartoum North (Bahri).\n\n===By car===\nDriving in Sudan is chaotic but not especially dangerous by African standards. Visitors to the area who are inexperienced at international driving are advised to hire a taxi or a driver. In most of the country, a 4WD is essential; Sudan's main highway is sealed for much of the way but most of the roads in the country are dirt or sand tracks. Crossing in to Sudan from Egypt via the ferry from Aswan to Wadi Halfa now has the benefit of the Chinese financed tarmac highway covering the 400km south to Dongola, and then right through to Khartoum, another 500km. This road is quick for overlanders as there are few military roadblocks, and very little other traffic.\n\nHitchhiking is fairly common in Sudan though there are not many private vehicles outside of Khartoum. Hold out your arm and wave your open hand up and down pointing in the rough direction of intended travel to indicate.\n\n===By bus===\nWhile buses do run frequently in the better travelled areas, in remoter areas people tend to use trucks or \"boxes\" (Toyota Hiluxes) - they're usually just as crowded as the buses but have fewer people sitting on top and get stuck in the sand less often. They tend to go whenever they fill up, which can take half a day or so. If you have money to spare, you can hire a whole one to yourself\n\n===By bicycle===\nIt is possible to cycle around Sudan, legally speaking, although it might be advisable to forget to mention your mode of transport when getting your permit to travel. \"Cycling\" will often consist of pushing the bike through sand or rattling along corrugations but the scenery and the warmth of the Sudanese people may compensate for the physical and bureaucratic hassles. Check carefully the availability of clean, drinkable water. Theft is not a problem; it is generally safe to leave bicycles unattended in villages and towns. Flies, puncture-generous thorn trees and, in the far north, lack of shade, are the only real annoyances.\n\nKhartoum and most Sudanese cities are ''not'' built with cyclists in mind. Khartoum is already chock-full of rickshaws, motorbikes, minibuses, trucks, cars, ''amjaads'', taxis, and even donkey-carts which all leave no safe space for cyclists. Add to that the pot-holes and bumpiness of certain roads, and cycling on main roads poses a genuine safety risk. '''If you must cycle, stick to the residential roads.\n'''\n\n==Talk==\nThe official languages in Sudan are [[Arabic]] and English, according to the 2005 constitution. English is not widely spoken except by officials, students and hospitality workers.  In contrast to many places in the world, it is the older generations that tend to speak the better English. Many locals in and around Khartoum, however, tend to speak some English, even those not directly engaged in the tourist industry.\n\n==See==\n*<see name=\"Meroe Pyramids\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">It is possible to vist the site of the Meroe pyramids in a day from Khartoum independently. For a good balance between convenience and price take the A/C bus from Bahri North bus station (15°37'28.2\"N 32°32'36.4\"E) to Shendi (SDG100 01/17) and from Shendi take a taxi to the pyramids and back. Alternatively take the bus from Khartoum to Atbara (100SDG 01/17) and ask to get off when you see the pyramids on the right side of the road. It is possible to hitchhike back to Shendi or Khartoum from here. Meroe Pyramids are a relatively popular tourist attraction and this is reflected in the attitude of the taxi drivers, Sudanese hospitality notwithstanding. Agree and confirm timings and prices beforhand. SDG200 both ways is a good rule of thumb. Entry at the site is USD25 or SDG150, so go for the latter. As of January 2017 if you make to leave they will drop the price to an suspiciously specific 52SDG. You may recieve a printed receipt for your payment. Toilet facilities are basic but clean. A permit to travel is technically not required on this route but it's so easy to obtain it is probably worth having one anyway. No other permits are necessary.</see>\n\n*<see name=\"Naqa and Musawarat\" alt=\"\" address=\"\" directions=\"\" phone=\"\" url=\"\" hours=\"\" price=\"\" lat=\"\" long=\"\">The best way to visit these sites is by private car or taxi. They are signposted beside the Nile Petrol station (about 1hours 15 minutes north of Khartoum) and the track is fairly clear but sandy. With a private driver it would be possible to see them along with the Meroe Pyramids in one day.</see>\n\n*In Khartoum/Omdurman you must see the Sufi ritual of drumming and trance dancing, about one hour before sunset and Friday prayer. These rituals take place northwest of the Nile river in Omdurman. Very welcoming, festive atmosphere.\n\n*A walk around Tuti Island, situated in the middle of the confluence of the two branches of the Nile, can take about four hours. The less populated northern section is pretty, with its shady lanes, and irrigated fields, and there is a great little coffee stall under a tree on the western side.\n\n*After 4pm take a good coffee at The Egg hotel, with high altitude view over Khartoum, the Nile, and Omdurman, and stay to watch the sunset. Worthwhile.\n\n*About 1.5 hours south of Khartoum visit the dam. Just north of the dam (downstream) the Nile is also very wide; on Friday/Saturday the area is popular with day visitors.\n\n*There is good diving near Port Sudan, either on live-aboards or from the new Red Sea Resort (north of Port Sudan). Beware the windy season (Nov/Dec/Jan/Feb) unless you're not prone to seasickness (2.5 hours dingy ride from the coast in rough seas can be testing!).\n\n==Do==\n==Buy==\n===Money===\nThe currency of Sudan is the '''Sudanese pound''' (Arabic: جنية ''jeneh'', SDG - the 'G' actually stands for Guinea) and it is divided into 100 piastres (coins). This is not to be confused with the Sudanese Dinar which was phased out in 2007 - do not accept any cash with \"dinar\" on it.\n\nBring only foreign CASH into Sudan, preferably US Dollars (often accepted in hotels). British Pounds and to a lesser extent Euros are also fairly easy to exchange at banks in big cities. Traveller's cheques and non-Sudanese bank cards are not accepted in Sudan, as neither Visa/Mastercard nor any foreign bank have any presence in Sudan, despite the lifting of the US trading embargo.\n\nIn the private sphere, official currency rates are rarely used and instead, the majority of cash exchanges are done through the \"black market\". The black market rates are almost always much more generous to foreign currencies, especially US dollars, Euros and British pounds. This is due to the stability and reputation of these currencies - unfortunately, the Sudanese Dinar is known by Sudanese themselves to be a very volatile currency, so many enterprising people keep some of their money in foreign currencies to preserve their wealth.\n\nNormally, black market prices are found through social links and ''never'' through any bank. Make sure to find out what the black market rates are before committing to anything. If possible, a Sudanese friend will be your source of help in this matter.\n\nThere are many Sudanese banks in Khartoum and throughout Sudan but not all of them have foreign exchange facilities. There are several money changers in [[Khartoum]], especially in Afra Mall. There are also several Western Union agents in Khartoum which will do payouts for money transferred from overseas. \n\n\nBefore leaving Sudan, make sure to change any local money you have back into your home currency since the Sudanese Pound is a closed currency.\n\n===Credit cards===\nAs of 2017, the US trading embargo on Sudan was lifted which ''technically'' means that the use of VISA/Mastercard in Sudan is no longer illegal - despite this, '''VISA and Mastercard are yet to make any entrance into the Sudanese market, as of 2018'''. This means that there are no opportunities to use any bank cards, other than those that work only in Sudan. \n\nSudan is not a cashless society so transactions must be made in cash which may pose safety issues if large sums of money are carried. \nCarrying out online transactions while you are in Sudan can cause problems, as some merchants (especially American ones) will pick up your Sudanese IP address and refuse to do business with you. If you attempt to use an American Express card for any online transaction while in Sudan, you are likely to have the card summarily cancelled. Other card issuers may take similar action.\n\n==Eat==\nSudanese cuisine has various influences, but none of them dominates the regional cuisines. Among these, there is the Egyptian cuisine, the Ethiopian and the Turkish one (meatballs, pastries and spices), but there are also numerous dishes that are specific to all Arabian nations.\n\n=== Food ===\n \nFoul, made from fava beans, is by far the most commonly eaten food in Sudan. Conveniently, it is frequently used a sandwich filling and sold fresh for very affordable prices.\n\nAlso popular is ''tamiya'', or falafels which always accompanies foul in any sudanese meal. These can be bought fresh on the streets of just about anywhere in Khartoum, Bahri or Omdurman. Do make sure to ask for them fresh to get the best crunchiness!\n\nLocal Sudanese breads are Kissra, a bread made from ''durra'' or corn; Aseeda, a porridge made from wheat, millet or corn; and Gurassa, a thick bread from wheat flour similar to pancake, but thicker.\n\nOne local Northern Sudanese dish is Gurassa Bil Damaa which is a bread of unleavened wheat similar to pancake but thicker, topped up with meat stew.\n\nSome Eastern Sudanese dishes are Mukhbaza which is made of shredded wheat bread mixed with mashed bananas and honey, and Selaat, which is lamb meat cooked over heated stones and Gurar which is a kind of local sausage cooked in a similar way to Selaat.\n\nA popular dish from Western Sudan is Agashe, a dish prepared with meat seasoned with ground peanuts and spices (mainly hot chilli), and cooked on a grill or an open flame.\n\n=== Drinks ===\n\nAs a country with Sharia Law, Sudan is completely alcohol-free. The occasional sight of locals drunk on illicit palm wine can cause much disturbance, and punishments for possessing alcohol can include fines and corporal punishment. \n\nSudan has some refreshing drinks such as ''karkade'' or hibiscus, which can be served hot or chilled, ''aradeeb'' or tamarind, and ''gongoleiz'' , made with the baobab fruit.\n\nThe local energy drink is a carbohydrates laden drink known as ''Madeeda''. There are several types of Madeeda, made with dates or with ''dukhun'' (Millet) or other types blended with fresh milk, and usually heavily sweetened with sugar. You might consider asking for less sugar in Madeeda and in Mukhbaza, as it might otherwise be too sweet (say: \"Sukkar khafeef\" or literally, light sugar)\n\n=== Dessert ===\nFresh fruit and vegetables are very common with mangos, dates, guavas and oranges being among the most popular. Like in many Arab countries, dates have a special place so make sure to sample some of the local produce.\n\nA particularly sweet dessert is ''basboosa'', which is a sweet semolina-based dessert. This is certainly one to try as it has a very pleasant texture and syrupy sweetness. Beware that when comes to food, the Sudanese don't tend to shy away from sugar!\n\n=== Foodie attractions ===\nOne of the main food-based attractions is ''Sug al Naga'' (The camel market) North of Omdurman, where you can select your meat of choice and then hand it over to one of the ladies to cook it for you in the way which you prefer.\n\n==Drink==\nIslam is the official religion of the country and as a result, '''''alcoholic beverages are banned''''', regardless of origin.\n\nSudan's daily drink is tea; usually sweet and black. Hibiscus tea called karkadeh is a delicious alternative. \n\nSudanese coffee is available in most souks and is similar to Turkish style coffee; thick and strong, sometimes flavoured with cardamom or ginger with a powerful kick and is delicious. Not to be taken before bed though if you want an undisturbed night's sleep!\n \nThe general advice is not to drink tap water. In most rural areas, you will not be able to, as there are no taps. Where there are no bore holes (which often yield water that is fine to drink), water is often taken directly from the Nile. Rely instead on bottled water or a water filter.\n\nWhile alcohol is strictly illegal, locally brewed alcohol is widely available in various forms and at various degrees of potency. A local beer (merissa) brewed from sorghum or millet is cloudy, sour, heavy and likely to be brewed with untreated water. It will almost certainly lead to the 'Mahdi's revenge' (the Sudanese version of 'Delhi belly'). Aragi is a pure spirit distilled from sorghum or in its purest form, dates. Potent and powerful, it should be treated with respect though it is sometimes contaminated with the likes of methanol or embalming fluid to add flavour and potency. \n\n'''Be aware though that all these brews, other than being potentially hazardous for your health, are illegal. Being caught in possession of anything alcoholic will result in the full action of Sudanese law.'''\n\n==Sleep==\nI) Larger Towns and Cities\n\nMost larger towns and cities have affordable hotels, although not as cheap as you might imagine. Quality is generally consistent within the price range. \n\nBasic hotels provide a bed and a fan with shared bathroom/toilet facilities. There may be more than one bed in the room but you are usually expected to pay for the whole room. The bigger the group of travellers, the more economical these rooms are, as more beds are often put in a room (within reason) to accommodate everybody without the price being changed. Some hotels have cheaper beds outside in the open as in smaller towns and cities. These hotels are not very clean but are cheap and perfectly acceptable for short stays. \n\nLower mid-range hotels - more likely to be found in Khartoum - offer the worst value for money. They may have en suite bathrooms, (mostly evaporative) air conditioning and satellite television, but for what you're paying (two or three times that of basic hotels depending on your bargaining skills) the rooms are extremely tatty and hotel owners will almost always subscribe to the philosophy of: 'Only fix something if the guest complains'. There will sometimes be rooms minus the bathroom/air conditioning/television for prices a little above those in basic hotels.\n\nUpper mid-range hotels are the next step up, with spotless rooms of a far higher quality but prices (usually quoted in dollars) closer to what you'd expect in the West. You'll have little to find fault with, though. \n\nTop-end hotels are commonly of the Five Star variety, and include the Hilton. The few are found mostly in Khartoum. They are much more expensive than the upper mid-range hotels.\n\nII) Outside Larger Towns and Cities\n\nOutside larger towns and cities hotels don't normally go above basic. That means bedframes with either simply a string mesh or with thin mattresses; that is not to say they are uncomfortable. They are offered (generally in fours or fives) in rooms where there is often a ceiling fan to keep things cool. The beds are usually cheaper - and more fun to sleep in - out in the courtyard under the stars, although there is obviously less privacy and security. As with the basic hotels in larger towns and cities, it is more often than not impossible to rent one bed in a room as you might in a dormitory. Hotel owners insist that you rent the whole room. Rooms become unavailable quickly at certain times (weekends, for example). Showers may be bucket showers, with water straight out of the Nile if your route follows that river. \n\nCamping in the wild is easy in rural areas outside the south as long as the usual precautions are taken.\n\n==Learn==\n\n==Work==\n\n===Volunteer===\n\n* <listing name=\"The Sudan Volunteer Programme\" alt=\"\" directions=\"\" lat=\"\" long=\"\" address=\"\" phone=\"\" tollfree=\"\" email=\"\" fax=\"\" url=\"http://www.svp-uk.com/\" hours=\"\" price=\"\">The Sudan Volunteer Programme, a UK registered charity, liaises with the Sudanese Ministry of Higher Education and Scientific Research to place native English speakers in universities and schools all over Sudan. Now in its 20th year SVP is one of the few ways for foreigners to experience first-hand an amazingly hospitable and generous people.  Volunteers receive accommodation and a small stipend from the university in exchange for their efforts. SVP arranges residency visas for volunteers. SVP charges no application fees and volunteers must pay for their own travel to Sudan. Minimum period of volunteering is six months. Volunteering with SVP is a useful stepping-stone for careers in international development and related fields. SVP is not for suitable for the casual traveller.</listing>\n\n==Stay safe==\nMuggings and theft happen but most people will go to great length to ensure your well-being. Sudan has some conflicts and corruption in the government occurs, although most Sudanese are honest.\n===Armed conflict===\nSudan ended a 40-year civil war between the Khartoum based central government and non-Muslim separatist groups from the South, at the time when [[South Sudan]] was still part of Sudan. Relations between the two countries after the independence of [[South Sudan]] remain fluid and somewhat tense. \n\nThe well-publicized conflict in Darfur is still taking place.\n\n===Transportation===\nThe official state airline, Sudan Airways, usually consists of less than 10 planes, almost all of which are leased from other airlines. The airline is notorious for its very poor safety record, even being banned from flying within EU airspace. Given the lack of planes, it is almost a given to encounter issues in delays, cancellations and the like. Travellers are advised to steer well clear of Sudan Airways and consider alternative transport. As of the lifting of the US trading embargo, the airline is working towards bringing itself back to being a normally functioning airline.\n\nEntering Sudan by car is also challenging. Sudan has a highly militarized border with its neighbor Egypt and Westerners are questioned before entry. Sudan's southern border with South Sudan is extremely dangerous. It is '''absolutely''' prohibited to drive across the border though the greater risk is with one's own life.\n\nBus travel is also not without its issues. Some buses are better than others, with icy-cold AC and complementary drinks, others may be less salubrious - sitting in a hot bus with no AC. For long distance travel, coaches are currently the best option.\n\n===Personal safety===\nIn the last few years, petty crime against foreigners has increased (thefts of phones, bags and muggings for cash). Keep an eye on your things (keep smartphones etc hidden) in public places, e.g. street cafes. Sometimes thieves operate in pairs: one distracts you while the other makes off with your stuff.\n\n===Women travelers===\nTravel for a solo woman is generally safe. If you dress and act appropriately for an Islamic country, you will be fine.  However, avoid taking public transport alone and be careful in crowded souk areas and bus stations. Many western women have reported being harassed, including some that have been sexually assaulted.\n\n===Police and army===\nThere will be no problem with police unless you have broken the law. A few scammers pose as Sudanese police/army to get bribes. If you are pulled over, be courteous. Pay and report it at the next police station!\n\n===Taking pictures===\nSudan has very strict rules about taking pictures. First and foremost, you need a permit to take pictures (see \"Get in\" section above for details) which will tell you where you can and cannot take pictures. Photographing or filming military personnel or installations is a '''quick way''' to get into trouble. People have been arrested for taking pictures at the confluence of the Blue and White Niles in Khartoum.\n{{warningbox|LGBT are discriminated against, arrested, refused service, attacked, and can be '''executed''' by the government and viligantes. Police are complicit to anti-gay attacks or turn a blind eye to it. Sudan is not LGBT friendly.}}\n\n==Stay healthy==\nSudan is a [[malaria|malarial]] region, so be especially cautious during the rainy season.  Venomous snakes, spiders and scorpions are common to the southern areas. \n\nBe cautious when drinking water. Make sure you choose bottled water, or use purifying tablets. Also, avoid any fruit drinks, as they are obviously made with the local water. And remember, that any ice cubes ( for example, in sodas) are only frozen local water. \n\nOn long trips (particularly during the hot season) on public transport it is often impossible - or would be expensive - to carry the amount of bottled water you need, and it may be scarce at certain remote stops. Therefore, keep plenty of your chosen means of purification close at hand (not in your luggage strapped to the roof!). Sanitation in some areas is nonexistent, so wash your hands frequently. \n\nFood from streetside vendors is generally fine if it is being prepared and served frequently. Empty restaurants and street cafes often indicate that food is standing uncovered and unrefrigerated for hours at a time. \n\nSudanese currency is notoriously dirty, and even the Sudanese handle small bills as little as possible. A hint would be to carry antibacterial wipes or gel in your luggage to treat your hands after handling filthy currency notes or shaking too many unwashed hands. \n\nSudan has reported Ebola outbreaks in 2004 and it is not advised to take local hospital treatments unless there is a real urgency. If you have malaria-like symptoms, seek medical assistance when possible, medical treatment is also available in many private clinics with high standards and reasonable price here are some of these private clinics: ('''Doctors clinic''', Africa St, '''Fidail medical center''', Hospital road Downtown, '''Yastabshiron medical center''', Riyadh area, '''Modern medical center''', Africa St, '''International Hospital''', Khartoum north-Alazhary St)\n\nSchistosomiasis/Bilharzia - Avoid bathing or walking through slow-flowing fresh waterways. If you have been in contact with such water or develop an itchy rash or fevers after your return, seek medical attention. Doctors in the West may only think to test you for malaria - you may need to see a tropical medicine specialist.\n\n==Respect==\n===Religious sensitivities===\nSudan is an Islamic nation, and the government has imposed a form of Sharia law.  Alcohol and drugs are forbidden, though many people dip a kind of snuff, and a few make moonshine.  Sudanese women tend to wear very conservative clothing and cover their heads, so foreign women would be wise to do the same, even if they observe other tourists who do not respect this custom.  Men should wear long trousers, not shorts. If in doubt, play it safe and cover up.\n\nThe Sudanese do not expect foreigners to adhere to Ramadan, the holy month of fasting, but it would be tactless to eat, drink or smoke in public. (Many people, ''e.g.,'' diabetics and those traveling more than a certain distance, are exempt from Ramadan, so it is possible to find open restaurants during the day but they are not well advertised.)\n\nBe assured that any foreigner will be treated as a local, and dealt with accordingly, in many cases, given a jail sentence of several months and a whipping, the minimum being forty lashes (it may be more, according to the discretion of the judge).  Distances between towns or villages being far, and news may travel very slow because of the political unrest, so your government, if it even knows or cares to interfere, may not be willing or able to help you.\n\nDo not in any circumstances, show images/statues/figures etc. of the prophet Muhammad. A heated controversy erupted when a British schoolteacher in Sudan allowed one of her students to name a teddy bear \"Muhammad\", prompting angry protests in Sudan.  Although the British school teacher is safe in her home country and no fatalities were reported, other related controversies such as the Pope Benedict XVI  and the Jyllands-Posten Muhammad drawings had led to violence.\n\n===Local customs===\nTo show the bottom of your foot is an insulting gesture, as is the touching of the thumb to the index finger while extending the rest of the fingers (the North American sign for \"O-kay\").  Although Sudan is a moderate Muslim culture, foreigners are still discouraged from speaking directly to local women unless spoken to, and even then it would be polite to ask permission from the man accompanying her before responding.  Try to avoid physical contact with women if possible. \n\nThis is a list of holidays in Sudan.\nJanuary 1: Independence Day\nJanuary 7: Coptic Christmas\nFebruary 4: Al-Mowlid Al Nabawi (Birth of the Prophet)\nApril 15: Coptic Easter\nJune 30: Revolution Day\nAugust 19: Eid-Ul-Fitr (End Of Ramadan)\nOctober 26: Eid-Al-Adha (Feast Of Sacrifice)\nNovember 15: Islamic New Year\nDecember 25: Christmas Day \n\n===Conversation===\nDuring conversation, avoid asking direct questions about people's political opinions unless you know the person quite well and sense that they would be comfortable; repercussions could be serious for them. Tact is a necessity in a country that has suffered the trauma of more than 40 years of civil war and refugees from affected areas are spread around the country, especially Khartoum.\n\n==Contact==\n===Telephone===\nSudan's international direct dialing code is '''249'''. Its international direct dialing access code is '''00''' although mobile phone users in Sudan will be able to dial overseas numbers by putting \"+\" in front of the international direct dialing code. \n\nPrepaid mobile phone packages are easily available in Sudan. The two main telecommunications companies in Sudan are [http://www.sd.zain.com Zain] (Tel: ''+249''-(0)-91-230000) and [http://www.mtn.sd/ MTN] (Tel: ''+249''-(0)-92-1111111). Zain has a cheaper prepaid package (SDG 10) than MTN (SDG 20). Note that the customer service line for MTN, should you need to call them for any problems, can be difficult to get through, as it only allows one call to the service line from each registered phone number per day. \n\nBelow is a list of mobile phone networks that operate in Sudan:\n\n* [http://www.sd.zain.com Zain] (4G network across many large cities)\n* [http://www.mtn.sd/ MTN] (4G only available in Khartoum)\n* [http://sudani.sd/PublicOne Sudani One]\n* [http://www.canar.sd/ Canar Telecommunications]\n\n\n\n\n{{isPartOf|Sahel}}\n{{outline}}\n{{countryguide}}\n\n\n[[ca:Sudan]]\n[[de:Sudan]]\n[[eo:Sudano]]\n[[es:Sudán]]\n[[fi:Sudan]]\n[[fr:Soudan]]\n[[hu:Szudán]]\n[[it:Sudan]]\n[[ja:スーダン]]\n[[nl:Soedan]]\n[[pl:Sudan]]\n[[pt:Sudão]]\n[[ru:Судан]]\n[[sv:Sudan]]\n[[zh:苏丹]]\n[[wts:Category:Sudan]]\n\n\n[[WikiPedia:Sudan]]\n[[Dmoz:Africa/Sudan/]]\n[[World66:africa/sudan]]"
        }
    }
}