{
    "parse": {
        "title": "Taiwan",
        "pageid": 843,
        "wikitext": {
            "*": "{{pagebanner|Taiwan Banner.jpg}}\n\n{{quickbar\n| image=Taipei 45637448 6d6ac21e15 o.jpg\n| caption=Taipei\n| location=Taiwan in its region.svg\n| flag=Flag of the Republic of China.svg\n| capital=[[Taipei]] (de facto)<br>[[Nanjing]] (de jure)\n| government=Multi-party democratic republic with a popularly elected president and unicameral legislature\n| currency=New Taiwan dollar (NT$, TWD)\n| area=35,980km²<br />''water: 3,720km²<br />land: 32,260km²''\n| population=23,519,518 (September 2016 est.)\n| language= '''Official''' : Mandarin (de facto) <br/> '''National''' : [[Taiwanese phrasebook|Taiwanese Minnan]], Hakka,  Aboriginal Languages\n| religion=Mixture of Buddhist, Confucian, and Taoist 93%, Christian 4.5%, other 2.5%\n| electricity=110V, 60HZ (US plug type)\n| callingcode=+886\n| tld=.tw\n| timezone=UTC+8\n}}\n\n[http://eng.taiwan.net.tw/'''Taiwan'''] is located off the coast of southwest of [[Okinawa]], [[Japan]] and north of the [[Philippines]]. The island has been governed by the '''Republic of China''' (ROC) since 1945. Shaped roughly like a sweet potato, the island nation has more than 23 million people and is one of the most densely populated places in the world. Besides its crowded cities, Taiwan is also known for steep mountains and lush forests. ROC also has de facto control over two provinces: Taiwan (consisting of the island itself and the tiny [[Pescadores]] (Penghu)), and [[Fujian]] ([[Quemoy]] (Kinmen/Jinmen), and [[Matsu]] islands), which are often referred to as outlying islands by the Taiwanese.  \n\n{{disclaimerbox|While the political status of Taiwan is a somewhat controversial and sensitive issue, from a traveller's point of view, Taiwan is under the ''de facto'' control of a different government from mainland China, and in practice operates as a separate state. ''This is not a political endorsement of the claims of any side of the dispute.''}}\n\n==Understand==\nTaiwan has some very impressive scenic sites and its capital city, Taipei, is a vibrant culture and entertainment hub. Taiwanese cuisine is highly regarded with the Japanese in particular taking short trips to enjoy its relatively cheaper hospitality. Lately, with the relaxation of restrictions, there are increasing numbers of mainland Chinese visiting, and Taiwan is perhaps the most favourite  destination for short holidays for Hong Kong residents.\n\n===History===\n[[Image:CKS_Memorial_Hall.jpg|thumb|upright=1.7|National Chiang Kai-shek Memorial Hall]]\nTaiwan has been populated for thousands of years by more than a dozen non-Han Chinese aboriginal tribes. Written history begins with the partial colonization of southern Taiwan by the [[Netherlands|Dutch]] and the northern part by Spanish in the early 17th century. (The old name of Taiwan, ''Formosa'', comes from the Portuguese ''Ilha Formosa'' for \"beautiful island\".)  Han Chinese immigrants arrived in significant numbers with the onset of European trade. Although controlled by the Dutch, the Ming loyalist Koxinga (鄭成功) defeated the Dutch garrisons in 1662 and set up Taiwan as a rump Ming Empire with the hope of reconquering Qing China. His grandson surrendered to the Qing in the late 1600s. Although contact between mainland China and Taiwan dates back thousands of years, it was not until larger numbers of Han residents arrived during the Qing dynasty that Taiwan was formally integrated into the rest of China as part of Hokkien (Fujian) province. It became a separate province in 1885. Defeated by the Japanese in the first Sino-Japanese War, the Qing Empire ceded Taiwan to [[Japan]] under the terms of the treaty of Shimonoseki in 1895. Japan ruled the island all the way until the end of World War II in 1945, and exerted profound influences on the development of the island.  Taiwanese entertainment and pop culture was and still is heavily influenced by that of Japan. Much of the Japanese-built infrastructure can still be seen on the island today, and has been in fact continuously used up to the present day (e.g. rail-road crossing gates, administrative buildings, and the old port at Kaohsiung).\n\nIn the early 20th century, the Nationalists (''Kuomintang'', KMT 國民黨) and Communists fought a major bloody civil war in mainland China. Although the two sides were briefly united against Japan during World War II, they quickly began fighting again after the war was over. Eventually, the Communists gained decisive victory in 1948/49. The Nationalist government, the remnant of their army, and hundreds of thousands of refugees then fled to Taiwan. From Taipei, they continued to assert their right as the sole legitimate government of the whole China. Initially very repressive, the government began to loosen control in its fourth decade under the leadership of Chiang Kai-shek's son, Chiang Ching-kuo. Taiwan also experienced rapid economic growth and modernisation under the leadership of Chiang Ching-kuo, becoming one of the world's richest and most modern economies and earning it a place as one of the East Asian Tigers. Taiwan still remains a leader in consumer electronics and is home to well-known brands such as Acer, Asus, Chatime, Chunghwa Telecom, Evergreen Marine, Garmin, Giant Bicycles, Gigabyte, HTC, Luxgen, Maxxis, MediaTek, MicroTek, MSI, Mustek Systems, Taiwan Beer, Taiwan Mobile, TSMC, UMC and Zyxel. Democratization began in earnest through the 1980s and 1990s, culminating with the first direct presidential elections in 1996, and the first peaceful transition of power between two political parties in 2000.\n\n===People===\nTaiwan was originally populated by indigenous tribes that spoke various Austronesian languages, which are closely related to Malay, Tagalog and Indonesian and who are ancestors of the great Polynesian navigators of the Pacific. Today the remaining tribes make up only about 2% of the population, while the other 98% are Han Chinese. \n\nThe Han Chinese are further split into Taiwanese local residents or original-province person, who make up about 84% of the population and whose culture is derived from people who migrated during the Ming and Qing Dynasties, as well as mainlanders or external-province person and their descendants, who make up about 14% of the population and whose families fled to Taiwan from the mainland shortly after the PRC's establishment in 1949. Among the Taiwanese local residents, Hoklo (Minnan) speakers form the majority, which is about 70% of the population while the remaining 14% are largely Hakka speakers. There is also a sizeable Japanese community, with many of its members working in the entertainment industry. \n\nOnly a small percentage of the Taiwanese are, to a large extent, the descendants of immigrants from the mainland in recent centuries who intermarried with indigenous people. In recent years there are also Vietnamese, Indonesian and Filipino migrant workers living harmoniously with each other as well as mainland Chinese immigrants.\n\n===Climate===\nThe climate of lowland Taiwan is marine tropical. Summers are hot and humid and above 30°C (86°F) from June through September. Winters are relatively cold, especially in northern Taiwan where temperatures can be as low as 8°C ( 46°F). Northern Taiwan rains year-round while southern Taiwan has dry winters. The best time of year to visit is from Oct-Dec, although the occasional typhoons can spoil the fun. Spring is also nice, although it rains more than during autumn. During the typhoon season, the east coast bears the brunt of the damage as it is facing the Pacific Ocean.\n\nTaiwan has tall mountains, which are much colder. They are also susceptible to sudden heavy rains, which can endanger unprepared visitors, so advice on proper preparation should be obtained before visiting those areas. In fact, it snows every year on Taiwan's highest mountains and occasionally even on mountains like Alishan.\n\n===Taiwanese calendar===\nThe ''Minguo'' (民國) calendar is commonly used in Taiwan. It refers to the number of years since the establishment of the Republic (i.e. Minguo in Mandarin) of China in 1912. To convert a ''Minguo'' date to CE (AD), just add 1911.  Months and days are according to the standard Gregorian calendar. 2012 is 101st Minguo. Most locals also keep track of the lunar calendar for holidays related to Han Chinese festivities.\n\n===Festivals===\n{{CNYdates}}\nAs Taiwan is dominated by ethnic Chinese, traditional Chinese festivals are celebrated by the Taiwanese. Among the most notable are:\n\n*'''Chinese New Year''' (春節). This is the most important festival for the Taiwanese and many shops and restaurants close on the first three days so it is not an ideal time to visit. However, the days leading up to the festival as well as the fourth to fifteenth days are ideal for soaking up the atmosphere and listening to Taiwanese New Year songs.\n\n*'''Ching Ming Festival''' (清明節). This is when many Taiwanese would pay respects at their ancestors' graves.\n\n*'''Dragon Boat Festival''' (端午節). This festival honours Qu Yuan, a patriotic official from the state of Chu during the Warring States period of Chinese history who committed suicide by jumping into a river when Chu was conquered by Qin. To prevent the fishes from eating his body, villagers threw rice dumplings into the river to feed the fishes and rowed dragon boats with drums being beaten on them to scare away the fishes. Since then, dragon boat racing has been carried out on this day and rice dumplings are also eaten.\n\n*'''Hungry Ghost Festival''' (中元節). This festival runs throughout the seventh month of the Chinese calendar. It is believed that the gates of hell open during this period and hungry ghosts are allowed to roam freely into our world. In order to appease the ghosts and prevent misfortune, many Taiwanese will offer food and burn joss paper for them. In addition, traditional Chinese performances such as Chinese opera and puppet shows are held to appease these wandering spirits.\n\n*'''Mid-Autumn Festival''' (中秋節). Legend has it that on this day, a woman known as Chang E swallowed some divine pills to prevent her power hungry husband from becoming immortal. Afraid of being killed by her husband, she fled to the moon and it is believed that the moon shines brightest on this day. This is when many lanterns will be put up for decoration in various parks and shops, which is quite a beautiful sight. Mooncakes are also eaten on this day so it would be an ideal time to try some.\n\n===Terrain===\n[[Image:DSC01952.JPG|thumb|Cliffs meet the eastern coast of Taiwan, Hualien County]]\nTaiwan is largely mountainous with a chain of mountains running from north to south at the centre of the island. The west coast is largely plains and unsurprisingly is where most of the population is concentrated, and is where all the larger cities like [[Taichung]] and [[Kaohsiung]] are located. The east coast also has some plains but is more sparsely populated due to the higher typhoon risk. It is also home to the cities of [[Hualien]] and [[Taitung]] with significant populations.\n\n===Sports===\n'''Baseball''' was brought to Taiwan by the Japanese during the colonial period. Its popularity rose greatly when the Taiwanese baseball team finished second in the Japanese national championships. Today, baseball retains a strong following and remains by far the most popular team sport in Taiwan. Several Taiwanese players have also gone on to successful careers in the US and Japanese Major League Baseball (MLB) and the Taiwanese national baseball team is considered to be one of the strongest in the world.\n\nBesides baseball, basketball also has a sizeable following in Taiwan and is quite popular among teenagers. When classes are over, the basketball courts inside schools are not only open to students but also the public. \n\nBilliard is another popular sport in Taiwan. It's easy to find billiard rooms throughout the country and there are also many championship-winning players in Taiwan, most of whom started training when they were still teens.\n\nOther sports which are popular include Taekwondo, table tennis and golf.\n\n==Regions==\n[[Image:Taiwan_Regions_Map.png|thumb|upright=1.7|Map of Taiwan with regions colour-coded]]\n\n{{Regionlist\n\n| region1name=[[Northern Taiwan]]  \n| region1color=#b08eb0\n| region1items=[[Hsinchu]], [[Hsinchu County]], [[Keelung]], [[New Taipei]], [[Taipei]], [[Taoyuan County]], [[Yilan County]], [[Yangmingshan National Park]]\n| region1description=the capital city, main airport and technology hub of the island \n\n| region2name=[[Central Taiwan]]\n| region2color=#EFB86E\n| region2items=[[Changhua County]], [[Miaoli County]], [[Nantou County]], [[Sun Moon Lake]] and [[Taichung]]\n| region2description=scenic mountains and lakes, major national parks and the second biggest city\n\n| region3name=[[Eastern Taiwan]] \n| region3color=#77c283\n| region3items=[[Hualien County]], [[Taitung County]], [[Taroko Gorge]], [[Hualien]], [[Taitung]]\n| region3description=Hualien and Taitung are cut off from the rest of the island by the central mountains; this is a region of great natural beauty \n\n| region4name=[[Southern Taiwan]] \n| region4color=#75a4c3\n| region4items= [[Kaohsiung]], [[Tainan]], [[Chiayi County]], [[Pingtung County]], [[Yunlin County]] \n| region4description=the tropics of Taiwan with beaches and terrestrial heat scenic\n\n| region5name=Outlying Islands  \n| region5color=#c9cf7b\n| region5items=[[Green Island (Taiwan)|Green Island]], [[Kinmen]], [[Matsu]], [[Orchid Island]], [[Penghu]]\n| region5description=A couple of small islands that are popular getaway destinations with the locals. \n}}\n\n==Cities==\nTaiwan has many large cities and towns. Below is a list of just '''ten''' of the most notable. Other cities are listed under their specific regional section.\n\n[[Image:Taipei01.jpg|thumb|upright=1.3|Taipei - the capital of Taiwan]]\n* [[Taipei]] (臺北 or 台北), the capital and the center of commerce and culture. Home to the world's fourth tallest skyscraper, Taipei 101.\n* [[Taichung]] (臺中 or 台中), the second largest city in Taiwan, also known as \"food capital\" in Taiwan. There are many night markets, museums, historical spots, and parks.\n* [[New Taipei City]] (新北市), the city that surrounds Taipei and the largest city in Taiwan. The area includes a substantial stretch of Taiwan's northern coastline and surrounds the Taipei Basin. New Taipei City is the epitome of Taiwanese culture from the urban districts of Banqiao and Xinzhuang to the more laid-back Tamsui and Wulai.\n* [[Hsinchu]] (新竹), a city in northern Taiwan that contains [http://eweb.sipa.gov.tw/en/index.jsp Hsinchu Science Park], which has the nickname \"Silicon Valley of Taiwan\" and is home to world-leading semiconductor manufacturing companies. \n* [[Hualien]] (花蓮), a city located near Taroko Gorge, and is considered one of the most pleasant of Taiwan's cities.\n* [[Kaohsiung]] (高雄), the third largest city and also an industrial city. It has a busy sea port (the Port of Kaohsiung) along with the island nation's second-largest airport, [http://www.kia.gov.tw/english/e_index.asp Kaohsiung International Airport] (KHH).\n* [[Keelung]] (基隆), the center of transshipment in the north, located about a thirty minute drive or a twenty minute bicycle ride from downtown Taipei.\n* [[Puli]] (埔里), a town located at the geographical center of the island. Serves as a hub for exploring the central mountains and [[Sun Moon Lake]].   \n* [[Tainan]] (臺南 or 台南), the oldest city and former capital, famous for its historic buildings.\n\n==Other destinations==\n[[Image:Alishan Forest Staircase2.JPG|thumb|240px|Mountain trail in [[Alishan]]]]\n[[Image:DSCN1803.JPG|thumb|240px|Taroko Gorge]]\n\nPeople tend to think of Taiwan as a small crowded island nation filled mostly with electronic factories, and if you stay in Taipei or along the west coast you might indeed maintain that impression. However, the island nation is also home to high mountain ranges, great beaches and stunning national parks - many with hot springs.\n\n* [[Alishan]] (阿里山) - misty forests of giant cypresses and amazing sunrises at the center of the island, reached by a scenic narrow-gauge train\n* [[Kenting National Park]] (墾丁國家公園) - located at the extreme southern tip of the island, this park is famous for its beaches and lush vegetation.\n* [[Shei-pa National Park]] (雪霸國家公園) - a park spanning mountains and rivers located in [[Hsinchu County]] - great hiking trails\n* [[Sun Moon Lake]] (日月潭) - nestled at 762 m (2,500 ft) in lofty mountains in [[Nantou County]], this lake is famous for its clear sparkling blue water and picturesque mountain backdrop.\n* [[Taipingshan]] (太平山) - a historic logging area and one of Taiwan's most scenic spots. Located in [[Yilan County]].\n* [[Taroko Gorge]] (太魯閣峽谷 ''Tàilǔgé'')- an impressive gorge located off the east coast\n* [[Yangmingshan National Park]] (陽明山國家公園) - spanning a mountain range overlooking Taipei with a dormant volcano still producing some steam.\n* [[Yushan]] (Jade Mountain/玉山) - at 3,952 m (12,966 ft) the highest mountain in not just Taiwan, but all East Asia south of the Kamchatka Peninsula.\n* [[Lalashan]] (拉拉山) - \"Lala\" means \"beauty\" in native Atayal language. Mt. Lala is one of natural protection zones in Taiwan. There are 500-2800 years old divine trees and the No. 5 divine tree, reputedly even older than Confucius. Lalashan is best known for its peach trees, and peach season (July - August) is the most beautiful time to visit Mt. Lala, which is located in [[Taoyuan County]].\n* [[Jiufen]] (九份), a former gold mining town located on the northeast coast that is now a popular tourist destination.\n\n==Get in==\n\n===Visa-free===\n\nForeign nationals of the following countries can enter Taiwan '''visa-free''' as a ''visitor'' provided that their passports are valid for at least 6 months upon entry:\n\n'''For up to 90 days:''' All '''European Union''' member states, Andorra, Australia, Canada, Chile, Iceland, Israel, Japan, Liechtenstein, Monaco, New Zealand, Norway, Paraguay, San Marino, South Korea, Switzerland, the United States and the Vatican City.\n\n'''For up to 30 days:''' Malaysia and Singapore.\n\n'''For up to 14 days:''' Brunei, Thailand, the Philippines (until 31 July 2019), and Russia.\n\nIf citizens of the above countries present an emergency or temporary passport, they will be required to apply for a landing visa on arrival by supplying a passport photo and paying a fee of NT$2,400.[https://www.boca.gov.tw/mp-2.html]\n\nCitizens of Japan need only present a passport with at least 3 months' validity (rather than 6 months' validity) upon entry. Citizens of the United States can enter Taiwan on a passport with less than 6 months' validity on the date of arrival by supplying a passport photo and paying a fee of $184 USD or NT$5,600.[https://www.boca.gov.tw/mp-2.html]\n\nCitizens of Canada and the United Kingdom can extend their stay for an extra 90 days (i.e. a total stay of up to 180 days) free of charge - more information is available on [https://www.boca.gov.tw/mp-2.html this Bureau of Consular Affairs information sheet]. \n\nHolders of diplomatic or official/service passports of [[Belize]], [[Burkina Faso]], [[Dominican Republic]], [[El Salvador]], [[Guatemala]], [[Honduras]], [[Nauru]], [[Nicaragua]], [[Panama]], [[Sao Tome and Principe]], [[Saint Kitts and Nevis]], [[Saint Lucia]], [[Saint Vincent and the Grenadines]] and [[Swaziland]] do not require a visa for up to 90 days. For more updated visa information please visit Republic of China Ministry of Foreign Affair's website https://www.boca.gov.tw/mp-2.html\n\n===Visas===\n\nResidents of '''Hong Kong''' and '''Macau''' in the PRC who hold valid Hong Kong / Macau SAR passports or British National (Overseas) passport should apply for an entry permit, which can be done on arrival or online before departure if they were born in their respective territories or have been to Taiwan previously after 1983. From July 2008, holders of mainland Chinese passport (which is different from Hong Kong and Macau) may visit Taiwan for tourism if they join an approved guided tour. Meanwhile, mainland Chinese citizens from certain cities, including Shanghai, Beijing, Guangzhou, Shenzhen, Nanjing, etc., can visit Taiwan individually.\n\nCitizens of India, Indonesia, the Philippines, Thailand and Vietnam who have a valid entry visa or permanent resident card issued by a Schengen country, Australia, Canada, Japan, New Zealand, the United Kingdom or the United States can obtain a 30-day Visa on Arrival after making an online application. Indonesian citizens can also apply if they hold a Japanese visa waiver certificate [https://www.boca.gov.tw/lp-149-2.html]\n\nCitizens of Brunei, Turkey and Macedonia can obtain a landing visa upon arrival in Taiwan. [https://www.boca.gov.tw/lp-149-2.html].\n\nDetailed information about visas is available at the website of the '''Bureau of Consular Affairs, Taiwan''' [https://www.boca.gov.tw/mp-2.html].\n\n===By plane===\nWhen checking in for your flight towards Taiwan you may need to be able to show a ticket to an onward destination (or a return ticket, or any other evidence of onward travel arrangements) or you may be refused to check in. \n\nThe primary international gateway of Taiwan is Taoyuan International Airport near [[Taipei]] (台北). Kaohsiung International and Taipei Songshan also serves extensive flights throughout Asia.\n\n*[https://www.taoyuan-airport.com/english '''Taiwan Taoyuan International Airport'''] (台灣桃園國際機場) ({{IATA|TPE}}) is the primary international airport of Taiwan located 40 km to the southwest of Taipei. Direct flights are available to North America, Europe and Oceania. The airport is connected to [[Taipei]] by Taoyuan Airport MRT, as well as to HSR Taoyuan Station. Alternatively, there are regular bus services to Taipei, [[Taichung]], HSR Taoyuan Station and more.\n\n* '''Kaohsiung International Airport''' (高雄小港國際機場) [https://www.kia.gov.tw/English/] ('''KHH''') is the second-busiest airport, located in southern Taiwan. International flights are available to major cities in Asia such as Osaka and Singapore.\n\n* Taipei Songshan Airport (臺北松山機場) [https://www.tsa.gov.tw/tsa/en/home.aspx] ({{IATA|TSA}}) in downtown Taipei serves domestic flights and flights to other \"downtown airports\" such as Tokyo Haneda and Seoul Gimpo.\n\n* Taichung Airport (台中機場) ('''RMQ''') in Central Taiwan serves a limited but growing number of flights domestic and international. Destinations include Seoul and Ho Chi Minh.\n\n* Hualien Airport (花蓮機場)[https://www.hulairport.gov.tw/e_content/about/about01.aspx] ('''HUN''') serves domestic flights and flights to Hong Kong.\n\nIn addition, the airports at [[Makung]] (馬公), [[Taitung]] (台東) and [[Kinmen]] (金門) have also been designated for cross-strait flights to mainland China, though of these, only Makung currently has regular flights to mainland China.\n\nRegular cross-Strait flights between Taiwan and mainland China resumed after civil war on 4 Jul 2008. From 15 Dec 2008, the frequency of these flights were increased to daily, and travel times on some popular routes have been reduced significantly as flights no longer have to be routed through Hong Kong airspace. \n\n====Major airlines====\nThe main Taiwanese carriers are '''EVA Air''' (長榮航空) [http://www.evaair.com/] and  '''China Airlines''' (中華航空) [https://www.china-airlines.com/] \n\n* AirAsia\n* ANA All Nippon Airways\n* Asiana Airlines (to/from Seoul Incheon)\n* Cathay Pacific - 2715 2333\n* Cebu Pacific (to/from Manila)\n* China Airlines - 2715 1212\n* Delta Air Lines (to/from Tokyo Narita)\n* Eastar Jet (to/from Seoul Gimpo)\n* EVA Airways - 2501 1999\n* Jetstar Asia (LCC) (from/to Singapore and Osaka)\n* KLM Asia - 2711 4055\n* Korean Air (to/from Seoul Incheon)\n* Malaysia Airlines\n* Peach Aviation (to/from Tokyo Narita, Osaka, Okinawa)\n* Philippine Airlines (to/from Manila, Kalibo)\n*Scoot\n* Silkair\n* Singapore Airlines - 2551 6655\n* TransAsia Airways (Ceased operations)\n* Thai Airways - 2509 6800\n* Tiger Airways\n* T'way Air (to/from Seoul Gimpo)\n* United Airlines\n* Vietnam Airlines\n\nFor up-to-date information on cheap flights, check the advertisement pages of one of the three local daily English newspapers (see media below).\n\n===By boat===\nAs of 2008, all scheduled passenger ferry services between Taiwan and Japan have been suspended.  Star Cruises [http://www.starcruises.com] operates limited cruise services from Keelung (基隆) and Kaohsiung (高雄) to Hong Kong and various Japanese islands.\n\nFrom Fuzhou (福州), Fujian Province, there are two daily ferries to Matsu (馬祖). Take bus 69 from Fuzhou train station to Wuyilu, then bus 73 to the end station Mawei harbor (馬尾港). The ferry costs ¥350 CNY between mainland China and NT$1,300 from Taiwan. The trip takes two hours. The old website [mit30.com.tw], appears to be down. From Matsu, there are two daily ferries to Keelung in Taiwan. NT$1,050 includes a bed, as the trip takes 10 hours. Bookings can be made at +886 2 2424 6868.\n\nAt [[Mawei]] harbour in [[Fuzhou]] there is an opportunity to buy an inclusive ticket all the way to Taipei (臺北) that includes the Fuzhou to Matsu ferry above and a domestic flight from Matsu to Taipei (or Taichung). The price (¥780) includes transfer between port and airport on Matsu, and a coupon for lunch at the airport while you wait for your connection. The ferry leaves Fuzhou at 9:30AM. Get to Mawei at 8AM to buy tickets.\n\nThere are also several ferry services between [[Xiamen]] and [[Quanzhou]] on the mainland and the island of Kinmen (金門). Now there also is one weekly ferry from Dongdu Harbor (東渡碼頭) in [[Xiamen]] to Keelung, that leaves on Thursdays at 6PM starting at less than ¥500, as well as one to Taichung leaving on Tuesdays. Call 0592-2393128 for information or 0592-6011758 for bookings from China. You can also check here for news [http://www.seat61.com/Taiwan.htm#Ferries_to_Taiwan].\n\n==Get around==\n\n[[Image:uni_air_taiwan.jpg|thumb|Domestic plane, Taiwan]]\n===By plane===\nTaiwan's main domestic carriers are '''UNI Air''' [http://www.uniair.com.tw/], owned by EVA, and Mandarin Airlines.  Flights are frequent, and it is usually unnecessary to book flights in advance.  Taipei and Kaohsiung have regular services and links to most other domestic airports; however, it may not be possible to fly from one domestic airport to another. The popularity of the high-speed train has drastically cut flights on the once popular west coast sectors, with eg. Taipei-Kaohsiung flights only a shadow of what they once were.\n\nIf you want to visit Taiwan's smaller islands, the plane is still the best option, and is the only practical option of travelling to , [[Kinmen]] as well as the easiest, most common, way to travel to [[Penghu]] and [[Matsu]].  Fares are not too expensive, and local planes are very good. The domestic airport in Taipei is Song Shan Airport [http://www.tsa.gov.tw/0069/index_e/index_e.shtm], which is in the north of the Taipei and easily reached by Taxi. Domestic destinations include [[Kaohsiung]], [[Tainan]], Chiayi, [[Taichung]], [[Pingtung]], [[Taitung]], [[Hualien]], [[Makung]] (Penghu / Pescadores), [[Kinmen]], [[Hengchun]], [[Nangan]] and [[Beigan]]. Travellers heading to [[Kenting]] can avail themselves of the  direct and frequent bus service from Kaohsiung airport that connect with flights arriving from Taipei.\n\n===By train===\n{{infobox|Navigation|In mid-sized and smaller cities, your main reference point is going to be the train station.}}\n\n{{infobox|Speaking English|If you're having trouble finding English speaking people, try looking for college or high school students. At ticket booths, the better chance is at those with student-age agents.}}\n\n[[Image:THS700T Train.JPG|thumb|Taiwan High Speed train]]\n[[Image:TaiwanHighSpeedRail Route en.gif|thumb|Map of Taiwan High Speed Rail]]\nTaiwan has 2 train systems:\n*Taiwan High Speed Rail (THSR, sometimes only: HSR,高鐵)\n*Taiwan Railway Administation (TRA,台鐵).\n\n===In general===\n*'''Buying tickets''': if buying directly from a ticket stall, write down your destination and possibly train number beforehand or show the search result webpage on your smartphone, as it is easier to communicate (ambient noise and the glass partition don't help and there will be people queueing behind you...). \n\nTIP: If you are not going very far (eg. Taoyuan, Hsinchu, etc) and don't mind possibly not getting a seat, you can just swipe into the train areas using your stored value cards (Easycard, iCash etc). Board any train you like and you can sit in any open spot until someone asks for your seat with a reserved ticket. You can also sit in the luggage car like many locals do. This usually the cheapest way to go.\n\n*'''validating tickets''' is done by walking through a gate. You either push the ticket into a slot (even the much smaller tickets from a vending machine, it will come out at the other end so you can exit at your desination the same way) or hand it to a person at special gates. Do this if you need someone to point you in the right direction (you will also get to keep the ticket as a souvenir, if you are into that sort of thing.)\n\n*'''Getting advice:''': If you do need to ask and discuss your journey, queue at a booth with a younger person, as they are more likely to speak English. Even then, write down your destination and travel dates on screen or paper to avoid confusion. \n\n*'''Going short distances''' (e.g. Taichung - Tainan) it might be quicker to use the slower TRA trains, since you spend less time getting to and from the more remote HSR stations (assuming your destination is near the town centre, as would be the case for tourists, but not necessarily for business travellers going to out-of-town commercial areas which might actually have sprung up near the THSR station).\n\n*'''Same day tickets:''' when buying a ticket for immediate use, it might be for a train that leaves within minutes. Check the departure time and ask the agent what the platform is, so you can go at a fast, uninterrupted pace.\n\n*'''Reserved seats''' will be given for most longer journeys (all THSR, most TRA) without you being asked. (tell them in advance if you want aisle or window or have special needs, like sitting near the end of an HSR carriage to keep an eye on the luggage rack). The carriage number is clearly marked on the platform. Trains stop precisely on the spot. No trouble there. Trains are walk-through, so just get on any car when in a hurry. Crowding might make it hard to pass through, though. Reserved seats are not marked as reserved on the train itself. You might have to politely ask a person to vacate your seat. (Simply showing the ticket with a polite gesture will usually let people understand what you cannot say.) \n\n*'''Luggage:''' TRA trains have overhead racks, big enough for backpacks or normal suitcases. HSR trains have luggage racks at each end of the carriage.\n\n*'''Lockers:''' Stations have lockers to store your luggage. Or, you can go to lalalocker.com, free your hand through deposit your luggages in the coffee shop, book store, hostel ...  \n\n*'''Queueing:''' is important. People will stand in neat lines along the clearly marked areas to wait for trains (even on the local MRT). Follow their example. \n\n*'''Food and drink''' are served from trolleys coming through. All stations have a collection of snack stalls and convenience stores.\n\n*'''Vending machines''' will (sometimes) need to have money first. They will then highlight the travel options and destinations available for that amount.\n\n====THSR====\nTHSR is a high speed train system that covers roughly 350 km (217 mi) across the western corridor. Trains from [[Taipei]] to [[Kaohsiung]] (Zuoying) take just 96 min.  Other stops on the route are [[Nangang]], [[Banqiao]], [[Taoyuan]], [[Hsinchu]], [[Taichung]], [[Chiayi]] and [[Tainan]]. Note that many THSR stations have been built a fair distance from the cities they serve (e.g. a taxi from downtown Tainan costs up to NT$400, but there's a free shuttle bus). The stations and platforms are wheelchair-friendly and all trains include a wheelchair-accessible car (wider doors, ample space, accessible bathroom).\n\nA one-way ticket from Taipei to Zuoying (Kaohsiung) for adults costs NT$1,490 in economy or NT$1,950 in business class. Seats in economy class have plush seats and ample legroom, so there's little reason to pay extra.  All signage and announcements are in English as well, making navigation a snap.\n\nIf THSR tickets are costly for you, you should book your tickets. Tickets can be booked up to 28 days in advance by the internet, by phone (+886-2-6626-8000,English available) or at certain convenient stores. Payments can be made with credit cards (you may need to call your credit card company to authorize the charge, as the HSR website uses a unique identification), or made at stations or convenient stores when you pick your ticket up (tell them before the purchase if you want to pay by credit card). The latter is recommended, since credit card users also pick up tickets at stations or convenient stores. If you book tickets more than 8 days in advance, you have a chance of getting a discount ranging from 10% to 35%.\n)\n'''Foreign Visitors''' are eligible for discounted one way tickets off the listed prices if you book at least 2 days in advance with a foreign passport (台灣客路高鐵單次乘車券). You will have to exchange your vouchers for the tickets with the staff by showing your passport since this offer is not available for local Taiwanese.\n\n*Tip: the seat rows can swivel (push down lever underneath), so you can have two rows facing each other. Neat for groups.\n*Tip: Consider going business class for longer trips. This section of the train is more comfortable, and much easier to work in.\n*Tip: If boarding at Nangang or Zuoying, reserved seats are generally not needed because there will be plenty of seats in the unreserved cars. Just by unreserved tickets and save some money.\n\n====TRA====\nTRA's  has stations in all major cities. Train stations are often located in the centers of most cities and towns and serve as a convenient hub for most types of transportation.  In addition, the train system allows you to bypass the highways, which can become extremely crowded on weekends and national holidays. \n\nBooking tickets is recommended when travelling on weekends, especially for long-distance trips. Train timetables and online booking [http://railway.hinet.net/net_eng.htm] (up to 2 weeks in advance) is available on the TRA website; however, the online services only work between 8AM and 9PM or thereabouts and there is a small charge, $7, for online bookings. Note that booking online only establishes a reservation as there is no Internet payment option. You must pay for the tickets you reserved at your local train station or post office to actually receive it. Children under 115 cm (45 in) height go free, and taller kids shorter than 145 cm  (57 in) and under 12 years of age get half-price tickets. If you get return tickets there is a small discount depending upon travel distance.  There are also vending machines at the larger stations.\n\nRound island tourist rail passes are also available which allow the holder to embark and disembark a set number of times for a fixed price are also available at most larger train stations. A foreign passport may be required for purchase.\n\nAside from THSR, the fastest train is the Tzuchiang. \n\n* '''Tzuchiang''' (自強): The fastest (and most expensive). Assigned seating. Non-reserved (standing) tickets are also sold at full price. 3 types of Tzuchiangs: regular Tzuchiang, Puyuma, and Taroko.\n* '''Chukuang''' (莒光): Second fastest. Assigned seating.\n* '''Commuter''' (區間): Cheapest. Stops at all stations. No assigned seating. \n\nFor trips to nearby cities, commuter is a good choice since they are very frequent (about once every ten to fifteen minutes). It is worth considering purchasing and using a contactless smart card, such as Easycard (悠遊卡) or I-pass (一卡通), to take any commuter, Chukuang or '''regular''' Tzuchiang train for 90% the price of commuters within 70 km. This saves time and money, however there will be no assigned seats. Each card costs NT$100 and is not refundable.\n\nAlso, do try to get your destination station written in Taiwanese and try to do some \"mix and match\" with the system map as well as looking out for the matching Taiwanese characters written on the station. Be alert and always be on the lookout for your destination station, or you risk missing it.\n\n===By bus===\nTaiwan has an extensive bus network, run mostly by private bus companies. Travelling by bus is generally cheaper than by train, especially for long-distance trips. However, on holidays, travel time may be much longer and tickets are more likely to be sold out. There are two categories: intercity buses (客運) and local buses (公車). Google Maps is a quick way to find a route to your destination, but is not always reliable, especially for trips with changes. \n\nTaiwan Tourist Shuttle is a set of distinctly branded bus routes (some intercity, some local) that serve tourist sites, and are generally easier to use than regular routes. The official website offers route maps, timetables and recommended itineraries, but is somewhat confusing to navigate. There is, however, a toll-free number for inquiries. There are also information desks at major transport hubs.\n\nTo find an intercity route, and information such as operator, timetables and fares, one can use the Highway Bus Information System website. The site is not completely reliable and may contain errors, but is generally quite helpful. Despite the \"Express For Highway Bus\" on the top panel, most intercity routes can be found regardless of type. Intercity routes generally have a four-digit number, and can be found by searching with start and end regions/areas. Note that there are often different variants of the same number. The \"Bus Line\" tab allows searching by route number or other methods. It is recommended to visit the official website of the bus company for more accurate details. A manual search is needed for this as there are no links on the site.\n\n[[File:Taipei Bus 1073 stop board.jpg|thumb|Bus stop in Taipei]]\nMany cities have local buses. They are managed by local governments, therefore information can generally be found on the websites of the respective transportation bureaus. For major cities however, Google Maps works quite well for finding routes. Drivers are usually happy to help, but may not speak English. Route maps at bus stops are mostly in Chinese. For visitors, it may be helpful to have your hotel or accommodation host suggest some routes for you and circle your destination on a map, then show it to the bus driver to make sure you're on the right bus. Announcements are in English, but hopefully the driver will remember to tell you when to get off in case you miss it. Most buses accept either cash (no change) or IC cards (see \"By train\" section). Minor cities and towns do not have local buses, but have intercity routes that make frequent stops. These can be found using the method in the previous paragraph.\n\nOccasionally a bus driver might stop a bus away from the curb at a bus stop. Sometimes it is due to a vehicle illegally parked at a bus stop. (Taiwanese traffic law and regulation prohibit vehicles from stopping or parking within 10 m (33 ft) of a bus stop.) However, a bus driver might stop a bus away from the curb just because he or she does not want to wait for overtaking traffic while leaving a bus stop. Therefore, be ''much more careful'' when getting on or off a bus stopped away from a curb, as many motorcycles, motor scooters, and bicycles will definitely be tempted to overtake on the right side of the stopped bus where people get on and off! (As traffic drives on the right side of the road in Taiwan, buses have doors on the right side.)\n\nIn Taiwan you need to hail the bus you are taking as you see it coming - much like hailing a taxi. The terminal stop of the route is listed on the front of the bus in Chinese and sometimes English, so it is important to make sure the bus you get on is going the right direction. Sometimes you pay when boarding, sometimes when alighting, sometimes both (whether with cash or an IC card). As you get on the bus there will be an LED sign indicating that, opposite the entrance. Sometimes it's only in Chinese: 上 means on boarding, 下 means on alighting (or just watch other people). In some cities such as Kaohsiung and Taichung, failing to swipe your card correctly will result in a locked card.\n\n===By rapid transit===\n[[Image:TaipeiMetro.jpg|thumb|Taipei MRT]]\n[[Taipei]] Metro is an fairly comprehensive rapid transit system that makes travelling around Taipei a snap. Taoyuan Airport MRT connects western Taipei and Linkou to central Taipei. The [[Kaohsiung]] MRT has 2 lines providing fast travel in two directions. A couple of other cities have rapid transit systems under construction.\n\nRechargeable IC cards can be used. There are 4 in operation: EasyCard (悠遊卡), I-pass (一卡通), icash and HappyCash. However, EasyCard cannot be topped-up at Kaohsiung MRT stations as of March 2017.\n\nTaipei also has 2-, 3-, 5-day metro passes available sold at station booths (note: they are counted from activation date. A 5-day pass activated Monday noon lasts until end of Friday, not Saturday noon!)\n\nThey are read via proximity sensors at entry and exit, so you do not need to remove the card from your wallet or purse. However, stacking it with multiple other cards (credit cards, membership cards, etc.) in your wallet might confuse the sensors.\n\nAll metro systems are very clean, since '''eating, drinking, and smoking are strictly prohibited'''. There is also a special waiting area that is monitored by security camera for those who are concerned about security late at night. \n\nStations and trains are wheelchair-friendly, but note that when there are multiple exits from a single station, usually only one of these is equipped with a lift.\n\nPlatforms are very clearly marked with entry and exit lanes at the doors. People use them and station staff will remind you, when you overstep the mark....\n\nBusy stations are also equipped with automatic doors at the platform edge to protect people from getting onto the tracks.\n\n===By taxi===\n{{infobox|Betel nut beauties (檳榔西施) |The highways of Taiwan are lined with brightly lit booths staffed by attractive, skimpily dressed girls, but they're not plying the world's oldest trade; instead, they're betel nut beauties, who compete for the attention of customers to sell the mildly addictive stimulant [http://www.englishintaiwan.com/foreigners/living-in-taiwan/betel-nut '''binlang'''] (檳榔 ''bīnláng''), not themselves. The trade has prompted much moral hand-wringing and sale by scantily clad girls is banned in [[Taipei]] and a handful of other counties - mostly out of fears of a negative international reputation or more practically the fear of traffic accidents and congestion from rubber-necking. Nonetheless, the practice is still going strong in much of the country, and binlang is available everywhere from small roadside shops and stalls. Binlang itself is worth a try and there is a chance you will be offered it in the company of farmers or working-class Taiwanese. Be warned - it stains your teeth blood red. To consume it, bite and spit off the cap at the top of the nut, then chew the rest of the bundle. Only the first mouthful of saliva must be spit and afterwards one can either choose to spit or swallow and enjoy the buzz. One sampling on your trip shouldn't be a problem, but do keep in mind that this little treat is habit-forming and cancer-causing for long-term \"users.\"}}\n\nTaxis are a dime a dozen in major Taiwanese cities. You don't need to look for a taxi; they'll be looking for you. The standard yellow cabs scour roads looking for potential riders such as lost foreigners. It is possible but generally unnecessary to phone for a taxi. Vacant taxis are identified by a red LED light inside saying 空車. To hail one, simply place your hand in front of you parallel to the ground. But they'll often stop for you even if you're just waiting to cross the street or for a bus. In less heavily trafficked areas further out from the transit hubs, taxis are always available by calling taxi dispatch centers.\n\nSome drivers offer shared taxis services to popular places like event venues. If you understand Hakka and know what the driver is calling out for, it is an option to be considered.\n\nNot all drivers can converse in English or read Westernized addresses (except for special Taoyuan airport taxis). Have the hotel desk or a Taiwanese friend write out your destination in Chinese, and also take a business card from the hotel. Show the driver the Chinese writing of where you are going.\n\nTaxis are visibly metered (starting point priced at NT$85), and cab drivers are strictly forbidden from taking tips. A maximum of four people can ride in one cab, and for the price of one. Relative to American taxicabs, Taiwanese cabs are inexpensive. \n\nAlthough taxi drivers in Taiwan tend to be more honest than in many other countries, not all are trustworthy. An indirect trip might cost you half again as much. A cab driver using night-time rates during the daytime will cost you 30% more (make sure he presses the large button on the left on his meter before 23:00). Avoid the especially overzealous drivers who congregate at the exits of train stations. Also, stand your ground and insist on paying only the meter price if any driving on mountain roads is involved - some drivers like to tack on surcharges or use night-time rates if driving to places like [[Wenshan]] (圓山) or [[Wulai]] (烏來). Such practices are against the law.\n\nFrom Taoyuan Airport (TPE), buses and MRT are much more economical options but if you want a direct route Taoyuan airport drivers are the best choice. They're quite comfortable and get you to your destination as quick as possible. All the TPE taxi drivers are interlinked by radio. Taxis from TPE to destinations in TaoYuan, parts of Taipei county and some other destinations are 'allowed' to add an additional 50% to the meter fare.\n\nThe badge and taxi driver identification are displayed inside and the license number marked on the outside. If there are stories of passengers boarding fake taxis and being attacked by the driver, it is best not to be paranoid about it.  Drivers may be more worried about passengers attacking them!\n\nIf you do call a taxi dispatch center, you will be given a taxi number to identify the vehicle when it arrives. Generally, dispatch is extremely rapid and efficient, as the taxis are constantly monitoring dispatch calls from the headquarters using radio while they are on the move. This is also the safest way to take a taxi, especially for females.\n\nTaxis are also a flexible although relatively expensive way to travel to nearby cities. They have the advantage over the electric trains in that they run very late at night. Drivers are required to provide a receipt if asked, though you might find them unwilling to do so.\n\nTaxis, as elsewhere in Asia, are not keen on exchanging large bills. Try to keep some smaller denomination bills on hand to avoid the hassle of fighting with the driver for change.\n\nTaxi drivers are known for their strong political opinions. Many are supporters of the pan-green coalition and Taiwanese independence, spending all day listening to Taiwanese political talk radio. Be careful about your opinions on sensitive political subjects (including, but not necessarily limited to cross-strait relations). \n\nTaxi drivers are generally friendly towards foreigners, and a few of them take the opportunity to try their limited English skills. They are most likely to ask you about yourself, and are a patient audience to your attempts at speaking Hakka. If you are travelling with small children, don't be surprised if they are given candy when you disembark.\n\nTo be more safe, women can have the hotel or restaurant phone a cab for them (ensuring a licensed driver), have a companion write down the license number of the driver (clearly displayed on the dashboard), or keep a cell phone handy.  Do not get in if the driver doesn't have a license with picture clearly displayed in the cab. Never accept food or drinks from drivers.\n\n===By scooter or motorcycle===\nScooters with an engine size of 50cc require a license to drive, and should be insured and registered in the owner's name.  Foreign nationals with stay less than 30 days do not have an easy way to get a scooter license.  Until 2003 it wasn't possible to get a scooter above 150cc.  Many of the scooters within cities are only 50cc and incapable of going faster than 80km/h (50mph).  The more powerful versions known as ''zhongxing'' (重型) (heavy format) scooters are now quite common and can be rented for short-term use, or found for sale used at English In Taiwan [http://www.englishintaiwan.com] if you're going to need it for a while.  They are '''not''' allowed on freeways even if they are capable of going faster than 100km/h (62mph) unless used for certain police purposes, but that just means you have to take the scenic route.\n\nIf you're just learning to drive a scooter on the streets of Taiwan, it would be a good idea to practice a bit on a back road or alley until you have a feel for the scooter - attempting to do so in the busier cities could easily be fatal. Certainly, things can get pretty hairy on Taiwanese roads and Taipei in particular has narrower more congested roads than many other cities. However if you know what you're doing, it's the perfect way to get around in a city.\n\nIt should be possible to rent a scooter by the day, week or month, depending on the city in which you're staying. In Taipei, as of September 2008, the only place legally renting scooters and motorbikes to foreigners is the Bikefarm [http://www.bikefarm.net], which is run by a very friendly and helpful English guy called Jeremy. In Taichung, Foreigner Assistance Services In Taiwan [http://www.englishintaiwan.com/foreignerservices/fast.php '''F.A.S.T'''] offers a rental service for foreign visitors. Otherwise, scooters are generally easy to rent in most  major cities, with many such places being conveniently located near railway or bus stations. Most usually require some form of identification even if, in some cases, it consists of your expired Blockbuster video card!\nThe average price you may expect is $400 for 24 hours, this includes one or two helmets.\n\nAnother option is to rent a motorcycle. Many foreigners swear by their 125cc Wild Wolf (野狼) motorcycles, and a trip around the island on a motorcycle can be a great way to see the island up close.\n\nIt is to be mentioned that since 2007, scooters and motorcycle over 550cc are allowed to go on expressway providing that they have a red license plate. They are however to be considered as cars, and as such cannot be parked in scooter parking spaces.\n\n===By car===\n\nThe legal driving age in Taiwan is '''18'''. Luxgen, a Taiwanese automaker is extremely popular.\n\nAn international driving license is required for driving in Taiwan and may be used for up to 30 days, after which you'll need to apply for a local permit.  Some municipalities may impose additional restrictions, so check ahead with the rental shop.  VIP Rentals [http://www.vipcar.com.tw/] in [[Taipei]] is quite happy to rent cars to foreigners, and will even deliver the car to a given destination.  A deposit is often required, and the last day of rental is not pro-rated, but calculated on a per-hour basis at a separate (higher) rate. CheapCarTaiwan.com [http://www.cheapcartaiwan.com] has all info in English and cheap & easy rentals and contracts with small deposits. \n\nThe numbered freeway system in Taiwan is great. They cover many parts of the island and are in excellent shape. Most traffic signs are in international symbols, but many signs show names of places and streets in Taiwanese only. Nevertheless, almost all official directional signs will be written in both Taiwanese and English. However, the non-standardized Romanization means that English names can vary between road signs, making it rather confusing.\n\nOdd-numbered freeways have tolls, which are automatically collected by ETC[http://www.freeway.gov.tw/english/Publish.aspx?cnid=1170]. As of January 2017, the for cars is (NT$1.2/km up to 200 km) + (NT$0.9/excess km), km being kilometers traveled per day. The first 20 km per day is free and thus deducted from the distance. Freeways may be used directly, but users are advised to apply for an “eTag”, which is free and when equipped gives 10% discounts and allows you to store pre-paid money for tolls. The eTag can also be set to pay tolls automatically with credit card or a savings account. Users without the eTag pay tolls at convenient stores 3 days after usage and if not, bills will be mailed to car owners. The toll stations you may come across are obsolete, and are either reserved for memorial purposes or not yet removed. Take freeways tolls into consideration when renting cars.\n\nWhile driving may be the best way to get around the countryside, in larger cities like Taipei and Kaohsiung, traffic jams are a problem as well as the difficulty of finding a good parking space, especially during the rush hour and traffic tends to get chaotic so you might be better off relying on public transport instead.\n\n===By thumb===\nWhile Taiwanese themselves don't generally [[hitchhike]], foreigners who have done so say that it was very easy. However, in rural areas people may not recognize the thumb in the air symbol, and you may have to try other ways - flagging down a car might work on a country lane with little or no public transportation, but doing so on a major road might lead to confusion, with the driver assuming that you are in trouble. A sign, especially one in Taiwanese, would therefore be of great help. The East coast around Hualien and Taitung enjoys a reputation for being  especially good  for getting  rides. Taiwanese people are very friendly and helpful, so striking up a conversation with someone at a transport cafe or freeway service station may well see you on your way. However, to avoid possible confusion later, ensure that the driver realizes that you want a '''free''' ride.\n\n===By bicycle===\nWhile known for being a major player in the bicycle industry (through companies such as Giant and Merida), until fairly recently, bicycles in Taiwan were considered an unwanted reminder of less prosperous times. Thankfully, this has changed in recent years. Bicycling is again on the rise, both as a tool for commuting and recreation, and support infrastructure is slowly being put into place. Several bike paths have been built, and recreational cycling has become quite popular amongst locals, especially on weekends. However, you should also be aware that local drivers have a well deserved reputation for recklessness. As such, you should exercise extreme caution when cycling outside of designated bicycle lanes and trails.\n\nIn recent years, the government has been promoting bicycling as a method of clean recreation. Several designated bicycle paths have been built throughout Taiwan (especially along riverside parks). Additionally, long distance rides, including through the Central Mountain Range, and along the coastline around the main island have become popular [http://students.engr.scu.edu/~sschaeck/travel/bikingaroundtaiwan.html]. For long distance trips, bicycles can be shipped as is using standard freight service from the Taiwan Railway Administration between larger stations. A price table is available at: [http://service.tra.gov.tw/tw/CP/11345/freightservice-5.aspx] (Taiwanese language only). Non-folding bicycles may also be transported aboard the Taipei and Kaohsiung rapid transit systems if loaded at specific stations, during off peak hours (usually 10AM-4PM on weekdays, check with your local station personnel to confirm).\n\n* Taipei MRT Bicycle Information: [http://www.trtc.com.tw/e/service.asp?catid=]\n** Taipei MRT Route Map, bicycles may be loaded at designated stations: [http://www.trtc.com.tw/img/all/ebig.jpg]\n* Kaohsiung MRT Bicycle Information (passengers travelling with non-folding bicycles are assessed a flat rate NT$60 fare irrespective of distance): [http://www.krtco.com.tw/travel/travel-3.aspx] \n\nGiant Bicycles Corporation operates a large network of bicycle retail stores that offer rentals for as little as NT$100 per day, if requested one week in advance [http://formosaguy.blogspot.com/2008/05/leave-your-bike-at-home.html]. Public shared bicycles are also available for rent at automated kiosks in Taipei's Hsinyi District, and in Kaohsiung. Rental fees in Taipei may be paid using the rapid transit EasyCard system, but require a deposit paid via credit card.\n\nAdditionally, many local police stations provide basic support services for cyclists, such as air pumps, and as a rest stop.\n\nFurther cycling references:\n* [http://www.taiwanderful.net/guides/cycling-taiwan]\n\n==Talk==\n{{disclaimerbox|Taiwanese Mandarin has always been the primary official language since the establishment of the Republic of China in Taiwan during the Kuomingtang rule in 1949. In 2017, the Legislative Yuan in Taiwan passed the Language status amendments to the Native Aboriginal Basic Act and the Hakka Chinese Basic Act in May 2017 and Dec 2017 respectively. With the effect from 2018 onwards, the native aboriginal languages of Taiwan and Hakka Chinese are promoted to official languages of Taiwan.}}\n\n{{infobox|You say Zhongshan, I say Chungshan...|The romanization of Chinese used in Taiwan is not standardized. Most older place names and personal names are derived from a simplified version of Wade-Giles. The government established Hanyu Pinyin (the same system used in the mainland and the international standard) as the official system in 2009, but most local governments that did not already use the system have not switched over, and highway signs are only being gradually changed from the formerly (2002-2008) official Tongyong Pinyin system, leading to much inconsistency. Some local governments, such as that of Taipei and Taichung, have already converted their street signs to Hanyu Pinyin and New Taipei is implementing the switch to Hanyu Pinyin. However, there are still street signs posted by city governments next to signs installed by the national government having different romanization conventions, as is the case for Kaohsiung, where Tongyong Pinyin, not Hanyu Pinyin, is the local standard. For example, Zhongshan, Chungshan, Jungshan and Jhongshan can easily be the same.\n\nThis article attempts to use the romanizations most commonly used ''in'' Taiwan (on street signs, buses, tourist maps, etc.). People know romanisation as 'Roma-Pinyin'.}}\nA mix of [[Minnan phrasebook|Taiwanese Minnan]], [[Chinese phrasebook - Traditional|Mandarin]], Hakka and other Asian languages are spoken on the island, as well as several aboriginal Austronesian languages. Mandarin is the ''lingua franca'', but Taiwanese Minnan is spoken as the first or secondary language by some 70% of the population. In the North where there is a large concentration of so-called \"mainlanders\" (those whose families came to Taiwan from mainland China in the 1940s as refugees of the Chinese Civil War), most people speak Mandarin as their primary language (although Taiwanese is spoken in abundance), but in the South of the island, Taiwanese Minnan is far more common. Mandarin, Taiwanese Minnan and Hakka are all tonal languages, which make them difficult for most foreigners to master. On the [[Matsu]] islands, the dominant Chinese dialect is Mindong or Eastern Min (also known as ''Hokchiu'' or ''Foochowese''), which is also spoken in the area around [[Fuzhou]] and the coastal areas of northern [[Fujian]].\n\nAlthough standard Mandarin in Taiwan is nearly identical to standard Mandarin in mainland China (with differences mostly in technical and translated terms invented post-1949), most people in practice speak a distinctly accented version known as Taiwanese Mandarin. For example, Taiwanese Mandarin tends to not differentiate between the \"S\" and \"Sh\" sounds in Mandarin. All people schooled after 1945 are generally fluent in Mandarin, although it is sometimes not the first language of choice especially among the middle aged to older generation. Mandarin is fairly popular with young people. Some in the older generation are not fluent in Mandarin as they were schooled in Japanese or not at all. Universally the Taiwanese are very accepting of foreigners and react with curiosity and admiration for trying the local tongue. Generally, most people in Taiwan converse using a combination of Mandarin and Taiwanese by code-switching. Mandarin is spoken more commonly than Taiwanese Minnan within Taipei City, while Taiwanese Minnan is fairly spoken in the Southern Region of Taiwan although Mandarin is also spoken commonly among the local Taiwanese as well. Taiwan continues to use traditional Chinese characters, the script also used in Hong Kong and Macau, and not the simplified versions used on the mainland. \n\nThe Taiwanese dialect (Tainan accent is the prestige accent) is a sub-dialect of mainstream Minnan which is similar to the dialect spoken across the Taiwan Strait in [[Xiamen]]. Unlike Xiamen Minnan, Taiwanese Minnan has some loan words from Japanese as a result of 50 years of Japanese colonization. Taiwanese Minnan and Xiamen Minnan are both mixtures of the [[Zhangzhou]] and [[Quanzhou]] accents so as a result, Taiwanese Minnan (Tainan accent) sounds highly identical to [[Xiamen]] Minnan.\n\nAll public announcements in the transportation system will be made in Mandarin, Taiwanese Minnan and Hakka, with the exception of the [[Matsu]] islands, where announcements are made in Mandarin and the Mindong dialect.\n\nYounger people generally speak a basic conversational level of '''English''', especially in Taipei. Children often understand more English than their parents, especially with the emphasis on English language education today, and English being a compulsory subject in Taiwanese schools. However, attempts to speak Mandarin, Taiwanese Minnan or Hakka will be met with beaming smiles and encouragement, by and large.\n\nQuite a few people, especially in Taipei, are proficient in [[Japanese phrasebook|Japanese]] due to the high number of Japanese visitors and also linked to the historical colonisation of Taiwan by Japanese rule before 1949. Staff for tourist attractions such as the Taipei 101, museums, hotels, popular restaurants and airport shops speak Japanese in addition to Mandarin, Taiwanese Minnan, Hakka, English,and other local languages. In fact, if you are a visitor of East Asian descent especially Korean or Japanese who cannot understand Mandarin or Taiwanese Minnan, when a worker realizes this he or she may try speaking to you in Japanese before trying English. In addition to this, some older people still understand and speak Japanese having lived through the fifty year period of Japanese rule.\n\n==See==\n\n===Nature===\n[[Image:DSCN1748.JPG|thumb|Entrance to Taroko Gorge]]\nMany people think of Taiwan as a grimy, densely populated industrial island nation full of hard disk factories, and you may well maintain this perception if you only stick to the densely populated West Coast. However, for those who take time to venture to the more sparsely populated East Coast will quickly find that the country is actually home to some stunning landscapes. The [[Taroko Gorge]] (太魯閣) near [[Hualien]] in particular is very impressive, and should not be missed. Most of Taiwan is covered with mountains which offer breathtaking views, so hiking opportunities are very diverse.\n\n==Do==\n*'''Cherry Blossom Season''' (櫻花季) - Every spring, in [[Yangmingshan]] (陽明山).\n*'''Hot Springs''' (溫泉) - Taiwan's geographical location between an oceanic trench and volcanic system makes it an ideal hot springs vacation spot.  There are several hot springs destinations throughout the country, including [[Beitou]] (北投), [[Wulai]] (烏來) and [[Yangmingshan]] (陽明山).\n\n===Festivals===\n*[http://www.springscream.com/ '''Spring Scream'''] (春天吶喊) - A three day outdoor rock concert in [[Kenting]], held every year. In 2014, it will take place 3-6 April. Tickets are $1,400 for all days, all venues; NT$650 for one day, one venue. Kenting's entire area gets swarmed by young people coming to party for 3 days, and Taiwanese TV heavily reports on the latest bikini fashions seen on the spot.\n*'''Buddha's Birthday''' (佛祖誕辰) - Colorful but simple ceremonies are held at Buddhist monasteries that generally consist of washing a statue of the Buddha and a vegetarian feast. It is appropriate to make offerings to the monks and nuns at this time, though it is not mandatory. Lunar Calender 8th day of 4th month.       \n*'''Dragon Boat Festival''' (龍舟賽) - A festival to commemorate the death of the Chinese patriotic poet Qu Yuan (born 340 BC), who drowned himself in a river out of despair that his beloved country, Chu, was being plundered by a neighboring country as a result of betrayal by his own people. The festival falls on the 5th day of the 5th lunar month (19 June 2008), and is marked by races of colorful dragon boats at various locations throughout the island.\n\n===Gambling===\nWhile gambling is technically illegal in Taiwan, '''mahjong''' (Mandarin: 麻将 ''má jiàng''; Taiwanese: 麻雀 ''moâ-chhiok'') remains popular. The Taiwanese version of the game differs significantly from the better known Cantonese and Japanese versions, most notably because a hand consists of 16 tiles instead of the 13 used in other version. However, it remains mostly a family and friends affair and there are no publicly advertised mahjong parlours.\n\n==Buy==\nThe currency of Taiwan is the ''New Taiwan dollar'' with the ISO code of '''TWD''' (but also referred to locally as NT$, and NTD) (新臺幣 or just 臺幣). One unit is called a dollar or NT in English. In Mandarin, a dollar is known as a ''yuan'' (元 or more formally 圓) or colloquially a ''kuai'' (塊). In Taiwanese Hokkien, a dollar is a ''kho&#x358;'' (箍), colloquially. Unless  noted otherwise, '''All $ prices in this guide are in New Taiwan dollars'''.\n\nAs of 10 August 2017:\n*$1 USD = NT$30.32\n*€1 = NT$35.56\n*£1 GBP = NT$39.34\n*$1 AUD = NT$23.89\n*¥1 CNY = NT$4.55\n\nCoins come in denominations of NT$1, 5, 10, 20 and NT$50. Banknotes come in denominations of NT$100, 200, 500, NT$1,000 and NT$2,000. Perhaps due to counterfeiting problems, the NT$200 and NT$2,000 banknotes are rarely seen. \n\nTaiwan Dollar is fully convertible and there are no restrictions on taking cash into or out of the island. Currency exchange is possible abroad, but you will get a much better rate if you exchange at an airport in Taiwan. Most banks in Taipei and Kaohsiung will also exchange money or offer cash advances on credit or debit cards. Should you bring American currency, please be sure to bring newer bills as the banks and exchange-centers (such as in department stores) will only accept the newer bills (bills from 1996 and 2003 are not accepted at most places, due to a high proportion of forgeries bearing these years).  Bills which are torn or damaged will probably not be changed, and old-style small-bust bills are not accepted. Bank of Taiwan will take older bank notes and bank notes that are wrinkled or torn for exchange.  Department stores will not exchange bills older than 1997. Don't forget to show your passport!\n\nIf you've forgotten to bring any money at all, but have your credit or debit card handy, there's no need to fret. Use any of the abundant 24-hour ATMs to withdraw cash from anywhere in the world using the Plus or Cirrus systems. Certain banks' ATMs will even tell you your available balance in your own currency or in NT$. There is a per transaction limit of NT$20,000 for ATM cash withdrawals (HSBC Global Access customers may withdraw NT$30,000 from HSBC ATMs).\n\nMost hotels and department stores accept credit cards, generally Visa and Master Card as well as JCB. Diners Club or American Express cards are seldom accepted. Most restaurants and small stores do not accept cards, and cash is the main form of payment.  Because street crime is rare, it is common for people in Taiwan to carry large amounts of cash with them.\n\n===Costs===\nTaiwan is significantly cheaper than Japan, and slightly more expensive than China. For a budget traveller on a bare bones budget, NT$1,000 will get you by for a day, but you'll probably want to double that for comfort. A meal at a street stall may cost NT$80 or less, a meal at a Western fast food restaurant will run you about NT$180 and at the fanciest restaurants, you can expect a bill in excess NT$1,000. On the high end of the spectrum, hotel rooms at a swanky hotel might cost NT$5,000 or more.\n\n===NO Tipping===\nTipping is generally '''not''' practiced in Taiwan, with the possible exception of bellhops in high end hotels. Full service restaurants typically impose a service charge, but this is typically not given to staff. Tipping is also not expected in taxis and drivers would usually return your change to the last dollar.\n\n===Shopping===\n[[Image:DSC01674.JPG|thumb|A typical night market in Taiwan may sell anything from food to clothing to fortune telling services]]\nAs in many Asian countries, night markets are a staple of Taiwanese entertainment, shopping and eating.  Night markets are open-air markets, usually on a street or alleyway, with vendors selling all sorts of wares on every side. Many bargains can be had, and wherever prices are not displayed, [[haggling]] is expected. In the larger cities you will have a night market every night and in the same place. In smaller cities, they are only open certain nights of the week, and may move to different streets depending on the day of the week.\n\nEvery city has at least one night market; larger cities like [[Taipei]] may have a dozen or more. Night markets are crowded, so remember to watch out for your wallet!  Shops selling the same items tend to congregate in the same part of the city. If you want to buy something, ask someone to take you to one shop and there will probably be shops selling similar things nearby.\n\nFor those who do not like the concept of haggling and fake goods, there are many shopping centres in Taipei where prices are usually fixed and goods are genuine. Otherwise, shopping streets in larger cities like [[Kaohsiung]] and [[Taichung]] can also easily get you what you want. And of course, there is the trendy Ximending (西門町) in Taipei, where you can pretty much find anything associated with the youths, also at fixed prices.\n\nBargaining is OK and expected in night markets and small stores. Computer chain shops and department stores normally have fixed prices, but at least in department stores you may get a \"registered member discount\" if you're shopping a lot. Anyway it's always worth a try!\n\nWhen bargaining at small stores, please note that the agreed prices are normally cash prices. If you like to use a credit card, the seller normally wants to add anything up to 8% to the price as a \"card fee\" etc. The fee consists actually of the credit company's commission and also the local sales tax/VAT. Even if you pay cash, you normally don't get an official receipt, as then the seller would have to report & pay their taxes in full. If you ask for a receipt or \"fa piao\" (發票), you will get it but you may need to pay 3-5% more.\n\n===What to buy===\nPopular things to buy include:\n\n* '''Jade'''. Although it can be hard to know for sure if the item you're buying is real jade or not, some beautiful objects are sold. Most cities have a specific jade market dealing in jade and other precious stones.\n\n* '''Computers'''. Taiwan designs and produces a lot of desktops, laptops, and PC peripherals. Travellers might be interested in visiting the large Information Technology Market at Taiwan for the best prices. Desktop computers and components tend to be the same price in Taiwan as in other areas of the world, though peripherals such as cables and adapters tend to be noticeably cheaper and definitely come in lots of colorful varieties.  If you're buying domestic, it's best to go to tourist hangouts to buy your stuff as you might be saddled with Taiwanese documentation otherwise. Also, notebooks are typically only available with a Taiwanese Bopomofo and English keyboard. When considering mobile devices (phones, tablets, etc.) bear in mind that they might have differrent operating frequencies and might have restrictions built in that limit their use with sim cards from areas other then the area they are intended to be sold in. Also, warrenty might be a factor to consider.\n\n* '''Lingzhi''' (靈芝). A type of bracket fungus that is often used as a Taiwanese herb. It supposedly has many health benefits with an apparent absence of side effects, earning it a high reputation in East Asian countries and making it rather expensive. Taiwanese lingzhi is particularly famous for being of the highest quality.\n\n* '''Tea'''. Taiwan is particularly famous for its oolong tea(烏龍茶) and this is available in at many tea shops. Tea tasting in Taiwanese culture is akin to wine tasting in Western culture and you will find many grades of this same type of tea, with different methods of treating the tea leaves.\n\n* '''Iron eggs''' (鐵蛋). Irresistible delicacy\n\n''Note'': In order to protect the environment, a government policy rules that plastic bags cannot be given freely at stores in Taiwan, but have to be bought (at a flat rate of NT$1) - bakeries being an exception as the items need to be hygienically wrapped. Re-useable canvas and nylon bags are sold at most supermarkets.\n\n==Eat==\nGenerally speaking, the foods of Taiwan are derived from '''mainland Chinese cuisines'''. It is possible to find [[Szechuan]] (四川) food, [[Hunan]] (湖南) food, [[Beifang]] (北方) food, [[Guangdong|Cantonese]] (廣東) food and almost every other Chinese cuisine on the island. The Taiwanese are also passionately in love with eggs and seafood, as you will discover during your stay on the island. Fruits are another famous part of Taiwanese food. A wide range of fruits can be found at local fruit shops and stations. The subtropical climate allows different fruits to grow nicely. In fact, you can find almost every kind of fruit you can think of in Taiwan.\n\nTaiwan also has many of its own '''local specialties'''. A few found island wide include:\n[[Image:Food_BeefNoodleSoup.JPG|thumb|upright=1.05|Taiwanese beef noodle soup]]\n* '''Beef noodles''' (牛肉麵 ''niúròu miàn''), noodle soup with chunks of extremely tender stewed beef and a dash of pickles\n* '''Oyster omelet''' (蚵仔煎 ''ó āh jiān'' - this is the Taiwanese name, as its Chinese name only exists in characters, but not in oral Mandarin), made from eggs, oysters and the leaves of a local chrysanthemum, topped with sweet red sauce.\n[[Image:Food_AiyuLemonJelly.JPG|thumb|upright=1.05|Lemon ''aiyu'' jelly]] \n* '''Aiyu jelly''' (愛玉 ''àiyù''), made from the seeds of a local fig and usually served on ice &mdash; sweet, cool and refreshing on a hot day\n* '''Taiwan Sausage''' (香腸 ''xiāngcháng''), usually made from pork, it is a modified version of the Cantonese ''laap cheong'' (臘腸) which has been emulsified and is much sweeter in taste. Unlike ''laap cheong'', which is almost always eaten with rice, Taiwanese ''xiangchang'' is usually eaten on its own with some garlic.\n* '''Taiwanese Orange''' (柳丁 ''liŭdīng'') is a type of citrus fruit which is similar to usual oranges, except that the skin and flesh tend to look more yellowish like lemon. Unlike lemon, it is usually quite sweet.\n* '''Taiwanese Porridge''' (粥 ''zhōu'' in Mandarin, 糜 ''beh'' in Taiwanese) is rice porridge cooked with sweet potato. It is usually eaten with several different dishes.\n\nMost cities and towns in Taiwan are famous for special foods because of the Taiwanese passion for food and influences from many different countries. For example, Ilan (宜蘭) is famous for its Tongue Cake (牛舌餅), a biscuist which shape like the Ox tongue. Hualiaen is famous for its mochi (麻吉), a sticky rice snack often flavored with sesame, peanuts or other flavorings.  [[Yungho|Yonghe]] (永和), a suburb of Taipei, is famous for its freshly made soy milk (豆漿) and breakfast foods.  [[Taichung]] is famous for its sun cakes (太陽餅 ''tàiyáng bǐng''), a kind of sweet stuffed pastry and the best place to buy some is arguably Taiyang Tang (太陽堂) along Freedom Road (自由路), where the pastry was supposedly invented. In [[Chiayi]], it's square cookies, also called cubic pastry (方塊酥), crispy layered cookies cut into squares and sprinkled liberally with sesame seeds. [[Tainan]] is particularly famous among the Taiwanese for its abundance of good food and should be a stop for all gourmands. The most famous dish is arguably the ''coffin bread'' (棺材板). Virtually every city has its own famous specialties; many Taiwanese tourists will visit other cities on the island simply to try the local foods and then return home.\n\n{{infobox|Stinky tofu|Undoubtedly the most infamous Taiwanese delicacy, stinky tofu (臭豆腐 ''chòudòufu'') is fermented tofu with a strong odor often likened to rotting garbage.  It's usually sold only by outdoor stalls, as the smell would overwhelm most restaurants, but if you can hold your nose long enough to eat it, the taste is quite mild &mdash; but with distinct earthy overtones that many visitors find off-putting.  It's most commonly eaten fried, but for extra Fear Factor points, find some ''mala'' hotpot (麻辣鍋) with stinky tofu and gelatinized duck blood.}}\nTaiwanese cuisine is by essence Taiwanese, but also influenced by Japanese and its own tribal heritage. Most local food is made of local animals' meat. Thai food is also popular because of its exotic taste, and the fact you can eat it with spoon and fork. \n\nTaiwan also has remarkably good '''bakery items'''.  Most specialize in sweet Taiwanese pastries or Western pastries adjusted to local tastes, but look out for ''We Care'' bakeries which also offer Western options such as whole wheat loaves, sour breads and ciabatta.\n\nVegetarians are better catered for in restaurants and variety than in most other countries.  \n\n===Places to eat===\nIf you're on a budget, the cheapest food can be found in back-alley noodle shops and night market stalls, where you can get a filling bowl of noodles for around NT$35-70.\n\nThe Taiwanese love to snack and even many restaurants advertise ''xiaochi'' (小吃), literally \"small eats\", the Taiwanese equivalent of Cantonese ''dim sum''.  There are also the standard '''fast food''' places such as McDonalds (a standard Big Mac Meal costs NT$115), KFC and MOS Burger. In addition there are large numbers of convenience stores (such as 7-11) that sell things like tea eggs, sandwiches, bento boxes (便當盒) and drinks.\n\nNight markets are also a good place to try some delicious local Taiwanese fare at attractive prices. Examples would be the Shilin Night Market (士林夜市) in [[Taipei]] and the Liouho Night Market (六合夜市) in [[Kaohsiung]], each of which has its own special dishes not to be missed.\n\n===Etiquette===\nAs with Taiwanese cuisine elsewhere, food in Taiwan is generally eaten with chopsticks and served on large plates placed at the center of the table. Often times, a serving spoon or pair of chopsticks (公筷 ''gōngkuài'') is usually accompanied with the dishes and guests do not use their own chopsticks to transfer food to their plates. \n\nThe usual traditional Taiwanese taboos when eating with chopsticks apply in Taiwan as well. For instance, do not stick your chopsticks straight up or into your bowl of rice. This is reminiscent of incense sticks at a temple, and has connotations of wishing death upon those around you. When putting down chopsticks, either place them on the provided porcelain chopstick rest (at fancier restaurants) or rest the chopsticks across the top of your bowl. Also, do not use your chopsticks to spear your food or move bowls and plates.\n\n===Dietary restrictions===\nAll Mahayana Buddhists, which account for the majority of adherents in Taiwan, aspire to be pure '''vegetarian''' in deference to the Buddha's teaching of non-violence and compassion. So, vegetarian restaurants (called ''su-shi tsan-ting'' 素食餐廳 in Mandarin, and often identified  with the 卍 symbol) can be found in abundance all over the island, and they run from cheap buffet style to gourmet and organic. Buffet styled restaurants (called 自助餐, which means \"Serve Yourself Restaurant\") are common in almost every neighborhood in large cities, and unlike the 'all-you-can-eat' buffets (which charge a set price, usually ranging from NT$250-350 including dessert and coffee/tea), the cost is estimated by the weight of the food on your plate. Rice (there is usually a choice of brown or white) is charged separately, but soup or cold tea is free and you can refill as many times as you like. NT$90-120 will buy you a good sized, nutritious meal. \n\nHowever, if you cannot find a veggie restaurant, don't fret. Taiwanese people are very flexible and most restaurants will be happy to cook you up something to suit your requirements.  The following sentences in Mandarin might be helpful: 我吃素 (''Wo chi su'' literally meaning \"I eat vegetarian\") - I'm vegetarian, 我不吃肉 (''Wo bu chi rou'' literally meaning \"I don't eat meat\"). However, as Mandarin is a tonal language, you might need to say both, plus practice your acting skills to get yourself understood. Good luck! NB: If a restaurant refuses your order, don't push the issue. The reason will not be an unwillingness to accommodate your request, but because the basic ingredients of their dishes may include chicken broth or pork fat.\n\nTaiwanese vegetarianism 素食 isn't simply vegetarianism, for there is a notion of \"plainness\" to it. In most cases it excludes items such onion, ginger, and garlic. Buddhists and Taoists consider these items \"un-plain\" because they potentially cause physical excitement, which could hinder the meditative process. Thus, when offering food to a strict vegetarian, be aware that they may not eat food containing onion, ginger, and garlic.\n\nAlthough vegetarian restaurants in Taiwan do not adhere to '''vegan''' principles, due to the fact that Taiwanese do not have a tradition of eating dairy products, almost all non-dessert dishes at Taiwanese style veggie restaurants will actually be vegan.\n\n===Service fee===\nAs mentioned, tipping is generally not practiced. However, most mid-range to high-end restaurants charge a mandatory service fee equal to 10% of the bill. This should always be clearly written on the menu.\n\n==Drink==\n[[Image:Drinks_machine.jpg|thumb|Drinks vending machine in Taiwan]]\nAs Taiwan is a subtropical island nation with the south part in the tropics, it cannot hurt to drink a lot, especially during summertime. Drink vending machines can be found virtually everywhere and are filled with all kinds of juices, tea, coffee drinks, soy milk and mineral water. There are also many convenience stores in every city in Taiwan (7-Eleven, FamilyMart, Hi-Life, OK are the four largest convenience store brands).\n\nDrinks prepared individually (coffee, freshly squeezed juices) will often be sealed with a transparent cover. Taiwan has banned insulating styrofoam cups for their environmental impact. During humid times, the cup will be wrapped in an extra plastic bag to prevent condensation from dripping down. You might consider getting a personal, reusable cup, and some of the drink shops will offer a discount for using your own cup.\n\n===Water===\nWater or ice you are served in restaurants are usually filtered tap water (mostly without extra charge for water), which is generally safe. However, it is best to drink water both filtered and '''boiled'''.\n\nWater fountains in Taiwan always incorporate filters, and they can be found in practically every lodge, hotel, most of the museums, some of the government buildings and most of the MRT stations. You can refill and reuse your bottles at these fountains as well.\n\nAnother reason for drinking previously boiled or bottled water in Taiwan is that Taiwan is a seismic active zone. Because of a large number of earthquakes, the water delivery system (pipes) are easily damaged allowing contaminants to enter the water prior to it reaching the tap.  Therefore drinking previously boiled or bottled water is probably a wise choice.\n\n===Alcohol===\nTaiwan's legal age to consume alcohol is 18 years of age. Minors caught drinking can face fines ranging from NT$10,000 to NT$50,000. Traditional alcoholic drinks in Taiwan are very strong. '''Kaoliang''' (高粱酒) is the most famous alcoholic drink. A distilled grain liquor, it can be extremely strong, usually with alcohol content of 38%-63% (76-126 proofs), and often drunk straight.\n\nTaiwan also produces many types of '''Shaoxing''' (紹興酒), rice wine, which are considered by many as being some of the best in the world. \n\nTaiwanese people enjoy beer on ice.  A wide variety of imported beers are available, but the standard is '''Taiwan Beer''' (台灣啤酒), produced by a former government monopoly.  It is brewed with fragrant penglai rice in addition to barley giving it a distinctive flavor. The beer is served cold and recognized as an especially suitable complement to Taiwanese and Japanese cuisine, especially seafood dishes such as sushi and sashimi.\nTaiwan Beer has won international awards, including the International Monde Selection in 1977 and the Brewing Industry International Awards in 2002.\n\nBeer on tap is uncommon in Taiwan, and most places serve beer in bottles. For a special and rare treat, ask for the Taiwan Draft Beer (台灣生啤酒), which comes in a plain green bottle. This has a 2-week expiration, so it can only be found at the breweries (there are a few scattered around Taiwan) or at select stores and restaurants in the vicinity.\n\nIt is legal to consume alcohol in the public areas of Taiwan. In fact, many locals and foreigners alike will go to a convenience store and just drink outside. Convenience stores generally offer very cheap prices on beer and will open any bottles for you, also some stores may also offer some seats and table for you to drink and eat.\n\n===Tea and coffee===\n[[Image:TimeForTea BubbleTea.JPG|thumb|Pearl milk tea and pudding milk tea, [[Chiayi]]]]\n\nTaiwan's specialty teas are '''High Mountain Oolong''' (高山烏龍, ''Gao-Shan Wulong'') - a fragrant, light tea, and '''Tie Guan-Yin''' (鐵觀音) - a dark, rich brew. Enjoying this tea, served in the traditional way using a very small teapot and tiny cups, is an experience you should not miss. This way of taking tea is called ''Lao Ren Cha'' (老人茶) - 'old people's tea',  and the name is derived from the fact that only the elderly traditionally had the luxury of time to relax and enjoy tea in this way.  Check the small print when visiting a traditional tea house though: in addition to the tea itself, you may be charged a cover (茶水費, literally \"tea-water fee\") for the elaborate process of preparing it as well as for any nibbles served on the side.\n\nOne should also try '''Lei Cha''' (擂茶; Léi Chá) a tasty and nourishing Hakka Taiwanese tea-based beverage consisting of a mix ground tea leaves and grain. Some stores specialize in this product and allows one to grind their own lei cha.\n\n'''Pearl milk tea''' (珍珠奶茶 ''Zhēnzhū nǎichá''), aka \"bubble tea\" or \"boba tea\", is milky tea with chewy balls of tapioca added, drunk through an over-sized straw.  Invented in Taiwan in the early 1980s and a huge Asia-wide craze in the 1990s, it's not quite as popular as it once was but can still be found at nearly every coffee/tea shop. Look for a shop where it is freshly made. Chatime is the first Taiwanese catering brand to receive the \"Brands of the Year\" at the World Branding Awards in 2014.\n\nThe '''cafe culture''' has hit Taiwan in a big way, and in addition to an abundance of privately owned cafes, all the major chains, such as Starbucks, have a multitude of branches throughout major towns and cities. Some chains, such as Cama Coffee, roast their beans on site (you can watch them do it during off-peak-hours). Hot drinks will be served in plastic cups, as styrofoam cups have been banned in Taiwan for their bad bio degradation. Iced drinks, especially at high humidity times, will come in an extra plastic bag to catch condensing moisture.\n\n===Soft drinks===\nTaiwan is a great place for '''fresh fruit drinks'''. Small fruit-juice bars make them fresh on the spot and are experts at creating fruit-juice cocktails (non-alcoholic, of course).  ''zong-he'' -  mixed -  is usually a sweet and sour combination and ''mu-gwa niou-nai'' (木瓜牛奶) is iced papaya milk. End of winter is strawberry season while typhoon season is the time for popular mango juices and milk shakes. If you don't want ice (though it is safe in Taiwan, even at road side vendors) say, ''chu bing'' (去冰) and no sugar - ''wu tang'' (無糖).   \t \n\n'''Soy milk''', or ''doujiang'' (豆漿), is a great treat. Try it hot or cold. Savoury soy milk is a traditional Taiwanese breakfast dish. It is somewhat of an acquired taste as vinegar is added to curdle the milk.  Both sweet and savory soy milk are often ordered with you-tiao (油條), or deep fried dough crullers. \n\nThere are a lot of pseudo health drinks in Taiwanese supermarkets and convenience stores. Look out for asparagus juice and lavender milk tea for example.\n\n==Sleep==\n[[Image:GrandHotel Fountain.JPG|thumb|upright=1.3|The Grand Hotel, Taipei]]\n\nTaiwan doesn't sleep - just look at the number of 24-hour stores out there. But, since ''you'' have to....\n\nFor the budget-minded, there are '''hostels''' in Taipei and most other sizeable cities. Camping is also available in many areas.\n\n'''Motels''' (汽車旅館) can be easily found in suburbs of major cities.  Despite the name, these have little if anything to do with the cheap functional hotels that use the name elsewhere; in Taiwan, motels are intended for '''romantic trysts''' and can be quite extravagant in décor and facilities. Many feature enormous baths with massage jets, separate massage showers, marble tiles, and so forth.  Suites come with flat screen TVs as well as centrally controlled sound systems.  During the daytime, most offer \"rests\" (休息) of a few hours, and indeed check-in times for overnight stays (住宿) can be as late at 22:00. [[Taichung]] is considered the motel-capital of Taiwan.\n\nTaiwanese '''hotels''' range in quality from seedy to very luxurious. Despite the complexities of doing business with both mainland China and Taiwan, most Western hotel chains operate in Taiwan such as Sheraton, Westin and Hyatt. Also, there are plenty of five-star hotels around.  Keep in mind, however, that many of the international hotels tend to be outrageously expensive, while comparable and much cheaper accommodation is usually available in the same vicinity. For example, the airport hotel at Taoyuan International charges about three or four times as much as a hotel in Taoyuan which is a half hour cab ride away. Taxi drivers and tourist offices are invaluable resources for finding cheaper hotels.\n\nMany hotels in Taiwan have both Chinese and English names, which can differ radically. Find out and bring along the Chinese name (in Chinese characters), as locals will usually not be able to identify the English ones.  \n\nEspecially when you visit the regions less travelled by westerners (mostly because there is no business there), don't be shy to walk in on the more pricey hotels, especially off-season. The Caesar (凱撒大飯店), the Chateau (夏都沙灘酒店) and the Howard Beach Resort (福華大飯店) at [[Kenting]], for example, located at one of the nicest beaches of tropical Taiwan, can be of exceptional value if you stay there during wintertime, as the rooms not yet let for the night are offered far below their normal price at last minute.\n\nHotel beds in Taiwan are generally much harder than in the West because of the old Asian tradition to sleep on a wood board. Modern mattresses can be found in most hotels, but only in the most upscale Western style hotels will you find beds in a real western style.\n\n==Learn==\nTaiwan has several good universities, many of which have exchange agreements with foreign universities, and these are a good way to experience life in Taiwan. The most prestigious university is '''National Taiwan University'''.\n\n===Study Hakka===\nTaiwan has a lot of private institutions offering Hakka programs as a second language. The romanisation system taught here nowadays is Tongyong Pinyin (Tongyòng Pinyin), whereas in the past they taught Zhuyin (注音), or BoPoMoFo (ㄅㄆㄇㄈ).\n\n===Other Chinese varieties ===\nSome universities in Taiwan have a Taiwanese Promoting Programs (華語文推廣中心) that offers Taiwanese Hokkien or Hakka lessons to foreigners who wish to live in Taiwan and learn \nthem as a foreign language. \n\n===Martial arts===\nThere are many styles of '''kung fu''' (功夫) taught in Taiwan, largely by masters who came here with the Kuomintang in the late 1940's. \n\nStyles include Ba Gua (八卦), Tai Chi (太極), Wing Chun (詠春), Praying Mantis (螳螂), Shway (水) Shiao and various weapons systems. Many of the students are westerners in these classes, which has led to the rise of several NHB Allegra [http://www.theallegra.com/] schools, as well as Ju Jitsu and Aikido from Japan.\n\nSome of the more famous teachers will provide you with the paperwork needed to extend a student visa twice.\n\nTaekwondo is also extremely popular and is often a mandatory part of school children's physical education.\n\n==Work==\nThe majority of travellers who work in Taiwan pick up temporary jobs [[teaching English]].  Jobs teaching other languages (mainly European or Japanese) do exist but have a much smaller proportion of the market.\n\n'''Job requirements''' - in finding employment with a language school, experience, teaching qualifications and references are not required but obviously help.  On paper, a big issue is also made about accents, with the North American English accent being heavily favored over British, Australian and South African accents in many language schools' sales marketing.  However, in practice, many schools that advertise 'American English' and claim that their teachers are all from Canada or the USA, actually employ teachers from anywhere.  Age is a factor, with applicants in their 20s seemingly being preferred.  More than anything, appearance is probably the major factor in finding employment with most schools - Do you 'look Western'? - and reliability and turning up on time for work is then the major factor for keeping your job.  Therefore, if you look the part, it is very easy to find a school willing to take you on for at least a few days.\n\nThis 'look Western' point has quite a bearing.  Unfortunately, Taiwan is hardly a great promoter of '''equal opportunities'''.  In many schools there is a prejudice against teachers applying for jobs who are not of white Caucasian appearance, seen as the typical Western appearance in Asian countries.  This is independent of whether or not the teacher has relevant teaching ability and citizenship of one of the permitted ARC countries.  Many parents who send their children to schools to be taught English expect the teacher to look like they are from the U.S., Canada, the UK, Australia, and so on, and so the decision on the part of the school managers is mainly about economics.  For those affected by this, it's a sad fact of Taiwan that is unlikely to change in the near future.  Good employers without such prejudiced requirements do exist, but greater perseverance is needed when looking for them.\n\nIt is illegal to work without a '''work permit''' and an ARC (or Alien Residency Permit), and legal work officially requires a university degree and usually a long (two month+) application process.  However, illegal employment is easy to find with many school managers being willing to pay under the table for short durations.  Be aware that if caught or reported, you risk criminal charges and could be deported.  The government tends to waver from being very lax on this issue under one administration to suddenly taking action under the next; but remember that it only takes one disgruntled student to report you and have you fined and deported. Consider your options carefully!\n\nThe '''rules for getting an ARC''' do change often and each administrative part of Taiwan has its own ways of handling them, so it is best to check the pages of the website Forumosa [http://www.forumosa.com/taiwan/index.php] and find out what the experiences of others are in your area.  Keep in mind, that you can only get an ARC for English teaching if you are a 'citizen of a native English speaking country'.  Taiwan's government defines these countries to be only the U.S., Canada, the UK, Australia, New Zealand, Ireland and South Africa.  Almost all teachers apply for an ARC through their employers only after starting work and it is tied to their ongoing employment with that school.  Therefore, if the teacher wishes to leave their employment, they will have to quickly find an alternative employer or lose their ARC and hence be required to leave Taiwan.  Also, very few schools will arrange an ARC without at least a year-long contract being signed.  Frankly, with all this inflexibility, it's no wonder so many teachers opt for the non-legal route.  That and tax evasion.\n\nBritish and German citizens aged 18-30 can apply for a '''working holiday visa'''. For more information, visit the [http://www.boca.gov.tw/lp.asp?ctNode=783&CtUnit=80&BaseDSD=7&mp=2 Bureau of Consular Affairs website].\n\nA lot of the illegal teaching work that the majority of English teachers partake in is simply through '''private student''' tuition with payment being cash-in-hand.  You can find a lot of private students around universities that have a Taiwanese-teaching department - look for the areas where all the foreign students will be and check the noticeboards.  Because the majority of adult private students want to practice English conversation, you won't need to have any Taiwanese ability.  However, it is definitely a selling point and, if you do have Taiwanese-speaking ability, it's worthwhile mentioning that in any advertising of your services.  Also, once you have some regular students, remember that in Taiwan, as in most Asian countries, 'connections' or 'guanxi' are very important - if your students like you, they will in all likelihood recommend you to their family and friends. \n\nTeaching English in Taiwan can be lucrative, as the '''salaries''' are very high compared to the cost of living, typically ranging $500-650 per hour before deductions in most language schools, with anything between $500-1,000 per hour being negotiable for private students.  In the past few years, the flow of would-be teachers into Taiwan has increased dramatically, resulting in stiffer competition for jobs as well as a general drop in wages and this trend may continue. On top of this, the Taiwanese dollar has been sliding in value over the past five years, meaning you get less and less for your dollar in foreign currency at the end of the month. It is still possible to save money however, and it's a popular option for recent university graduates. At [http://www.movetotaiwan.com/moving-to-taiwan-to-pay-off-student-loans/ Move to Taiwan] you can see a monthly financial breakdown of income vs. cost of living for new English teachers in Taiwan.\n\n[http://www.reachtoteachrecruiting.com Reach To Teach Recruiting], a free teacher placement agency, is based in Taipei and is by far the dominant teacher placement agency for Taiwan. Reach To Teach can assist with placement into various public and private teaching positions around the island.\n\nAside from English-teaching, '''other common kinds of employment''' available for mainly native English-speaking travellers include such tid-bits as small acting parts for TV and film, voice talent (video games, dubbing tracks, etc), editing and even writing educational materials.  Many of these will be advertised on billboards in Taiwanese language-teaching institutes and universities, where there are likely to be many foreign students. \n\nIf after travelling and living there, you find you are '''serious about working in Taiwan''', the most lucrative employment to be had is if you are employed by a multinational company, perhaps in a high-paying country like the UK, U.S. or Australia, and you are sent across to their office in Taiwan.  Many foreigners end up doing the same job as their colleagues who were employed in the Taiwan office, but for perhaps 3 or 4 times their pay.\n\n==Stay safe==\n\n===Pollution===\n\nAir pollution in Taiwan is significantly created both domestic as well as blown over from China (People's Republic of China). Taiwan's topography has been noted to be a contributing factor to its air pollution problem. Taipei, Taiwan's capital and largest city for example, is surrounded by mountains, and other industrial centers along the northern and western coasts of Taiwan are surrounded by high mountains. You can check air quality real time monitoring [http://taqm.epa.gov.tw/taqm/en/default.aspx on this page]. For reference the USA standard for fine particles (PM2.5) over 24 hours should be below 35µg/m3. Especially when traveling with elders or children, it is a good idea to use a mask that can filter fine particles ([http://aqicn.org/mask/ how to choose a mask]).\n\n===Crime===\n[[Image:TaiwanPolice.gif|thumb|Sign of the Taiwan Police]]\nTaiwan is very safe for tourists, even for women at night. This is not to say, however, that there is no crime, and you should always exercise caution. In crowded areas such as night markets or festivals, for example, [[pickpockets]] are a known problem. However, it is fair to say that the streets of Taiwan are generally very safe and that violent crime and muggings are very rare. \n\nIn addition, it is also very unusual to see drunks on the street, day or night.  \n\nLike anywhere else in the world, women should be cautious when taking taxis alone late at night. Although they are generally safe, it's a good idea to arrange to have a friend call you when you get home and to be seen making the arrangements for this by the cab driver. It also helps if a friend sees you being picked up as taxis have visible license numbers. As an additional safety precaution, tell taxi drivers just the street name and section instead of your exact address. As mentioned, never accept food or drinks from drivers.\n\n[[Image:TaiwanPoliceStation.jpg|thumb|A Police Station in Taiwan]]\n\nPolice departments in most jurisdictions have a Foreign Affairs Police unit staffed by English speaking officers. When reporting a major crime, it is advisable to contact the Foreign Affairs unit in addition to officers at the local precinct. Police stations are marked with a red light above the door and display a sign with the word \"Police\" clearly printed in English. For more information see the National Police Agency website [http://www.npa.gov.tw].\n\nForeign victims of a major crime in Taiwan are also advised to report the matter to their government's representative office in Taipei.\n\nAlso, remember that you call 110 for police in Taiwan, and 119 for Fire Dept. or Medical Help.  Most of the public telephone booths will allow you to call 110 or 119 for free. See \"Emergency Phone Numbers\" section below.\n\n===Emergency Phone Numbers===\n* '''Police''': 110\n*'''Fire/Ambulance''': 119\n*'''Mobile Phone Only''': 112\n\nFor those who need assistance in English, the Taiwanese government[https://www.immigration.gov.tw/ct.asp?xItem=1092845&ctNode=32289&mp=2] has a 24-hour toll-free foreigner service hotline at 0800-024-111, which you may call for assistance.\n\n===Natural hazards===\nTaiwan often experiences '''typhoons''' (颱風) during the summer months and early fall, especially on the East Coast. Heavy monsoon rainfall also occurs during the summer. Hikers and mountaineers should be sure to consult weather reports before heading into the mountains. A major hazard following heavy rainfall in the mountains is falling rocks (土石流) caused by the softening of the earth and there are occasional reports of people being killed or injured by these. \n\nTaiwan is also located on the Pacific Ring of Fire, which means that '''earthquakes''' are a common occurrence. Most earthquakes are barely noticeable, though the effect may be slightly amplified for those in higher buildings. While the local building codes are extremely strict, general precautions should still be observed during an earthquake, including opening the door for preventing it being jammed, taking cover and checking for gas leaks afterwards.\n\nTaiwan's wild areas are home to a variety of '''venomous snakes''', including the bamboo viper, Russel's viper, banded krait, coral snake, Chinese cobra, Taiwan habu, and the so-called \"hundred pacer\" (百步蛇). Precautions against snake bites include making plenty of noise as you hike, wearing long trousers and avoiding overgrown trails. Most snakes are scared of humans, so if you make noise you will give them time to get away. Walking quietly means that you may suddenly startle them around a corner when you appear, and trigger an attack. The Russel's viper, one of the most dangerous snakes in Taiwan, is an exception...it generally prefers to take a stand against threats.\n\n===Traffic===\nLocal drivers have a well-deserved reputation for being reckless. It is possible to obtain a driving license in Taiwan without ever having driven on the roads. Despite traffic's chaotic appearance, it is viscerally intuitive to yield the right-of-way to a much larger vehicle barreling towards you. It is advisable to use slow and smooth movements over quick or sudden ones. Local drivers often cut in front of moving traffic into spaces that seem too small, or try to change lanes regardless of the fact that lane is already full, etc.  Be aware that sometimes drivers make two-lane roads become three-lane ones. Drivers routinely enter a junction when their exit is blocked, and are therefore frequently still there long after the lights change, blocking traffic traveling in other directions. Some scooter drivers also zip through tiny spaces. \n\nIf you happen to drive a car or a motorcycle, the obvious rule is that if someone turns in front of you, you should be the one to adapt.  To avoid collisions, drivers need to be extremely vigilant for other vehicles creating hazards and always be willing to adjust speed or direction to accommodate.  Do not expect drivers to yield way, or respect traffic lights in many areas.  Sounding the horn is the usual way a Taiwanese driver indicates that they do not intend to accommodate a driver trying to encroach on their lane, etc, and does not necessarily imply the anger or criticism, as it does in other countries.  One bright side of Taiwan's chaotic traffic is that drivers tend to have an exceptional awareness of the spatial extents of their vehicle, so that even though it continuously looks like somebody is about to drive straight into you, it's relatively rare that they actually do so.\n\nBe extra careful when crossing the road, even to the extent of looking both ways on a one-way street.  When crossing at a pedestrian-crossing at a T-junction or crossroads, be aware that when the little green man lights up and you start crossing, motorists will still try to turn right, with or without a green feeder light.  Even on roads where traffic is infrequent and the green light is in your favor, bike-riders are still strongly advised to check the opposite lane.\n\n==Stay healthy==\n\n===Dengue===\n\nSome years, there are Dengue epidemic bursts confined to one given city. Gaoxiong and Tainan were hit in 2014 and 2015 respectively. Locals can tell you if the place you are visiting is concerned or not. The most efficient prevention is appropriate clothing, wearing long sleeves and pants will greatly decrease the number of mosquito bites. Then only you can add repellent on the parts that are still exposed.\n\n===Eating and Drinking===\nWesterners should be cautious of relatively undercooked food.  Many Taiwanese restaurants offer plates of raw, sliced red meat and uncooked seafood that are brought to the table and either barbecued or simmered in a pot of stock.  As this constitutes a staple of the Taiwanese diet, any bacteria that may remain doesn't affect the locals, but it can wreak havoc with foreigners.  The best policy is to make sure you cook the food in a manner to which you are accustomed.\n\nDon't drink tap water without boiling it, though it's safe for brushing your teeth.\n\n===Healthcare===\nMedicines are available for minor ailments at drug stores.  You may also find common drugs requiring a prescription in the west (like asthma inhalers and birth control pills) cheaply available from drug stores without a prescription.\n\nTaiwan has both Taiwanese physicians and Western doctors, both of which are taken equally seriously. However, as a foreigner, the assumption would generally be to direct you to a Western doctor. The quality of the hospitals in Taiwan is excellent and on par, if not better, with those found in the West. Taiwan's health care program is considered as one of the best health care systems in the world. Legal residents with a National Health Card can avail themselves of the very convenient and efficient national health service, which covers treatment and medication using both Western and traditional Taiwanese medicine. However, this service is not available to short term visitors on tourist visas; nor does it cover major hospitalization expenses. Still, hospital visits and medicine in Taiwan tends to be far less expensive than in the west for minor ailments and problems (flu, broken bones, stitches, etc). Note that outside the major cities, it might be difficult to find a doctor who speaks English, so try to learn some basic Mandarin before heading off the beaten track.\n\n===Hiking===\nWatch out for mosquito bites when hiking in the mountains. Especially in the summer, the humid and hot weather makes mosquitos very active. Most mosquito bites only cause skin irritation and itching, but in some areas of Taiwan it's possible to contract Dengue Fever or Japanese Encephalitis (though they are both on the rare side in Taiwan). Mosquito/insect repellent spray can be found at convenience stores (such as 7-11 and Family Mart) and local pharmacies. If you are bitten by mosquitos, apply a small amount of ointment for irritation relief.\n\n==Respect==\n===Culture===\nTaiwan shares several cultural taboos with other East Asian nations. \n* Some Taiwanese are superstitious about anything connected with dying &ndash; unlucky things should never be mentioned. One thing to note is that the number 4 (four, pronounced 'si') sounds like the word for death in Mandarin. \n* Do not write people's names in red. This again has connotations of death. When writing someone's name in English or another language, this is not a problem, but avoid writing Chinese names in red.\n* Do not whistle or ring a bell at night. This is an \"invitation to ghosts\".\n* Do not point at cemeteries or graves. This means disrespect to the dead.\n* There are numerous taboos dictating that certain objects shouldn't be given to others, often because the word for that object sounds like another unfortunate word:\n** Umbrellas, which in Mandarin sound the same as the word for \"break up\". Friends should therefore never give friends umbrellas. Instead, friends will euphemistically \"rent\" each other umbrellas for a tiny amount ($1, for example). \n** Clocks. The phrase \"to give a clock\" (\"song zhong\"), in Mandarin, has the same sound as the word \"to perform last rites.\" If you do give someone a clock, the recipient may give you a coin in return to dispel the curse.\n** Shoes. Never ever offer shoes as a gift to old people, as it signifies sending them on their way to heaven. This is acceptable only if by mutual arrangement it is nominally sold, where the receiving party gives a small payment of about $10.\n** Knives or sharp objects, as they are made for or could be used to hurt the person.\n* The Taiwanese are certainly not puritanical and enjoy a drink, especially the locally brewed Taiwan Beer and Kaoliang. However, Taiwan does not have a culture of heavy drinking and is rare to see anyone drunk on the streets. While overindulging in alcohol is not a social taboo as such (and some people do so at weddings), it is considered a sign of lack of self-confidence and immaturity, and doing so certainly won't gain you any respect among Taiwanese friends.\n* You are expected to remove your shoes before entering a house. You will find some slippers to be worn by visitors next to the entrance door. It is likely to be the same ritual for bathrooms and balconies where you will be expected to remove your slippers to wear a pair of plastic sandals (though it is less shocking not to use the sandals by then).\n* As you will get along with Taiwanese people, you are very likely to receive small presents of any sorts. This will be drinks, food, little objects... These are a very convenient way to lubricate social relations for Taiwanese people, and are specially commons betweens friends in their 20s. You should reply to any such presents with something similar, but it does not need to be immediate, or specific to the person (i.e. keep it simple). As a teacher you are not expected to offer anything in return (i.e. in a classroom environment) as long as the relationship stays formal. However beware of the sometime overly generous parents who can go as far as offering presents running in the thousands of NT$ and who will then expect you to take special care of their child (understand that their expectations will be considered as fair in Taiwanese culture).\n* You are not expected to tip in hotels, restaurants and taxis, though bellhops may still expect NT$50 or so for carrying your luggage.\n* If you should need to use a temple's washroom, bow to any statues of deities you see on the way whether or not you believe in them. While most people will not mind you using the temple's washroom, they expect you to treat their place of worship with respect. If you plan to offer gifts (such as simple fruits) to the statues of deities in the temple, it is expected that you wash the fruits and your hands prior to offering. In addition, upon entering and leaving a temple, do take note and avoid stepping on the threshold (a single raised step, similar to that of a stair's, often found at the gateways) that divides the outside and the inside of the temple. Always try to step over it instead of on it.\n* As with many other Buddhist asian countries, symbols resembling backwards swastikas are commonly seen in homes and Buddhist temples. They are a Buddhist symbol and have no relationship to Nazism or anti-Semitism.\n\n===Gay and lesbian travellers===\nTaiwan is quite liberal when it comes to homosexuality compared to its neighbours. Taiwan does not have laws against homosexuality, and in May 2017, the Taiwanese court ruled that same-sex couples have a right to marry (although legislation will not yet come until sometime in the next two years). Violence against gays and lesbians rarely occurs. That being said, Taiwan still has some fairly strong male machismo streaks in its society and homosexuality is not quite as open and accepted as in the West or even some other Asian countries like Thailand, and openly displaying your sexuality in public might draw some stares and whispers, especially outside Taipei. But the trend seems to be to be more accepting of it as exampled by gay oriented bars/pubs as well as the many entertainers who are known to be gay as well as a transsexual with her own TV show.\n\nGays and lesbians may wish to attend the annual '''Taiwan Pride''' parade event (which started around 2003).  This event takes place sometime between September and November, and has become the biggest Pride Parade in Asia throughout the years.\n\n==Contact==\n\n===Getting Online===\n\nInternet cafes are plentiful, although you may have to wander around before finding one. Rather, Internet cafes in Taiwan should be called gaming cafes. These are often found on the first or second floor of a building, and equipped with very comfortable chairs and large screens. Although people do surf the Internet, most people primarily go there for a smooth experience of online gaming. Each hour of Internet access/game play is cheap, coming in at around $20. Some machines in the internet cafes are coin operated. For free internet access in big cities, try out the local libraries. \n\nThe government of Taiwan offers nationwide free WiFi service named iTaiwan [http://itaiwan.gov.tw/en/index.php], and the City of Taipei offers free WiFi service in many public locations and some of city buses called TPE-Free [http://www.tpe-free.taipei.gov.tw/tpe/index_en.aspx]. Registration is required but one account covers both services. If you have mobile phone from selected countries it can be done online; otherwise, bring your passport to the visitor information centre at the airport, MRT stations etc., and the friendly staff will do it for you. McDonald's and 7-Eleven provides free WiFi.\n\nIf you want an internet connection to your smart-phones, you can purchase a prepaid 3G data sim card from Chunghwa Telecom at a cost of NT$250 for 3 days, or NT$450 for 7 days. Just walk in to any official Chunghwa Telecom office counters to apply. They need your passport and identification documents of your country of origin. (Driving license or identification card)\n\n===Telephone===\nThe standard prefix for international calls from Taiwan is 002, though some other companies may use alternative prefixes at lower rates. Check with your telecom operator for more details. Calls to mainland China, Hong Kong or Macau require international dialling. For calls to Taiwan, the country code for Taiwan is 886.\n\n'''Mobile phone''' coverage is covered by HTC and generally excellent in Taiwan,  with the exception of some remote mountainous areas. Among the major providers are Chunghwa Telecom (中華電信), Taiwan Mobile (台灣大哥大), T Star (台灣之星) and Far EasTone (遠傳電訊). Taiwan has both GSM 900/1800 and 3G (UMTS/W-CDMA) and 4G (LTE) networks and roaming might be possible for users of such mobile phones, subject to agreements between operators.\n\n'''Most payphones''' work with telephone cards (電話卡）which are available at all convenience stores.\n\n\nNumbers Starting With 0800 are commercial toll-free numbers, just like the 1-800 numbers in North America(mobile phone cannot use 0800 toll-free number, need to use landline phone to call toll-free numbers).\n\n'''Getting SIM Cards:''' There's one booth in the Taipei airport (to the right as you exit) that sells SIM cards for all the major telecom companies in Taiwan. \nStaff will register a prepaid card for you (requires your passport) and set up the phone. While they do seem to know their setup menues, it still might help to set the language to English for some not-so-popular models.\nThe card will be valid for 30 days. Make sure your plan includes unlimited data access, so you have navigation and map services available at any time.\n\nAs of June 2013 the following plans were available:\n  '''Chunghwa Telecom:''' NT$300 for 3 days unlimited data and NT100 airtime.\nNT$300 for 5 days unlimited data and NT50 airtime.\nNT$500 for 5 days unlimited data and NT300 airtime.\nNT$500 for 7 days unlimited data and NT150 airtime.\nNT$500 for 10 days unlimited data and NT100 airtime.\nNT$1,000 for 30 days unlimited data and NT450 airtime.\n  '''Far EasTone:''' NT$300 for 5 days unlimited data.\nNT$300 for 3 days unlimited data and NT100 airtime.\n  '''Taiwan Mobile:''' NT$500 for 5 days unlimited data and NT250 airtime.\nNT$800 for 10 days unlimited data and NT550 airtime.\nNT$345 for NT3450 airtime.\n\n===Media===\n\nTaiwan has a very free and liberal press. There are three daily newspapers available in English:\n\n*Focus Taiwan  [http://www.focustaiwan.tw]\n*Taiwan News [http://www.etaiwannews.com/]\n*Taiwan Today [https://www.taiwantoday.tw/]\n*Taipei Times [http://www.taipeitimes.com/News/],\n\nOther news sources:\n\n*Central News Agency [http://www.cna.com.tw/cnaeng/]\n*Government Information Office's periodicals [http://publish.gio.gov.tw/]\n*RTI (Radio Taiwan International) [http://english.rti.org.tw/]\n*the Taiwan Economic News [http://news.cens.com/]\n*Taiwan Headlines [http://english.www.gov.tw/TaiwanHeadlines/index.jsp]\n*Taiwan Journal [http://taiwanjournal.nat.gov.tw/]\n*TaipeiNews.net [http://www.taipeinews.net/]\n*Taiwan Sun [http://www.taiwansun.com/]\n\nFree magazines:\n*'''Highway 11 Magazine''' [http://www.highway11.net] - A free east coast travel & lifestyle magazine in [[Hualien County]] - bilingual\n*'''Xpat''' [http://www.xpatmag.com] - a magazine dedicated to promoting Arts and Culture in Taiwan - English.\n*'''Lifestyle''' - info on Taiwan relating to what's on and current trends - bilingual. \n*'''Taiphoon''' [http://taiphoon.pristine.net/main-page.htm] - a magazine dedicated to promoting peace and environmental awareness in Taiwan - bilingual.\n*'''Journey East''' [http://www.journeyeast.url.tw/] - a travel & lifestyle magazine for northern Taiwan - bilingual.\n\n\n{{isPartOf|East_Asia}}\n{{outline}}\n{{countryguide}}\n\n\n\n\n\n[[WikiPedia:Taiwan]]\n[[Dmoz:Asia/Taiwan/]]\n[[World66:asia/northeastasia/taiwan]]\n\n[[de:Taiwan]]\n[[eo:Tajvano]]\n[[es:Taiwán]]\n[[fi:Taiwan]]\n[[fr:Taïwan]]\n[[hi:ताइवान]]\n[[it:Taiwan]]\n[[ja:台湾]]\n[[nl:Taiwan]]\n[[pl:Tajwan]]\n[[pt:Taiwan]]\n[[ru:Тайвань]]\n[[sv:Taiwan]]\n[[wts:Category:Taiwan]]\n[[zh:台灣]]"
        }
    }
}