{
    "parse": {
        "title": "Tanzania",
        "pageid": 849,
        "wikitext": {
            "*": "{{pagebanner|Tanzania Banner.jpg}}{{quickbar\n| image=Kilimanjaro 2006-08-13.jpg\n| location=Tanzania in its region.svg\n| flag=Flag of Tanzania.svg\n| capital=[[Dodoma]] (moved from [[Dar es Salaam]] in 1973)\n| government=Republic\n| currency=Tanzanian shilling (TZS)\n| area=945,087 km<sup>2</sup>\n| population=37,187,939 (July 2002 est.)\n| language=Kiswahili or [[Swahili]] (official); English (official); [[Arabic]] (official in [[Zanzibar]]); many local languages.\n| religion=Mainland - Christian 30%, Muslim 35%, indigenous beliefs 35%; Zanzibar - 99% Muslim\n| timezone=UTC +3\n| callingcode=+255 (007 from [[Kenya]] and [[Uganda]])\n| tld=.tz\n| electricity=230V/50Hz (Indian or UK plug)\n}}\n'''Tanzania''' [http://www.tanzaniatouristboard.com] is the largest country in [[East Africa]], bordered by [[Kenya]] and [[Uganda]] to the north; [[Rwanda]], [[Burundi]], and the [[Democratic Republic of the Congo]] to the west, and [[Zambia]], [[Malawi]], and [[Mozambique]] to the south.\n\n==Understand==\n===History===\nThis is one of the oldest known continuously inhabited areas on Earth; fossil remains of humans and pre-human hominids have been found dating back over two million years. Tanzania is believed to have been populated by hunter-gatherer communities, probably Cushitic and Khoisan speaking people. About 2000 years ago, it is believed that Bantu-speaking people began to arrive from western Africa in a series of migrations. Later, Nilotic pastoralists arrived, and continued to immigrate into the area through to the 18th century.\n\nTravelers and merchants from the Persian Gulf and Western India have visited the East African coast since early in the first millennium CE. Islam was practised on the Swahili coast as early as the eighth or ninth century CE.\n\nIn the late 19th century, Imperial Germany conquered the regions that are now Tanzania (minus Zanzibar), Rwanda, and Burundi, and incorporated them into German East Africa. The post-World War I accords and the League of Nations charter designated the area a British Mandate, except for a small area in the northwest, which was ceded to Belgium and later became Rwanda and Burundi. British rule came to an end in 1961 after a relatively peaceful transition to independence. In 1954, Julius Nyerere transformed an organization into the politically oriented Tanganyika African National Union (TANU). Nyerere became Minister of British-administered Tanganyika in 1960 and continued as Prime Minister when Tanganyika became officially independent in 1961. After the Zanzibar Revolution overthrew the Arab dynasty in neighboring Zanzibar, which had become independent in 1963, the island merged with mainland Tanganyika to form the nation of Tanzania on 26 April 1964. \n\nFrom the late 1970s, Tanzania's economy took a turn for the worse. Tanzania aligned with China, seeking Chinese aid. The Chinese were quick to comply, but with the condition that all projects be completed by imported Chinese labor. From the mid 1980s, the regime financed itself by borrowing from the International Monetary Fund and underwent some reforms. From the mid 1980s Tanzania's GDP per capita has grown and poverty has been reduced.\n\n===Geography===\n\nA large central plateau makes up most of the mainland, at between 900 m and 1800 m. The mountain ranges of the Eastern Arc and the Southern and Northern Highlands cut across the country to form part of the Great Rift Valley.\n\nA land of geographical extremes, Tanzania houses the highest peak (Mount Kilimanjaro), the lowest point (the lake bed of Lake Tanganyika), and a portion of the largest lake (Lake Victoria, shared with [[Uganda]] and [[Kenya]]) on the African continent.\n\n===Climate===\nTanzania's weather varies from humid and hot in low lying areas, such as Dar es Salaam, to hot during the day and cool at night in Arusha. There are no discernible seasons, such as winter and summer -- only the dry and wet seasons. Tanzania has two rainy seasons: The short rains from late-October to late-December, a.k.a. the Mango Rains, and the long rains from March to May.\n\n{{Climate\n| units=metric |janlow=25|feblow=25|marlow=23|aprlow=21|maylow=21|junlow=20|jullow=18|auglow=18|seplow=21|octlow=24|novlow=25|declow=25|\njanhigh=35|febhigh=35|marhigh=34|aprhigh=30|mayhigh=30|junhigh=28|julhigh=27|aughigh=27|sephigh=28|octhigh=30|novhigh=34|dechigh=35\n}}\n\nMany popular resorts and tourist attractions on Zanzibar and [[Mafia Island Marine Park]] close during the long rains season, and many trails in the national parks are impassable during this period. For that reason, in most cases tours are restricted to the main roads in the parks. Travelers should plan their trip accordingly.\n\nDuring the dry season, temperatures can easily soar to above 35°C in Dar. You should seek shelter from the sun during the midday heat and use copious amounts of sunblock, SPF 30+.\n\nBest times to visit are:\n*'''June to August:''' This is the tail-end of the long rainy season and the weather is at its best at this time of year -- bearable during the day and cool in the evening. However, this is not necessarily the best time of year for safaris, as water is plentiful in the parks and animals are not forced to congregate in a few locations to rehydrate, as they do in the middle of the dry season right after Christmas.\n*'''January to February:''' This is the best time to visit the Serengeti. It is usually at this time that huge herds of wildebeest, zebra and buffalo migrate to better grazing areas. You could observe some of the 1.5 million wildebeest that inhabit the Serengeti undertake their epic journey. Be advised this is most likely the hottest time of year in Tanzania, when even the locals complain about the heat. You've been warned!\n\n==Regions==\n\n{{Regionlist\n| regionmap=Tanzania regions map.png\n| regionmaptext=Tanzania regions\n| regionmapsize=400px\n\n| region1name=[[Central Tanzania]]\n| region1color=#89b47f\n| region1items=\n| region1description=a plateau with grasslands and the capital Dodoma\n\n| region2name=[[Northeast Tanzania]]\n| region2color=#838acf\n| region2items=\n| region2description=the mountainous location of Kilimanjaro\n\n| region3name=[[Northwest Tanzania]]\n| region3color=#cc6464\n| region3items=\n| region3description=Africa's \"great lakes\" and the Serengeti\n\n| region4name=[[Pembwe and the Southeast]]\n| region4color=#c174a8\n| region4items=\n| region4description=the hot, humid shoreline\n\n| region5name=[[Southern Highlands (Tanzania)|Southern Highlands]]\n| region5color=#cd9f70\n| region5items=\n| region5description=Ruaha National Park, volcanic mountains, crater lakes, natural attractions, waterfalls, beautiful Matema Beach\n\n| region6name=[[Zanzibar]]\n| region6color=#0d006c\n| region6items=\n| region6description=a coastal island in the Indian Ocean\n}}\n\n==Cities==\n<!--Please discuss proposed changes to the list below on the talk page before changing it. This list may not exceed more than NINE cities.-->\n\n*[[Dar es Salaam]]\n\n*[[Arusha]]\n*[[Dodoma]]\n*[[Kigoma]]\n*[[Mbeya]]\n*[[Moshi]]\n*[[Morogoro]]\n*[[Mwanza]]\n*[[Mtwara]]\n\n==Other destinations==\n \n* [[Arusha National Park]] - Home to the 5th highest peak in Africa, Mt. Meru (4,500m). You can climb it independently.\n* [[Mahale]] Mountains National Park - See Chimpanzees up close and experience the clear water of Lake Tanganyika. \n* [[Mikumi National Park]]\n* [[Mount Kilimanjaro]] - Africa's highest peak and the world's highest freestanding mountain. You can climb it with the help of a guide.\n* [[Ngorongoro Conservation Area]] - includes the Ngorongoro Crater and the Olduvai Gorge\n* [[Ruaha National Park]]\n* [[Serengeti National Park]]\n* [[Stone Town]]\n* [[Udzungwa Mountains National Park]]\n\nSee also [[African National Parks]]\n\n==Get in==\n\n===Visa===\n\nNo visa is required for stays of less than 3 months for citizens of [[Namibia]], [[Romania]], [[Rwanda]], [[Hong Kong]], [[Malaysia]], [[Macau]] and all commonwealth member states ('''except''' the [[United Kingdom]], [[Australia]], [[Canada]], [[Bangladesh]], [[New Zealand]], [[Nigeria]], [[India]] & [[South Africa]]). A Tourist Visa costs US$50 or US$100 for a three-month single entry and a three-month double entry visa, respectively. The visa can be obtained upon landing in Dar es Salaam, Kilimanjaro, Mwanza and ports of entry. Be advised that the wait can be especially long if your flight arrives at the same time with other international flights. Obtaining a visa before arrival is recommended. Holders of a [[US]] passport can only obtain a US$100 multiple-entry visa. The website of Tanzania Embassy in the U.S. gives the current requirements, [http://www.tanzaniaembassy-us.org/].\n\n===By plane=== \nThere are two major airports; one in Dar es Salaam, '''Julius Nyerere International Airport''' ({{IATA|DAR}}) (formerly known as Mwalimu Julius K. Nyerere International Airport and Dar es Salaam International Airport), and one in Kilimanjaro, '''Kilimanjaro International Airport''' ({{IATA|JRO}}) [http://www.kilimanjaroairport.co.tz], which is halfway between Arusha and [[Moshi]].\n\nTanzania is served '''Internationally''' from\n\n[[Europe]] by\n*KLM Royal Dutch Airlines [http://www.klm.com] ([[Amsterdam]]), +255 22 213 9790 (Dar) & +255 27 223 8355 (Arusha). Daily flights with stopover in Kilimanjaro.\n*British Airways [http://www.ba.com] ([[London]]-Heathrow), +255 22 211 3820. Flights on Tuesday, Friday and Sunday.\n*Swiss International Air Lines [http://www.swiss.com] ([[Zurich]]), +255 22 211 8870. 5 flights a week (Monday, Wednesday, Thursday, Friday and Saturday) with a stopover in [[Nairobi]], [[Kenya]].\n*Turkish Airlines [http://www.turkishairlines.com/en-tr/] from İstanbul to Dar Es Salaam directly, from İstanbul to Kilimanjaro directly.\n\n[[Middle East]] and [[Asia]] by\n*Emirates [http://www.emirates.com] ([[Dubai]]), +255 22 211 6100. Daily flights.\n*Qatar Airways [http://www.qatarairways.com] ([[Doha]]), +255 22 284 2675, 1019, Julius Nyerere International Airport, Dar es Salaam, Tanzania. Daily flights.\n*Oman Air [http://www.omanair.com] ([[Muscat]]), +255 22 2119426 Daily Flights from Muscat to Dar Es Salaam (DAR) and Zanzibar (ZNZ)\n*Air India [http://www.airindia.com] ([[Mumbai]]), +255 22 215 2642. Flights on Monday, Wednesday and Friday.\n\n[[Africa]] by\n*South African Airways [http://www.flysaa.com] ([[Johannesburg]]), +255 22 211 7044. Twice daily flights.\n*Ethiopian Airlines [http://www.flyethiopian.com] ([[Addis Ababa]]), +255 22 211 7063. Daily flights (except for Monday) with a stopover in Kilimanjaro.\n*Kenya Airways (Nairobi) [http://www.kenya-airways.com], +255 22 211 9376 (Dar) & +255 24 223 8355 (Zanzibar). Three daily flights with some stopping in Kilimanjaro.\n*Egypt Air [http://www.egyptair.com] ([[Cairo]]), +255 2 136665. Daily flights.\n* Carriers originating from [[Malawi]], [[Mozambique]] and [[Zimbabwe]] also maintain regular flights to Dar es Salaam.\n\nAnd '''Domestically''' by\n*Air Tanzania [http://www.airtanzania.com], +255 22 211 8411, [mailto:bookings@airtanzania.com bookings@airtanzania.com].\n*[http://www.air-viva.com air viva], offering domestic flights and flights to Kenya. [mailto:helpdesk@airviva.com helpdesk@airviva.com].\n*Precision Air [http://www.precisionairtz.com], +255 22 212 1718, Along Nyerere/Pugu Road, P.O Box 70770, Dar es Salaam, Tanzania, [mailto:info@precisionairtz.com info@precisionairtz.com] or [mailto:pwreservations@precisionairtz.com pwreservations@precisionairtz.com] also flights to/from Kenya. \n*Coastal Aviation [http://www.coastal.cc], +255 22 211 7959, P. O. Box 3052, 107 Upanga Road, Dar es Salaam, Tanzania, [mailto:safari@coastal.cc safari@coastal.cc].\n*Auric Air [http://www.auricair.com], +255 783 233 334, P. O. Box 336, T-14 First Floor, Haidary Plaza, Upanga/Kisutu street, Dar es Salaam, Tanzania, [mailto:auric@auricair.com auric@auricair.com]. provides daily service to all major cities, including [[Zanzibar]] [[Serengeti]] [[Arusha]] and most national parks.\n*ZanAir [http://www.zanair.com], +255 24 223 3670, P.O.Box 2113, Zanzibar, Tanzania, [mailto:reservations@zanair.com reservations@zanair.com]. \n* Regional Air [http://www.regionaltanzania.com/] \n\nDomestic flights are often late but generally reliable.\n\n===By train===\nThe Tanzania - Zambia train service, known as '''TAZARA''' [http://www.tazarasite.com/], operates trains twice a week between [[New Kapiri Mposhi]], Zambia, and Dar es Salaam, leaving from Dar es Salaam on Tuesdays and Fridays.\n\nA domestic railroad network links the country's major cities, including [[Kigoma]], [[Mwanza]], Dodoma, [[Tabora]], and Dar es Salaam. The domestic train service is usually reliable, and ticket prices are affordable. Ticket prices differ, however, according to 'class', typically first, second, and third. First and second classes offer cabins with two and four beds, respectively. Third class is open seating. Hot meals and beverages are usually available from the dining car. It is not uncommon for the train kitchen to purchase fresh produce at many of the stopping points along the way. It is also possible to purchase fruit and snacks directly from local vendors who frequent the many train stations on each of Tanzania's many train routes.\n\n===By car===\n'''''Warning:'''  You must be careful about driving in Tanzania, or throughout most of Africa, unless you have already experienced the driving conditions in developing countries.\n\n'''Drive on the left side of the road'''\n\n*Tanzanians drive on the left (like in the UK, India, Australia, Japan, and other countries), as opposed to driving on the right, like in North America and most European countries. Experienced drivers from \"right-hand drive\" countries will need about half a day of driving around before adjusting to the change. Although the gear shift, windshield wipers and turn signal activators are reversed, luckily, the pedals are not. Just follow the traffic. However, even with some practice, you should always be vigilant, as you could easily find yourself disoriented, which could put you at risk of a head-on collision or hitting a pedestrian, if you are used to driving on the opposite side of the road.\n\n'''Choice of vehicle'''\n\n*If you're hiring a car when you get here, your best option is a 4x4 sport utility vehicle with good road clearance, especially if you plan on going on safari in any of the national parks. Look for the Land Cruiser, Hilux Surf (4Runner), and Range Rover vehicles. Avoid mini-SUVs, such as the Toyota RAV4 and Honda CRV, because they can't always negotiate the poor road conditions in most of Tanzania's national parks. Another issue is 4-wheel drive options. Low-slung cars are not a good choice despite having 4-wheel drive. These vehicles were designed for driving in the snow on paved roads or through small mud holes. What you encounter in national parks in Tanzania is quite different and demands a proper 4-wheel drive vehicle capable of traversing large mud holes and sandy roads. Even then, you may still get stuck.\n\n'''Tanzania Car hire Agency and Tour Operators.\n'''\nYou can rent 4 x 4 car in Arusha for Airport transfers, research, safari and outdoor travel. Most game drives roads in National parks are paved. Off road driving is allowed for special photographic permits. There are Open 4 x 4 car game drives and there are slide open roof safari cars. Tour Operators in Arusha provide cheap car rent to which suits your budget.\n\nIf you want to hire a car for wildlife safaris in Tanzania, it is advised to get 4 x 4 car with professional safari guide. Some safari guides speak more than one language like English and German, English and French, Spanish and Italian. Benefits of going safari with a guide is knowledge of environment because they are used to, knowledge of species of wildlife, taking care of car because you are on holiday, you need not to hustle replacing flat tire.\n\n'''Navigation'''\n\n*'''Nelles Maps of ''Tanzania, Rwanda & Burundi''''' [http://www.nelles-verlag.de] is the best map. They've taken the time to locate the smallest of villages along the routes, which is great for navigating places where landmarks are scarce.\n\n*There are markers and white concrete pillions along the main roads. They identify the next major city or town along the route and how many kilometers remain.\n\n'''Driving in the city'''\n\n*This only applies to Dar es Salaam, since all other cities and towns are relatively small and easy to get around in. The city center is extremely congested from 9AM-6PM, Monday to Friday. There are few traffic lights, and the streets are very narrow. It's a dog-eat-dog kind of place, so offensive driving skills are a must, as no one will let you pass if you just sit and wait at stops signs. Streets are crowded with parked and moving cars, SUVs, lorries, scooters, and very muscular men pulling insanely overloaded carts. People can spend hours stuck in traffic jams, especially around Kariakoo Market.\n\n*There are a few roundabouts in downtown, which the locals call \"keeplefties\" because they thought that the sign advising drivers to \"Keep Left\" when entering the roundabouts named this fascinating Mzungu invention. '''Mzungu''' is the Swahili word for \"white\" foreigners. It is not derogatory, and it's more along the lines of calling a white person a Caucasian.\n\n*When parking on the street in Dar, find a spot to park, then lock your doors and leave. When you return, a parking attendant wearing a yellow fluorescent vest will approach you for payment. The fee is 300 Tsh for two hours. The attendant should either hand you a ticket, or the ticked will already be on your windshield. '''DO NOT''' leave without paying if there is a ticket on your windshield. The attendant will most likely be forced to make up for the missing money, as he probably earns, at best, a mere 3000 Tsh a day.\n\n*Carjacking is uncommon but opening doors or jumping through open windows to steal valuables is not. Keep your windows closed and the doors locked. When vehicles are stopped at traffic lights or parked on unattended locations, thieves have been known to steal mirrors, paneling, spare tires, and anything that is not either engraved with the license plate number or bolted into the vehicle's body. Choose your parking spots carefully and don't leave valuables in plain sight. You can either offer the parking attendant a small tip to watch your vehicle, 500 to 1000 Tsh, or find a secured parking lot, especially if you are leaving your vehicle overnight.\n\n'''Routes'''\n\n*The two main roads are the \"'''Dar es Salaam to Mbeya'''\" road (A7/A17), which takes you to the [[Southern Highlands (Tanzania)|Southern Highlands]] through the towns of [[Morogoro]], [[Iringa]], and [[Mikumi National Park]], and near the Selous and Ruhaha National Parks. The other road is the \"'''Dar to Arusha and the Serengeti'''\" road (B1), which takes you to the [[Northern Circuit]] by the towns of [[Tanga]] and [[Moshi]], and [[Mount Kilimanjaro]], Saadani, Tanrangire, Ngorongoro and Serengeti National Parks.\n\n'''Dangers and annoyances'''\n\n*Tanzanians drive very fast and won't hesitate to overtake in a blind curve. Also, most commercial vehicles are poorly maintained and overloaded, and you'll see many of them broken-down along the main highways. '''NEVER''' assume their brakes are working or that the drivers have fully thought through the dangerous maneuver they are undertaking.\n\n*Most roads in Tanzania are poorly maintained and littered with potholes and dangerous grooves formed by overloaded transport vehicles. All main roads cut through towns and villages, and often traffic calming tools (a.k.a. speed or road humps) ensure vehicles reduce their speed when passing through. Unfortunately, few are clearly marked while most are hard to see until you are right upon them, and if you are coming too fast, you could be thrown off the road. '''SLOW DOWN''' when entering any town, or you might not be able to avoid these and other hazards. This defensive driving attitude is also prudent because animals and children often bolt out into the street.\n\n*If you are involved in an accident with a pedestrian, drive to the nearest police station to advise them. DO NOT exit your vehicle and attempt to resolve the situation, even if you are sure it was not your fault. Tanzanians are some of the nicest people you will ever meet in Africa, but they have been known to take matters into their own hands. This is largely due to their mistrust of the police and the belief that anyone with money, e.g. rich foreigners, can buy their way out of a problem.\n\n*If you encounter a convoy of government vehicles, move out of the way. They have priority, although this is debatable, and will not hesitate to run you off the road if you don't give way. You could also be fined by the police for your failure to give way.\n\n'''FYI:''' In Tanzania, you can determine vehicle registration by the license plate colours. '''Yellow''' plates, starting with '''\"T\"''' and followed by three numbers, are privately owned vehicles. Official Tanzanian government plates are also yellow, but they display only letters and usually start with '''\"S\"''' (the fewer the letters, the higher up in the food chain the owner is). '''Green''' plates are diplomatic; '''Red''' are international development agencies; '''Blue''' are UN and similar organizations; '''White''' are taxis, buses and commercial (safari) vehicles, and '''Black''' are the military and the police. This coding does not apply in Zanzibar and Pemba.\n\n'''Passing Etiquette'''\n\n*Drivers following you will activate their '''right''' turn signal light to indicate they wish to pass you. If the road is clear, activate your '''left''' turn signal; if not, activate your '''right''' turn signal. Look for this when attempting to pass.\n\n'''What to bring'''\n\n* A large jerry can (20 liters) with emergency fuel. (FYI - Don’t enter a national park without a full tank of gas.)\n* A shovel, a machete (\"panga\" in Swahili), and tow rope\n* Good road maps\n* First-aid kit\n* Drinking water, at least 5 liters, and non-perishable emergency food supplies.\n\n===By bus===\nThe bus is a great way to get into Tanzania. Fly to a place like Nairobi, then you can catch a bus down to Arusha, a great base for [[Mount Meru]] and Ngorongoro Crater. Also, you should not forget the south central part of Tanzania, away from tourist hawkers.  Roads in Tanzania aren't in good condition; there are no highways, and there are very few multiple lane segments along main roads. Buses slow down or stop in most villages because of traffic, police, and speed calming tools. For your reference, the trip from Dar to Iringa takes at least 6 hours in a private vehicle. It's mostly a two-lane road, recently rebuilt by the Chinese, so it's in good condition for the most part.\n\nWestbound and northbound buses leaving from Dar ply the same road (A7) until you get to Chalinze, which is about halfway, less than two hours, between Dar and Morogoro.\n\nIf you are going to Arusha, the bus will veer north on the A17. Other notable destinations along this route are Saandani National Park, Pangani, Tanga, Lushoto, Kilimanjaro, and Moshi. From Arusha, you can also take a bus to Mwanza and Kigoma, but once you've past the Ngorongoro Conservation Area, the roads are in extremely poor condition, and you are in for a bumpy ride.\n\nIf you continue on past Chalinze you'll pass by Morogoro (also the turn off for Dodoma), the entry point into the Selous Game Reserve, Mikumi National Park, the old main gate to Udzungwa Mountains Parks, and Iringa, which is the turn off for Ruaha National Park.\n\nIringa is the place to explore the southern circuit, with a new campsite at the Msosa gate to the Uduzungwas (the Iringa side of the park) and the gateway to Ruaha (possibly Tanzania's best park). It is a great place to stay for a few days.\n\nAfter Iringa, you'll either go west, to Mbeya, or south, to Songea. Head to Mbeya if you want to either visit Lake Tanganyika, enter into Malawi, or head north to Kigoma. North of Mbeya, the roads aren't sealed, so it will be a long and very unpleasant trip. If you want to see Lake Nyasa (a.k.a. Lake Malawi), take the bus to Songea. Although you are within a stone's throw of Mozambique, there are no official entry points into Mozambique.\n\nFinally, if you're headed south of Dar, then you'll take the B2. This is the main route to the Selous and the Rufiji River. Along the way, you can also stop in Kilwa, Lindi, and, finally, Mtwara. The road isn't sealed the whole way, so, again, bring on a cushion.\n\nOutside Dar, roads between other cities and villages are in very poor condition, although they are slowly being improved. For instance, traveling from Arusha to Dodoma is slow. It can be faster to return to Chalinze and then board a bus to Dodoma. This is pretty much the case for any travel between cities that are not located along the road to Dar.\n\nThe border town of Namanga is a hectic outpost that epitomizes much of Africa. The bus even waits here for you to cross the border. You can even get off on the Kenyan side, walk across the border, and get on the bus again on the Tanzanian side.\n\nFrom Dar by bus it is also possible to travel to Malawi, Uganda, and Rwanda.\n\nUseful information on the Dar Es Salaam bus stand (\"Ubungo\") and some specific bus lines can be found in the [[Dar_es_Salaam]] article.\n\n====Bus Lines====\n\nSee specific cities for more information about the bus lines that serve them.\n\n* '''Tahmeed Buses''' connect [[Mombasa]] with [[Tanga]] and Dar in Tanzania.\n\n* '''Royal Coach''' travels to Arusha, and is one of the nicest buses available.\n\n* '''Dar Express''' services many cities, including [[Nairobi]], Kenya.\n\n* '''Sumry''' connect the beautiful southern part of Tanzania, [[Iringa]] and Mbeya to Dar and further S.W.\n\n===By boat===\nAzam Marine and Fast Ferries connect Dar es salaam and Zanzibar. And it's about 90 minutes sail.\n\n==Get around==\n\nThe bus is the most common way to travel around in Tanzania. Most buses have a simple design, and the roads are poor, although 1st class air-con buses are available on the Dar-Moshi-Arusha route (Dar Express - ticket office on Libya Street downtown or office no. 45 at Ubungo). Nearly all buses go in and out of Dar es Salaam. The main bus station in Dar (where all buses go), Ubungo, is 8 km west of the city center. A number of the better \"intercity buses\" provide you with complimentary drinks and biscuits. \nIn Dar, minibuses called Dala-Dalas can be taken cheaply to most places within the city. The fare is written on the front next to the door - currently it's usually TSH 250 for adults (2011) except for longer distances. The route of the bus is also stenciled on the front and sides of the bus, e.g. 'Posta-Mwenge' and there's a colour coding system. Posta (outside the central post office on Azikiwe/Maktaba Street) is the main downtown daladala hub. Others are Kariakoo, Mwenge, Buguruni, Ubungo etc. Hop on the daladala, take a seat if there is one, and pay the conductor ('konda') when he shakes his pile of coins at you in a meaningful way. The konda shouts the names of the stops - if you don't know where you are, or don't know the name of your destination stop, it'll be hard to know where to get off. If possible, it's worth asking someone at your destination, since the stops sometimes have no signs at all - people 'just know' that certain street corners are the daladala stop and the names are not obvious (e.g. 'Sudani' on the Masaki-Posta line - near the Sudanese ambassador's residence on Toure Drive). When you hear/see your stop and want to get off, shout 'Shusha!' (let me off), the konda will knock on the chassis twice, and the driver will immediately swerve to the side and stop. The daladalas don't run very late; on the east side of town the latest ones are the Msasani and Mwenge routes. \n\nThere are also three-wheeled tuktuks/baby taxis/CNGs/bajajis that zoom around. They are cheaper than a taxi, and can get past traffic jams. Probably not the safest option but I haven't heard of any bajaji-related problems. You can negotiate the fare in advance, but sometimes the driver doesn't know your destination 8there's no Dar es Salaam 'knowledge') and won't know how much to charge. The drivers I've taken have generally quoted pretty fair prices (maybe with a reasonable 'skin tax' for white people) at the destination and if they're trying to rip you off you can usually tell by the leer. It may be handy to know 'right' and 'left' in Swahili: kulia (right), kushoto (left), moja kwa moja (straight), simama (stop), asante kaka (thanks brother). \n\nPrivate '''taxis''' are also a convenient choice, but be sure to negotiate the price before you use them.  Fellow travelers might be able to offer advice about a reasonable fare.  Some places (e.g. Dar Es Salaam Airport) have a strong taxi cartel and post fixed prices.\n\nIf you can afford it, flying around Tanzania is faster and safer. See [[Tanzania#By_plane]] section above. Even the busiest roads are in poor condition, and bus drivers are not known for their patience or great driving skills. Road accidents claim more lives in Tanzania than any other cause of death.\n\nThere are several local Tour Operators which have fleet of cars for hire in major airports like Dar es Salaam Julius Nyerere Airport, Kilimanjaro International Airport, major cities and all towns which are peripheral to tourist destinations like Moshi, Mwanza, Arusha, and Karatu around Ngorongoro.\n\n==Do==\n\n* '''Safari''' While you are in Tanzania you may organize your safari to [[Serengeti National Park|Serengeti]] and other National parks at an affordable price. If there's one trip that will change your perspective on life, it's an African safari. Contact some of the tour operators for Safari Details.\n\n* '''Cultural Tours''' Touring Tanzania for culture is interestingly great as it encompasses more than 150+ ethnic groups. There is plenty of traditional food, cultural practices (such as hunting with bushmen, beekeeping, traditional medicine) that one enjoys within the boundaries. You will also get to visit a number of locations that normally people would be completely unaware of. If you happen to be a person who loves to explore the world and meet new people in order to gain knowledge about different customs, a cultural tour is definitely the best type of vacation for you.The services are not expensive and can turn out to be cheaper than expected provided you get the right information on where to stay, best tour companies and just knowledge of what you want. This way, it will save you time and costs as well. \n\n* There are loads of '''National Parks''' for those wanting to watch Tanzania's wildlife. You can gain entry for around $100 US and benefit from a tour (and perhaps a night's accommodation). The better parks, though packed with tourists, are found in the north of the country. Ruaha National Park is the best in the south (locals actually say this is the best park, especially if you want to see wild animals as opposed to semi-tame ones in the northern parks). Don't just be sucked into the tourist circuit in the north; the south offers great parks and towns (base yourself out of Iringa), and you will feel less of a tourist and more of a guest if you travel this way.\n\n* '''Scuba diving''' in and around Pemba and Zanzibar is another good experience.\n\n* You can also visit numerous historical '''Slave Trade sites''', which could make for an interesting, if a little depressing, excursion.\n\n* '''Beaches''': Did you know that Tanzania has some of the best, most unspoiled beaches in the world? They are stunning, with their white sand, palm trees, and cool Indian Ocean water!\n\n* Kayak the beautiful coastal waters with a tour operator.\n\n* Tanzania has two of the best '''Stone Age sites''' in the world: Isimila Gorge (near Iringa) and the earliest known examples of human art among the rock paintings, near Kolo, north of Dodoma -- some of which are reckoned to be around 30,000 years old.\n\n* '''Kilimanjaro''' is one of Tanzania's main attractions. Kilimanjaro is the highest mountain in Africa. Many visitors come to Tanzania to summit this great mountain. The main peak is estimated to be 5895m high making it a real challenge for mountaineers.\n\n==See==\n\nTanzania is a country with great national parks, where you can see some of the finest [[African flora and fauna]]. Tanzania is home to several national parks and game reserves. Safaris in Tanzania can be put into two categories, the Northern Circuit (Serengeti, Ngorongoro, Manyara and Tarangire) and the Southern Circuit (Selous, Mikumi and Ruaha). This is certainly an oversimplification and does not include other interesting but harder to reach parks such as Katavi and Gombe, just to name two. For tourist, the two first groupings are more acces\n\n'''Camping safaris Tanzania''': Camping safari is accommodation option preferred by colonialists during Medieval time because at that time Lodges and Hotels were not well developed. Adventure people traveled across the world to discover major Geographical features in Africa like Mount Kilimanjaro, Great Rift valley, Ngorongoro crater and more used tented camps. Camping safari uses tents as a shelter for outdoor travel and wilderness research. Nowadays camping safari is used as accommodation for wildlife safaris in Tanzania and Africa at Large. There are types of camping safaris such as luxury tented camps, mobile camping safaris and budget camping safaris. Budget camping safari is also known as basic tented camps and low cost safaris Tanzania. Budget camping safari is cheap wildlife safari trips and adventure tours in Africa. \n\nTo see places you need to Move, Car hire is a deal.\n\nCar hire in Tanzania will help you move from one place to another for sight seeing tours or wildlife tours. Several car hire agencies offer car rental for varies purposes. You can rent car for Town sight seeing or game park safaris.\n\n'''Price'''\nThe cost of a safari can range from the basics (fly-tents, self-catering and guides with vehicles) to smaller parks like Manyara and Tarangire, to luxury lodges and tented camps in the Serengeti which can cost anywhere from US$250 to US$1,500 per person per night. You can use your own vehicle, provided it's a 4x4 with adequate clearance. There is a benefit to hiring a guide and a vehicle as safari vehicles are equipped with open rooftops which provide a much better vantage point for animal viewing. Also, many park will require that you hire a certified guide before you enter the park, even if you're using your own vehicle. Guides can cost around US$35 a day plus tip. Guides are good to have since they know the park and can help you locate some of the more sought after animals such as lions, leopards, rhinos, cheetahs and hyenas.\n\n==Budget camping safaris==\nThis is basic camping safari where tourists visit national parks and game reserves and the accommodation is on budget tented camps. Budget camping safari differ from one Tour Operator to another. For [http://www.kilitraveladventurestz.com Kilimanjaro Travel Adventure Safaris Co.Ltd] budget camping safaris is organized in different way as explained below.\n\nTourists travel in 4WD Landcruisers or Landrover safari car together with cook and driver guide. Camping equipments, cooking materials, water and food will be in same car. On Arrival at Camp ground means cook, TENT CREW and driver guide will start erecting tented for tourists. Camp grounds in National parks are usually at Public campsites. Public campsites have kitchen, bathroom and toilet. Public campsites are usually for shared for all travelers there especially budget camping safari. \n\nThe cook and camp crew will prepare food and warm water for bathing. Tourists will sleep on mattress on ground, mattresses, bedsheets and blankets will be provided. Tourists are advised to bring sleeping bags. Budget camping safaris is comfort, enjoyable and bring tourists close to nature experiencing real wildlife safari in the wilderness of African bush.\n\n\nPark fees for Manyara and Tarangire for 2015 US$45 per person and US$10,- for vehicle/driver fees. For Ngorongoro there is a US$200 vehicle fee as well, a $50 per person park fee as well as a $10,- vehicle/driver fee. For the Serengeti it's US$60 per person with and a $10,- vehicle/driver fee. These fees are valid for 24 hours. If you arrive in the afternoon, you can return in the morning the next day and not pay again.\n\nSome of the more popular safari companies are Warrior Trails, Ranger tours & Leopard tours. Other popular companies rated by the Tanzania Association of Tour Operators include [http://www.congemasafaris.com Congema Tours&Safaris],[https://www.livingstonesafaritanzania.com Livingstone Safari Tanzania], [http://www.ajabu-adventures.com Ajabu Adventures], [http://www.bush2beach.com Bush2Beach Safaris], Bushmen Expeditions, Fay Safaris, [http://www.naturalhighsafaris.com/explore/tanzania Natural High Safaris] [https://www.earthlifeexpeditions.com Earthlife Expeditions] and [http://www.tanzania-expeditions.com Tanzania Expeditions]. While ['''Shrike safaris'''][http://shrikesafaris.org/home] specialize in tailor-made safari.  Serena and Sopa are popular lodging spots and have facilities throughout the Northern Circuit. However, don't discount using smaller tours and lesser known lodging facilities which are just as good if not better than the larger tours and lodges. One smaller but great company is Meru Wellness Retreat [http://www.meruwellnessretreat.com] who offers a more personalized tour as well as fair pay to their employees and eco lodging. Other companies include [http://ehsafaris.com EH Blessed Safaris]\n\nFor better prices and some of the most beautiful parks avoiding the traffic jams of safari vehicles, head for the southern circuit, particularly Ruaha National Park where fees are still only $20 per person and the range of wildlife is much greater and the scenery spectacular.  [[Iringa]] is a great place to base yourself to explore this area and sort out your safari trips.\n\n* Wildlife Viewing in Tanzania :\n\n: '''[[Serengeti]] National Park''', made famous by numerous Discovery Channel specials, hosts a wide range of wildlife, including lions, cheetahs, leopards, hippopotamuses, elephants, zebra, buffalo, water buck, crocodiles, gazelle, warthogs, and wildebeest. One major attraction is the wildebeest migration, which occurs continuously between the Serengeti and Masai Mara (Kenya). Park fees are $50/person/day as of July 2008, and a guide with a 4-wheel drive vehicle is required. If the migration is your main purpose for visiting the Serengeti, you should advise your tour company as this may require travel much further afield and could be more costly. \n\n:'''[[Ngorongoro]] Conservation Area''' also hosts an abundance of wildlife, particularly in the Ngorongoro crater. Formed by the same volcanic activity that generated Kilimanjaro and the Great Rift Valley, Ngorongoro consists of the highlands around the crater (rich in elephants) and the crater itself (similar animals to Serengeti, but at higher densities and with a small population of black rhino). Park fees are $50/day/person as of July 2007, plus $200 per vehicle for a six-hour game drive in the crater.\n\n: '''Ruaha National Park''' and '''Selous Game Reserve''' are far less popular but very enjoyable. You will find much greater variety of wildlife than you would in the Serengeti, if you're looking for a destination with fewer tourists these parks are for you. Ruaha is known for having the largest elephant and giraffe population of any park in Africa and often goes by the name 'Giraffic Park', it is also a good place to see large prides of lion and the elusive and rare hunting dogs. Additionally, Selous is the only other place besides Ngorongoro where you may see a rhino. You can also visit the Uduzungwa Mountains Park for a truly wilderness hike through unspoiled and spectacular scenery. There are few places left in the world like this one. With new gates opened up on the [[Iringa]] side of the park with great camping it is a great addition to any visit to Tanzania.\n\n: '''Tarangire National Park''' is in the northern circuit of Tanzania and was named after the Tarangire river flowing within the park. The park area is approximately 2,600 sq km. Similar to Serengeti, the park has a high concentrations of wildlife during the dry seasons. Also, over 570 bird species have been identified, and the place is surely a birdwatchers' paradise. Safari accommodation is available in quality safari lodges and campsites.\n\n''*When visiting wildlife parks be sure to stay as close to the viewing areas (center of the parks) as possible and leave as soon as you can in the morning as animals are typically most active soon after sunrise. ''\n* Islands:\n\n: [[Zanzibar]] is an island off the coast of Tanzania; it includes both Zanzibar and Pemba. Zanzibar has beautiful beaches and a historical Stone Town. Zanzibar is great for scuba diving, snorkeling, and swimming with dolphins. Other attractions include spice tours and the Jozani Forest, which shelters a small population of red Colobus monkeys.\n\n: '''Mafia Island Marine Park''' is south of Zanzibar and boasts some fantastic scuba diving and snorkeling. You may also get to swim with whale sharks, as this is one of the few areas in the world where they congregate annually.\n\n: '''Bongoyo Island''' is easy to get to with a boat from slip way. It is has a remarkable beach with excellent snorkeling in clear water, although you may be better off taking your own snorkels as renting is costly. The island is not tide dependent therefore you can swim at any time. There is a residence price and a 'muzungu' price' but still quite reasonable.\n\n: ''' Sinda Island''' is a small uninhabited island of ínner sinder' and outer sinder'.\n\n: ''' Mbudya Island''' can be accessed from silver sands hotel. The water is amazing although it looks clear you cannot snorkel in it as it is surprisingly murky underneath the surface.\n\n: '''Lazy Lagoon''' There are just 12 rooms on the private 9km long white sandy island with deserted beaches. It boasts swimming at all tides in clear azure blue water, ideal for snorkelling to be mesmerized by the shoals of iridescent tropical fish hiding among the pristine coral gardens that protect the island. The island is accessed from the mainland, just south of Bagamoyo town 70km north of Dar es Salaam. It is home to bushbabies, wild pigs, genets, baboons, duiker and Suni antelope. The bandas were well appointed and have solar powered hot water, a large shady verandah with spacious rooms and big windows. \n\n\n* Mountains:\n\n: [[Mount Kilimanjaro]] is the highest peak in Africa and one of the highest freestanding mountains in the world. Many people travel to Tanzania just to climb this mountain.  Does tend to be crowded with tourists. You can either organize your trek up the mountain from your home country through a travel agency, but you'll pay a lot more for this convenience, or, if you've got a bit of time, hop on plane and save some money by organizing it in Arusha, Moshi or in Dar. Be advised that there are as many incompetent and dishonest trek organizers as there are good ones. Ask around to make sure your guide will deliver on his promises.  \n\nMount Kilimanjaro importance increased recently after entering to 7 natural wonders Africa competition in August 2012 among 12 natural attractions in Africa. In February 2013, Mount kilimanjaro was announced as one of 7 natural wonders Africa and hence pinnacle of Africa.\n\n:['''Mount Meru'''] Second highest mountain in Tanzania (4562m)is located in the center of Arusha National Park, a beautiful area with a wide range of habitats teeming with wildlife. On the lower slopes of the mountain and inside the park, there is a good chance of spotting animals. An armed ranger will accompany your party on the first stage to protect against any wildlife threats. The trail follows the north rim of the crater, along a dramatic ridge line. Once at the summit, the views of Mount Kilimanjaro and down into Meru crater are unforgettable. Many people who climb both mountains have a quiet preference for the humble Mount Meru.\nAlthough about 4,000 feet lower than Mount Kilimanjaro, Mount Meru is still a very tall mountain. Do not underestimate Mount Meru. Altitude acclimatization is still the key to a successful summit.\n\nThings to do in Tanzania mountains include climbing, trekking, rock climbing, hiking, walking safaris and game drives\n\n==Talk== \n\nThe predominant official language and ''lingua franca'' is '''[[Swahili phrasebook|Swahili]]''', which is spoken by over 90% of the population. '''English''' has some official status - it is used in foreign trade, diplomacy, the higher courts, and as a medium of instruction in secondary and higher education, although the Tanzanian government plans to discontinue English as a language of instruction altogether.\n\n[[Arabic phrasebook|Arabic]] is widely spoken and is official at Zanzibar.\n\nMany languages are spoken at the local level. Most Tanzanians learn their local tribal language first. Then, in primary school, they learn Swahili. When they go to secondary school, they are taught English. As elsewhere, English is more commonly spoken in larger cities and tourist destinations.\n\n'''Time of Day'''\n\nThis is where a little knowledge of Kiswahili can cause some inconveniences. Tanzanians don't function on the same time as Westerners. This doesn't mean Africa time, which is the notion that appointments are flexible and people can arrive when they please. For Tanzanians, it's illogical that the day would start in the middle of the night.\n\nSince sunrise and sunset happen pretty much at the same time all year round, 6a.m. and 6p.m., the day starts at 6a.m.which is 0 hours. So when telling time in Kiswahili, Tanzanians always subtracted 6 hours for western time. 11 a.m. is 5a.m to a Tanzanian. To avoid any confusion, a Tanzanian will tell time in English if they want to use the western standard and in Kiswahili if they use local standard.\n\nIf you want to practice your Kiswahili, just keep this in mind if you discuss appointment times with a Tanzanian. If you say '''Saa tano asubuhi''' (11 a.m.), instead of '''Saa kumi na moja asubuhi'''(5 a.m.), you'll end up waiting for 6 h if the person arrives on time, plus however long it takes to arrive fashionably late!\n\n==Buy== \n\n===Currency===\n\n'''Money'''\n\nThe currency of Tanzania is known as the '''Tanzanian Shilling''' ('''TSH''', /=). There are 5 notes and 6 coins:\n\n* Notes - 10000 (Red); 5000 (Violet); 2000 (Brown); 1000 (Blue), and 500 (Green) denominations.\n* Coins - 500, 200, 100, and 50 denominations.\n\nNotes and coins vary in size and color.   In descending size order, 10000 is the largest note, and 500 is the smallest.  \n\nIn Jan 2019, one US dollar was worth about 2300 Tsh. [https://www.xe.com/currencyconverter/convert/?Amount=1&From=USD&To=TZS] Note that Tanzanian currency exchangers usually have a different exchange rate for different US$ denominations, larger and newer bills having a better exchange rate than older and smaller bills. The difference in exchange rate between $1/$5 bills and $50/$100 bills may exceed ten percent. Older US $100 notes are no longer accepted in Tanzania, and any note older than 2003 will most likely be refused everywhere. Also, it's best to avoid attempting to exchange notes with pen marks or any writing on them. Finally, be advised that if you withdraw a large amount of money, in the range of $400 US, you'll have to carry over 40 notes around!\n\nThe 10000 and 5000 notes can be difficult to break when shopping in small shops, a.k.a. '''dukas'''. In Tanzania, it's usually the customer's responsibility to provide exact change. But if they do agree to provide change, you could be left with several 1000 and 500 notes of very poor quality. However, you won't have such problems in the large hotels and restaurants catering to foreigners.\n\nIn general, stores, restaurants, and hotels in Tanzania expect payment in Tsh.  Exceptions include payment for travel visas, entry fees to national parks (which must be paid in US dollars by non-residents), and payments for safaris and Kilimanjaro treks, which are generally priced in US dollars (though payment will be also accepted in other currencies). On Zanzibar, prices are generally in US dollars (including the ferry fare from Dar es Salaam to Zanzibar), and non-residents are required to pay for hotels with foreign currency (although the hotel will change Tsh for you). Make sure your US currency is current--US dollars older than 2001 will not accepted by most places in East Africa.\n\nMost hotels will exchange US dollars, Euros and British Pounds for Tanzanian Shillings. Other currencies, such as Canadian or Australian dollars, may be accepted but at rates far below the going rate. ATMs are mostly located in the city center and on the Msasani Peninsula. For those wishing to withdraw money from bank accounts back home, in general, '''Barclay's''', '''Standard Charter''', \"'Exim\"', '''CRDB''' and '''NBC''' '''ATM'''s work with PLUS and Cirrus compatible cards. Additionally, if you have a PIN code for your credit card, almost all Tanzanian banks with ATMs will allow cash advances on credit cards like '''Visa''', '''Mastercard''', and '''American Express'''.  If the ATM reports your home balance in TSh, you may be pleasantly surprised to find that you're a \"shillionaire\".\n\n'''Traveler's Checks''' have become virtually impossible to cash in almost all banks in Tanzania. For some odd reason, banks will only accept those TCs they have issued. Only hotels will accept checks from their guests, but at a far lesser rate than hard currency -- usually at the same rate they give for US$1/$5 notes. Since ATMs are much more prevalent, using credit cards and withdrawals from your personal accounts is much easier and less time consuming.\n\n'''Credit Cards''' can only be used in large hotels, resorts, and with certain travel agents. In short, Tanzania is still a cash society.\n\n===Shopping===\nThere are many markets in tourist cities that sell standard \"African\" goods. Beaded jewelry, carved soapstone, and Masai blankets make interesting gifts. Be aware that most \"ebony\" wood is fake (shoe polish) - the exception being in the far south-east of the country, where the Makonde tribe of Tanzania and Northern Mozambique create masks and other carvings from ebony and mpingo wood. Be prepared to bargain for everything. Masks are not typical of most East African groups, and the ones you find in the markets are either imported from West Africa or are strange things made just for tourists, with the exception of the Makonde masks.\n\nTinga Tinga paintings, named after the painter who originated that style, are for sale everywhere. Their distinctive style and colors make for attractive souvenirs. A standard size painting can be had for TS 5,000 - 10,000. There is a Tinga Tinga school in Dar es Salaam, where you can purchase paintings from the artists themselves.\n\n=== Air freight ===\n\nIf you happen to buy too many goodies during your travels, it is possible to send them home air freight.  Many airlines will allow you to check additional parcels when you fly, for a fee, which probably makes the most sense if you're going straight home.  But if you're continuing on, air freight might be the way to go.  Note that many listed rates do not include 20% VAT, or a \"fuel surcharge\", 13.5% as of December 2008.  \n\n* <listing name=\"DHL\" alt=\"\" directions=\"\" address=\"\" phone=\"\" email=\"\" fax=\"\" url=\"http://www.dhl.co.tz\" hours=\"\" price=\"\"> Offers quite pricey service (e.g. about $300 for a 10kg package to the US) but is conveniently located in Dar city center, as well as in a bunch of other cities (see web site).  Will deliver direct to the recipient in most countries.</listing>\n\n* <listing name=\"KLM\" alt=\"\" directions=\"go to the old terminal at DAR airport\" address=\"\" phone=\"\" email=\"\" fax=\"\" url=\"http://www.af-klm.com/cargo/b2b/wps/portal/b2b/\" hours=\"\" price=\"\">Offers slightly more reasonable rates than DHL (e.g. about $100 for a 10kg package to the US) but requires a trip to the airport and about 1 hour of paperwork & waiting.  You must pay cash, in US dollars, plus some fees in shillings.  Customs will want to go through the package, so bring something to (re)seal it.  You can first go to the KLM freight office (look for the sign), then to the cargo building further down the same road, or call ahead and be met at cargo.  If you just arrive at cargo you will be swarmed by freight forwarders - to find the KLM staff, look for the KLM logo (e.g. on a lanyard) or call ahead to Sameer (+255.714.474.617) who is quite helpful.  Note that, despite what you might be told, someone will need to go to the destination airport to pick up the package - it will not be delivered to an address by KLM.  Storage charges will accrue if it's left for very long.</listing>\n\n* <listing name=\"EMS\" alt=\"\" directions=\"\" address=\"\" phone=\"\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">EMS is a branch of the Tanzanian postal service, and is the cheapest way to send packages.  It's available at most larger town post offices.  But shipping time can be quite long, and delivery is not always reliable.  Also there are size/weight restrictions.  Packages will be transferred to the local postal service at destination, which usually provides direct delivery.</listing>\n\n* <listing name=\"FEDEX\" alt=\"\" directions=\"\" address=\"\" phone=\"\" email=\"\" fax=\"\" url=\"\" hours=\"\" price=\"\">FEDEX currently have offices in Arusha, Dar-es-salaam, Shinyanga and Mwanza, and like DHL, they are also pricey. </listing>\n\n==Eat== \n*Produce is often of very poor quality. Meat and milk can prove difficult for western taste and diets, so be sure that all meat is cooked through. At hotels, you won't have any trouble, but if you venture into small villages, make sure that all water is filtered or boiled before drinking and all fruits and vegetables are peeled before eating.\n*Local dishes include '''Mtori''' - cooked beef and bananas - and '''Mchicha''', a vegetable stew with meat or fish in it.\n*If there is anything that can be called Tanzania's national dish, then '''Ugali''' would most likely win out. A polenta-style dish made with corn flour, it accompanies cooked meat and a variety of stews, and it's eaten with your hands. Recipes vary from village to village, and everyone has their own way of making it. Many foreigners find it bland and unappealing, but it's worth a try, and some upscale establishments serve it.\n*'''Chai Maziwa''' (chai with milk) is a local favorite and well worth trying if you can handle the large amounts of sugar added to this drink.\n*Street food is also cheap and plentiful. Barbecued maize on the cob is very nice, as are the chipped potatoes (fries), cooked over a roaring fire.\n*'''Mandazi''' is a sweet doughnut-styled food that is mostly made fresh each morning. Great with coffee in the morning, it makes an ideal snack.\n*Tanzania's large South Asian community ensures that a great variety of restaurants offer cuisine from all parts of that region of the globe. All eateries near Hindu temples (particularly in Dar) are a good bet. Just watch where the local Indians go to eat, and you won't be disappointed. Most of the food is cooked in large amounts of Ghee, clarified butter, which can be hard for some people to digest.\n*'''Chips Mayai''' (chips cooked in an omelet) are served at nearly every African food stand in Tanzania and are considered a Tanzanian specialty. They're quite good with pili pili (hot sauce).\n*Northern Tanzania has a number of great coffee plantations. Although coffee does not have the same popularity in Tanzania as it has in Ethiopia, with a bit of searching you can find a decent cup of java, instead of the instant \"Africa\" coffee that is served in most restaurants. All large hotels in Dar make good coffee. If you want to brew your own cup, '''Msumbi Coffee Shop''', +255 22 260 0380, Sea Cliff Village, sells Tanzanian coffee beans ground or whole, roasted on the premises.\n\n==Drink== \n\nThe legal drinking/purchasing age of alcoholic beverages is '''18'''.\n\n* '''Bottled water''' is cheap and widely available throughout the country. You shouldn't drink the tap water unless you have no other option, and it must either be filtered with a high quality filter and purifier or kept at a rolling boil for at least 10 minutes before consumption. Recent tests on tap water have found it contaminated with the e-coli bacteria.\n* '''Konyagi''' is a wonderful gin-like beverage, sold only in Tanzania.\n* Domestic beers are '''Kilimanjaro''', '''Serengeti''' and '''Safari''', which are western-style and very good. Imports include Tusker, Stella Artois, and Castle. Tanzania is home to some of the most exotic drinks in the world.\n* Locally produced banana-beer is also available at times, but questionably safe to drink. Traditionally, you will drink this out of a hollowed gourd. First drink the guests, who then pass it to the elders. In some parts of of Tanzania, fermented bamboo juice (Pombe) is the common tipple.\n* Passion fruit, mango, and orange juices are available in many restaurants, and excellent when the fruits are in season.\n* '''Soft drinks''' are widely available; '''Stoney Tangawizi''' (ginger ale - tangawizi means 'ginger', in Swahili) is one of the most popular.\n* Other popular beverages are Orange Fanta, Bitter Lemon, Soda Water, Tonic Water, and Lassi (a sweet or salty yogurt drink).\n\n==Sleep== \nSunrise and sunset are always the same time (about 7) at the equator.\n\nBe sure to avoid touts. If you are travelling as a couple, a good idea is for one person to sit in a lobby or restaurant with the bags, while the other scopes out rooms. You are likely to get a cheaper price without the bags, and not be targeted by sneaky touts that will raise the price $5-$10 for you  for their commission.\n\n==Learn==\nVarious schools and volunteer programs offer courses ranging from Beginners Swahili to Economic Development. Dar es Salaam also has a well-established University, which has exchange programs with several universities in the US and other countries.\n\n==Work==\n*<do name=\"A Broader View Volunteers Corp\" alt=\"\" address=\"Tanzania: Arusha\" directions=Tanzania\" phone=\"+1 866-423-3258 or +1-215-780-1845\" url=\"http://www.abroaderview.org\" email=\"volunteers@abroaderview.org\"> Social and conservation programs from 1 week up to 12 by an US non profit organization, based in Philadelphia area. You can contact them also by chat online at this link  [https://www.abroaderview.org/volunteers/tanzania] *[https://www.abroaderview.org/volunteers/tanzania Volunteer Tanzania]</do>\nThere is a wide assortment of volunteer organisations sending volunteers and interns to Tanzania to do work in health care, orphanages, education, and development projects. On <listing name=\"Volunteer World\" alt=\"\" directions=\"\" lat=\"\" long=\"\" address=\"a social startup from Germany\" phone=\"\" tollfree=\"\" email=\"\" fax=\"\" url=\"https://www.volunteerworld.com/en/volunteer-abroad/tanzania/\" hours=\"\" price=\"\">, you can search and compare all volunteering options in Tanzania online and get in direct contact with the NGOs of your choice.</listing> Finding a paying job may be more of a daunting task, taking more time and making use of local connections, but a job could be certainly obtainable when sought hard enough.\n\n==Stay safe==\n===Theft===\nCaution should always be exercised, particularly in tourist areas, such as Arusha, Stone Town (Zanzibar), and Dar es Salaam. Violent crime against foreigners is not uncommon, particularly against those walking alone at night, which is not recommended. Pickpocketing and con artists are also common. Pickpockets work crowded markets, like Kariakoo, and bus stations. Don't be fooled by small children who are often forced into a life of crime by older kids or parents -- never carry anything of value in your pockets and don't let expensive camera equipment dangle from your neck. Don't leave bags unattended or even out of your sight when on the beach.\n\n''See specific area or city articles for details. '' \n\nIn general, avoid isolated areas, especially after dark.  Travelling in large groups is safer.  If there are many people or security guards around (e.g. city center areas) you should be relatively safe.\n\nThe safest way to travel is by taxi with a driver you know, especially when it's dark out (late night or early morning).  Although it's uncommon, taxi drivers have been known to rob tourists. Taxi drivers are a major security weak link in Dar es Salaam.  Get the number for a taxi you trust, from your hotel or a local.    If you are in a situation where you have to take a taxi that has not been recommended, take the number and send it to your relative so that it can be tracked if something happens.   Most of the taxi drivers in Dar know the  criminals who hang out in their parking area but turn a blind eye to their activities.\n\n\nBuses have infrequently been stopped by robbers on long-distance (often overnight) routes.  If you have to travel a long distance by bus, it might be better to break it into multiple day-only trips, or to travel by plane or train.\n\nIn the event of an incident, the police may or may not make a strong effort to identify the culprits, but obtaining a police report is necessary if you plan on filing an insurance claim later, or if important documents are stolen.  Make sure the police report indicates if your papers were stolen; otherwise you may have difficulty leaving the country.  You should immediately contact your local embassy or consulate in the event that your passport is taken.\n\n===Walking===\n\nThere are very few sidewalks in Tanzania, always pay careful attention to the traffic and be prepared to move out of the way, as vehicles do not make much effort to avoid pedestrians.  In Tanzania, cars have priority. \n\nThe best way to avoid touts, sellers, dealers etc, when they inevitably come up to you and say \"jambo\" is to either say nothing, or to say \"thank you\" or \"asante\", and to keep moving.  Some may be offended by 'no', and persistent touts will be encouraged by any kind of interaction at all.\n\nWalking safaris is a part of Ecotourism whereby tourists walk to see natural scenery of tourist destinations to minimize impacts on tourist destinations.\n\n\nEcotourism is travel to natural places which are virgin while conserving environment and improving well being of people. Ecotourism activities include walking safaris, game drives, bird watching, trekking, cultural tourism and mountain climbing.\n\nEcotourism is a responsible travel whereby all tourist destinations visited are left intact and ecotourism is guided by naturalist guides. Naturalist guides include safari guides and mountain climbing guides.\nIn Tanzania ecotourism hotspots are Mount Kilimanjaro, Serengeti national park, Ngorongoro conservation area, Selous game reserve, Ruaha national park, Udzungwa and Mafia Island.\n\nTo organize ecotourism trips, local tour operators know better places and private Tanzania tours. KILIMANJARO TANZANITE SAFARIS Co.Ltd offer best travel deals on climbing mount Kilimanjaro, wildlife safaris, photographic safaris, nature safaris, camping safaris, eco lodges, cheap travel packages, budget camping safaris and beach holidays. <a rel=\"nofollow\" class=\"external autonumber\" href=\"http://www.kili-tanzanitesafaris.com/\">[2]</a>\nMount Kilimanjaro climbing trips, wildlife safaris, African safaris, Kilimanjaro trekking expeditions, Kilimanjaro climbing routes, machame route, Rongai route, budget camping safaris and photographic safaris Tanzania.\n\n===Corruption===\n\nTanzania, like many developing countries, suffers from corruption.  Police are poorly paid - many make less than $40/month.  You may be solicited for a bribe by an official willing to turn a blind eye to your infraction, fabricated or otherwise.  Some travellers are very much averse to paying bribes to anyone, especially in a country with so many needy but honest citizens. \n\nFraudsters are known to impersonate police, sometimes in the guise of an \"immigration official\" who identifies a problem with your documents.  They will flash official-looking papers at you.  But there are many plainclothes officers as well.  And if you are confronted with someone in uniform, they are almost certainly an actual officer.\n\n'''On-the-spot-fine''' is one term used for a bribe. Those words are meant to initiate a conversation about money. You may be told that the real fine is TSh40,000 or more and that for TSh20,000 or 30,000, paid immediately, you can be on your way and avoid a trip to the Police Station to pay a higher fine.\n\nIf you are certain you are in the right, and do not want to pay a bribe, some strategies are:\n\n* '''Involve other people'''.  Fraudsters or corrupt officials are unlikely to pursue their schemes near an audience.  You can ask bystanders for help on the pretext of not understanding the officer.\n\n* '''Invoke higher powers'''.  Insisting on going to the local police station is a good way to make an illegitimate issue go away.  Suggesting a visit to your country's embassy (e.g. to have an official there help translate the conversation, due to one's poor knowledge of the local language and laws) is also effective.  At this point, they usually have a look of horror on their face, since they don't want any real officials involved.  Asking for bribes is illegal, and there is an office of corruption where they can be reported.\n\n* '''Play dumb'''. Politely explain to the person that you don't understand the nature of the infraction, even if you do.  Tanzanians are not direct, and prefer to imply what they want, instead of asking outright.  Tell them you've only just arrived in the country, even if it's your 100th visit. If you know some Kiswahili, I wouldn't mention it.  It may only make things harder.\n\n* '''Insist a receipt with an official stamp''' -- a request that is most likely to be met with confusion and concern. The idea is to show that you don’t know that this is actually a bribe and that you simply try to play by the rules.  Hopefully, after 10 or 20 minutes of a circular, but always polite, conversation, they may send you on your merry way. '''A word of caution about this approach. Corrupt officials have become wise to this and in one case a person requesting a receipt was told the cashier's office was closed and would not open until the next morning. The options were to pay the fine or spend the night in prison. It appears this was not a bluff on the part of the officer. The fine was paid and no receipt was issued. Be aware that the game is constantly changing.'''\n\nAlso keep in mind that:\n\n* Discussing money or negotiating the fine may encourage the perception that you understand the nature of the conversation (i.e. you are willing to pay a bribe).\n\n* Directly accusing the officer of corruption is likely to be counter-productive; it is important that you allow the officer to save face. \n\n* If you insist on going to the police station, you may be expected to give the officer a ride.  If you are alone, and especially if the \"officer\" is plainclothes, this may not be a good idea.  If you are approached by multiple people and are alone, under no circumstances get in their vehicle - insist on taking a taxi.  And once you get to the station, just pay whatever fine is quoted and insist on a receipt.  This may end up costing you more than the bribe, but at least this cop won't get any money out of you, and he/she may think twice before flagging down other foreigners.  Also, demonstrate respect for their authority, never raise your voice, and never swear or insult them.  Whether you are right or not does not matter at that point. \n\nFinally: Incidents of excessive force involving tourists are rare, but that doesn’t mean it cannot happen. For instance, police have been known to be drunk on the job, which can seriously inhibit their ability to reason. As in any situation where someone is trying to get money out of you, by force or threat of force, it's better to be safe than sorry; it's only money.\n\n==Stay healthy== \n\n===Illnesses and diseases===\nAs in most African countries, the AIDS/HIV infection rate is high. Tanzania's '''HIV/AIDS''' infection rate was 9% at the end of 2003 UNAIDS [http://www.unaids.org/en/geographical+area/by+country/united+republic+of+tanzania.asp ]. This figure is deceiving, however, since several distinct segments of the population, such as artisanal miners, itinerant fisherman, truck drivers, and sex workers, have HIV infection rates significantly higher than the national average. Do not have unprotected sex in Tanzania or anywhere else, for that matter.\n\nAfter food-borne illnesses, '''[[malaria]]''' should be your greatest concern. Malaria is transmitted by mosquitoes and is endemic to Tanzania. You may find yourself at risk in almost every part of the country, although this risk is diminished at altitudes above 2000 m. Care should always be taken between sunset and sunrise, especially during the rainy season. Always sleep under a treated net; wear trousers and closed footwear, and use an effective repellent. '''It's amazing, but many large hotels don’t automatically install mosquito nets in their rooms. However, a call to the reception requesting one is seldom ignored.''' In some cases, the nets have several large holes, but a bit of adhesive tape or tying a small knot to cover the hole should do the trick.\n\nPrior to leaving for Tanzania, you may also wish to consult a physician about taking some anti-malarial medication -- before, during, and after your trip. If, in spite of your best efforts, you do contract malaria, it is usually easily treated with medication that is readily available throughout most of the country. If you plan on being in isolated locations, you may wish to drop by a clinic and purchase a batch. Note that symptoms associated with malaria can take up to two weeks before manifesting themselves. The rule of thumb for ex-pats living in Tanzania is this: Any fever lasting more than a day should be cause for concern and necessitate a trip to the clinic for a malaria test. Upon your return home, should you show signs of a possible malaria infection, notify your doctor that you’ve visited a malaria-infected country.\n\nOther major illnesses to avoid are '''typhoid''' and '''cholera'''. In theory, typhoid can be avoided by carefully selecting food and drink and by avoiding consumption of anything unclean. Typhoid infection, according to the U.S. Centers for Disease Control and Prevention (CDC) [http://wwwn.cdc.gov/travel/yellowbook/2008/ch4/typhoid.aspx], is marked by 'persistent, high fevers...headache, malaise, anorexia, splenomegaly, and relative bradycardia.'  \n\nCholera infection is marked by vomiting and sudden, uncontrollable bowel movements, which can dehydrate and ultimately kill the sufferer within 48 hours. It is important to seek medical attention as quickly as possible. Cholera is more or less a seasonal phenomenon in Zanzibar, where outbreaks frequently occur during the rainy seasons. Vaccines and/or oral prevention are available for both typhoid and cholera.\n\n'''[[Yellow fever]]''' is an acute viral disease transmitted through the bite of a particular mosquito. Although not as common as malaria, it is nonetheless a serious disease, and travelers to Africa should consult a physician about being vaccinated against it. If you plan on traveling to other countries after your stay in Tanzania, be advised that some countries, such as [[South Africa]], may require proof that you’ve been vaccinated against Yellow Fever before allowing you to enter the country. If you aren’t or can’t prove it, you will be offered two options: 1) receive the Yellow Fever vaccination at the airport, and 2) immediately leave the country. The Yellow Fever vaccine (as any cavvine) can have  side effects for some people,  so you may wish to get the vaccine in your home country, under controlled conditions. Most physicians will not administer the Yellow Fever vaccine to children under the age of 1 year, and a letter from a physician explaining this will ensure that your infant child will not receive the vaccine at the airport.\n- People travelling to Tanzania from INDIA, There is acute shortage of the yellow fever vaccine in India so please get yourself vaccinated at the airport in Dar-ES-Salaam as soon as you land there.\n\n'''Gastrointestinal Distress''', a.k.a. traveler’s diarrhea, is the result of one, some, or all the following factors: Unhygienic food preparation and storage, changes in diet, fatigue, dehydration, and excessive alcohol consumption. Prevention is your best defense. Eat only raw vegetables and fruits you can peel and which have been rinsed in clean water. Avoid street or restaurant food that appears to have been left in the open for an extended period of time. Eat only freshly fried or steamed food. You should drink only bottled water, which is available throughout the country. You should even brush your teeth with it. If you must drink tap or well water, boil it for a minimum of 10 minutes or use a high quality filter.\n\n'''Rift Valley Fever:'''  In January 2007, there was an outbreak of RFV in the Kilimanjaro area. Consumption of unpasteurized milk and improperly cooked meat from infected cows led to a number of deaths in the area. Following the deaths, beef sales dropped sharply all over the country, despite the limited scope of the infection. In general, meat served in upscale restaurants is of superior quality. However, care should be taken when indulging in street foods or when eating in remote areas.\n\n===Insects and Animals===\n\nTanzania has its fair share of venomous and deadly insects and animals, such as Black and Green Mambas, scorpions, spiders, stinging ants, lions, sharks, and others. You should take care when walking through high grass; when visiting national parks, or when shoving your hand under rocks or into dark holes -- unless you know what you are doing. In actuality, the likelihood of encountering these and other similar dangers is remote.\n\nThe insect/animal most residents fear is the mosquito.\n\n===Medical Facilities===\n\nHospitals and dispensaries in Tanzania do not meet western standards. If you require surgery or any complex medical procedure you will have to be evacuated to Kenya, South Africa or Europe. You should ensure your medical insurance covers such expenses. Outside of Dar es Salaam, and especially outside of the larger cities and towns, you will be hard pressed to get even basic medical help as many doctors are poorly trained and/or have limited equipment and medication. You should ensure you have your own medical kit to hold you over in case of an emergency. Misdiagnoses are frequent for even common ailments such as malaria, as high as 70% of the cases.\n\nDar es Salaam is served by a few clinics staffed by western trained physicians. However, some surgical procedures still require evacuation out of Tanzania.\n\n*'''IST Medical Clinic:''' Just off Haile Selassie Road past the Chole Road intersection, behind the International School of Tanganyika, Msasani Pinensula, Tel: +255 22 260 1307, Emergency: +255 754 783 393.\n*'''Premier Care Clinic Limited:''' 259 Ali Hassan Mwinyi Road, Namanga, Kinondoni, P.O. Box 220, Dar es Salaam, Tel: +255 22 266 8385, Mobile: +255 748 254 642.\n*'''Aga Khan Hospital:''' Corner of Ocean Road & Sea View Road, Tel: +255 22 211 5151.\n====Government Hospitals====\n\n*'''Bugando Hospital''', Mwanza, Tanzania Tel: +255 68 40610,  [http://www.bugando.org]. The University College of Health Sciences at Bugando Medical Center is established as a Catholic college having four schools: Medical, Nursing, Pharmacotherapy and Dental. \n\nMbeya Referral Hospital, PO Box 419, Mbeya, Tanzania Tel: +255 65 3576.\nMnazi Mmoja Hospital, PO Box 338, Zanzibar, Tanzania Tel: +255 54 31071.\n\nOther Government run hospitals used for electives:\n\nHindu Mandal Hospital, PO Box 581, Dar es Salaam, Tanzania Tel: +255 51 110237/110428.\nAgha Khan Hospital, PO Box 2289, Dar es Salaam, Tanzania Tel: +255 51 114096.\nNachingwea District General Hospital, Nachingwea, Lindi, South Tanzania\nTeule District Designated Hospital, Muheza, Tanga Region, Tanzania.\n\n====Mission Hospitals====\n\nBerega Mission Hospital, Berega, Morogoro, Tanzania.\nSt Anne’s Hospital, PO Box 2, Liuli (via Songea), Tanzania (connected via USPG charity).\nSt Francis Hospital, Kwo Mkono, Handeni District, Tanzania.\n\n*A flying doctor service is based in Arusha, Tel: +255 2548578.\n\n'''For any medical issues please don't hesitate to contact''': Ministry of Health, PO Box 9083, Dar es Salaam Tel: +255 51 20261 Fax: 51 39951\n\nIn Moshi Municipality (Kilimanjaro Region) there is the renowned '''KCMC''' -   Kilimanjaro Christian Medical Centre which is in the foothills of the snow capped, Mount Kilimanjaro, Tanzania. It was opened in March 1971 by the Good Samaritan Foundation, who planned and raised large funds to build and equip it.\n\n==Respect==\nIn general, tourists should wear modest or conservative attire, especially in Zanzibar, which is a conservative Muslim society. Western women should not wear clothing that reveals too much skin. 'Kangas', brightly-colored wrap-around cloth, are affordable, available throughout the country, and can serve as a discreet covering.  \n\nThe Masai people, with their colorful clothing, are tempting targets for any tourist with a camera. However, they expect to be paid for it, and you should always ask before taking pictures.\n\nIt is common practice among Swahili-speakers to use 'shikamoo' (prounounced 'she ka moe' and literally meaning, 'I hold your feet') when greeting elders or superiors. The usual response from an elder will be 'marahaba'. In Zanzibar, the equivalent of 'shikamoo' is 'chei chei'. The traveler will get along very well when using these verbal expressions of respect. In addition, a title after the 'shikamoo' is also a useful indicator that you are not just a dumb tourist -- 'shikamoo bwana' for the gents, and, when addressing a female elder, 'shikamoo mama'.\n\nTanzanians will also comment if you are doing any work while they are not, with the phrase \"pole kwa kazi\". It literally means \"I'm sorry you have to work\". A simple \"asante\", or \"thanks\", will suffice in reply.\n\nMany Tanzanian sellers are persistent and, ordinarily, a simple head shake, accompanied by \"asante sana\", should settle it. However, as a last resort, a firm \"hapana\", meaning \"no\", will do the trick. Tanzanians find the word \"hapana\" quite rude, so please don't use it casually -- only as a last resort. Whatever you plan to do, do not tell someone you will come back to buy from them later when you have no such intention; better to be honest and say 'no' than having to avoid someone for days. They somehow have a funny way of finding you when you promised to visit their stall or shop!\n\nThe most polite way to refuse something is to say \"sihitaji\" (pronounced see-hih-tah-jee)- \"I don't need it\".\n\n==Contact==\nKeeping in touch while traveling in Tanzania is rarely a problem. You can get decent mobile phone reception even in some national parks.\n\n===Telephone calls===\nThe \"Tanzania Telecommunications Company Ltd\" (TTCL) is the state owned telecom, operating all pay phones and landlines in Tanzania. As it is the case with most developing countries, telephone fixed-lines are not affordable for many ordinary people. However, the mobile network has blossomed throughout Africa in the past five years, and this is equally true of Tanzania. With many used mobile phones for sale and the very low cost of getting a SIM card, 2000 Tsh, this is the popular choice of most Tanzanians. For many, a mobile phone is the first large purchase when they get a job. The major mobile service providers operate all over the country, even in some of the most remote areas, although service interruptions are common.\n\nIf you find a taxi driver or tour guide that you like, ask for his/her mobile number. This is often the best way to reach them.\n\n'''Using a mobile phone'''\nIf you have an \"unlocked\" '''GSM 900/1800mhz frequency''' mobile phone (the same frequency as used in the rest of the world, apart from USA and Canada), you can purchase a local SIM card for 500 Tsh from a series of Tanzanian service providers. The most popular are '''Celtel''' [http://www.celtel.co.tz], '''Vodacom''' [http://www.vodacom.co.tz], and '''Tigo''' [http://www.tigo.co.tz]. '''Zantel''' [http://www.zantel.co.tz] is a new arrival on the mainland and, through the '''national roaming agreement'''  with Vodacom, currently has the largest network coverage.\n\n'''Air Time'''\nYou can recharge your \"Prepaid\" mobile phone account by using \"scratch-cards\", which are available everywhere. Just look for shops or even small tables set up along the road, with posters for the various mobile service providers. Those cards come in the following denominations: 500, 1000, 5000, 10000, 20000, and 50000 Tsh. If you plan on making frequent calls outside of Africa, you will need at least a 10000 Tsh-card.\n\n; Making calls within Tanzania to a mobile phone: Dial ''\"0 & (telephone number)\"'' or ''\"+255 & (telephone number)\"''\n; Making calls within Tanzania to a landline: Dial ''\"0 & (city code) & (telephone number)\"'' or ''\"+255 &  (city code) & (telephone number)\"''\n; Telephone codes for the Tanzanian cities (These numbers are only used when calling landlines): Dar es Salaam (22), Morogoro & [[Mtwara]] (23), Zanzibar & Pemba (24), Mbeya (25), Iringa (26), Arusha & Tanga (27), and Mwanza (28).\n; Making international calls: Dial ''\"+ & ([[List of country calling codes|country code]]) & (area code, if any) & (telephone number)\"'' or ''\"000 & ([[List of country calling codes|country code]]) & (area code, if any) & (telephone number)\"''\n\nIn October 2006, '''Vodacom''' changed the second digit, not counting the first \"0\" or the \"+255\" country code, in their phone numbers from \"4\" to \"5\", e.g.: 7'''4'''4 is now 7'''5'''4. Some magazines, books, travel guides, and advertisements may not have made the necessary corrections. All Vodacom mobile numbers starting with 744, 745, or 746 should be changed to 754, 755, and 756.\n\n===Internet===\n\nInternet cafés are more and more common throughout Tanzania. They are easy to find in major urban areas, like Dar es Salaam and Arusha.\n\nInternational telecommunications have low capacity, and can be unreliable.\n\nSome mobile providers have started offering wireless internet service. Zantel, Vodacom, and Zain are the main providers. All urban areas and many rural areas that have mobile phone coverage also have mobile internet coverage. Wireless 3G coverage is available in many areas of Dar es Salaam, Arusha, and Zanzibar town. For the Zanzibar Archipelago Zantel seems to be the best option. On the continent there is more competition between the operators.\n\nTo use this service you can use your phone's mobile browser. To use it with a computer, you must first purchase a CDMA PC Card or USB mobile receiver which plugs into your computer. This will set you back about 200,000 Tsh. If you have an unlocked CDMA phone with a modem cable, that will also work.\n\nAirtime is obtained using scratch cards just like mobile phones. Connection rates are dropping dramatically and there are packages of \"unlimited\" access for some period of time. For example, Zantel offers 3 days of unlimited transfer for 5000 TSh.\n\n===Emergency===\n* Emergency Services: '''112'''\n\nIn 2006, there was a huge scandal involving the emergency service number, a scandal that saw the resignation of the Chief of Police. During an armed robbery at a popular Indian restaurant, an employee dialed 112 to notify the police that a crime was in progress. He let the phone ring for over 30 minutes before hanging up. The following day, the media reported that the emergency number had been disconnected for over a month, and the police had not advised the public.\n\nLuckily, the emergency number has been reactivated; however, if you can, it's probably better to go straight to the nearest police station, instead of dialing 112.\n\n==Get out==\n\n{{outline}}\n{{countryguide}}\n{{isPartOf|East_Africa}}\n\n\n[[ca:Tanzània]]\n[[de:Tansania]]\n[[eo:Tanzanio]]\n[[es:Tanzania]]\n[[fi:Tansania]]\n[[fr:Tanzanie]]\n[[hu:Tanzánia]]\n[[it:Tanzania]]\n[[ja:タンザニア]]\n[[nl:Tanzania]]\n[[pl:Tanzania]]\n[[pt:Tanzânia]]\n[[ru:Танзания]]\n[[sv:Tanzania]]\n[[zh:坦桑尼亚]]\n[[wts:Category:Tanzania]]\n\n[[Dmoz:Africa/Tanzania/]]\n[[World66:africa/tanzania]]"
        }
    }
}