{
    "parse": {
        "title": "Thailand",
        "pageid": 810,
        "wikitext": {
            "*": "{{pagebanner|Thailand Banner.jpg}}\n\n{{quickbar\n| image=Sukhothai.jpg\n| caption=Sukhothai Historical Park, Sukhothai\n| location=Thailand in its region.svg\n| flag=Flag of Thailand.svg\n| capital=[[Bangkok]]\n| government=constitutional monarchy\n| currency=Thai baht (THB)\n| area=513,120km²<br />''land: 510,890km²<br />water: 2,230km²''\n| population=66,720,153 (2011 estimate)\n| language=[[Thai phrasebook|Thai]], minority languages\n| religion=Buddhism (mainly Theravada), Islam in the south\n| electricity=220V, 50Hz (American and/or European plug)\n| callingcode=+66\n| tld=.th\n| timezone=UTC +7\n| emergencies=dial '''999'''\n}}\n\n'''Thailand''' (ประเทศไทย), officially the '''Kingdom of Thailand''' (ราชอาณาจักรไทย) is a country in [[Southeast Asia]] with coasts on the Andaman Sea and the Gulf of Thailand. It borders [[Myanmar]] (Burma) to the northwest, [[Laos]] to the northeast, [[Cambodia]] to the southeast and [[Malaysia]] to the south. \n\nWith great food, a tropical climate, fascinating culture, majestic mountains and ''great'' beaches, Thailand is a magnet for travellers around the world.\n\n\n==Understand==\n[[Image:WatRajnadda_Garland.JPG|thumb|upright=1.3|Garlanded statue, [[Bangkok/Rattanakosin|Wat Rajanadda]], [[Bangkok]]]]\nThailand is the country in [[Southeast Asia]] most visited by tourists, and for good reason. You can find almost anything here: thick jungle as green as can be, crystal blue waters that feel more like a warm bath than a swim in the ocean, and food that can curl your nose hairs while dancing across your taste buds. Exotic, yet safe; cheap, yet equipped with every modern amenity you need, there is something for every interest and every price bracket, from beach front backpacker bungalows to some of the best luxury hotels in the world. And despite the heavy flow of tourism, Thailand retains its quintessential Thai-ness, with a culture and history all its own and a carefree people famed for their smiles and their fun-seeking ''sanuk'' lifestyle.  Many travellers come to Thailand and extend their stay well beyond their original plans and others never find a reason to leave.  Whatever your cup of tea, they know how to make it in Thailand.\n\nThis is not to say that Thailand doesn't have its downsides, including the considerable growing pains of an economy where an agricultural labourer is lucky to earn 300 baht per day while the ''nouveaux riches'' cruise past in their BMWs. [[Bangkok]], the capital, is notorious for its traffic jams and rampant development has wrecked much of once-beautiful [[Pattaya]] and [[Phuket]]. In heavily touristed areas, some lowlifes have made [[#Stay safe|scamming]] tourists into an art form, and Immigration queues are often long, giving travellers bad first and last impressions. \n\n*<see name=\"The Tourism Authority of Thailand (TAT)\" alt=\"(TAT)\" address=\"Tourism Authority of Thailand 1600 New Phetchaburi Road, Makkasan, Ratchathewi, Bangkok 10400, THAILAND\" directions=\"Suvarnabhumi Airport\" phone=\"+66 02 250 5500 (120 automatic lines) \" url=\"http://www.tourismthailand.org \" hours=\"\" price=\"\" lat=\"\" long=\"\">Suvarnabhumi Airport\nArrival Floor, Domestic Tel: (66)2134 0040 Open 24 hours\nArrival Floor, International Tel: (66)2134 0041 Open 24 hours\nfor all TAT Local Offices see their web page</see>\n\n==Cities==\n<!-- No more than nine (9) cities, please; discuss changes on Talk page first! -->\n* [[Bangkok]] — Thailand's bustling, frenetic capital, known among the Thai as Krung Thep\n* [[Ayutthaya]] — a historical city, UNESCO World Heritage Site and old capital of Siam\n* [[Chiang Mai]]—  de facto capital of Northern Thailand and the heart of Lanna culture \n* [[Chiang Rai]] — gateway to the Golden Triangle, ethnic minorities and mountain trekking\n* [[Chumphon]]— gateway to the [[Chumphon Archipelago]], Pathio's unspoilt beaches & [[Ko Tao]] Island\n* [[Kanchanaburi]] — home of the bridge over the River Kwai and numerous World War II museums\n* [[Nakhon Ratchasima]] — largest city of the [[Isaan]] region\n* [[Pattaya]] — one of the main tourist destinations, known for its nightlife\n* [[Sukhothai]] — Thailand's first capital, with amazing ruins still\n* [[Surat Thani]] — home of the Srivijaya Empire, gateway to [[Ko Samui]], [[Ko Pha Ngan]], [[Ko Tao]], and [[Khao Sok National Park]]\n\n==Other destinations==\n* [[Ko Chang]] — once a quiet island, now undergoing major tourism development\n* [[Ko Lipe]] — small island in the middle of Tarutao National Park, amazingly unspoiled with great reefs and beaches\n* [[Ko Pha Ngan]] — site of the famous Full Moon Party with miles of quiet coastline\n* [[Ko Samet]] — the nearest island beach escape from Bangkok\n* [[Ko Samui]] — comfortable, nature, and entertainment hippie hangout gone upmarket\n* [[Ko Tao]] — known for its diving and nature, easily reached from [[Surat Thani]] or [[Chumphon]] by high speed catamaran\n* [[Khao Lak]] — gateway to the Similan Islands, hard hit by the 2004 tsunami, but vibrant once more\n* [[Khao Sok National Park]] — one of the most beautiful wildlife reserves in Thailand\n* [[Khao Yai National Park]] — take a night time 4x4 safari spotting deer or visit the spectacular waterfalls\n* [[Krabi Province]] — beach and watersports hub in the south, includes Ao Nang, Rai Leh, Ko Phi Phi and Ko Lanta\n* [[Phuket]] — the original Thai paradise island, now very developed, but still with some beautiful beaches\n* [[Khon Kaen]] — in the heart of Esaan (Isan) known for their silk and dinosaur sites.\n* [[Mae Sot]] — a thriving multi-cultural border town, with lots of national parks around to explore\n* [[Mae Sariang]] — small town life at the Thai Burmese border with trecking and Salween National Park\n* [[Tarutao National Marine Park]] — Attractions of Tarutao, Ko Lipe, Ko Tarutao, Mo Lae Bay, Ao Son Bay, Ko Kai [https://www.thainationalparks.com Tarutao National Marine Park]\n\n==Regions==\nThailand can be conveniently divided into five geographic and cultural regions:\n\n{{Regionlist|\n\nregionmap=Thailand_regions_map.png |\nregionmaptext=Regions of Thailand |\nregionmapsize=upright=2 |\n\nregion1name=[[Northern Thailand]] |\nregion1color=#62a862|\nregion1items= |\nregion1description=[[Chiang Mai]], hill tribes, and the [[Golden Triangle (Thailand)|Golden Triangle]]. |\n\nregion2name=[[Isaan]] |\nregion2color=#b36b48 |\nregion2items= |\nregion2description=The great northeast region. Get off the beaten track and discover back country Thailand, mouthwatering food, and some magnificent Khmer ruins.|\n\nregion3name=[[Central Thailand]] |\nregion3color=#acac6b |\nregion3items= |\nregion3description=[[Bangkok]], lowlands and historic Thailand. |\n\nregion4name=[[Eastern Thailand]] |\nregion4color=#7272c5|\nregion4items= |\nregion4description=Beaches and islands within easy reach of Bangkok, like [[Pattaya]], [[Ko Samet]] and [[Ko Chang]]. |\n\nregion5name=[[Southern Thailand]] |\nregion5color=#945493 |\nregion5items= |\nregion5description=Lush rainforest, hundreds of km of coastline and countless islands on both the Andaman Sea and the Gulf of Thailand, plus [[Phuket]], [[Chumphon]], [[Krabi (province)|Krabi]], [[Ko Samui]], [[Ko Tao]] and more of Thailand's famous beach spots. |\n}}\n\n===History===\nThe earliest identifiably Thai kingdom was founded in [[Sukhothai]] in 1238, reaching its zenith under King Ramkhamhaeng in the 14th century before falling under the control of the kingdom of [[Ayutthaya]], which ruled most of present-day Thailand and much of today's Laos and Cambodia as well, eventually also absorbing the [[North (Thailand)|northern]] kingdom of '''Lanna'''.  Ayutthaya was sacked in 1767 by the Burmese, but King Taksin regrouped and founded a new capital at [[Bangkok/Thonburi|Thonburi]].  His successor, General Chakri, moved across the river to [[Bangkok]] and became King Rama I, the founding father of the '''Chakri dynasty''' that rules (constitutionally) to this day.\n\nKnown as '''Siam''' until 1939, Thailand is the only Southeast Asian country never to have been colonised by a foreign power, and is fiercely proud of that fact. A bloodless revolution in 1932 led to a constitutional monarchy. During World War II, while Japan conquered the rest of Southeast Asia, only Thailand was not conquered by the Japanese due to smart political moves. In alliance with Japan during World War II, Thailand became a US ally following the conflict. After a string of military dictatorships and quickly toppled civilian Prime Ministers, Thailand finally stabilized into a fair approximation of a democracy and the economy boomed through tourism and industry. Above it all presided '''King Bhumibol Adulyadej''' ('''Rama IX'''), the world's longest-reigning monarch and a deeply loved and respected figure of near-mythic proportions.\n\nIn September 2006, a swift and bloodless military coup overthrew populist tycoon '''Thaksin Shinawatra''''s democratically elected but widely criticized government, exposing a fault line between the urban elite that has ruled Thailand and the rural masses that supported Thaksin. Thaksin went into exile and a series of unstable governments followed, with the successors of Thaksin's ''Thai Rak Thai'' party and the royalist-conservative ''People's Alliance for Democracy'' duelling both behind the scenes and, occasionally, out in the streets, culminating in Bangkok's airports being seized and shut down for a week in November 2008. The political scene remains in flux and the direction of the country once the ailing King passes away is a major question mark because of the perceived inadequacy of the current heir.\n\n===Politics===\nThailand is in theory  still a constitutional monarchy, with the king as a very highly respected and revered Head of State, but there have been repeated military coups and as of 2016, the country is run by a military junta which allows no organised political opposition. A draft new constitution would greatly limit the power of elected governments.\n\nIn practice, the king's role is largely ceremonial, with the Prime Minister holding the most authority in government. However, the king and the royal family are still protected by strict ''lèse majesté'' laws, which stipulate long jail terms for anybody convicted of insulting the king or any other members of the royal family. This can include jokes or even very indirect references.\n\n===Climate===\n[[Image:KohTaoBeach.jpg|thumb|Beach on [[Ko Tao]]]]\n\nThailand is largely '''tropical''', so it's hot and humid all year around with temperatures in the 28-35°C range (82-95°F), a degree of relief provided only in the mountains in the far north of Thailand. The careful observer will, however, note three seasons:\n\n* '''Cool''': From November to the end of February, it doesn't rain much and temperatures are at their lowest, although you will barely notice the difference in the south and will only need to pack a sweater if hiking in the northern mountains, where temperatures can fall as low as 5°C. This is the most popular time to visit and, especially around Christmas and New Year's or at Chinese New Year a few weeks later, finding flights and accommodation can be expensive and difficult.\n\n* '''Hot''': From March to June, Thailand swelters in temperatures as high as 40°C (104°F). Pleasant enough when sitting on the beach with a drink in hand, but not the best time of year to go temple-tramping in Bangkok.\n\n* '''Rainy''': From July to October, although it only really gets under way in September, tropical monsoons hit most of the country. This doesn't mean it rains non-stop, but when it does it pours and flooding is not uncommon.\n\nThere are local deviations to these general patterns. In particular, the south-east coast of Thailand (including [[Ko Samui]]) has the rains reversed, with the peak season being May-October and the rainy off season in November-February.\n\n===People===\nThailand's people are largely indigenous, although there are significant minorities of ethnic Chinese and assimilated Thai-Chinese throughout the country, Muslims in the south near the [[Malaysia|Malaysian]] border and hill tribes such as the Karen and the Hmong in the north of the country. The overwhelmingly dominant religion (95%) is '''Theravada Buddhism''', although there are adherents to Confucianism, Islam, Christianity and animist faiths.\n\n===Culture===\n[[Image:WatDoiSuthep_Courtyard.JPG|thumb|upright=1.3|Wat Doi Suthep, [[Chiang Mai]]]]\n\nMainland Thai culture is heavily influenced by '''Buddhism'''. However, unlike the Buddhist countries of [[East Asia]], Thailand's Buddhists follow the Theravada school, which is arguably closer to its Indian roots and places a heavier emphasis on monasticism. Thai temples known as '''wat'''s, resplendent with gold and easily identifiable with their ornate, multicoloured, pointy roofs are ubiquitous and becoming an orange-robed monk for a short period, typically the three-month rainy season, is a common rite of passage for young Thai boys and men.\n\nOne pre-Buddhist tradition that still survives is the '''spirit house''' (ศาลพระภูมิ ''saan phraphuum''), usually found at the corner of any house or business, which houses spirits so they don't enter the house and cause trouble. The grander the building, the larger the spirit house, and buildings placed in particularly unlucky spots may have very large ones. Perhaps the most famous spirit house in Thailand is the Erawan Shrine in [[Bangkok]], which protects the Erawan Hotel (now the Grand Hyatt Erawan) - built in 1956 on a former execution ground - and is now one of the busiest and most popular shrines in the city.\n\nSome traditional arts popular in Thailand include traditional Thai dancing and music, based on religious rituals and court entertainment. Famously brutal '''Thai boxing''' (''muay Thai''), derived from the military training of Thai warriors, is undoubtedly the country's best known indigenous sport.\n\nIn addition to the mainland Thai culture, there are many other cultures in Thailand including those of the \"hill tribes\" in the northern mountainous regions of Thailand (e.g., Hmong, Karen, Lisu, Lahu, Akha), the southern Muslims, and indigenous island peoples of the Andaman Sea.\n\n===Calendar===\nIn addition to the Gregorian calendar, Thailand also uses the '''Thai solar calendar''', which is 543 years ahead. Thus, Thai year 2558 corresponds to the Western year 2015. Thai dates in English are often written as '''B.E.''', short for \"Buddhist Era\".\n\nSome Thai holidays are still calculated with the older Thai lunar calendar, so their dates change every year.\n\n===Holidays===\n[[Image:Thailand_Ayutthaya_Wat_Phra_Si_Sanphet.jpg|thumb|upright=1.3|Wat Phra Si Sanphet, [[Ayutthaya]]]]\n\nThailand has a lot of holidays, mostly related to Buddhism and the monarchy. Nobody celebrates all of them, except for banks, which seem to be closed a lot.\n\n'''Wisakha Bucha''' (วิสาขบูชา) - falls on a full moon in the sixth lunar month, which is usually in May or sometimes June. It commemorates the birth, enlightenment, and death of the Lord Buddha that all happened on the same day in Buddha period. Wisakha Bucha Day is recognized as the most important day in Buddhism and also recognized as “World Heritage Day” by UNESCO. On this day, Thai Buddhists visit a temple to make merit in the morning and listen to sermons (Dhamma) by monks. After sunset, candle-lit processions (Wian-Tian) take place at most temples across the country. Buddhists carry lighted candles, three incense sticks and flowers, usually lotus flowers and walk around the central chapel three times in clockwise direction among smoke from the candles and incense sticks.\n\n'''Makha Bucha''' (มาฆบูชา) - falls on the full moon in of the fourth Lunar month, which usually falls in February or March, and commemorates the spontaneous gathering of 1,250 people before the Buddha, which led to their ordination and subsequent enlightenment. At temples in Bangkok and throughout Thailand, Buddhists carry candles and walk around the main shrine three times in a clockwise direction.\n\n''' Asanha Bucha''' (อาสาฬหบูชา) - falls on a full moon in the eighth lunar month, usually in July. It commemorates the first sermon of the Lord Buddha and the first monk of Buddhism. Many Thai Buddhists make merit, give food to monks, donate offering to temples and listen to sermons given by monks. Ceremonies are held in Buddhist temples throughout Thailand. In the evening, Buddhists perform candle-lit processions (Wian-Tian) by walking around the main chapel together with carrying candles, three incense sticks and lotus flowers. This day is also marked as the beginning of Buddhist lent period (Vassa) that neat wax candles are lit and kept burning during this period. In Ubon Ratchathani province, a Candle Festival is held which there is a parade of candles that each candle is enormous and made up very elaborately and creatively in many different figures. In Saraburi, monks will walk through the town with their bowls, on this day, to let Buddhists put flowers into their bowls instead of food.\n\nDuring '''Chinese New Year''' (ตรุษจีน), Chinese Thais, who are numerous in Bangkok, celebrate by cleaning their houses and offering food to their ancestors. This is mainly a time of abundant feasting. Visit Bangkok's Chinatown or Yaowarat to fully embrace the festivity.\n\n'''Songkran''' (สงกรานต์) - undoubtedly the most fun holiday - is the celebration of the Thai New Year, sometime in April (officially April 13th to 15th, but the date varies in some locations). What started off as polite ritual to wash away the sins of the prior year has evolved into the '''world's largest water fight''', which lasts for three full days. Water pistols and Super Soakers are advised and are on sale everywhere. The best places to participate are [[Chiang Mai]], the [[Bangkok/Khao San Road|Khao San Road]] area in Bangkok and holiday resorts like [[Pattaya]], [[Ko Samui]] and [[Phuket]]. Be advised that you will get very wet, this is not a spectator sport. In recent years, the water-throwing has been getting more and more unpleasant as people have started splashing iced water onto each other. It is advisable to wear dark clothing, as light colours may become transparent when wet.\n\n'''Loy Krathong''' (ลอยกระทง) falls on the first full moon day in the twelfth month of the Lunar calendar, usually in November, when people head to rivers, lakes and even hotel swimming pools to float flower and candle-laden banana-leaf (or, these days, styrofoam) floats called ''krathong'' (กระทง). The ''krathong'' is meant as an offering to thank the river goddess who gives life to the people. Thais also believe that this is a good time to float away your bad luck and many will place a few strands of hair or finger nail clippings in the ''krathong''. According to tradition, if you make a wish when you set down your krathong and it floats out of sight before the candle burns out, your wish will come true. Some provinces have their own version of Loy Krathong, such as [[Sukhothai]] where a spectacular show takes place. To the North, Chiang Mai and Chiang Rai, have their own unique tradition of floating ''Kom'' or lit lantern balloons. This sight can be breath-taking as the sky is suddenly filled with lights, rivalling the full moon.\n\n'''Coronation Day''' (5 May) commemorates the crowning of the current King in 1950 (although his reign actually began on 9 June 1946 - making him not only the longest-serving monarch in Thai history, but also the world's longest-serving current Head of State).\n\nThe '''King's Birthday''' (5 December) is the country's National Day and also celebrated as Father's Day, when Thais pay respect to and show their love for His Majesty the King. Buildings and homes are decorated with the King's flag (yellow with his insignia in the middle) and his portrait. Government buildings, as well as commercial buildings, are decorated with lights. In Old Bangkok ([[Bangkok/Rattanakosin|Rattanakosin]]) in particular, around the Royal Palace, you will see lavish light displays on trees, buildings, and the roads. The '''Queen's Birthday''' (12 August) is Mother's Day, and is celebrated similarly if with a little less pomp.\n\n'''Royal Ploughing Ceremony''' (วันพืชมงคล). The old rite since ancient times to enhance the morale of farmers. To commemorate the importance of agriculture to the economy of Thailand. Ceremonies are conducted at Sanam Luang.\n\n'''Queen’s Birthday/ Mother’s Day''' (วันแม่แห่งชาติ) is on 12 Aug, the birthday of HM Queen Sirikit. \n\n'''Children’s Day''' is on the second Saturday of January in each year and has a motto for children by the Prime Minister of Thailand. Many organizations have celebrations and events for children to get a gift and toy.\n\n==Get in==\nThe Thailand eVisa will be pre launched in four test countries before the end of the year: the United Kingdom, France, China, and the United Arab Emirates.\n\nBe aware that if you have visited Thailand many times, particularly using visa-exempt entries, it is very possible that the immigration officer may suspect that you are working illegally in the country and refuse your entry. They also have the power to ask you to show 20,000 baht (or the equivalent in another currency) '''in cash''', to prove that you have money for your stay, and you will likely be sent back to the country you came from if you don't have it (they do not accept bank books, credit cards, statements, only cash). There are no ATMs air-side. You are more likely to be questioned if you visit Thailand using back-to-back visas, or if you spend more time in Thailand than you do your home country.\n\nJust bear in mind that tourist visas are for genuine tourists. If you are getting several tourist visas per year then the authorities, quite rightly, will suspect that you are not in fact a genuine tourist and you could be sent back to your country of departures. Always get the correct type of visa because the government is getting stricter about refusing entry to and removing people who are abusing their tourist visa.\n\n{{infobox|Visa exemption changes|Starting 29 August 2014, 30-day visa exemption and tourist visas can be extended for 30 days once at the nearest immigration office. According to immigration, you should bring with you an onward flight ticket, THB20,000  (some have reported the money has not been asked for), hotel booking confirmation/itinerary, passport sized photo, and application fee of THB1,900  before expiry of the initial 30 day period. Get there early, they start handing out numbers usually at 08:00.<br />More information can be found on the [http://bangkok.immigration.go.th/popup_anounce.html Thai Immigration] website.}}\n'''(A) Countries/territories that do not require a visa for stay up to 90 days:-'''\nArgentina, Brazil, Chile, Peru and South Korea.\n\n'''(B) Countries/territories that do not require a visa for stay up to 30 days: (30 days when entering by air; by land border only 14 days)-'''\nAustralia, Austria, Belgium, Bahrain, Brunei, Canada, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hong Kong, Hungary, Iceland, Indonesia, Ireland, Israel, Italy, Japan, Kuwait, Laos, Liechtenstein, Luxembourg, Macau, Malaysia, Monaco, Mongolia, Netherlands, New Zealand, Norway, Oman, Philippines, Poland, Portugal, Qatar, Russia, Singapore, Slovakia, Slovenia, Spain, South Africa, Sweden, Switzerland, Turkey, United Arab Emirates, United Kingdom, United States and Vietnam.<br /><br />However, passport holders from G7 countries may enter by land or air for 30 days, visa-free. See information from the [http://www.consular.go.th/main/th/customize/62281-Summary-of-Countries-and-Territories-entitled-for.html Ministry of Foreign Affairs].\n\n'''(C) Countries/territories that do not require a visa for stay up to 14 days or others (if indicated):-'''\nCambodia, Ukraine.\n\nThose with passports from countries not widely known, including European city-states, or have problems with document forgery, should obtain a visa in advance from the nearest Thai embassy. This is true even if visa on arrival is technically permitted. There are reports of tourists being detained using valid passports not commonly presented in Thailand. In addition, ask for a business card from the person or embassy which granted the visa, so they may be contacted on arrival, if necessary. Anyone whose nationality does not have its own embassy in Bangkok, should find out which third country represents your interests there, along with local contact information.\n\n'''Proof of onward transit:-''' long happily ignored by Thai immigration, has been known to be strictly applied in some instances (Indian passport holders beware). The requirement is for an international flight itinerary - NOT train, ferry, or other departure type.\n \nAirlines, who have to pay for your return flight if Thai immigration doesn't let you into the country, also check this and often will not let you board your flight for Thailand without it.)  A print-out of an international e-ticket on a budget airline is sufficient to convince the enforcers, but those planning on continuing by land may have to get a little creative. Buying a fully refundable ticket and getting it refunded once in Thailand is also an option. \nLand crossings, on the other hand, are a very straightforward process and proof of onward journey is generally not required (Indian passport holders beware again... or anyone, if the border officials simply decide to uphold the bureaucracy).\n\n'''Overstaying:-'''\nOverstaying in Thailand is possible with a 500 baht fine per day. Earlier it was fairly simple to avoid overstaying by doing a visa run to a neighbouring country overland or via a cheap flight, but since 12 August 2014 this will not be possible according to latest developments.\n\nStricter regulations introduced on 22 July 2014 now impose harsher penalties as a means of curbing overstaying. As can be seen from the tables, a distinction is made regarding an overstayer's circumstances. Overstayers presenting themselves to immigration officials at an airport or other border control are subject to the regulations in the first table. \n\nIn all other circumstances, overstayers will incur the much harsher penalties of being banned from re-entering Thailand for at least five years even if they overstay by just one or two days. \n\nFor example, an overstayer through no fault of their own is involved in an accident, or becomes involved in an altercation where the police are called. The first thing the police will want to see is your passport. Once it becomes apparent that you've overstayed your welcome, you're likely to be deported and banned from re-entering the kingdom for either five or ten years.  \n\n{| border=\"1\" cellspacing=\"0\" cellpadding=\"3\"\n! Departure at the airport or other border control || Penalty\n|-\n| Overstay 90-365 days || ''Forbidden to re-enter the kingdom for one year''\n|-\n| Overstay more than one year || ''Forbidden to re-enter the kingdom for three years''\n|-\n| Overstay more than three years || ''Forbidden to re-enter the kingdom for five years''\n|-\n| Overstay more than five years || ''Forbidden to re-enter the kingdom for ten years''\n|}\n<!-- Do not remove the blank table which has been used to separate the other two -->\n{| border=\"0\" cellspacing=\"0\" cellpadding=\"3\"\n!\n|-\n|\n|}\n{| border=\"1\" cellspacing=\"0\" cellpadding=\"3\"\n! Apprehended by law enforcement for any reason || Penalty\n|-\n|  Overstay less than one year || '''Forbidden to re-enter the kingdom for five years'''\n|-\n| Overstay more than one year || '''Forbidden to re-enter the kingdom for ten years'''\n|}\n\nMore information can be found on the [http://bangkok.immigration.go.th/popup_anounce.html Thai Immigration] website.\n\n===By plane ===\nThe main international airports in Thailand are at [[Bangkok]] and [[Phuket]], and both are well-served by intercontinental flights. Practically every airline that flies to Asia also flies into Bangkok, this means there are plenty of services and the competition on the routes helps to keep the ticket prices down.\n\nInternational airports are also located at [[Hat Yai]], [[Krabi]], [[Ko Samui]] and [[Chiang Mai]], though these largely restricted to flights from other Southeast Asian countries. [[Kuala Lumpur]] and [[Singapore]] make excellent places to catch flights into these smaller Thai cities, meaning you can skip the ever-present touts and queues at Bangkok.\n\nThe national carrier is the well-regarded [http://www.thaiair.com Thai Airways], with [http://www.bangkokair.com Bangkok Airways] filling in some gaps in the nearby region. Bangkok Airways offers free Internet access while you wait for boarding to start at your gate.\n\nChartered flights from and to Thailand from international destinations are operated by Hi Flying Group. They fly to Bangkok, Phuket, Ko Samui, and Udon Thani.\n\nMany low-cost carriers serve Thailand including [[http://www.nokair.com/ Nok Air]], Thai Air Asia and Thai Lion Air. See [[Discount airlines in Asia]] for an up to date list.\n\nFor a full at-a-glance list of all Thai-based carriers, see the '''[[#Thai_airlines|Thai airlines]]''' section (below).\n\n===By road ===\n'''[[Cambodia]]''' - six international border crossings. The highway from [[Siem Reap]] and the temples of [[Angkor]] via [[Poipet]] to [[Aranyaprathet]], once the stuff of nightmares, is now merely bad and can usually be covered in less than 3 hours. The border crossing at Poipet remains the stuff of nightmares, however. The Cambodian side is merely slow. The Thai side is glacial: travellers queue (outdoors in the heat) to reach a queue (in the Immigration building) - typically two and one hours, respectively. An alternative is to head to Hatlek/ Cham Yeam towards [[Koh Kong]]; that crossing is quiet and honest with good communication links.\n\n'''[[Laos]]''' - the busiest border crossing is at the Friendship Bridge across the Mekong between [[Nong Khai]] and the Lao capital [[Vientiane]]. It's also possible to cross the Mekong at [[Chiang Khong]] / [[Huay Xai]], [[Nakhon Phanom]] / [[Tha Khaek]], [[Mukdahan]] / [[Savannakhet]], and elsewhere.  \n\n* [[Vientiane]] / [[Udon Thani]] - A bus service runs from the Morning Market bus station in [[Vientiane]] to the bus station in [[Udon Thani]]. The cost is 80 baht or LAK22,000 and the journey takes two hours. The Udon Thani airport is 30 minutes by tuk-tuk from the bus station and is served by Thai Airways, Nok Air and Air Asia.\n\n'''[[Malaysia]]''' and '''[[Singapore]]''' - driving up is entirely possible, although not with a rented vehicle. Main crossings (with name of town on Malaysian side in brackets) between Thailand and Malaysia are [[Padang Besar (Songkhla)|Padang Besar]] ([[Padang Besar]]) and [[Sadao]] ([[Bukit Kayu Hitam]]) in [[Songkhla (province)|Songkhla]] province, Betong (Pengkalan Hulu) in [[Yala (province)|Yala]] province, and [[Sungai Kolok]] (Rantau Panjang) in [[Narathiwat (province)|Narathiwat]] province. There are regular buses from '''[[Singapore]]''' to the southern hub of [[Hat Yai]].\n\nIf you are driving, then depending on whether your starting point is Singapore, Kuala Lumpur or Penang, you can expect to make it to Hat Yai, Nakhon Si Thammarat and Krabi / Phuket / Ko Samui respectively on the same day. The key to this is leaving *EARLY* (7 a.m.) since border crossing formalities can take up to 2.5 hours, particularly on holiday weekends. The following is a guide to border crossing procedures at the Bukit Kayu Hitam / Sadao border crossing point.\n\nWhat you will need:\n\n1) Passports with at least six months validity\n\n2) Original car registration document - if you are in Malaysia and you have a car on loan, you can go to your financing bank and request the original for the trip. They will ask you to write a letter requesting it and then hand it over to you.\n\n3) Visa for Thailand if your nationality requires it (Malaysians and Singaporeans do not need one). Even if you are not eligible for visa-free entry, if you are crossing at the Bukit Kayu Hitam / Sadao border crossing, you can obtain a visa on arrival at the border if you are from one of the eligible countries.\n\n4) 3rd party liability coverage car insurance for Thailand - Malaysian and Singaporean car insurance does NOT extend to the territory of Thailand. The minumum legal coverage for Thailand is easily purchased in the Malaysian town of Changlun right before the border. Stop at any one of the numerous shops that have signs advertising 'Insurans'. 3rd party coverage can be bought for a minimum of MYR 17 (~SGD 6.3) which covers you for 9 days. Longer term coverage can be purchased as well if you plan on making multiple trips during a year. However, since this insurance does not cover damages to your own vehicle, you should call your insurance company and ask them for an extension of 1st party coverage to Thailand, although this is not legally required. Most insurance companies will do this on a per-trip basis. Charges may vary according to your insurance company. When you buy car insurance, many will also sell you Thai arrival / departure cards for a nominal fee of MYR 2 (SGD 0.75) for each. While these are freely available at the border, it will save you some time and hassle getting these here. The insurance agent will also fill them in for you!\n\nProcedure for crossing:\n\n1) Follow the North-South highway to its terminus at Bukit Kayu Hitam. Continue straight towards the Thailand border.\n\n2) You will first pass through a Malaysian immigration checkpoint. You do not need to get out of your car here, regardless of nationality. Just drive up to the window and hand over the passports for yourself and all passengers in the car as well the car registration document. Once they are scanned / stamped and handed back to you, continue driving ahead.\n\n3) The next checkpoint is a Malaysian customs checkpoint, but there is a gap of about a kilometer between the Malaysian immigration and Malaysian customs checkpoints. In this gap, on the left, there is a duty-free shopping complex. It might be worth stopping here on the way back since goods here are somewhat cheaper than at Malaysian supermarkets and no GST is charged here. Again, at the Malaysian customs checkpoint, you do not need to get down from the vehicle. Just drive up to the window and hand over your documents. Assuming that you have no contraband and nothing to declare, you will be waved through.\nNow this part is a bit tricky ...\n\n4) Immediately after the Malaysian customs checkpoint, you will pass a border stone indicating that you are now in Thailand. To your left, there will be a large parking lot. Go ahead and park your vehicle there and come outside with your documents (Passports, car registration and car insurance).\n\n5) Stand in the Immigration and Borderpass lines to clear immigration. You can *only* stand in these lines if you are of Malaysian, Singaporean, Thai, or other nationality that does not require a visa for entry to Thailand. If you require a visa on arrival or if you have a stamped visa from the Thai embassy, you must go into the office on the left to get your immigration stamp. However, since the queues at the Immigration and Borderpass lines are longer than the crowd inside the office, you'll probably finish your immigration formalities faster than if you were of a nationality that does not need a visa for entry to Thailand!\n\n6) Once the immigration stamp has been provided, take your documents to the Customs window (right in front of the Immigration and Borderpass windows). Hand over your passport and car registration (and insurance, if they ask for it) to the Customs agent and they will provide you with a temporary import permit for your vehicle. This import permit is valid for ONE MONTH and you must have this permit in order to take your vehicle out of Thailand, so protect it as carefully as you would your passport. The import permit has some scary looking words in it, such that you will pay a fine of THB 1,000 per day for every day beyond the expiry of this import permit for a maximum of 10 days, and then THB 1,450,000 if you keep your vehicle in Thailand beyond that! Don't worry about those scary words, as long as you don't overstay your visa and leave within 30 days with your vehicle, you will face no problems whatsoever. The temporary import permit is provided freely for no charge.\n\n7) Once you have cleared immigration formalities and collected your vehicle import permit, walk back behind these booths you just passed to the parking lot. Collect your car now and then drive past those very same booths. You may or may not get stopped by a Thai officer for documents checking, so it is imperative that you complete the procedures mentioned above. It would be very easy to drive into Thailand without either getting an immigration stamp or a vehicle import permit, which may complicate matters for you upon your exit.\n\n8) Set your clocks back an hour since Thailand time is one hour behind Malaysia / Singapore time. Drive into Sadao and further into Thailand! Enjoy your stay and drive safely!\n\n'''[[Myanmar]]''':\n\n* [[Mae Sai]] / [[Tachileik]] - foreigners can access this crossing from either side, and enter and/or exit either country here; onward travel restrictions: since Oct 2009, onward travel by land to Kengtung is only possible if accompanied by an official guide (1,000 baht/day + expenses), exiting Myanmar at Tachilek is only possible for those who entered at this border crossing and were issued a 14-day entry permit; to get to Tachileik or [[Kengtung]] from the rest of Myanmar, a domestic flight must be taken (eg from [[Heho]]). \n\n* [[Mae Sot]] / [[Myawaddy]] - This border crossing was closed in July 2010 and re-opened [http://www.dvb.no/news/key-myawaddy-border-crossing-reopens/19055 on 5 December 2011]. When open, foreigners can only access this crossing from the Thai side; neither onward travel into Myanmar (ie beyond the Burmese border town of Myawaddy) nor overnight stays are possible. No visa is needed; instead there's an entry stamp fee: USD10 if paid in dollars, more (500 baht) if paid with Thai currency.\n\n* [[Three Pagodas Pass]] ([[Sangkhlaburi]] / [[Payathonzu]]) - foreigners can only access this crossing from the Thai side; onward travel into Myanmar (ie beyond the border town) is not possible; entry/exit stamps are NOT issued here, and foreigners passports are held at the Myanmar checkpoint, where a fee is levied: USD10 if paid in dollars, more (500 baht) if paid with Thai currency. However, as of November 25, 2008, this crossing is temporarily closed.\n\n* [[Ranong]] / [[Kawthoung]] - foreigners can access this crossing from either side, and enter and/or exit either country here; no onward travel restrictions (other than those that apply to everyone, no matter how they enter); access to/from Kawthoung is by sea ([[Mergui]]/[[Dawei]] & [[Yangon]]) and air (Mergui & Yangon). If entering without a visa, maximum stay is 3 days / 2 nights, travel beyond Kawthoung is not permitted, and there's an entry stamp fee: USD10 if paid in dollars, more (500 baht) if paid with Thai currency.\n\n===By train ===\nThailand's sole international train service links to [[Butterworth]] (near [[Penang]]) and [[Kuala Lumpur]] in [[Malaysia]], continuing all the way to [[Singapore]]. Tickets are cheap even in first class sleepers, but it can be a slow ride; the 2-hour flight to Singapore will take you close to 48 hours by rail, as you have to change trains twice. The luxury option is to take the [http://www.easternandorientalexpress.com '''Eastern & Oriental Express'''], a refurbished super-luxury train that runs along the same route once per week, with gourmet dining, personal butler service and every other colonial perk you can think of. However, at around USD2200 one-way just from Bangkok to Kuala Lumpur, this is not exactly a budget friendly route!\n\nWhile you can't get to [[Laos]] or [[Cambodia]] by train, you can get very close, with rail terminals just across the border at [[Nong Khai]] (across the river from [[Vientiane]]) and [[Aranyaprathet]] (for [[Poipet]], on the road to [[Siem Reap]]). A link across the Mekong to Laos opened in March 2009, but service to Cambodia remains on the drawing board.\n\nThere are no rail services to [[Myanmar]], but the Thai part of the infamous Burma Death Railway is still operating near [[Kanchanaburi]].\n\n===By ferry ===\nIt is now possible in high-season (Nov-May) to island-hop using ferries from Phuket all the way to Indonesia. This can now be done without ever touching the mainland, '''Phuket (Thailand) to Padang (Indonesia)'''. \n\n'''Islands en route:'''\n\n*Ko Phi Phi\n*Ko Lanta\n*Ko Ngai\n*Ko Mook\n*Ko Bulon\n*'''[[Ko Lipe]]'''-''Ko Lipe is a hub on the border between Thailand and Malaysia and has a Thai immigration office.''\n* Langkawi- Malaysian immigration here.\n*Penang\n\n''Thai portion can be done in a day.'' \n\nFerries cross from [[Satun]] in southern Thailand to the Malaysian island of [[Langkawi]], while over in [[Narathiwat (province)|Narathiwat]] Province, a vehicular ferry shuttles between [[Tak Bai]] and Pengkalan Kubur, near [[Kota Bharu]] in Malaysia's [[Kelantan]] state.\n\nThere are also occasional cruises from [[Malaysia]] and [[Singapore]] to [[Phuket]] and [[Bangkok]], the main operator being [http://www.starcruises.com Star Cruises], but no scheduled services.\n\n==Get around==\n\n===By plane===\nThailand is a large country, and if sitting in a bus for 11 hours is not your idea of a fun time, you may well want to consider domestic flights. Never terribly expensive to begin with (at least by Western standards), the deregulation of the industry has brought in a crop of new operators: with a little research, it's possible to fly pretty much anywhere in the country for less than 2,000 baht. Various taxes and (often hefty) surcharges are invariably added to the \"advertised\" prices.\n\nFor the benefit of passengers arriving on international flights who intend to fly to another destination using a budget airline, there is a [http://suvarnabhumiairport.com/en/122-transfer-bus-between-suvarnabhumi-don-mueang free shuttle bus] which connects Bangkok Suvarnabhumi Airport with the budget terminal at Don Mueang Airport. The bus departs from the 2nd Floor, Gate 3 and runs hourly in both directions starting at 05.00 with the last bus departing from both terminals at midnight. As you exit Gate 3, turn right. The bus has an orange colour scheme and is the only one which stops at that location so you won't have any trouble finding it. \n\nFrom Don Mueang Airport, the bus departs from the 1st floor. You have to be a little careful here and make sure you get on the correct bus which will have a sign on the dashboard saying \"Suvarnabhumi Airport\" on it. The shuttle bus doesn't have a conductor, so if you get on another bus with the same colour scheme, but there's a conductor on it issuing tickets, you're on the wrong bus!\n\nDuring off-peak hours, the journey takes approximately 40 minutes, but add another 30 minutes to that if you're going to be travelling during the rush hour. It's a pleasant trip though and the vehicle is fully air-conditioned. \n\nThe driver will want to see the ticket for your onward flight, so keep that handy when boarding. \n\n====Thai airlines====\nAsian low cost carrier[http://www.airasia.com '''AirAsia'''] has coverage of international and domestic routes in Thailand and offers discounted tickets if booked well in advance; however, prices rise steadily as planes fill up. It's sometimes even cheaper than bus or train, if booked at least a week or two in advance. They fly A320s from [[Bangkok]] to a number of places domestically, as well as cities across Southeast Asia and China. ]. On-line booking is straightforward and can be done even using the mobile phone, but must be done at least twenty-four hours in advance; ticket sales at the check-in desk close one hour before the departure time.\n\n[http://www.bangkokair.com '''Bangkok Airways'''] promotes itself as \"Asia's Boutique Airline\", and has a near monopoly on flights to its own airports at [[Ko Samui]] (now shared with Thai Airways), [[Sukhothai]] and [[Trat]]. More expensive and the posh option; however, their [http://www.bangkokair.com/discovery-airpass/index.php Discovery Airpass] with fixed per segment rates can be good value, especially if used to fly to [[Siem Reap]], ([[Cambodia]]) or [[Luang Prabang]], ([[Laos]]). Note that the Discovery Airpass can now only be purchased from abroad.\n\n[http://www.nokair.com '''Nok Air'''] took to the skies in 2004 sporting graphic paints scheme with a bird's beak painted on the nose. 39% owned by Thai Airways, they compete with Air Asia on price and, with a very comprehensive domestic network, are a good choice overall.  In 2014 they became the number one domestic carrier in terms of passengers carried and will commence a new regional airline '''NokScoot''' with joint venture partner Singapore Airlines.\n\n[http://www.fly12go.com '''Orient Thai'''], previously '''One-Two-Go''', is easily the dodgiest of Thailand's main carriers, flying a ragtag bunch of ancient planes with a poor safety record, including a crash in Phuket in 2007 that killed 90 people.  The fleet has been grounded on and off, but as of late-2010 they're flying again.  Unlike most LCCs, their ticket prices don't change much, meaning they're often the cheapest option for last-minute flights, if you are not afraid. If you're tall (above 6 feet), get an exit row seat unless you want to ride the whole flight with your knees resting against the seat in front.\n\n[http://www.thaiair.com '''Thai Airways'''] is a full service airline, but usually more expensive than the alternatives (look for their promotions, though). Travel agents often sell only Thai Airways or  Bangkok Airways tickets; you can also book on-line. Thai Airways is a member of Star Alliance; all domestic flights, except some promotional fares, give at least 500 Star Alliance miles, which may (partially) compensate the price difference.\n\n[http://www.thaismileair.com/ '''Thai Smile'''] is Thai Airway's answer to the threat to its business posed by the various budget airlines which have mushroomed in Thailand - a premium budget airline, if that is not an oxymoron. Although fares can hardly be considered to be 'budget orientated', they are a little bit cheaper than the parent company and  worth considering since they fly from the main international terminal at Suvarnabhumi Airport. In September 2014 Thai Smile moved a number of its flights to Don Mueang Airport.\n\n[http://www.jetairways.com/EN/TH/Home.aspx '''Jet Asia Airways'''] is a Thai airline based out of Suvarnabhumi International Airport in Bangkok, Thailand. The fleet is composed exclusively of Boeing 767 aircraft focusing on the Asian charter market. \n\n\n===By train ===\n[[Image:Thailand_rail_map.gif|frame|SRT railway network]]\n\n[http://www.railway.co.th/main/index_en.html '''State Railway of Thailand'''] (SRT) has a 4,000km network covering most of Thailand, from [[Chiang Mai]] in the north all the way to (and beyond) the [[Malaysia]]n border in the south. Compared to buses, most trains are relatively slow and prone to delays, but give different travel feeling and a bit more freedom on the move.  You can pick up fruits, snacks and cooked food from hawkers at most stations.\n\nPoint-to-point fares depend on the type (speed) of the train and the class of the carriage. There are three main classes:\n\n* '''First class''' (''chan neung'') 2-berth sleeping compartments with individually regulated air conditioning are available on some trains, but prices are sometimes matched by budget airfares. Prices are at about ~$50 for a overnight trip (BKK-Chiang Mai or Suratthani), there are 2 berth compartments and some routes feature single-berth compartment in an ex-japanese railcar (these compartments are usually booked long in advance).\n\n* '''Second class''' (''chan song'') is a good compromise, costing about the same as 1st class buses (and about 2 times cheaper than 1st class) and with a comparable level of comfort. Some 2nd class trains are air-con, others aren't; air-con costs a little more, but much colder at night. Second class sleeper berths are comfortable and good value, with the narrower upper bunks costing a little less than the wider lower bunks. Food and WCs are basic. 2nd class Express Railcar trains have reclining seats and refreshments are included in the fare; unlike all other Thai passenger trains, they can match buses for speed, but cannot carry bicycles.\n\n* '''Third class''' (''chan saam'') is ''the'' cheapest way to travel in Thailand, with virtually nominal fares, and can be great fun. Some 3rd class trains have wooden seats, others are upholstered; some services can be pre-booked, others cannot; refreshments are available from hawkers who roam the aisles. 3rd class trains are slow and not convenient for long distances, but give a distinct feeling of traveling by a classic train.\n\nPre-booking is recommended, especially for sleeper berths.  While SRT's official '''E-Stars''' site [http://thairailticket.com] is no more since Jan'2013, there are a few agencies that can get you a ticket for a service fee (~200 baht/ticket + pickup at the office), or you can reserve with SRT directly by e-mail at 'passenger-ser@railway.co.th' for a 200 baht/booking surcharge. Alternative way is '''12Go''' ([https://12go.asia/?z=55111 ''12go.asia'']) and '''Baolau''' ([https://www.baolau.com/''Baolau'']) though they only book trains starting from Bangkok and Chiang Mai only.\n\nFull information regarding routes, timetables, and up-to-date ticket costs along with interesting videos can be found at [http://seat61.com/Thailand.htm seat61].\n\n===By road ===\nThailand's roads are head and shoulders above its neighbours [[Myanmar]], [[Laos]] and [[Cambodia]], but driving habits are still quite dangerous. '''Drunk driving''', '''speeding''' and '''reckless passing''' are depressingly common, and bus and taxi drivers (especially for private companies) work inhuman shifts and often take drugs to keep themselves awake, with predictable and tragic results.  It's common for motorbikes &mdash; even police! &mdash; to drive close to the curb '''on the wrong side of the road'''. Death tolls sky-rocket around major holidays, especially Songkhran, when bystanders often throw water on passing cars and bikes. Many drivers don't use headlights at night, multiplying risks, and it is wise to '''avoid or minimize overnight travel''' by road.\n\nNote that unlike in its neighbours (except Malaysia), traffic moves on the left side of the road in Thailand and Thai cars are generally right-hand drive. All official road directional signs are written in both Thai and English.\n\nMost major roads are marked in both Thai and English, and traffic culture is not as bad as some might lead you to believe. Keep a sharp lookout in both mirrors for passing traffic including 18-wheelers and scooters.\n\nTraffic on major highways is at 100-120km/h, while smaller highways are generally 80km/h. Gas stations are common and most Thai are more than willing to give directions in spite of any language barriers. \n\nDrive very defensively at first and watch what the locals do. Of course, it helps if you are accustomed to driving on the left side of the road, which in itself could be enough to distract some drivers. \n\nDriving under the influence of alcohol is both illegal and dangerous, and driving at night also increased the risk of accidents — even if you're sober, many others aren't.\n\nFuel at large petrol stations is around 25 baht/litre. Small kerbside vendors who pump by hand from drums and/or pour from bottles charge a few baht more.\n\n====Bus====\n{{infobox|VIP? Very Inferior Product|Travel agencies, particularly those on Bangkok's [[Bangkok/Khao San Road|Khao San Road]], are keen to sell you '''VIP''' bus tickets. These are more often than not cramped minibuses that will do their best to arrive late, often by breaking down right next to a conveniently located restaurant, and sell you to the guesthouse that gives them the highest commissions. Theft, particularly on routes to the south, is also a major problem. Thais never use them, opting for public BKS buses instead - and you should too.}}\n\nBuses travel throughout the country and the government's bus company '''BKS''' (บขส ''Baw Kaw Saw''), known in English simply as the [http://www.transport.co.th/ The Transport Company], has a terminal in every province of any size. If the Transport Company's website is difficult to read, try [http://www.sawadee.com/thailand/transfer/ Sawasdee's bus timetables].\n\nGenerally speaking, BKS buses are the best option for both price and comfort.  There are also private buses sanctioned by BKS, which operate on the same routes from the same terminals with the same fares, and these are also fine.  The ones to watch out for are the illegal bus companies, which operate from tourist areas (especially [[Bangkok/Khao San Road|Khao San Road]]) and subsidize slightly cheaper tickets with worse amenities, schedules and safety.  In particular, beware of non-government \"VIP\" buses, which often turn out to be cramped minivans - and you'll only find this out after paying in advance.\n\nThe basic BKS bus types are:\n\n[[Image:ChiangSaen Bus Outside.JPG|thumb|Local bus, [[Chiang Saen]]]]\n[[Image:ChiangSaen_Bus_Inside.JPG|thumb|The same bus on the inside]]\n\n* '''Local''' - relatively slow, can be cramped when full (nevertheless there's always room for one more), and stop at every village and cowshed along the way. Many are of larger '''''[[Thailand#Songthaew|songthaew]]''''' flavour. Not suitable for long-distance travel, but may be the only cheap way to get around locally. \n\n*'''Express''' (''rot duan'') - skip some stops, but no other frills. Identifiable by their orange colour. Size varies, with the largest having around 65 seats (five seats per row) as well as an open space across the width of the bus by the back door for you to sling your backpack, bicycle, sack of rice, live chickens, etc.\n\n*'''Second class''' (''chan song'') - skip more stops, but often take a less direct route than 1st class / VIP / S-VIP. Blue and white with an orange stripe, usually 45-48 seats per bus, air conditioned (some provide blankets, some do not).  Most have no on-board toilet, although the frequent stops mean this isn't a problem.\n\n*'''First class''' (''chan neung'') - generally take the most direct routes and make very few stops. Blue and white in colour, air conditioned, blanket usually provided, fewer (larger, longer pitch) seats (typically 40, but some double-decker types seat 60+), snack and drinking water included.  Toilet on board for all but the shortest services.\n\n* '''\"VIP\"''' - as per 1st class, but with only 32-34 seats, which have more leg room and recline further. Basic meal included and freshly laundered shrink-wrapped blanket provided. Also blue and white (or sometimes blue and silver) but usually signed \"VIP\".\n\n* '''\"S-VIP\"''' - Super-VIP is very similar to VIP, except there are only 24 seats, which are wider - the aisle is offset, each row having a pair of seats on the right and only a single seat on the left. Primarily used on overnight services.\n\nSome buses may have TVs and sound systems blaring, so earplugs are well worth having, just in case.  On long-haul buses, if your ticket allocates you a front seat, you may have to switch seats if a monk boards.\n\n====Songthaew====\n[[Image:Yellow Songthaew.JPG|thumb|upright=1.3|A typical rural ''songthaew'' in [[Mae Salong]]]]\n\nA '''songthaew''' (สองแถว) is a truck-based vehicle with a pair of bench seats in the back, one on either side &mdash; hence the name, which means \"two rows\" in Thai. In English language tourist literature, they're occasionally called \"minibuses\". By far the most common type is based on a pick-up truck and has a roof and open sides. Larger types start life as small lorries, and may have windows, and an additional central bench; smaller types are converted micro-vans, with a front bench facing backwards and a rear bench facing forwards.\n\nSongthaews are operated extensively as local buses (generally the most economical way to travel shorter distances) and also as taxis; sometimes the same vehicle will be used for both. Be careful if asking a songthaew to take you to some place if there is nobody in the back, the driver might charge you the taxi price. In this case, check the price of the ride before embarking.\n\n==== Tuk-tuk (ตุ๊กๆ) ====\n[[Image:Tuktuk3.JPG|thumb|upright=1.3|Tuk-tuks on the prowl, [[Bangkok]]]]\n\nThe name '''tuk-tuk''' (pronounced more similarly to ''dtuke dtuke'' with a high tone) is used to describe a wide variety of small, lightweight vehicles. The vast majority have three wheels; some are entirely purpose-built (eg the ubiquitous Bangkok tuk-tuk), others are partially based on motorcycle components (primarily engines, steering, front suspension, fuel tank, drivers seat). A relatively recent development is the four-wheeled tuk-tuk (basically a microvan-songthaew) as found in [[Phuket]].\n\nBe cautious if your ''tuk-tuk'' driver is offering to show your secret/hidden places or want to leave you at a jewelry store as this is a infamous tourist scam. Be wary of your bags and phone while riding as other motorcyclists have been known to occasionally steal loose items while passing by.\n\n====Taxi====\nMetered taxis are ubiquitous in [[Bangkok]] and are starting to become more popular in [[Chiang Mai]], but rare elsewhere in the country. When available, they are an excellent means of transport - insist on the meter. Beware of taxis which idle around touristy areas and wait for people. They are looking for a tourist who will take their taxi without using a meter. Always use the meter! If you have difficulty finding a cooperative taxi driver, just walk a few hundred meters beyond the idling taxis and your chances will improve dramatically.\n\nUber existed in Thailand until April 2018, but since then the only similar service is Grab. The Grab app works somewhat similarly to Uber, and allows you to hail a motorbike, a regular taxi, an Uber-like private car, or a premium vehicle such as a 7-passenger SUV. Many of the former Uber drivers continued to work as Grab drivers after the merger, and they now provide their service under the Just Grab service name, along with regular taxis. Grab is convenient when you don't see any taxi near you and you need one - all you need is the app on your phone with data connection. It is also helpful because you can enter your destination, which helps to skirt any language barrier, and you will not need to negotiate a price with taxi drivers who refuse to use the meter, or who refuse to drive to your destination. Grab supports the option of paying by cash by default, but if you prefer you can add your credit card to your profile and have your fare automatically billed.\n\n====Motorbike====\nAs is the case throughout virtually all of Asia, motorcycles (''motosai'') are the most common form of transport overall; the most popular type are the 100cc-125cc step-through models. These are very widely used as taxis, with fares starting from as low as 10 baht. Negotiate the fare with the driver before using his service otherwise you may be charged more than you expect.\n\nMotorcycles can be rented without difficulty in many locations. While rates can vary dramatically from one location to another, prices generally start at around 125 baht/day for recent 100-125cc semi-automatic (foot operated gear change, automatic clutch) step-through models, 150 baht/day for fully automatic scooters; larger capacity models can also easily be found, although the rates reflect the risks - up to around 2500 baht/day for the very latest model high capacity sport bikes, such as the Honda CBR1000RR. In all cases, lower prices will apply if paying upfront for more than a week or so; in some cases, long-distance travel may be prohibited. Motorcycle rentals do not include insurance, and both motorcycling accidents and motorbike thefts are common.\n\nMany places will rent to you without requiring a license, but legally speaking you '''must''' have a valid Thai license or International Driver's Permit.   Often a deposit will be required; sometimes a passport photocopy, or even the passport itself (don't do this- bargain to leave some baht instead), will be requested. Helmets are normally included, but are usually ultra-basic models with very flimsy chin-strap fasteners - if you're intending to travel by motorcycle and have a good quality helmet at home, then bring it with you. If supplied a helmet with a chin-cup (many cheap rental helmets are), slide the cup up the strap out of the way and securely fasten the bare strap directly under the jaw, as this is much safer.\n\nInsurance is usually not included (or even available), so try to ensure in advance that the insurance you leave home with is going to cover you; alternatively, arrange cover with an insurance broker locally in Thailand.  If you rent a vehicle without insurance and it's damaged or stolen, the bottom line is that you will be required to '''pay in full''' the cost of repairing or replacing it.  Furthermore, some travel insurance policies will only provide medical cover in the event of an accident if you hold a motorcycle license in your home country.\n\nMotorcyclists (including passengers) are required to wear crash helmets and to keep their headlights switched on at all times.  Enforcement varies widely, but in tourist areas spot checks for helmets and/or licences are commonplace. While the fines are light (typically 400 baht) the inconvenience can be considerable as offender's vehicle is impounded until the fine is paid, and the queue at the police station can be lengthy.\n\nSome (but not all) border crossings allow motorcycles through. At those which do, documentation including proof of ownership must be produced (with the possible exception of day visits to [[Payathonzu]], [[Myanmar]] via [[Three Pagodas Pass]]).\n\n====Rental car====\nRenting a car to explore on your own is a cost-effective way of getting off the beaten track, and avoids the constant hassle of haggling with local taxi or tuk-tuk drivers. Renting a car usually costs about 1200-1500 baht if you want to go for an economical one like a Toyota Vios. \n\nDriving your own car in Thailand is not for the faint-hearted, and many rental companies can supply drivers at a very reasonable price. Prices without insurance for a self-driven car start from around 900 baht/day for small cars, and from as little as 570 baht/day for the increasingly rare open-top Jeep; cars with insurance start at just under 1000 baht/day, and come down to around 5,600 baht/week or 18,000 baht/month.\n\nMost of the national companies can be found in Thailand together with some reputable local car rental companies, which are often a little cheaper. Cars can be rented without difficulty in many locations. It may be worth paying a little more than the absolute minimum to use one of the international franchises (eg Avis, Budget, and Hertz) to minimize the risk of hassles, and to ensure that any included insurance is actually worth something.\n\nMore reputable agencies require that valid licences be produced: foreigners who do not have a Thai driving licence '''must carry a valid International Driving Permit'''.  Even if you manage to rent a car without an IDP, not having one will invalidate the insurance and count against you in the event of an accident.\n\nA common rental scam involves the owner taking a deposit, and then later refusing to refund it in full on the basis that the customer is responsible for previous damage; the Tourist Police (dial 1155) may be able to help.  Another common scam involves the owner having someone follow the rented vehicle and later \"steal\" it, using a set of spare keys. Always report thefts: a \"stolen\" vehicle may mysteriously turn up as soon as the police become involved.\n\n===By boat ===\n[[Image:AoNang Longtails.JPG|thumb|240px|Long-tail boats, [[Ao Nang]], [[Krabi (province)|Krabi]]]]\n\nOne of the Thais' many names for themselves is ''jao naam'', the Water Lords, and from the river expresses of [[Bangkok]] to the fishing trawlers of [[Phuket]], boats remain an indispensable way of getting around many parts of the country.\n\nPerhaps the most identifiably Thai boat is the '''long-tail boat''' (''reua hang yao''), a long, thin wooden boat with the propeller at the end of a long 'tail' stretching from the boat. This makes them supremely manoeuvrable even in shallow waters, but they're a little underpowered for longer trips and you'll get wet if it's even a little choppy. Long-tails usually act as taxis that can be chartered, although prices vary widely - figure on 300-400 baht for a few hours' rental, or up to 1500 for a full day. In some locations like [[Krabi]], long-tails run along set routes and charge fixed prices per passenger.\n\nModern, air-conditioned speedboat services, sometimes ferries (departure every 30min) also run from the [[Surat Thani (province)|Surat Thani]] to popular islands like [[Ko Samui]] and [[Ko Pha Ngan]]. Truly long-distance services (eg Bangkok to any other major city) have, however, effectively ceased to exist as buses, planes and even trains are faster. Safety measures are rudimentary and ferries and speedboats do sink occasionally, so avoid overloaded ships in poor weather, and scope out the nearest life jackets when on board.\n\n====[http://en.wikipedia.org/wiki/BTS_Skytrain BTS_Skytrain]====\nAlmost everyone in Bangkok uses the Skytrain to avoid the roads' traffic jam. \nThe Bangkok Mass Transit System, known as the BTS Skytrain (Thai: รถไฟฟ้าบีทีเอส rot fai fa BTS), is the rapid transit system in Bangkok. The system of stations features 34 stations and two lines. The first line is the Sukhumvit Line, which runs from the north to the south on the east side of the country (Terminal stations are at Mo Chit and Bearing). The second line is the Silom Line, which travels along Silom and Sathon Roads. The Central Station of Bangkok has one station for each line, with terminal stations at the National Stadium and Wongwian Yai. The lines interchange at Siam Station, where you can change to the MRT or change line on the BTS. The system is formally known as the Noble Train in Celebration of HM the King's 6th Cycle Birthday.\nFor more information of BTS ticket fare ans route map, see http://www.bts.co.th.\n\n===By MRT===\n===By Airport Link===\n===By Van===\n\n==See==\n{{infobox|Wats for dummies|A Thai temple is known as a wat. Usually a temple does not consist of one building, but is a collection of buildings, shrines and monuments enclosed by a wall. There are thousands of temples in Thailand, and nearly every town or village has at least one. The word \"wat\" (วัด) literally means school, and the temple has been the only place where formal education took place for centuries. A typical Buddhist wat consists of the following structures:\n\n* '''Bot''' — The holiest prayer room, usually only open to the monks. It is architecturally similar to the viharn, but is usually more heavily decorated and it has eight cornerstones to ward off evil. It is also known as the \"ordination hall\" as it is where the monks take their vows.\n\n* '''Viharn''' — Usually the busiest room in a wat, it is where the temple's main Buddha image is and where people come to make offerings. It is open for everyone.\n\n* '''Chedi''' or '''stupa''' — A tall bell-shaped structure that generally houses relics of the Buddha.\n\n* '''Prang''' — A finger-like spire of Khmer and Ayutthayan origin that serves the same religious purpose as a chedi.\n\n* '''Mondop''' — An open, square building with four arches and a pyramidal roof. It is often used to worship religious texts or objects.\n\n* '''Sala''' — An open-sided pavilion that is used for relaxation and as a meeting place (and often used as a shelter for rain).\n\n* '''Chofah''' — Bird-like decorations on the end of temple roofs. They are meant to represent the Garuda, a mythical creature that is half-bird, half-man.}}\n\n\n===Historical and cultural attractions===\n[[Bangkok]] is at the start of many visitors' itineraries, and while a modern city, it has a rich cultural heritage. Most visitors at least take in the Grand Palace, a collection of highly decorated buildings and monuments. It is home to Wat Phra Kaew, the most sacred Buddhist temple in Thailand that houses the Emerald Buddha. Other cultural attractions include Wat Pho, Wat Arun and Jim Thompson's House, but these are just a fraction of possible sights you could visit.\n\nThe former capitals of Siam, [[Ayutthaya]] and [[Sukhothai]], make excellent stops for those interested in Thai history. The latter could be combined with a visit to [[Si Satchanalai]] and [[Kamphaeng Phet]], all of which are [[UNESCO World Heritage List|UNESCO World Heritage Sites]]. Khmer architecture is mostly found in Isaan, with the historical remains of [[Phimai]] and [[Nang Rong|Phanom Rung]] being the most significant.\n\nIn the northern provinces live unique hill-tribe peoples, often visited as part of a trekking. The six major hill tribes in Thailand are the Akha, Lahu, Karen, Hmong, Mien and Lisu, each with a distinct language and culture. [[Chiang Mai]] makes a good base for arranging these trekkings, and has some cultural sights of its own, such as Wat Doi Suthep.\n\nFor those interested in recent history, [[Kanchanaburi]] has a lot of sights related to World War II. The Bridge over the River Kwai, popularised by the film of the same name, is the most famous one, but the museums in its vicinity are a lot more moving.\n\n===Beaches and islands===\n[[Image:Chaweng Beach13.JPG|thumb|350px|[[Chaweng]] at dusk, [[Ko Samui]] ]]\n\nThailand's beaches and islands attract millions of visitors each year from all over the globe. [[Hua Hin]] is Thailand's oldest beach resort, discovered by King Rama VII in the 1920s as an ideal getaway from Bangkok. Things have considerably changed since then. While [[Pattaya]], [[Phuket]] and [[Ko Samui]] were only discovered in the 1970s, these are now by far the most developed beach resorts.\n\nThe [[Chumphon Archipelago]] has a great selection of islands from touristic to unspoilt. Using [[Chumphon]] as a gateway, the islands of [[Ko Tao]], [[Ko Nang Yuan]], [[Ko Phangan]] and [[Ko Samui]] can be reached by high speed catamaran. The archipelago also includes 2 marine national parks, Mu Ko National Park and [[Ang Thong National Marine Park]]\n\n[[Krabi Province]] has some beautiful spots, including [[Ao Nang]], [[Rai Leh]] and the long golden beaches of [[Ko Lanta]]. [[Ko Phi Phi]], renowned as a true paradise island, has been undergoing massive development since the release of the film ''The Beach'' in 2000. [[Ko Pha Ngan]] gives the best of both worlds, with well-developed beaches and empty ones a short ride away.\n\n[[Ko Chang]] is a bit like [[Ko Samui]] used to be, it has a backpacker vibe, but is fairly laid-back and there is accommodation in all price ranges. If you're looking for unspoiled beaches, [[Ko Kut]] is very thinly populated, but also difficult to explore. [[Ko Samet]] is the closest island beach to Bangkok, but its northern beaches are quite developed and hotels are full on weekends and public holidays.\n\n===Natural scenery===\nWhile not as beautiful as Malaysia or Indonesia, Thailand does have its fair share of '''tropical forest'''. [[Khao Yai National Park]], the first national park of Thailand, is the closest to Bangkok. Wild tigers and elephants are increasingly rare, but you can't miss the macaques, gibbons, deer, and species of birds. The stretch of jungle at [[Khao Sok National Park]] is probably even more impressive, and you can spend the night in the middle of the jungle.\n\n'''Waterfalls''' can be found all over Thailand. The Heo Suwat Waterfall in [[Khao Yai National Park]] and the 7-tiered Erawan Falls in [[Kanchanaburi]] are among the most visited, but the Thee Lor Sue Waterfall in [[Umphang]] and the 11-tiered Pa La-u Falls in [[Hua Hin|Kaeng Krachan National Park]] are equally exciting. Finally, the gravity-defying '''limestone formations''' of the [[Phang Nga Bay]] shouldn't be missed by anyone who stays in the region.\n\n===Itineraries===\n* [[Chiang Mai to Chiang Rai in 3 days]] — three-day tour through undiscovered Northern Thailand\n* [[Five days in the Golden Triangle]] — a five-day tour of the Golden Triangle region through Thailand, Laos and Myanmar\n* [[Mae Hong Son Loop]] — the popular route right through the mountains of Mae Hong Son Province\n* [[One day in Bangkok]] — if you have just one day to spare and want to catch a feel for the city\n* [[One weekend in Bangkok]] — for attractions that only open in weekends\n* [[Rattanakosin Tour]] — a quick tour along Bangkok's famed historic district\n* [[Yaowarat and Phahurat Tour]] — a full-day walking tour through this multicultural district\n\n==Do==\n===Pampering===\nIn Thailand, massage is viewed as much more than the physical treatment it often is in the West; it draws on a number of traditions from neighboring countries – including India and China – and has much more of a philosophical, psychological basis. In particular, it combines elements from reflexology, acupressure, and assisted yoga into one all-encompassing method that does much more than simply relax muscles and alleviate pain.\n\nFor those who know and appreciate Thai massage – Thais and foreigners – ongoing regular sessions are an important part of their lives, and these massages help alleviate stress and tension, calm one’s mood, restore a sense of balance to one’s life, and invigorate and rejuvenate one’s body. Sessions are quiet, peaceful, and meditative, and a sense of trust and bonding develops between the massage therapist and the client that is an important part of the process. Regular appointments with a compatible therapist are best for optimum results. \n\nAlthough '''spas''' in Thailand did not take off for tourists until the early 1990s, it quickly became apparent that this was an industry tailor made for the Kingdom. Given that there already existed a very deep an extensive knowledge of natural remedies and herbal properties, it was a logical step to make this knowledge available to tourists in venues and locations that were amenable to this market. \n\nSpas and wellness centres now exist throughout Thailand, with the larger and more exclusive ones concentrated in the main tourist destinations of [[Bangkok]], [[Pattaya]], [[Phuket]], [[Koh Samui]], [[Chiang Mai]], and [[Hua Hin]]. That said, almost any town or hotel of any size will offer some type of massage, sauna, or spa treatment, which adds great value for tourists to traveling throughout Thailand. \n\nThailand has quickly become one of the highest ranking spa destinations in the world. Besides traditional Thai massage, there is a phenomenal variety of international treatments, including aromatherapy, Swedish massage and many others. There is usually an option for every budget, varying from extravagant wellness centres in the five star hotels to the ubiquitous little massage shops found on many street corners.\n\n===Outdoors===\nThailand's a big enough country that you can find a place to practice almost any outdoor sport. [[Ko Tao]] is becoming one of Asia's great '''[[Scuba diving]]''' centres, while the [[Ang Thong National Marine Park]] near [[Ko Samui]] and the [[Similan Islands]] also draw the crowds. One of the newest hot spots for diving is [[Ko Lipe]], a small island that is amazingly unspoilt with great reefs and absolutely stunning beaches. '''Snorkeling''' can be done at pretty much at every beach, but coral reefs of the [[Similan Islands]] stand out as particularly worthwhile.\n\nWhile Thailand does not match surf paradises like Bali, '''surfing''' does have its place. The waves are generally small, good for '''longboarding''' and those wanting to learn to surf. [[Khao Lak]] and [[Phuket]]'s west coast beaches are among the better ones, but the best waves are to be found at the relatively unknown [[Ko Kradang]] at the west coast of Trang Province. Other surf-spots include [[Rayong]] and [[Ko Samui]], but the waves of the Gulf Coast are less reliable.\n\n[[Phang Nga Bay]]'s gravity-defying limestone formations are usually seen with boat tours, but if you go '''sea-canoeing''', you can get into areas unexplored by the tourist masses. The limestone cliffs of [[Rai Leh]] are arguably among the best in the world for '''rock-climbing'''.\n\n'''Wildlife''' of Thailand has much to offer. From tigers and elephants to monkeys and birds, there are many new species to discover in Thailand. Adventurous and giving travelers can also look into spending time volunteering with animals in Thailand.[http://www.volunteerthailand.org/projects/elephant-camp/] Another option to enjoy Thailand's wildlife up close is through the '''zipline''' canopy experience, Flight of the Gibbon. Located in Chonburi and Chiang Mai, Flight of the Gibbon invests a portion of their profits in primate re-habilitation, re-forestation projects and ecological education programs throughout Thailand.[http://www.treetopasia.com/]\n\n===Golf===\nGolf arrived in Thailand during the reign of King Rama V one hundred years ago. It was first played by nobles and other elitists of high society, but since then, things have certainly changed. Over the past decade or so, the popularity of golf in Thailand has escalated; played both by local Thais and visiting foreign tourists and expatriates.\n\nMeeting to the recent needs of an average of 400,000 foreign golfers coming to Thailand annually, golf in Thailand has turned into a huge local industry with new courses constantly being churned out. Golf alone is annually bringing an income of 8 billion baht into the local economy. Thailand offers over two hundred courses with high standards. Internationally renowned courses can be found in tourist-spots like [[Bangkok]], [[Pattaya]] and [[Phuket]].\n\nThere are an abundance of reasons why golf in Thailand became so popular. First, if you compare the cost to most golfing countries in the world, membership and course fees are exceptionally low. The general low cost of travel in Thailand itself makes the country ideal for cost-efficiency minded tourists. Also, many of the golf courses in Thailand have been designed by top names in the game such as Jack Nicklaus, Nick Faldo and Greg Norman.\n\n===Boxing===\nThai Boxing (Muay Thai) was the most popular sport in Thailand which is regarded as national martial arts of Thailand. It is a combat sport that uses physical and mental in the fight. Such as punches, knee, forearm, foot, head and body. Boxing is a sport that is very useful in self-defence. It is very popular in Southern Thailand and Surat Thani. Boxing is the art of “Muay Thai Chaiya” that has famous in reign 5-6. Moreover, it has remained Muay Korat (Northeast), Muay Lopburi.  Muay Thai camps are offered throughout the country with 1,762 camps. Bangkok has a boxing stage into close contact, such as Lumpini Boxing Stadium Rama IV Road Ratchadamnoen Boxing Stadium.\n\n==Talk==\nThe official language of Thailand is '''[[Thai phrasebook|Thai]]'''. Like Lao, Mandarin and Vietnamese, Thai is a tonal language (think about the difference in your voice when saying \"yes.\" versus \"yes?\" - that's tonal) which can make it tricky for speakers of non-tonal languages to learn quickly, but despite this, everyone will appreciate any attempt you do make so pick up a [[Thai phrasebook|phrasebook]] and give it a go. Thai is a language with many dialects, though the Bangkok dialect, also known as Central Thai, is used as the standard and is taught in all schools. Language schools can be found in all larger Thai cities, including [[Bangkok]] and [[Phuket]].\n\nIn the Muslim-dominated south, dialects of [[Malay phrasebook|Malay]] that are largely incomprehensible to speakers of standard Malay/Indonesian are spoken. However, in southern areas like Hat Yai, you will almost certainly be able to find some people who can speak in Malay due to the proximity with the border with Malaysia.\n\nVarious dialects of Chinese are spoken by the ethnic Chinese community, with Teochew being the dominant dialect in Bangkok's Chinatown, and [[Cantonese phrasebook|Cantonese]] speakers also forming a sizeable minority among the Chinese community. Down south in [[Hat Yai]], [[Minnan phrasebook|Hokkien]] is also widely understood due to the large number of tourists from [[Penang]]. Mandarin is taught in most Chinese schools while Cantonese is commonly heard in the mass media due to the popularity of TVB serials from Hong Kong among the Chinese community, so many are conversant in both, in addition to their native dialect.\n\nThe eastern [[Isaan]] dialects are closely related to [[Lao phrasebook|Lao]].\nIn the eastern provinces of Thailand bordering Cambodia, there are various ethnic Khmer communities, known locally as the ''Khmer Surin'', who speak various dialects of [[Khmer phrasebook|Khmer]]. The remote hill areas of Thailand are also home to various tribal people known as the ''Hill Tribes'', who speak various indigenous languages such as Hmong, Karen and many others - some of these are so remote that Thai speakers are few and far between.\n\nPali is taught to those who attend Buddhist religious schools, and many clerics as well as other very observant Buddhists will have a functional command of Pali. However, it is not widely spoken, though the Thai language does have a large number of loan words from Pali.\n\nPublic signage is generally written in both Thai and Roman letters. There is also some prevalance of Japanese and Chinese signs. Where there is Roman-letter, it will usually be fairly phonetic - for example \"Sawatdee\" (meaning ''hello'') is pronounced just as it reads: sa-wat-dee. There is no universal agreement on how to transcribe Thai letters, so [[Bangkok/Khao San Road|Khao San Road]] for example is also commonly spelled Kao Sarn, Kao Sahn, Khao San, Koh Saan, Khaosan, and many other variations. Maps with names in both Thai and Roman letters make it easier for locals to try and help you. On many occasions, you would never be able to get the correct pronunciation just by looking at the English version of the Thai word. An example would be the airport name \"Suvarnabhumi\" - it is actually pronounced as \"Su-wanna-poom\".\n\nAs Thailand has never been colonized, not many Thais can speak English, but since the 1980s many Thais have started to learn English. As of 2011, English is compulsory in most schools, and spoken in the larger cities, although in rural areas a little Thai will come in handy. Outside Bangkok, students learn English from age 13 and learn at the basic level, so very few people can speak English.  The 2012 research found that 10% of the population are fluent in English, and 32% can speak English at least at basic level, and the age group with most English speakers is 25-34.\n\nIn general, Thailand and its citizens have a very poor standard of spoken English (exceptions include hotel staff, waiters in touristy areas and prostitutes), if any at all, which is compounded by their shyness and the thought of losing face by using broken English. So if someone is making the effort to speak to you in English, be patient, listen carefully and do your best to interact with them. It can be difficult - the tuk-tuk driver who is giving you a thumbs-up and asking you about \"lane-loony\" is speaking about an English football player, and someone who is asking you if you want to \"sa-mock\" is almost certainly offering you a cigarette. For most holiday-makers, their English will be better than your Thai, so try and go with it! They also like to break English words and names into individual syllables, so if your name was William Hewitt, this would be pronounced as \"will-lee-yum he-you-it\", which sounds very different to the English pronunciation.\n\nThere is also a colloquial form of English spoken among Thais in urban areas, not inappropriately known as Tinglish, which takes a bit of getting used to if you intend to join in the conversation on local topics. Thais will almost always try to speak 'standardized English' when approached by Western travellers. In general, police stations and government offices will have English-speaking staff on duty, but you CANNOT rely on this. If you need to speak with the police or an official, if you can find someone to translate, things will be so much easier.\n\nMany Thais have trouble pronouncing the consonant clusters of the English language. Common confusion comes from the fact that Thais often pronounce \"twenty\" as \"TEH-wen-ty\", making it sound like they're saying \"seventy\". If you extrapolate this and consider that they change from an L sound to an R sound as and when they see fit, some English words can quickly become unintelligible. Therefore it is a good idea to make use of the calculators that street vendors may offer you to avoid confusion about prices offered when buying goods. If you're willing to learn some numbers and basic greetings in Thai, haggling will be a lot more fun and you will almost certainly be able to get a better price!\n\nEven though Thai tones can be hard to master, if you are obviously a foreigner they will usually be able to guess what you mean even if you did not pronounce it correctly, and many Thais would be more than appreciative that you have at least gone to the effort to learn a few words and phrases which shows that you have respect for your hosts.\n\n==Buy==\n{{infobox|Weighty bahts|Is your new girlfriend asking for a one-baht gold ring? Watch out, as this isn't the cheap trinket it sounds like: for jewellers and goldsmiths, the baht is also a measure of weight, or 15.244 grams (around 0.5 oz) to be exact. At 2009 gold prices, one baht (weight) of gold would thus cost you well north of 16,000 baht in cash. In late 2013 the price is around 19,000 baht.[http://www.goldpricethai.com/] Thai gold is much higher purity than standard International gold, and ornamental gold has only a small increment in price above the cost of the metal alone.}}\n\nThe currency of Thailand is the '''baht''' (THB, ฿), written in Thai as บาท or บ. There are six coins and six notes:\n\n*25 and 50 satang (100th of a baht, copper or gold colour) coins - nearly worthless and only readily accepted (and handed out) by buses, supermarkets and 7-11s\n\n*1, 5 (silver colour), 2 (gold) and 10 baht (silver/gold) coins\n\n*20 (green), 50 (blue), 100 (red), 500 (purple) and 1000 (light gray/brown) baht notes. \n\nThe most useful bills tend to be 20s and 100s, as many small shops and stalls don't carry much change, and prefer \"small money\". Taxi drivers also like to pull the \"no change\" trick; if caught, hop into the nearest convenience store and make a small purchase.  Beware of 1000-baht notes, as '''counterfeits''' are not uncommon: feel the embossing, look for the watermark and tilt to see colour-changing ink [http://www.bot.or.th/English/Banknotes/production_and_security/Pages/identify.aspx] to make sure the note is real.\n\n'''ATM'''s can be found in all cities and large towns, and international withdrawals are not a problem.  When using a debit card, an ATM will typically provide a much better exchange rate than a money exchange counter, and this is especially the case if you have a card that does not charge a transaction fee for overseas withdrawals (becoming common in countries such as Australia). ATMs are available at Bangkok's Suvarnabhumi airport (BKK) after collecting your bag and clearing customs, and while it is advisable to arrive with a small amount of baht if possible, you may obtain cash from an ATM after landing as well.  Since early 2009, there is a minimum '''150 baht surcharge''' for use of foreign ATM cards in all banks. Yellow Ayudhya (Krungsri) ATM's should be avoided. Not only do they charge 150 THB surcharge, the exchange rate can be poor.\n\nSome remote areas (including smaller islands) don't have banks or ATMs, so cash or traveller's checks are essential (traveller's checks are only useful at bank branches and larger hotels). Many hotels and guest houses will change money for guests, but hefty commissions and poor rates may apply. US dollars in small bills (1s, 5s, and 20s) are useful for onward travel to Laos and Cambodia, but are only useful in Thailand for exceptional purchases (eg paying visa fees for Cambodia). \n\n'''Credit cards''' are widely accepted in the tourist industry, at larger tourist-oriented restaurants, shopping malls and grocery stores, and shops catering to tourists, but most local stores do not accept them.  Fraud can happen, so use them sparingly and tell your bank in advance, so your card doesn't get locked down because ''you'' are using it. Some businesses add a surcharge (usually 2-3%) if you're paying by credit card; in this case, it can turn out cheaper to pay them in cash. \n\nAnother problem with credit cards here (at April 2014) is that no one appears to use the PIN option - it is always your signature. This makes it possible for your card to be hacked easier.\n\n=== Costs ===\n\nThailand is not as cheap as it used to be with Bangkok recently being named the second most expensive city in south east Asia behind Singapore. However, budget travelers who are careful with what they spend will still find 1,000 baht will get a backpacker a dorm bed or cheap room, three square meals a day and leave enough for transport, sightseeing, and even partying (edit: as of March 2019 this is very difficult to achieve). Doubling that budget will let you stay in decent 2-star hotels, and if you're willing to fork out 5000 baht per day or more you can live like a king. Bangkok requires a more generous budget than upcountry destinations, but also offers by far the most competitive prices for shoppers who shop around. The most popular tourism islands such as Phuket and Ko Samui tend to have higher prices in general. It is common for tourists to be charged several times the actual price in tourist areas of other places, as well. If you do want to have an idea what the real Thai prices are - consider visiting local markets, as well as malls like Big C, Tesco or Carrefour where locals and expats do routinely shop. Those are available in any major cities (in Bangkok, there are dozens of them) and even on some larger islands such as Phuket or Ko Samui.\n\nAny travellers on a tight budget would be well-advised to avoid all of the touristy destinations entirely, and head to the North-Eastern region of the country known as Isaan, which, although much quieter and more subdued, offers a more authentic taste of the country without all the tourist-traps and scams which can be found in the capital and island destinations. Definitely not a party destination, but more authentic than the bright lights of Pattaya or Phuket.\n\nThe Thai baht seems to be strengthening, and combined with crippling inflation, things are no longer that cheap any more. If you want to stay in luxury, and eat in the best restaurants and enjoy the nightlife, you can easily burn through $500 (or more) a day!\n\nAs an example - there is a steak restaurant close to Terminal 21 where you can drop an INSANE amount of money on an imported Argentinian steak. Anything that is imported will be heavily taxed, putting them out of the reach of most Thais. If you're on a budget, eat like a local.\n\nThe days of swanning around the country on a few hundred baht a day are long gone!\n\n=== Shopping ===\n\n[[Image:SiamSquare_Mannequin.JPG|thumb|240px|Racks of clothing at [[Siam Square]], [[Bangkok]]]]\n\nThailand is a shopper's paradise and many visitors to [[Bangkok]] in particular end up spending much of their time in the countless markets and malls. Particularly good buys are '''clothing''', both cheap locally produced streetwear and fancy '''Thai silk''', and all sorts of '''handicrafts'''. Electronics and computer gear are also widely available, but prices are slightly higher than in [[Singapore]], [[Hong Kong]], [[Philippines]] and [[Kuala Lumpur]].\n\nA Thai speciality are the '''night markets''' found in almost every town, the largest and best-known of which are in [[Bangkok/Silom#Markets|Bangkok]] and the Night Bazaar in [[Chiang_Mai#Buy|Chiang Mai]]. Here a variety of vendors from designers to handicraft sellers have stalls selling goods which cannot normally be found in malls and day markets. Most night markets also have large open air food courts attached.\n\nYou can also find marvelously tacky modern clothing accessories. Witness pink sandals with clear plastic platform heels filled with fake flowers. Night markets along the main roads and Bangkok's Mahboonkrong (MBK) Mall, near the Siam skytrain stop, are particularly good sources. Not to be left out is what is often touted as the world's biggest weekend bazaar - '''The Chatuchak Weekend Market''' or knowned to locals simply as \"JJ\" Market. Chatuchak sells a myriad of products ranging from clothes to antiques, covers over 35 acres (1.1 km square) and is growing by the day!\n\nThai silk is made from the cocoon of the silk worm. It is a very complicated process and is painstakingly completed by Thai women in the Northeast region of Thailand. From raising the silk worms to the weaving of the fabric, it is a real work of art.\n\nCeladon ceramics are another Thai signature handicraft that you don't want to miss purchasing on your visit to Thailand. Celadon ceramics have been around for hundreds of years and have been an attempt to create a type of manmade jade.\n\nThe Thai people are master craftsmen and their talent shines through in the hand carved wooden items available for purchase throughout Thailand. Different types of wood are used; coconut, sandalwood and teak.\n\nNote, for some products in some markets [[haggling]] is the norm, especially in Bangkok. In some locations, market and road-side vendors will try to charge you as much as they think you can afford to pay. It's not uncommon to buy something, walk outside, and find somebody who bought the same item for half or one third what you paid (or even less).  Try to figure out the item's rough value first &mdash; adjacent stalls, government-run fixed price shops and even hotel gift shops are a good starting point — and you'll find that prices drop drastically when the seller realizes you have some idea of what it costs. However, it is important to note that haggling, is not at all common in many of the wet markets or those places with prepared foods. For example, in the local Chiang Mai marketplaces, vendors become deeply offended by the oblivious foreigner trying to get a discount on eggs or bananas or prepared foods by the roadside. At the same time, asking for a discount when trying to buy some souvenirs is generally ok, but the point is to not try and bargain hard as one might in other countries such as India.\n\nIf you want to receive new experience by shopping in the most luxurious shopping mall in Thailand, you should go visit the \"Siam Paragon\". One of the most famous landmarks in [[Thailand]] which is located on \"Rama I\" Road in \"Pathum Wan\" district,at the middle of teenager's walking street called \"Siam\". You could visit Siam Paragon by driving your car or take the BTS train either at Sukhumvit or Silom lines and get off when you reach Siam station.\n\nThat said, something like custom tailored suits are generally hugely marked up for the foreign visitor, but good luck getting a reasonable price.\n\nWhen shopping in Thailand, you should be aware that refunds are very uncommon, unlike in the West where consumers have rights to refunds or exchanges for defective goods. Therefore buying expensive electronic goods can be a costly mistake. Also bear in mind that many goods, especially at the cheaper end of the spectrum, can be very poor quality or fakes of known brands, so don't be surprised when those $5 Oakley sunglasses fall apart after a week. Likewise with shoes, you may find a very authentic-looking pair of Nike trainers for only $20. However, they probably comprise of at least 25% glue, and in the hot humid condition of Bangkok, you won't get very far in them at all!\n\n== Learn ==\n[[Image:Thai Buddhas.jpg|thumb|250px|Meditating Thai Buddhas]]\n* Diving\n* Cooking\n* Gemology\n* Massage\n* [[Meditation in Thailand|Meditation]]\n* Thai Kick Boxing\n* Muay Thai(Art of Fighting Thailand Style)\n\n===Thai language===\n\nThai is a tonal language with 5 tones (mid, low, falling, high and rising).  \nThe Thai alphabet has 44 consonants, 15 vowel symbols and 4 tone marks.\nEach letter of the Thai alphabet is learned with its associated object:  ก \"g\" as in chicken, ข \"k\" as in egg, ฃ \"k\" as in bottle, ..., up to ฮ \"h\" as in owl.\nThere are numerous transcription methods for writing Thai in Latin letters, all of which are of limited use in Thailand.\nIt is highly recommended to start learning the Thai alphabet from the start.\n\nThai language has several vowels and consonants which English does not have. It also does not have a couple of consonants which English does have (c,q,v,x,z).\n\nIn addition, like its counterparts for many other languages, Thailand's official Romanisation system (introduced by the Royal Society and adopted by ISO) does not resort to Anglicisation, meaning that Thai names are spelled in Roman letters not always in the same way as English names. This often leads to misunderstandings by some who are unaware that the Thai names in Roman letters are not English names. Some notable examples are:\n\nPhuket - (Pooget, if in Anglicised form), Krabi (Grabee, if in Anglicised form), Kanchanaburi (Garnjanaburee, if in Anglicised form), Ko (Gau, if in Anglicised form).\n \nAlso in any transliteration containing an \"h\" after a consonant with the exception of \"ch\", ignore the \"h\" and just pronounce the consonant. As in Phuket, Nong Khai, Khao Lak , Thonburi and so many others. \n\n\"v\" does not occur in the Thai language at all, and is always actually a \"w\". (Suvarnabhumi - Suwannapoom -  being an example.)\n  \n\nLanguage schools in Bangkok for studying Thai\n\n* '''Piammitr (Plenty of Friends) Language School''' located near Asok [http://www.piammitrschool.com/]  Courses are 60-hours of class time and last one month.\n* '''Thai Language Achievement School in Silom''' [http://www.tlaschool.com/]\n* '''Unity Thai Language School''' [http://www.utl-school.com/] \n* '''Jentana & Associates Thai Language School''' [http://www.thai-lessons.com/]\n* '''Walen School''' [http://www.thaiwalen.com/]\n* '''AUA (American University Alumni) Language Center Bangkok''' [http://auathai.com/] The AUA uses a non-traditional method where all teaching is done in Thai without books or any use of English. Students learn by looking and listening and eventually after a certain number of hours are expected to begin to speak Thai \"naturally\".\n* '''Chulalongkorn University Intensive Thai classes''' [http://www.culi.chula.ac.th/] Intensive Thai courses with an emphasis on learning to read and write academic Thai at a university level.\n* '''My Thai Language School''' [http://www.mythailanguage.com/] Thai corporate courses, private and group class.\n\nLanguage schools in Chiang Mai for studying Thai\n\n* '''Effective Thai''' near the Ping river [http://effectivethail.com/] Small group and 1-to-1, online and in Chiang Mai, ED visa\n\nWebsites and Apps for studying Thai\n\n* '''thai-language.com''' [http://thai-language.com/] Reference documents, interactive lessons, dictionary, and forums for learning Thai (website)\n* '''Thai Script''' [https://play.google.com/store/apps/details?id=org.foonugget.thaiscript] Learn reading, writing and pronunciation of the Thai script (Android app)\n\nIt should  be noted that Thai Immigration has decided to clampdown on the frequent misuse of Thai Educational visas which at one time could be obtained for five years provided the applicant enrolled at an approved educational establishment. With effect from August 29, 2014, ED visas will only be issued for 90 days. The initial validity can be extended by an additional 90 days three times thereafter, but only for a maximum period of one year. \n\nMore information can be obtained by visiting the Thai Immigration website. [http://bangkok.immigration.go.th/popup_anounce.html]\n\n== Work ==\nThe two main opportunities for work for foreigners are '''[[teaching English]]''' and '''dive instructor''', but both are very competitive and dive masters in particular are paid a pittance. However, do not even consider working in Thailand without a valid work permit - you could easily end up deported and blacklisted form the country, always follow the rules!\n\nTo become a dive instructor, the most popular destination is [[Ko Tao]] (Turtle Island) a few hours off the coast of Chumphon in the Gulf of Thailand.  There are dozens of dive shops that provide training and internships.\n\nAnyone with a four-year degree can gain employment as an English teacher in Thailand, and even those without a degree can usually find work under the table. As of 2019, the Thai authorities are seriously cracking-down on foreigners working without the correct visa and work permit, so do not risk it by working illegally. Normal starting salary is approximately 30,000 baht per month and this goes up and down slightly depending upon location (higher in Bangkok, lower in some up-country towns). Some private teachers working at international schools can earn as much as 150,000 baht a month, however they will be very well qualified with a teaching qualification and many years of experience.\n\nA great start to working as a teacher is a TESOL/TEFL Certificate. For non-degree holders a CELTA/TEFL can be enough along with a positive and caring attitude for teaching will make your chances of finding stable work and financially stable as well.  There are so many opportunities with language centers, as they don't require a degree.  Providers include International House with locations in Bangkok www.ihbangkok.com and Chiang Mai www.ihchiangmai.com/ Chiang Mai University [http://www.cmutefl.com] and SEE TEFL [http://seetefl.com] in Chiang Mai and various locations through the TEFL International franchisees [http://www.tefllife.com].\n\nITTT, International TEFL and TESOL Training, offers in-class TEFL and TESOL courses at four locations in Thailand[https://www.teflcourse.net/tefl-courses-locations/thailand/?r=wikitravel]: Bangkok, Chiang Mai, Ban Phe, and Phuket. Get your TEFL certification[https://www.teflcourse.net/tefl-certification/?r=wikitravel] at one of their training centers and start your international teaching career in Thailand or around the world after the four-week course. \n\nFinding any other kind of work in Thailand can be difficult, as wages are poor and a large number of occupations are legally off limits to non-Thais. Thai law requires foreigner to earn quite a high wage to be eligible for a work permit. Companies and schools should assist employees to obtain visas and work permits, but some schools fear the extra work involved.\n\nTechnically, even doing freelance work through the internet requires a work permit in Thailand, although some people seem to be doing this discretely. If you can go about your work privately in your room, you may get away with it, but it is always advisable to stay on the correct side of the law. Working from shared spaces or internet cafes is highly inadvisable as eventually you should expect to be caught and deported. You may hear stories about people who have been working under the radar for years, however, you really do not want to be in the same boat.\n \nVolunteering is a great way to meet locals and experience the culture and traditions of Thailand. There are many worldwide organizations that offer volunteer work on such projects as community development, conservation, wildlife sanctuary maintenance & development, scientific research, & education programs. Here are a couple of them:\n\n* <listing name=\"Child's Dream Foundation\" alt=\"\" address=\"238/3 Wualai Rd, Haiya, Muang, Chiang Mai 50100\" directions=\"\" phone=\"+66 53 201 811\" url=\"http://www.childsdream.org\" hours=\"\" price=\"Does not charge volunteers\" lat=\"\" long=\"\" email=\"info@childsdream.org\" fax=\"\">Founded by two Swiss financiers with good hearts, Child's Dream places volunteers in schools in Thailand, Laos, and Cambodia in addition to other good works. They are highly regarded for their ethics and efficiency.</listing>\n\n* <listing name=\"Foundation for Education and Development\" alt=\"formerly known as Grassroots Human Rights and Development\" address=\"Moo 4 Khuk Khak, Takuapa, Phang Nga 82120\" directions=\"at km790 on Rt 4 in Khuk Khak (Khao Lak)\" phone=\"+66 76 486 351\" url=\"http://www.ghre.org\" hours=\"\" price=\"Does not charge volunteers\" lat=\"\" long=\"\" email=\"\" fax=\"\">A joint Burmese-Thai NGO committed to assisting Burmese migrant workers in Phang Nga Province, just north of Ko Phuket in the region better known as Khao Lak. FED runs schools, health clinics, women's empowerment programs, and provides legal assistance to political and economic refugees. The organisation runs on a shoe-string and depends on the commitment of paid staff and volunteers.</listing>\n\n* <listing name=\"Isara Foundation\" alt=\"\" directions=\"\" lat=\"\" long=\"\" address=\"897/1 Mee Chai Rd, Amphur Muang, Nong Khai 43000\" phone=\"+66 42 460827\" tollfree=\"\" email=\"\" fax=\"\" url=\"http://www.isara.org/\" hours=\"\" price=\"\"></listing>\n\n*<listing name=\"Volunteer World\" alt=\"\" directions=\"\" lat=\"\" long=\"\" address=\"Ronsdorfer Straße 77a, 40227 Düsseldorf\" phone=\"\" tollfree=\"\" email=\"\" fax=\"\" url=\"https://www.volunteerworld.com/volunteer-in-thailand/\" hours=\"\" price=\"\">The social start up helps grassroot projects and interested volunteers worldwide to get in touch. Volunteers can compare the social projects while local NGOs receive the support and attention they need to fulfill their great cause.</listing>\n\nIMPORTANT: Volunteering is defined as a form of employment by the Thai authorities. Foreigners must obtain a work permit even to volunteer for small projects. This is easier to obtain than a normal work permit, and can be issued even for one or two days. Tourists are advised to take these rules seriously. Thai jails are not comfortable; if you are arrested on a Friday you may not be able to contact anyone before Monday.\n\n== Eat ==\n[[Image:Thai_seafood_curry.jpg|thumb|240px|Thai-style seafood curry]]\n\nThe food alone is really reason enough for a trip to Thailand. Curries, fruit shakes, stir fries, fresh fish made a zillion ways - and that's just the beginning. Food in Thailand can be as cheap and easy as 25 baht ''pad thai'' (Thai fried noodles) cooked at a street stall and floating markets [http://www.columbusdirect.com.au/content/the-ultimate-thailand-travel-guide/#whatToSeeThailand] or as expensive and complicated as a $100 ten-course meal by a royal chef served in one of Bangkok's 5 star hotels.\n\nSince most backpackers will be sticking closer to the first than the second, one of the great things about Thailand is that food from stalls and tiny sidewalk restaurants is usually quite safe. Unlike some Asian countries, travellers should worry more about overeating or too much curry spice than about unclean kitchens and bad food. In fact, street restaurants, where you can see what you'll get and everything is cooked on the spot can be a safe option.\n\n\n=== Etiquette ===\nThai food is most commonly eaten with '''fork and spoon'''. Hold the spoon in your right hand and use it to eat, and reserve the fork for piling food onto your spoon. Chopsticks are ''only'' employed for noodle soups and East Asian-style dishes. \n\nThai food is meant for '''sharing'''. Everybody gets their own plate of rice and tiny soup bowl, but all the other dishes are laid out in the middle of the table and you're free to eat what you wish. Though some people believe that taking the last piece from a shared plate is considered slightly unlucky, and you may hear people make wishes for ''others'' to compensate for their own misfortune &mdash; a popular wish is that \"may my girl/boyfriend be beautiful\"!\n\nFood is also generally brought out a dish at a time as it is prepared. It is not expected for diners to wait until all meals are brought out before they start eating as is polite in western culture. Instead they should tuck into the nearest meal as it arrives.\n\n=== Thai cuisine ===\nThai cuisine is characterized by balance and strong flavors, especially '''lime juice''', '''lemon grass''' and '''fresh coriander''', the combination of which gives Thai food its distinctive taste. In addition, Thai food has a deserved reputation for being '''spicy''', with hot little torpedo-shaped chillies called ''phrik khii nuu'' (พริกขี้หนู, lit. \"mouse shit chillies\") making their way into many a dish. Thais are well aware that these can be more than Westerners can handle and will often ask if you like it hot (เผ็ด ''phet''); answer \"yes\" at your own risk!\n\nThai dishes can be roughly categorized into '''central Thai food''' (around Bangkok), '''northern Thai food''' (from the [[North (Thailand)|northern region]] around [[Chiang Mai]], with Burmese and Chinese influence), '''north-eastern Thai food''' (from the [[Isaan]] region bordering with [[Laos]]) and '''southern Thai food''' (with heavy influences from [[Malaysia]]). The following list covers some better-known dishes; see [[Isaan]] for Isaan food, which is widely available throughout the country. \n\n'''Rice'''\n\nThe Thai staple food is rice (ข้าว ''khao''), so much so that in Thai eating a meal, ''kin khao'', literally means \"eat rice\".\n\n* ''Khao suai'' (ข้าวสวย) or \"beautiful rice\" is the plain white steamed rice that serves as the base of almost every meal.\n\n* ''Khao phat'' (ข้าวผัด) is simple fried rice, usually with some pork (''muu'') or chicken (''kai'') mixed in.\n\n* ''Khao tom'' (ข้าวต้ม) is a salty and watery rice porridge served with condiments, quite popular at breakfast.\n\n* ''Khao niao'' (ข้าวเหนียว) or \"sticky rice\" is glutinous rice - usually eaten dry, traditionally by hand, with grilled/fried pork or chicken or beef. It is especially popular (more than plain rice) in North-Eastern (Isan) and Northern provinces, but is widely available throughout the country, especially in places specializing on Isan or Lao cuisine.\n\n* ''Khao Chae'' (ข้าวแช่)is a croquette. Polished rice soaked with cold water. Which is often a barracuda. Then eat with rice variety.\n\n'''Noodles'''\n\n[[Image:Sriwan KuayTiow.JPG|thumb|''Kuay tiao phat sii-u kai'', or fried giant rice noodles with soy sauce and chicken]]\n\nThais are great noodle eaters. The most common kind is rice noodles, served angel-hair (เส้นหมี่ ''sen mii''), small (เส้นเล็ก ''sen lek'') and large (เส้นใหญ่ ''sen yai''), but egg noodles (บะหมี่ ''ba mii''), Chinese-style stuffed wonton ravioli (เกี๊ยว ''kio'') and glass noodles made from mung beans (วุ้นเส้น ''wun sen'') are also popular.\n\nUnlike other Thai foods, noodles are usually eaten with chopsticks. They are also usually served with a rack of four condiments, namely dried red chillies , fish sauce, vinegar and sugar which diners can add to their own taste.\n\n* ''Phad Thai'' (ผัดไทย), literally \"Thai stir-fry\", means thin rice noodles fried in a tamarind-based sauce. Ubiquitous, cheap and often excellent - and as an added bonus, it's usually chili-free (you can add yourself, however, or ask to do if buying of the street - but be warned, it is often ''really'' hot). Can be made vegetarian, with shrimp, pork, or chicken.\n\n* ''Ba mii muu daeng'' (บะหมี่หมูเเดง) yellow egg noodles with slices of red (barbecued) pork.\n\n* ''Guay dtiao ruea'' (ก๋วยเตี๋ยวเรือ) is a rice noodle soup with a fiery pork blood stock and an assortment of offal. An acquired taste, but an addictive one.\n\n* \"Kanom Jeen\" (ขนมจีน) can be divided into two types - famentation flour and newly-milk flour - In each region of Thailand has different eating depend on local. The big festival of Kanom Jeen will be on March every year district Thug Song at Nakon Sri Thammarat.\n\n'''Soups and curries'''\n\nThe line between soups (ต้ม ''tom'', literally just \"boiled\") and curries (แกง ''kaeng'') is a little fuzzy, and many dishes the Thais call curries would be soups to an Indian. A plate of rice with a ladleful of a curry or two on top, known as ''khao kaeng'' (ข้าวแกง), is a very popular quick meal if eating alone.\n\n* ''Tom yam goong'' (ต้มยำกุ้ง) is the quintessential Thai dish, a spicy, sour soup with prawns, lemongrass and galangal. The real thing is quite spicy, but toned-down versions are often available on request.\n\n* ''Tom kha gai'' (ต้มข่าไก่) is the Thai version of chicken soup in a rich galangal-flavored coconut stock, with mushrooms and not a few chillies. \n\n* ''Gaeng ped'' (แกงเผ็ด, \"red curry\") this coconut-based red curry dish can be spicy. Red curry with roast duck (''kaeng phet Bped yaang'' แกงเผ็ดเป็ดย่าง) is particularly tasty.\n\n* ''Gaeng kheow-waan'' (แกงเขียวหวาน), sweet green curry, is a coconut-based curry with strong accents of lemongrass and kaffir lime. Usually milder than the red variety.\n\n* ''Gaeng som'' (แกงส้ม), orange curry, is more like tamarind soup than curry, usually served with pieces of herb omelette in the soup.\n\n'''Mains'''\n\nThais like their mains fried (ทอด ''thot'' or ผัด ''phat'') or grilled (''yaang'' ย่าง). Fish, in particular, is often deep-fried until the meat turns brown and crispy.\n\n* ''Ka-phrao kai'' (กะเพราไก่), literally \"basil chicken\" is a simple but intensely fragrant stir-fry made from peppery holy basil leaves, chillies and chicken.\n\n'''Salads'''\n\n[[Image:SomTam Larb StickyRice.JPG|thumb|A classic [[Isaan]] meal: ''som tam'' papaya salad, ''larb'' meat salad and sticky rice]]\n\nAbout the only thing Thai salads (ยำ ''yam'') have in common with the Western variety is that they are both based on raw vegetables. A uniquely Thai flavor is achieved by drowning the ingredients in fish sauce, lime juice and chillies - the end result can be very spicy indeed!\n\n* ''Som tam'' (ส้มตำ), a salad made from shredded and pounded raw papaya is often considered a classic Thai dish, but it actually originates from neighboring [[Laos]].  However, the Thai version is less sour and more sweet than the original, with peanuts and dried shrimp mixed in.\n\n* ''Yam ponlamai'' (ยำผลไม้) is Thai-style fruit salad, meaning that instead of canned maraschino cherries it has fresh fruit topped with oodles of fish sauce and chillies.\n\n* ''Yam som-o'' (ยำส้มโอ) is an unusual salad made from pomelo (a mutant version of grapefruit) and anything else on hand, often including chicken or dried shrimp.\n\n* ''Yam wunsen'' (ยำวุ้นเส้น) is perhaps the most common ''yam'', with glass noodles and shrimp.\n\n* '' Yum Tua Poo'' (ยำถั่วพลู) is a mellow mix of pork and shrimp. Of Winged Bean and crunchy sweet-sour flavor. The taste is a little spicy, exotic food.\n\n'''Dessert'''\n\nThais don't usually eat \"dessert\" in the Western after-meal sense, although you may get a few slices of fresh fruit (ผลไม้ ''ponlamai'') for free at fancier places, but they certainly have a finely honed sweet tooth.\n\n* ''Khanom'' (ขนม) covers a vast range of cookies, biscuits, chips and anything else snackable, and piles of the stuff can be found in any Thai office after lunch. One common variety called ''khanom khrok'' (ขนมครก) is worth a special mention: these are little lens-shaped pancakes of rice flour and coconut milk, freshly cooked and served by street vendors everywhere during the morning hours, but after that you might probably find it a bit difficult to find.\n\n* ''Khao niao ma-muang'' (ข้าวเหนียวมะม่วง) means \"sticky rice with mango\", and that's what you get, sweetened sticky rice and ripe mango with some coconut milk drizzled on top. Filling and delicious and an excellent way to cool the palate after a spicey Thai dish! Alternatively, for the more adventurous type, an equally popular dish is ''Khao niao tu-rean'' in which you get durian instead of mango with your sticky rice.\n\n* ''Waan yen'' (หวานเย็น), literally \"sweet cold\", consists of a pile of ingredients of your choice (including things like sweet corn and kidney beans) topped with syrup, coconut cream and a pile of ice, and is great for cooling down on a hot day or after a searing curry.\n[[File:Thong yib.jpg|thumb|Thong yib]]\n* ''Thong Yib'' (ทองหยิบ), is originally Portuguese dessert. It was introduced to Thais a few hundred years ago by Marie Guimar de Pinha (ท้าวทองกีบม้า). ''Thong Yib'' literally means \"pinched gold\". It is made from egg yolks, its bound is pinched to star-shaped. One piece of ''Thong Yib'' is bite-sized, served in a tiny cup. ''Thong Yib'' is sold in typical markets in the morning. A pack of 6-8 pieces is around 20-25 baht. Travellers can also find these in other Thai dessert shops. For example, ''Mae U-Dom'' (แม่อุดม), this is a famous Thai dessert shop, open daily from 8 a.m. to 7 p.m. ''Mae U-Dom'' located on ''Din-sor'' (ดินสอ pencil) road, near ''Satri wittaya'' School (โรงเรียนสตรีวิทยา) and the Democracy Monument. Another shop is ''Ma-li-wan'' (มะลิวัลย์), open daily from 8 a.m. to 5 p.m. It is located on ''Soi Arie 1'' (ซอยอารีย์ 1), not far from ''Arie'' BTS station.\n\n* ''Thong Yod'' (ทองหยอด) means \"gold drop\" and its shape is like a drop. It is Portuguese sweet like ''Thong Yib'' (ทองหยิบ). Rice flour is mixed with egg yolk, this is the difference of ''Thong Yod'' from ''Thong Yib'' that has no flour. ''Thong Yod'' is usually sold with ''Thong Yib''. A pack of 10-15 pieces is priced around 20-25 baht. It also be sold at ''Mae U-Dom'' (แม่อุดม) and ''Ma-li-wan'' (มะลิวัลย์).\n\n* ''Foy Thong'' (ฝอยทอง) means “gold fibre”. It is egg-based Portuguese sweet too. It is made from yolks mixed with egg-dew (the light egg white that remains in the egg shell). It is like fibre because the stirred mixture is poured through a pastry cone into hot syrup. When it is long enough, it will be folded to a fold. A pack of 3-4 folds is priced around 30 baht. It is usually sold by the same vendors who sell ''Thong Yib'' and ''Thong Yod''. ''Mae U-Dom'' (แม่อุดม) and ''Ma-li-wan'' (มะลิวัลย์) also sell this.\n\n* ''Thong muan'' (ทองม่วน) is a kind pocket Thailand is a circular loop coil looks crisp.\n\nIn Thailand, there are many varieties of desserts. Most Thai people like to eat desserts that are made from coconut milk. \n\n* ''Khao lam'' (ข้าวหลาม) means \"Bamboo sticky rice\" which is a sticky rice (white or black) with sweetened coconut milk, which may include taro or black bean, and stuffed into bamboo sticks.\n\n* ''Bua loy kai-wan'' (บัวลอยไข่หวาน) means \"Dumplings in coconut cream with egg\".\nDumpling balls in coconut cream with egg is found everywhere in Thailand and it also is a popular dessert. This dessert is often enjoyed in the evening. The dumpling balls are made from flour, water and coloured water. Dumpling balls in coconut cream with egg can also be found in colours such as green, purple, blue, yellow, pink, white and so on. Each colour is made from flowers and vegetables. The ingredients of this dessert contains eggs, coconut milk, taro, corn, and colourful dumpling balls. Most Thai people loves these because it is a hot coconut cream soup with dumpling balls and eggs and tastes sweet and creamy.\n\n* ''Kluay buat-chi'' (กล้วยบวชชี) means \"Banana in coconut milk\".\nBanana in coconut milk are easy to buy and cook. The taste is creamy, sweet and silky. The ingredients are cheap and contains bananas, coconut milk, some salt and sugar. Most Thai people like to cook this dessert because of the affordable ingredients and the dish is easy to make. However, banana in coconut milk are easy to find in the supermarket and other shops.\n\n* ''Tubtim Krob'' (ทับทิมกรอบ) “Water Chestnut with Syrup and Coconut Milk”. A tasty and refreshing dish when served with ice. It is very popular in the summer time and can be found in the markets.\n\n* ''Khanom Thai''- usually made of starch, sugar and coconut milk. In the early times, Knanom Thai was only made for special occasions, like weddings and Songkran day, because of the considerable amount of time and people required in order to make a perfect Khanom Thai. Moreover, Thais believe that the names and the shapes of Khanom Thai will bring good luck to those who consume it.\n\n* ''Rook choob''- is one of the most popular Thai desserts. Most people like this dessert because it is colourful and often made into fruit shapes. Moreover, Rook choob is made into a bite size, so it easy to eat. A main ingredient of this dessert is crushed green bean. It smells great from the natural colours such as Bai toey (green), Aun chun (blue) etc. While chewing it, you will not only get a soft sweet taste from soybean and coconut milk but also a good smell from aroma candle’s smoke. Great for relaxing with a hot tea. Can be bought for cheap at local markets and food shops. \n\n* ''Ka noom sord sai''- is a meticulous Thai dessert because it has many steps to make. It consists of sticky rice, flour, coconut etc. The dessert has a sweet taste from coconut and palm sugar and a wonderful smell from aroma candle’s smoke. It is delicious and nutritious because of the carbohydrates and fat. This dessert is cheap and easy to find due to the availability of the ingredients. Furthermore, it is packed with Thai’s folk wisdom style, which is banana leaf and small bamboo pin. The banana leaf will keep the dessert's smell and freshness.\n\n* ''Kaow tom mud'' is another dessert that popular in Thailand. It consists of many ingredients such as sticky rice, black bean, banana, coconut, etc. This desser provides many nutrients from carbohydrates and vitamins B1 and B2. Foreigners can buy this dessert for cheap in any local market. It should be eaten while it is hot to keep the sticky rice's softness. This dessert is wrapped with a traditional Thai banana leaf.\n\n=== Vegetarian food ===\nVegetarians won't have too many problems surviving in Thailand, with a couple significant exceptions: oyster sauce (น้ำมันหอย ''naam man hoy'') and/or fish sauce (น้ำปลา) are used in nearly Thai cuisine, and keeping it out of soups, curries and stir-fries will be a challenge.  \n\nThat said, Thailand is a Buddhist country and vegetarianism is a fairly well-understood concept, especially among Chinese Thais (many of whom eat only vegetarian food during several festivals). Tofu is a traditional Thai ingredient and they aren't afraid to mix it up in some non traditional dishes such as omelettes (with or without eggs), submarine sandwiches, and burritos. Since Thai dishes are usually made to order, it's easy to ask for anything on the menu to be made without meat or fish, but be careful because it's not impossible for someone to say that's fine and then put it in anyways. Bangkok features several fantastic veggie and vegan restaurants, but outside of big cities make sure to check that your idea of \"veggie\" matches the chef's.\n\nThere are 2 categories of vegetarian in Thai: \n\n* เจ [jeh] \n \nเจ [jeh] comes from the Chinese word 齋 (jai1/jaai1) and aside from abstaining from meat jeh eaters also avoid a number of strong smelling vegetables like garlic and onions.\n\n*มัง [mung] (short form of มังสวิรัติ)\n\nมังสวิรัติ [mung sa wi rut] comes from the Sanskrit mamsa, which means “meat” and virat which means “without.” So this is essentially an acceptable translation of “vegetarian.” As with it's English counterpart, some people may or may not eat eggs and/or dairy.\n\n\nKey phrases for vegetarians:\n\n* [gin jay] กินเจ \"(I) eat vegan\"\n* [gin mung] กินมัง \"(I) eat vegetarian\"\n\nDon't put X in (something): \n* ''mai sai naam plaa'' ไม่ใส่น้ำปลา \"Don't put in fish sauce\"\n* \"mai sai naam man hoy\" ไม่ใส่น้ำมันหอย \"Don't put in oyster sauce\"\n* ''mai sai pong chu roht'' ไม่ใส่ผงชูรส \"Don't put in MSG\"\n\n=== Restaurant chains ===\nThailand has a large number of indigenous restaurant chains offering much the same fare as your average street stall, but with the added advantages of air conditioning, printed menus (often in English) and some semblance of hygiene. All the chains are heavily concentrated in [[Bangkok]], but larger cities and popular tourist spots may have an outlet or two.\n\n* '''MK''' and '''Coca''' are near-ubiquitous chains specializing in what the Thais call ''suki'', perhaps better known as \"hotpot\" or \"steamboat\". A cauldron boils in the middle of your table, you buy ingredients (40-80 baht a pop) and brew your own soup. The longer you spend, the better it tastes, and the bigger the group you're with, the more fun this is!\n\n* '''S&P''' [http://www.sandp.co.th] outlets are a bakery, a café and a restaurant all rolled into one, but their menu's a lot larger than you'd expect: it has all the Thai mainstays you can think of and then some, and most all of it is good. Portions are generally rather small, with prices mostly in the100-300 baht range.\n\n* '''Yum Saap''' (signs in Thai; look for the big yellow smiley logo) is known for their Thai-style salads (''yam''), but they offer all the usual suspects as well. Quite cheap with mains around 50-150 baht.\n\n* '''Kuaytiew Ruea Siam''' (signs in Thai; look for the boat-shaped decor and hungry red pig logo) does dirt-cheap noodles with prices starting about 40B. Portions aren't too generous, but at that price you can get two! No concessions to English speakers in menu or taste, so point & choose from the pictures and watch out for the spicier soups.\n\n* '''Fuji''' [http://www.fuji.co.th] and '''Zen''' specialize in surprisingly passable Japanese food at very cheap prices (at least compared to Japanese restaurants almost anywhere else); rice/noodle mains are less than 100 baht, and you can stuff yourself full of sushi for less than 500 baht.\n\nAnd yes, you can find the usual '''McDonalds''', '''KFC''', '''Pizza Hut''', '''Komalas''' etc if you insist. If you do end up at McD's, at least try the un-Maclike fried chicken with McSomTam (green papaya salad). For those craving American-style pizza, try the ubiquitous '''The Pizza Company''', which is a less expensive and (arguably) tastier local chain.\n\n== Drink ==\n'''Tap water''' is usually ''not'' drinkable in Thailand outside of Bangkok. In many places in Bangkok however, particularly in new buildings, drinking tap water is perfectly safe. However, if you don't want to chance it, buying a bottle of water is the obvious solution. Bottled water (น้ำเปล่า ''naam plao'') is cheap and ubiquitous at 5-20 baht a bottle depending on its size and brand, and drinking water served in restaurants is always at least boiled (น้ำต้ม ''naam tom''). '''Ice''' (น้ำแข็ง ''naam khaeng'') in Thailand usually comes packaged straight from the factory and is safe; there is only reason to worry if you are served hand-cut ice. You can buy a large package of ice in most 7-11s for 7 baht, too. \n\nMainly in residential areas, machines dispensing water into your own bottle (1 baht or 50 satang /liter are often available. This is a clean (the water is cleaned and UV-treated on the spot) and extremely cheap option, also, this way you'll avoid making unnecessary plastic waste from empty bottles. These machines are widely available streetside in Chiang Mai.\n\n=== Iced drinks ===\n'''Coconut water''' (น้ำมะพร้าว ''naam ma-phrao''), iced and drunk directly from a fresh coconut is a cheap and healthy way to cool the body. Available at restaurants and also from vendors that specialize in fruit juice. \n\nFruit juices, freezes, and milkshakes of all kinds are very popular with Thais and visitors alike. Most cafés and restaurants charge 20-40 baht, but a bottle of freshly squeezed '''Thai sweet orange juice''' (น้ำส้ม ''naam som'')- which really is orange in colour! - can be sold on the street for 15-30 baht. Thais often add salt to their fruit juices-- an acquired taste that you might just learn to like. Thais also like to have basil seeds in their iced fruit juice sold on the road - which looks like small jelly balls down of the bottle.\n\n=== Tea and coffee ===\nOne of Thailand's most characteristic drinks is '''Thai iced tea''' (ชาเย็น ''chaa yen'', lit. \"cold tea\"). Instantly identifiable thanks to its lurid orange colour, this is the side effect of adding ground tamarind seed (or, these days, artificial colour) during the curing process. The iced tea is always very strong and very sweet, and usually served with a dash of condensed milk; ask for ''chaa dam yen'' to skip the milk. There is also ''Lemon tea'' (ชามะนาว ''chaa ma naow'') which is also strong and sweet.\n\n''Naam chaa'' is a loose term for plain tea without milk and sugar, being it black, Chinese or even green tea in some specific context. Though mostly it'll refer to Chinese tea, asking for ''Naam chaa'' can give you any of these depending on what the restaurant serves. To ask for any of those specifically, ''chaa jiin'' is literally Chinese tea which is often served in restaurants for free, Western-style black tea is called ''chaa farang'' (ชาฝรั่ง - lit. \"Western/westerners tea\") and ''chaa khiao'' is green tea, literally. However, green tea is not so common in Thailand, in a sense. Ordering green tea outside of a Japanese style restaurant will most likely give you a sweet bottled green tea or sweet instant green tea which can be quite different from what you might expect. And if you happen to know that ''Dam'' means black in Thai, imitating the word structure of green tea hence asking for ''chaa dam'' will likely give you the ''cha dam yen'' mentioned above instead.  Coffee (กาแฟ ''kaafae'') is also widely available, and is usually served with condensed milk and lots of sugar. Ask for ''kaafae thung'' to get traditional filtered \"bag\" coffee instead of instant. Two terms used widely and can be found in most local stalls and street restaurants drinks menu are ''O liang'' (โอเลี้ยง) and ''O yua'' (โอยัวะ) are borrowed words from Teochew Chinese dialect for iced and hot black ''kaafae thung'' respectively; both are very sweet though. Unlike tea, asking for ''kaafae dam'' will give you a black coffee but a lot of sugar is not uncommon.\n\nThe Starbucks phenomenon has also arrived in Thailand, but for the moment local competitors '''Black Canyon Coffee''' and '''S&P''' still have the edge in marketshare. These are the places to look for if you want that triple-moccha latte with hazelnut swirl and are willing to pay 75 baht for the privilege.\n\n* '''Black Canyon Coffee''' [http://blackcanyoncoffee.com] is Thailand's home-brewed Starbucks, but while coffee is their mainstay they also offer a limited meal menu. Try the ''chaa yen'' (lurid orange Thai iced tea with milk).\n\n=== Herbal juice ===\nHerbal juice is characteristic of Thai drinks. It makes from herbs in nature and it is folkways drinks of Thailand people as well. They call healthy drinks; they often drink herbal juice with ice. Basic process is squashing the herbal, it will give herbal juice. Also, herbal water has benefits to the body such that it can help you refreshed when you feel thirsty as well as it can help you to healthy such that it nurtures the skin ,nurtures the blood system and nurtures eyesight etc. Herbal drinks as the follows:\n\n*'''Roselle juice''' (น้ำกระเจี๊ยบ ''naam gra jee yeb''): is red and usually sweetened (though can be ordered without sugar (ไม่หวาน ''mai waan'' lit. ''not sweet'') in which case it is a little sour). It has benefit to the body such as it gives high vitamin A, nurtures eyesight, gives calcium to help maintain healthy bones and improves wound healing. You can buy on herbal juice shop, Thai restaurant and street of Chinatown at least 15 baht. Most restaurants charge 20-50 baht. \n*'''Lemon grass water''' (''น้ำตะไคร้''): it's green and the flavour is rather bitter sweet. It's a very useful medicinal juice as it helps alleviate indigestion, helps in reducing fevers, helps reduce blood pressure, and helps improve the skin by reducing acne and pimple. You can buy on street of Chinatown and herbal juice shop in the price around 15-30 baht\n*'''Bael water''' (''น้ำมะตูม''): it's brown and rather sweet. It helps to body refreshed, coating on the stomach and helps in the healing of ulcers. You can buy on herbal juice shop, on street of Chinatown and Thai restaurant in the price around 15-50 baht.\n*'''Gotu kola water''' ''(น้ำใบบัวบก naam bai bua bok'') : is the herbal that has cooling effect within a body. Some seller may add sugar for the better taste. Gotu kola has many properties e.g. decrease acne, cure bruised inside,maintain the brain, support blood flow.\n*'''Passion fruit water''' (''น้ำเสาวรส naam sao wa rods'' ) : this drink has a good taste, little sour and sweet. If drink it when it cool that can make you refresh. Moreover it can help about healthy. For example, easier to sleep, be old slowly, maintain gum, teeth, ability of seeing, hair because it rich of many vitamins.\n*'''Pomegranate Juice''' (''น้ำทับทิบ naam tub tim'') it’s colour may look terrible because it’s red but the taste is good. If drink it every day it will be long-term affects that is you will have a healthy skin, antioxidant, Diabetes treatment, prevention of scurvy. You always meet it on the street side at china town. The price of it about 20 bath/bottle.\n*'''Butterfly Pea water''' (''น้ำอัญชัน naam aun chaan'') this drink is violet in colour and has many benefits e.g. antioxidant, increase energy, increase rate of blood flowing, Diabetes treatment. The seller usually mix it with honey or lemon to make better taste.\n\n=== Energy drinks ===\nThailand is the original home of the Red Bull brand energy drink - a licensed and re-branded version of Thailand's original ''Krathing Daeng'' (กระทิงแดง, \"Red Bull\"), complete with the familiar logo of two bulls charging at each other.\n\nThe Thai version, however, is syrupy sweet, uncarbonated and comes packaged in medicinal-looking brown glass bottles, as the target customers are not trendy clubbers, but Thailand's working class of construction workers and bus drivers in need of a pick-me-up. And a pick-me-up it most certainly is; the caffeine content is higher even than Western-style Red Bull, and packs a punch equivalent to two or three shots of espresso coffee. Krathing Daeng and its many competitors (including M150, Shark, .357 and the inevitable ''Karabao Daeng'', \"Red Buffalo\") are available in any convenience store for 10 baht a pop, although in some places you can now buy imported European Red Bull for five times the price.\n\n=== Alcohol ===\nDrinking alcohol in Thailand, especially if you like Western tipples, is actually comparatively expensive - but still very affordable by Western standards.\n\nNote that retail sales of alcohol in supermarkets, convenience stores etc are banned between '''midnight and 11:00''' and, more bizarrely, '''14:00-17:00'''.   Restaurants and bars are not affected, and smaller, non-chain stores are often willing to ignore the rules. However in certain circumstances these rules are relaxed for alcohol purchases above a particular quantity. For example if you purchase 5 liters of wine during the restricted period, then the purchase will not be allowed, however if you were to purchase say 10 liters of wine in the same period then this would be permitted.\n\nThere are also occasional days throughout the year when alcohol can't be sold anywhere - even the smaller mom & pop shops normally adhere to the rules on these days, and most bars and pubs do too (although you can probably find a beer ''somewhere'' if you're desperate enough). Up-market hotel bars and restaurants are probably the only places that are realistically likely to be exempt. Religious holidays and elections are normally the reason for these restrictions.\n\n'''Whisky'''\n\nThe misnamed '''Thai whisky''' (''lao'') refers to a number of liquors.  The best known are the infamous '''Mae Khong''' (แม่โขง \"Mekong\") brand and its competitor, the sweeter '''Saeng Som''' (\"Sangsom\"), which are both brewed primarily from sugarcane and thus technically rum.  Indeed, the only resemblances to whisky are the brown tinge and high alcohol content, and indeed many people liken the smell to nail polish remover, but the taste is not quite as bad, especially when diluted with cola or tonic water. This is also by far the cheapest way to get blotto, as a pocket flask of the stuff (available in any convenience store or supermarket) costs only around 50 baht.\n\nThe \"real\" Thai whisky is ''lao khao'' (เหล้าขาว \"white liquor\"), which is distilled from rice.  While commercial versions are available, it's mostly distilled at  home as moonshine, in which case it also goes by the name ''lao theuan'' (\"jungle liquor\").  White liquor with herbs added for flavor and medical effect is called ''ya dong'' (ยาดอง).  Strictly speaking, both are illegal, but nobody seems to mind very much &mdash; especially when hilltribe trekking in the [[North (Thailand)|North]] you're likely to be invited to sample some, and it's polite to at least take a sip.\n\n'''Rice wine'''\n\nThai rice wine (สาโท ''sato'') is actually a beer brewed from glutinous rice, and thus a spiritual cousin of Japanese ''sake''.  While traditionally associated with [[Isaan]], it's now sold nationwide under the brand '''Siam Sato''', available in any 7-11 at 25 baht for a 0.65L bottle.  At 8% alcohol, it's cheap and potent, but you may regret it the next morning!  The original style of brewing and serving ''sato'' is in earthenware jars called ''hai'', hence the drink's other name ''lao hai'' (เหล้าไห).  These are served by breaking the seal on the jar, adding water, and drinking immediately with either glasses or, traditionally, with a straw directly from the pot.\n\n'''Beer'''\n\nWestern-style beer (เบียร์ ''bia'') is a bit of an upmarket drink in Thailand, with the price of a small bottle hovering between 50 and 100 baht in most pubs, bars and restaurants. Thais like their lagers with relatively high alcohol content (around 6%), as it is designed to be drunk with ice, so the beer in Thailand may pack more of a punch than you are used to. However, if you are an experienced drinker from Western Europe, namely Belgium or part of Germany, you will find it similar to your local tastes.\n\n* '''Local brews''': For many years the only locally brewed beer was '''Singha''' (pronounced just ''Sing'') but it has lost market to cheaper and stronger '''Chang'''. Both Singha and Chang beer are fairly strong (Chang being 6.0% now as at 2014-was 6.4% , and Singha 5%), but for those who prefer something a bit lighter, both local brands have introduced low-alcohol versions of their beers. '''Singha Light''' comes in at 3.5%, '''Chang Draught''' is 5% and '''Chang Light''' is 4.2%. There is also now a '''Chang Export''' brand at 5%. Both are strong in alcohol percentage, gives a little spicy taste (for Europeans, you can refer them to Leffe or Duvel) rather than blended smoothness of German beers (Erdinger or Paulaner). Chang has a reputation for having an inconsistent alcohol content, where sometimes a few Chang beers can be more potent than expected. There are also some cheaper local beers. Singha Brewing launched the lower priced '''Leo''' brand to compete more effectively with Chang (very popular among locals and expats) and '''Archa''' (cheapest, but the taste is not as nice, it's not sold in the bars often, but is available in almost any 7-11) being among the most popular. Leo and Archa are both 5%, and Archa is the cheapest of all in the 711.\n\n* '''Premium brands''': The two most popular premium brands are '''Heineken''' and '''Tiger''', but '''San Miguel''', '''Federbrau''' and other Asian beers such as the Japanese '''Asahi''' are also fairly commonplace. The premium beers tend to be a bit weaker than the full-strength local beers, and are about 10-20% more expensive.\n\n* '''Imported beers''': Most upmarket pubs in touristy areas will have at least a couple of imported beers available along with the usual local brands, either on draught, in bottles or both. Belgian and German beers can often be found, as well as Irish stouts and ales such as '''Guinness''', British bitters such as '''John Smiths''' and the light Mexican beer '''Corona''' is gaining in popularity. Regional favourite '''Beerlao''' has also started to make an appearance in bars and pubs around the country. All imported beers (with the exception of Beerlao) are very expensive though, being about twice the price of locally sourced beers.\n\n* '''Other non-beers''': The usual range of \"alcopops\" is available in Thailand, with '''Bacardi Breezer''' enjoying the lion's share of the market. '''Spy''' wine cooler (of about 10 varieties) is also popular. '''Cider''' is harder to find, although some pubs have started to stock '''Magners''' and '''Bulmers'''. \n\n''''Imported drinks''''\n\nImported liquors, wines and beers are widely available but prohibitively priced for the average Thai. A shot of any brand-name liquor is at least 100 baht, a pint of Guinness will set you back at least 200 baht and, thanks to an inexplicable 340% tax, even the cheapest bottle of wine will set you back over 500 baht. Note that, in cheaper bars (especially the go-go kind), the content of that familiar bottle of Jack Daniels may be something entirely different.\n\n== Sleep ==\nThailand has a plethora of accommodation in every price bracket. Always take a look at the room (or better still several rooms, sometimes owners offer not the best/cheaper rooms first) before agreeing a price. In smaller establishments also do ask for the agreed price in writing to avoid problems during check out. \n\nThe best prices (30%-50% off rack rates) for accommodation can be found during Thailand's low season, which is during May - August, which not surprisingly also coincides with the region's monsoon season. The peak season is during December - February.\n\nThe prices listed are average for the country, and vary depending on the region and season. Smaller provincial towns will not have fancy hotels or resorts, while on popular island beaches it may be hard to find something cheaper than 300-400 baht even during the low season.\n\n'''[[Hostels]]''' are  something not typical for Thailand. You will often get a bit more Westernized and hotel-like interiors. They will usually have both a dorm and private rooms, depending on what you are interested in. Hostels will usually always be filled with western tourists, and it is easy to make friends and socialize with the other guests. Most hostels will have decent air conditioning as well. They will almost always have free wifi, and usually a guest bar.\n\n'''Guesthouses''' are usually the cheapest option, basic ones cost 100-200 baht per room per night (100 or less for a dorm bed). This gets you a room with a fan, a squat toilet (often shared), shower (shared or private) and not much else. Better guesthouses, especially in towns with significant amount of foreign guests, have more amenities (European style toilet, 24h hot shower, bigger room or even balcony, free wi-fi internet, sometimes TV, everyday room service, fridge) - with price, subsequently, in the range 200-500 baht. This makes them close to Thai hotels - however, the difference is they're more oriented to the Western clientele, and as such often offer various tours (sometimes overpriced), computers and/or in-room Internet access, or even have a ground floor restaurant.\n\nIf you're satisfied with the guesthouse of your choice and plan to stay there for more than several days (especially during the low season or in the places with abundant accommodation options such as Chiang Mai) - ask for a discount; this may be offered not everywhere, but if it is - even weekly rate may be 25% less or so, and for monthly rates it's not uncommon to be twice or more cheaper. Normally, you'll have to pay for the entire period asked, but note that if something changes and you have to check out early - money refunds are not customary in Thailand. As such, if an early departure is possible (but unlikely enough to pay a week/month in advance) - you should discuss this option with the owner/manager beforehand.\n\nLast-minute bookers can often get quite steep discounts at nice hotels. Last-minute deals can be found on the internet or since recently on some mobile applications that give you large discounts on same-day bookings. If you are lucky you can get a decent 3 or 4 star hotel for the price of a hostel or guesthouse room. \n\n'''Thai hotels''' start around 200 baht and go up to around 800 baht. The upper end of this range will be air-conditioned, the lower end will not. The primary difference is that with a hotel room, your bathroom should be private, bed linen and towels should be provided, and there may be a hot shower.  The guests are mostly Thais. TVs are available except in the lower end; Internet access, though, is less likely to be present than in guesthouses; and is even less likely to be complimentary and/or in-room.\n\n'''Tourist hotels''' are generally around 1000 baht and offer the basics for a beach vacation: swimming pool, room service and colour TV.\n\n'''Boutique hotels''', 2000 baht and up, have mushroomed during the past few years, they provide a limited number of rooms (10 or less) and more personalized service.  While these can be excellent, quality varies widely, so research is essential.\n\n'''Business and luxury hotels''' , 4000 baht and up, offer every modern amenity you can think of and are largely indistinguishable from hotels anywhere else in the world. Some, notably [[Bangkok/Silom#Sleep|Bangkok]]'s '''Sofitel So Bangkok''','''The Oriental''','''The Sukhothai''' and '''The Peninsula''' are among the world's best hotels.  The most luxurious '''resorts''' also fall in this price category, with some of the very best and most private adding a few zeros to the price.\n*<sleep name=\"Hcube \" alt=\"Cozy mini duplex room\" address=\"Pattanakarn rd,\" directions=\"near Hua Mark ARL station\" phone=\"\" url=\"https://th.airbnb.com/rooms/15336043\" checkin=\"\" checkout=\"\" price=\"\" lat=\"\" long=\"\">easy access to transportation, close to Suvarnaphum Airport, shopping, food, hospital</sleep>\n\n\n==Stay safe==\nThe number one cause of death for visitors to Thailand is '''motorbike accidents''', especially on the often narrow, mountainous and twisty roads of [[Phuket]] and [[Samui]].  Drive defensively, wear a helmet, don't drink and avoid travel at night. If you don't have experience of riding motorcycles, don't rent a motorbike in Thailand, unless you want to risk ending up as another statistic. Riding a motorcycle through Bangkok traffic can be '''very''' dangerous indeed, Thai motorists can be very unpredictable at best, and downright dangerous at other times.\n\n===Political unrest===\n\nThailand is deeply troubled politically. The army has overthrown the democratically elected government twice since 2000 and now runs Thailand. A new constitution has been drafted which would greatly curtail the power of elected governments. A referendum on this draft has been promised for 2016 but public discussion of it is severely curtailed and the military junta  have announced the setting up of a network of reducation camps for critics of the regime. The political situation is likely to remain tense.\n\nDo not under any circumstances say or write anything negative, or even make jokes, about the Thai royal family. There are strict Lese Majeste laws. This extends as far as the currency, which bears the picture of the king.  Many locals will not hesitate to physically assault you or at the least verbally attack you. This will also usually land you in prison and your embassy will have little influence in freeing you. The Islamist group Jemaah Islamiyah still operates in the country, and may have links to foreign jihadists.\n\n===Scams===\nThailand has more than its fair share of [[scams]], but most are easily avoided with some common sense. Just remember, if something seems to good to be true, then it almost certainly is. A genuine tuk-tuk driver will not drive all day for 20 baht! And real precious gems are never sold for a fraction of their real value!\n\nMore a nuisance than a danger, a common scam by touts, taxi drivers and tuk-tuk drivers in Thailand is to wait by important monuments and temples and waylay Western travellers, telling them that the site is closed for a \"Buddhist holiday\", \"repairs\" or a similar reason. The 'helpful' driver will then offer to take the traveller to another site, such as a market or store. Travellers who accept these offers will often end up at out-of-the-way markets with outrageous prices - and no way to get back to the centre of town where they came from. Always check at the front gate of the site you're visiting to make sure it's ''really'' closed.\n\nSome Tuk-tuk drivers might demand much higher price than agreed, or they might take you to a sex show, pretending they didn't understand the address (they get commissions from sex shows). For the same reason, avoid drivers who propose their services without being asked, especially near major tourist attractions.\n\nIf you are in a public park, and someone approaches you and puts bird seed in your hand, do not take it or you will be charged an exorbitant amount after you have fed the birds!\n\nDon't buy any sightseeing tours at the airport. If you do, they will phone several times to your hotel to remind you about the tour. During the tour, you will be shortly taken to a small temple, without a guide, and then one shop after another (they get commissions). They might refuse to take you back home until you see all the shops. On your way back, they pressure you to buy more tours. Also, there are some unscrupulous travel agents in Bangkok targeting naive Westerners, after buying a huge package taking you around Thailand with plane tickets and hotels etc, when you arrive at the airport you may find that nothing has been booked and you have lost your money!\n\nEasily identified with practice, it is not uncommon in tourist areas to be approached by a clean cut, well dressed man who often will be toting a cellphone. These scammers will start up polite conversation, showing interest in the unsuspecting tourist's background, family, or itinerary. Inevitably, the conversation will drift to the meat of the scam. This may be something as innocuous as over-priced tickets to a kantok meal and show, or as serious as a gambling scam or (particularly in [[Bangkok]]) the infamous '''gem scam'''. Once identified, the wary traveller should have no trouble picking out these scammers from a crowd. The tell-tale well pressed slacks and button down shirt, freshly cut hair of a conservative style, and late-model cellphone comprise their uniform. Milling around tourist areas without any clear purpose for doing so, the careful traveller should have no difficulty detecting and avoiding these scammers.\n\nMany visitors will encounter young Thai ladies armed with a clipboard and a smile enquiring as to their nationality, often with an aside along the lines of \"please help me to earn 30 baht\". The suggestion is that the visitor completes a tourism questionnaire (which includes supplying their hotel name and room number) with the incentive that they just might win a prize - the reality is that everyone gets a call to say that they are a \"winner\"; however, the prize can only be collected by attending an arduous time-share presentation. Note that the lady with the clipboard doesn't get her 30 baht if you don't attend the presentation; also that only English-speaking nationalities are targeted.\n\n'''5 most common scams''' in pattaya are Pickpockets,Jet Ski Scam,,Bill Padding,The Bar girls of Pattaya,The 1000 Baht scam.\n\nNever keep your wallet in your back pocket and check your bill (they will write in Thai to try and confuse you, ask for the bill in English).\n\nIf you really must rent a jet-ski, take copious photos of the entire jet-ski with the owner present. Otherwise you could be extorted for thousands of dollars after he claims that you damaged his jet-ski.\n\nA more recent serious scam involves being accused of shoplifting in the duty free shops in the Bangkok airport. This may involve accidentally straying across ill defined boundaries between shops with merchandise in hand, or being given a \"free gift\". Always get a receipt. Those accused are threatened with long prison sentences, then given the opportunity to pay $10,000 or more as \"bail\" to make the problem disappear and to be allowed to leave Thailand.  If you end up in this pickle, contact your embassy and use ''their'' lawyer or translator, not the \"helpful\" guy hanging around.\n\nIf a Thai person approaches you speaking excellent English, beware, and if they suggest that you go somewhere, politely decline. And if anyone tries to convince you that the destination you are heading to is closed, ignore them as it will indeed be open, they just want to take you somewhere else and scam you.\n\nBe aware that there are also some Westerners here involved in scamming tourists, the classic setup is to invite you to a 'poker game' but when you arrive it is nothing of the sort, you could end up drugged and missing your wallet. Some of the Thai scammers may also employ foreigners to pretend to be tourists to make the scam seem more believable.\n\nThere has been an increase in the number of Eastern European scammers targeting Thailand's ATMs with skimming devices - if an ATM looks suspicious or appears to have a box attached to the front, do not use it, and report it if you have time.\n\nYou may also be approached by a 'fake monk', usually asking for money. It is unlikely that a genuine monk would strike up a conversation with you, and even less likely that they would ask for money, so politely decline and walk away. \n\nIf you are a smoker, don't walk down the street smoking. Particularly in some areas of Sukhumvit, you may be accosted by a policeman asking for 2000 baht if he sees you dropping your cigarette butt in public. It's debatable as to whether or not this is a scam, but something to be aware of nonetheless. With Thailand increasingly moving towards banning smoking in public places, you are better off having your cigarette in a bar or restaurant, anywhere that provides an ashtray to ensure that you are not caught out.\n\n===Robbery on buses===\nTheft is common enough in Thailand - and buses are a favourite venue. In one famous case, the owner of Noporat Tours in Phuket was caught rifling minibus passengers' bags during a rest stop. People are also drugged and robbed on overnight buses. Steer clear of cheapish and non-government buses, and keep your money in a money belt or another hard-to-reach place. Decline offers of food and especially drink. Warning your travel companions about these dangers will be useful. If robbed, refuse to get off the bus, loudly tell the other passengers what has happened, and ask the driver to call the police. Never part with your valuables - this is not your home country and you are very unlikely to be able to gain any kind of redress if something goes 'missing'.\n\n===Prostitution===\nThailand's age of consent is 15 but a higher minimum age of 18 applies in the case of prostitutes. Thai penalties for sex with minors are harsh, and even if your partner is over the age of consent in Thailand, tourists who have sex with minors may be prosecuted by their home country. As far as ascertaining the age of your partner goes, all adult Thais must carry an identity card, which will state that they were born in 2542 or earlier if they were over the age of 18 on January 1, 2017. The difference is 543 years.[https://bangkokhasyou.com/thai-to-christian-year-converter-online/]\n\nThailand has a high rate of sexually-transmitted diseases (STDs), including HIV/AIDS, both among the general population and among prostitutes.\n\nHowever, most prostitutes in Thailand are very honest and decent and just want to be able to feed their families, bear this in mind. Obviously in the West, prostitutes are considered to be garbage, but remember that this is a third world country, these girls will have exhausted all other options of putting food on the table, and are not doing this for fun. There is no welfare state. They are still human beings with families who love them, so bear this in mind as you walk past them late at night. Not everyone is as privileged as you!\n\n===Drugs===\nThailand has '''extremely strict drug laws''' and your foreign passport is not enough to get you out of legal hot water. Possession and trafficking offenses that would merit traffic-ticket misdemeanors in other countries can result in '''life imprisonment''' or even '''death''' in Thailand. Police frequently raid nightclubs, particularly in [[Bangkok]], with full body searches on all patrons. [[Ko Pha Ngan]]'s notoriously drug-fueled Full Moon Parties also often draw police attention.\n\nPossession of cannabis (กัญชา ''ganchaa''), while illegal, is treated less harshly and, if busted, you ''may'' be able to pay an \"on the spot fine\" to get out, although even this can set you back tens of thousands of baht. It's highly unwise to rely on this.\nWhile some police will accept payments on the spot for violating drug laws, others will strictly follow the harsh drug laws to the letter. \n\nPenalties for drug possession in Thailand vary in harshness depending on the following: category of drug, amount of drug, and intent of the possessor. If you do take the risk and get arrested on drug-related charges, you would do well to immediately contact your embassy as a first step. The embassy usually cannot get you out of jail but can alert your home country of your arrest and can often put you in contact with a lawyer in Thailand. The availability of drugs in Thailand can mislead tourists into making light of the penalties for possessing or selling drugs, but that is unwise.\n\nBe aware of a common scam involving drugs. Someone will offer to sell you the drugs, but they are secretly in cahoots with a policeman. If you buy the drugs, he will phone the policeman and within one minute of purchase, a policeman will arrive and search you. Once you have been arrested, the drugs are given back to the dealer, and the policeman will begin to extort you for hundreds of thousands of baht, or even worse, will lock you up in a prison of the most appalling conditions.\n\nThe conditions of a Thai prison are unimaginable to most Westerners - indeed many people do not survive their sentence and die from illnesses or beatings from other prisoners or guards.\n\nIn short, '''never touch drugs in Thailand''', and if you suspect someone of using them, then get as far away as you can so that you can't be implicated in case something happens!\n\nAlso, even if you do not possess drugs, in the eyes of the Thai police, having drugs in your blood counts as possession and you will be in trouble. A positive urine sample can put you in hot water very fast.\n\n===Civil conflict===\nIn 2004, long-simmering resentment in the southern-most Muslim-majority provinces burst into violence in [[Narathiwat (province)|Narathiwat]], [[Pattani (province)|Pattani]] and [[Yala (province)|Yala]] provinces. All are off the beaten tourist trail, although the eastern rail line from [[Hat Yai]] to [[Sungai Kolok]] (gateway to [[Malaysia]]'s east coast) passes through the area and has been disrupted several times by attacks.\n\n[[Hat Yai]] (Thailand's largest city after [[Bangkok]] and its [[Nonthaburi]] suburbs) in [[Songkhla (province)|Songkhla]] has also been hit by a series of related bombings; however, the main cross-border rail line connecting Hat Yai and [[Butterworth]] (on the west coast) has not been affected, and none of the islands or the west coast beaches have been targeted.\n\nIn September 2006, three foreigners were killed in bombings in Hat Yai. Some rebel groups have threatened foreigners, but while targets have included hotels, karaoke lounges and shopping malls, Westerners have not been singled out for attacks.\n\n===Passport===\nMake a photocopy of your passport and the page with your visa stamp. Always keep your passport or the photocopy with you (the law requires that you carry your actual passport at all times, but in practice a photocopy will usually suffice). Many night clubs insist on a passport (and ONLY a passport) as proof of age. It is not required that you leave your passport with a hotel when you check in.\n\n===Security===\nCarrying your own '''padlock''' is a good idea, as budget rooms sometimes use them instead of (or as well as) normal door locks; carry a spare key someplace safe, like your money belt, otherwise considerable expense as well as inconvenience may result should you lose the original. Also consider some type of cable to lock your bag to something too big to fit through the door or window.\n\n===Wildlife===\nThailand has a few dangerous animals.  The most common menace is '''stray dogs''' which frequent even the streets of Bangkok.  The vast majority of which are passive and harmless, but a few of which may carry rabies, so steer clear of them and do not, by any means, feed or pet them. If they try to attack you, don't run as this will encourage them to chase you as if you were prey. Instead, try to walk away slowly.\n\n'''Monkeys''' may be cute and friendly, but in any area where unaware tourists have corrupted them, they expect to get food from humans. They can be very sneaky thieves, and they can bite. As with dogs, you won't want to get bitten, whether or not they have '''rabies'''. Most urban areas do not have \"stray\" monkeys, but [[Lopburi]] is famous for them.\n\nPoisonous '''cobras''' can be found throughout Thailand, hiding in tall brush or along streams.  You're unlikely to ever see one, as they shy away from humans, but they may bite if surprised or provoked.  There are many more poisonous snakes in Thailand as well, including various kinds of vipers, kraits, and sea snakes.  The '''Siamese crocodile''', on the other hand, is nearly extinct and found only in a few remote national parks.  '''Monitor lizards''' are common in jungles, but despite their scary reptilian appearance they're harmless. There are also poisonous centipedes, scorpions and spiders in Thailand.\n\n'''Box Jellyfish''' have killed ocean swimmers, tourists and locals alike, many survive.  All jellyfish stings are extremely painful.  Immediate treatment is for cardiac arrest (CPR).  30 seconds of vinegar will keep tentacles from continuing to sting. Vinegar prevents making the contact worse when you wipe the tentacles off with a cloth.  At the hospital they might give you antivenom and painkillers.  The word is getting out and some resorts have nets around the swimming areas.  If you swim in the ocean between India and Australia you should get more information about them. In 2015 so far there have been two deaths (which is uncommon, usually less than 1/year on average), one a 5 year old French boy, and the second a local Thai tourist from Bangkok (died off of Koh Phangan). \n\n===Racial issues===\nThais are normally very tolerant of tourists, who are unlikely to encounter aggressive racial abuse regardless of skin colour. However, some visitors may notice their ethnicity attracting some innocent attention. Usually, these situations are limited to stares or unwanted attention in shops. Thais are often curious to find out the nationality of the travellers they meet. Apart from this curiosity, most travellers find it easy to strike up a rapport with Thais.\n\nFor some reason, most Thai people look down on anyone with darker skin. Africans in particular may find that they are refused entry to a bar or nightclub, especially if in a group. Your immediate reaction may be to get angry, but remember, this is not the USA, casual racism does exist and nothing that you say or do will improve the situation so quietly go somewhere else without causing a scene.\n\n===Fights===\n'''Do not get into fights with Thais'''. Unless you are their fighting partner, you will eventually be outnumbered 15 to 1, and weapons (metals, sharp objects, beer bottles, martial arts) are usually involved. Trying to break up someone else's fight is a bad idea, and your intention to help may get you hurt. Keep in mind that Thailand's national sport is '''Muay Thai'''. Also known as Thai Boxing, it's a combat sport like few others. Thais train it from childhood and an experienced Muay Thai fighter can easily inflict bone-crushing strikes or even kill someone. It is an extremely bad idea to get into fights with Thais. Thais '''never''' fight one on one, or fight fair. If something kicks off, other Thais will appear out of nowhere and they '''will''' have something in their hand to hit you with.\n\nBasically, Thai people are friendly and willing to welcome you to enjoy your trip in Thailand. Aside from that, most of Thailand is safe, and there are just a few people who are violent. The important thing that Thai people are concerned with, especially with male tourists, is that they shouldn't do something inappropriate to Thai women. For instance, holding hands of a Thai woman who you just met for the first time is one thing you shouldn't do. The culture in Thailand is to give respect to women. There is nothing to worry about if you are being polite.\n\nHowever, it would be better if you used your common sense to get away from trouble and took the usual precautions. 191 is the emergency number in Thailand which can help you if you find yourself in danger.\n\nIf someone is trying to provoke you into starting a fight, '''always''' walk away. Or you could find yourself staying in Thailand for much longer than you anticipated. \n\n==Medical Tourism==\nA growing trend in Southeast Asia is that of foreigners seeking more affordable medical procedures. From hip replacements to dental care, Thailand has become a country of choice for residents of the UK, [[Australia]], [[New Zealand]], [[Canada]], and the [[United States]]. Other countries contributing to the doubling of [[medical tourism]] to Thailand between 2008-2012 include the Middle East ([[UAE]], Kuwait, and Oman), Germany, Japan, and Thailand’s fellow ASEAN countries.\n\nMany factors contribute to Thailand’s attractiveness as a medical tourism destination, not least of which is its well-developed infrastructure, including being a regional hub, and the extreme desirability of the country for tourists for several decades now. Add to that its many excellent medical and dental facilities, including 30 JCI accredited hospitals; its excellent medical establishment with many Western-trained and certified doctors; and the substantial price savings available, and one can well see why so many medical tourists are heading towards Thailand. \n\nAside from Bangkok, the beating heart of the country, tourists are increasingly heading “up-country” for medical, dental, and cosmetic treatment, as well as to the bountiful spa and wellness centres that Thailand is also famous for. These other cities have much to offer as well, and include Chiang Mai, Hua Hin, Koh Samui, Pattaya/Chonburi, and Phuket. \n\n===Medical Treatments===\nThailand has a popular reputation as a cosmetic and sexual reassignment surgery destination; the fact is that it is that, but also much more; the Kingdom is capable of handling the entire gamut of medical procedures and treatments, and this is becoming much more widely known. Dental tourism is also coming to the fore as one of medical tourists’ primary reasons for seeking treatment in Thailand. \n\nDermatology and fertility treatments are also, with dental care, among the most popular specialties in demand by international medical tourists. \n\nFinally, it should be noted that many of Thailand’s finest hospitals have also received Clinical Care Program Certification (CCPC), a reputable standard that assures excellence and quality in the care and treatment of a certain number of specific serious conditions, including many types of cancer, chronic kidney disease, diabetes mellitus, primary stroke, heart failure, joint replacement, and other major diseases and afflictions.\n\n==Stay healthy==\nBeing a tropical country, Thailand has its fair share of exotic tropical diseases. [[Malaria]] is generally not a problem in any of the major tourist destinations, but is endemic in rural areas along the borders with [[Cambodia]] (including [[Ko Chang]] in [[Trat_(province)|Trat Province]]), [[Laos]] and [[Myanmar]]. As is the case throughout [[Southeast_Asia|South-East Asia]], [[dengue fever]] can be encountered just about anywhere, including the most modern cities.  The only prevention is avoiding mosquito bites; wear long pants and long sleeves at dusk in mosquito areas and use repellent (available at any Thai corner shop or pharmacy). [http://wwwnc.cdc.gov/travel/destinations/traveler/none/thailand '''For more information on recommended vaccinations and other tips for staying healthy while traveling, check out the CDC Travelers' Health page dedicated to travel in Thailand.'''] Note: if you want to avoid DEET, there are insect repellents with CMD (a safe, effective plant derivative with a registered name of Citriodiol) but these are not widely available in Thailand, better to stock up before leaving home. \n\nFood hygiene levels in Thailand are reasonably high, and it's ''generally'' safe to eat at street markets and to drink any water offered to you in restaurants.  Using common sense &mdash; eg. avoiding the vendor who leaves raw meat sitting in the sun with flies buzzing around &mdash; and following the precautions listed in our article on [[travellers' diarrhea]] is still advisable.\n\nThere are varying opinions as to whether it is safe to drink the tap water. Some people say the water is perfectly safe, others say to boil it first. When in doubt, stick to bottled water. It's cheap (10-15 baht per bottle) and sold everywhere. \n\n'''HIV/AIDS''' (''Estimated adult (15-49) HIV prevalence is 1.3% in 2007'') and other sexually transmitted diseases are common, especially among sex workers. Condoms are sold in all convenience stores, supermarkets, pharmacies, etc. Avoid '''injection drug use'''.\n\nThere's a pharmacy on every block in Thailand and most are happy to sell you anything you want without a prescription.  However, ''this is technically illegal'', and police have been known to occasionally bust tourists for possessing medicines without a prescription &mdash; even innocuous stuff like asthma meds.\n\n== Respect ==\nThais are a polite people and, while remarkably tolerant of foreigners gallivanting on their beaches and ignoring their culture, you'll find that you will get more respect if you in turn treat them and their customs with respect. If you are a polite and respectful guest in their country, you will be very unlikely to have any problems, and will almost certainly have a more enjoyable trip.\n\n=== The ''wai'' ===\n[[Image:RonaldMcDonald Wai.JPG|thumb|Ronald McDonald showing how it's done]]\nThe traditional greeting known as the '''''wai''''', where you press your hands together as is in prayer and bow slightly, is derived from the Hindu cultural influence from [[India]], and still widely practised. Among Thais, there are strict rules of hierarchy that dictate how and when the wai should be given. In brief, inferiors salute superiors first. You should not wai service people or street vendors. The higher your hands go, the more respectful you are. You will also often see Thais doing a wai as they walk past temples and spirit houses. As a foreign visitor, you are not expected to know how to wai, nor to reciprocate when wai'd to; while you're unlikely to cause offense if you do, you may well look slightly strange. If somebody makes a wai to you, a slight bow alone is more than sufficient for ordinary occasions, and for business, most Thais will shake hands with foreigners instead of waiing anyway.\n\n=== Dress ===\n'''Personal appearance''' is very important in Thailand as a measure of respect to other people, you will find that dressing appropriately means that you are shown more respect in return.  This translates in many ways, even sometimes lowering initial offering prices at markets. While some allowance is made for the differing customs of foreigners, Thais respond more positively to well-dressed Westerners. \n\nTraditionally, Thais are modest and conservative dressers. At a minimum your clothes should be neat, clean, and free from holes or tears. Except at the beach or at sacred sites normal western dress is acceptable for both men and women, except that you should avoid clothing showing a lot of skin. Pants are preferable to shorts, blouses should have capped sleeves, and if tank tops are worn, the straps should be thick (''i.e.,'' not spaghetti straps). Thai men generally wear pants, and most Thais view an adult man wearing shorts as fairly ridiculous; shorts are primarily worn by laborers and schoolchildren. Men's shorts should be knee length or more, if worn at all.\n\nTaking off one's shoes at temples and private homes is mandatory etiquette, and this may even be requested at some shops. Wear shoes that slip on and off easily. Flip-flops, hiking sandals, and clog-type shoes are usually a good pragmatic choice for traveling in Thailand; only in the most top-end establishments are shoes required.\n\nIt is best to play it safe with wats and other sacred sites in Thailand; your dress should be unambiguously modest and cover your entire torso and most of your limbs. For men, ankle-length pants are mandatory; on top, t-shirts are acceptable, though a button-front or polo shirt would be best.  Many recommend that women wear only full length dresses and skirts; you should make sure that your clothing covers at least your shoulders and your knees and some places may require that you wear ankle-length pants or skirts and long sleeved tops. Shorts and sleeveless shirts are highly inappropriate, as are short skirts. The rules are even more strict for foreign visitors, so even if you see a local in shorts it's not OK for everyone.\n\nTopless sunbathing is common by western women at many touristy beaches.  At beaches which are primarily Thai visitors however, this is not advised.\n\n=== Monks ===\n[[Image:Prayer Flags Bangkok.jpg|thumb|upright=1.3|Buddhist prayer flags, [[Bangkok/Rattanakosin|Wat Arun]], [[Bangkok]]]]\nBuddhist monks are meant to avoid the temptation of women, and in particular they do not touch women or take things from women's hands. Women should make every effort to make way for monks on the street and give them room so they do not have to make contact with you. Women should avoid offering anything to a monk with their hands. Objects or donations should be placed in front of a monk so he can pick it up, or place it on a special cloth he carries with him. Monks will sometimes be aided by a layman who will accept things from women merit-makers on their behalf.\n\nWhile some monks do accept money, most of them do not and offering money to a monk is sometimes considered a sign of disrespect in Theravada Buddhist cultures. Therefore, should you wish to donate to a monk, you should only offer food and put your donation in the appropriate donation box at the temple.\n\nIn the morning from 05:00 to 06:30, monks are seen walking in the front of houses and along the main road. At the same time, you can give alms to Buddhist monks. The most popular item that most people offer is rice. While the monks stand in front of you, you put something you had prepared into the monk's alms-bowl. For the next step, you take off your shoes and kneel down and the monks will bless you. During the blessing, you can pour ceremonial water into a bowl which is dedicated to people who have died. When the monks finish with their blessings, the activity is finished. On the Buddhist holy day, you must go to temple if you want to give alms because Monks cannot go outside of the temple.\n\n=== The Royal Family ===\nIt's illegal (lèse-majesté) to show '''disrespect to royalty''', a crime which carries up to '''15 years''' imprisonment. Do not make any negative remarks, or any remarks which might be perceived as disrespectful about the King or any members of the Royal Family.  Since the King is on the country's currency, don't burn, tear, or mutilate it - especially in the presence of other Thais. If you drop a coin or bill, do not step on it to stop it - this is very rude, since you are stomping on the picture of the King's head that is printed on the coin. Also, anything related to the stories and movies ''The King and I'' and ''Anna and the King'' is illegal to possess in Thailand. Almost all Thais, even ones in other countries, feel very strongly when it comes to any version of this story. They feel that it makes a mockery of their age-old monarchy and is entirely inaccurate. In 2007, a Swiss man was sentenced to 10 years imprisonment for spraying graffiti on the King's portrait, although he later expressed remorse and was pardoned by His Majesty personally (quote: \"It troubles Me when such harsh sentences are passed.\") and deported.\n\n=== Animal Abuse ===\n'''Elephants''' are a large part of Thailand's tourist business, and the smuggling and mistreatment of elephants for tourist attractions is a widespread practice. Be aware that elephants are often separated from their mothers at a young age to be cruelly trained under captivity for the rest of their lives. If you intend to go on an '''elephant ride''', purchase an '''elephant painting''' or \"use\" elephants for other activities please take their mistreatment into account. There are a few ethical animal tourism operators in Thailand such as Elephant Nature Park and Maetang Elephant Park in [[Chiang Mai]].\n\nA depressingly common sight on the congested streets of Bangkok and other tourist centres is '''elephant begging'''. During night hours, mahouts (trainers) with lumbering elephants approach tourists to feed the creatures bananas or take a photo with them for a fee. The elephants are brought to the city to beg in this way because they are out of work and are mistreated and visibly distressed under the conditions of the city. Please avoid supporting this cruelty by rejecting the mahouts as they offer you bananas to feed the elephants.\n\nDrugged animals such as lizards and birds are somtimes used by touts as photo subjects. These touts are often seen plying the main tourist beaches of thailand. The tout will take a photo with you and the doped up animal and then demand payment. \n\nRare and endangered species are often sold at markets for pets, and many other animal products are sold as luxury items. Avoid buying rare pets, leather, ivory, talons, dried sea creatures (such as starfish), fur, feathers, teeth, wool, and other products since they are most likely the result of illegal poaching, and buying them contributes greatly to animal endangerment and abuse.\n\n=== Other ===\nThe head is considered the holiest part of the body, and the foot the dirtiest part. Never touch or pat a Thai on the '''head''', including children. If you accidentally touch or bump someone's head, apologize immediately or you'll be perceived as very rude. Similarly, do not touch people with your feet, or even point with them. If someone is sitting with outstretched feet, avoid stepping over them, as this is very rude and could even spark a confrontation. Squeeze around them or ask them to move. Even if the person is sleeping, it is best to go around, as others are likely to notice. Take care when you sit in a temple to cross your legs under you \"mermaid-style\" so your feet do not point at any person or statue. Do not pose alongside a Buddhist statue for a photo and certainly don't clamber on them. It's OK to take photos of a statue, but everyone should be facing it. It is considered impolite and disrespectful to visibly sniff food before eating it, particularly when eating in someone's home (this is true even if the sniffing is done in appreciation). Do not audibly blow your nose in public. Also, as doorway thresholds are considered a sanctuary for spirits, it's important not to step on a raised threshold, but rather to step over it. Keep this in mind especially when visiting temples.\n\nIn Thailand, expression of '''negative emotions''' such as anger or sadness is almost never overt, and it is possible to enjoy a vacation in Thailand without ever seeming to see an argument or an unhappy person.  Thai people smile constantly, and to outsiders this is seen as happiness or friendliness.  In reality, smiling is a very subtle way to communicate, and to those who live in Thailand, a smile can indicate any emotion — from fear, to anger, to sadness, to joy, etc. \"Saving face\" is a very important aspect of Thai culture and they will try to avoid embarrassment and confrontation.\n\nIn public places (such as large markets) the '''National Anthem''' is played over loudspeakers at 8 A.M. and 6 P.M. When this is played, everybody stops what they are doing and stands still, and you should do the same. The '''Royal Anthem''' is played in cinemas before the film, and everyone must stand. It lasts about a minute, then everyone will continue where they left off. In MRT and SkyTrain stations in Bangkok, the escalators will also lurch to a halt to prevent a large human pile-up.\n\n== Cope ==\nBring an open mind and a sense of humour. Don't come with too many preconceived ideas about what Thailand is like, as media and friends’ experiences have a habit of distorting reality. \n\nIf you're sticking to major cities and tourist areas, don't worry too much about under-packing; you can get hold of any essentials you've forgotten. Essentials are a swimming costume, a day pack, an umbrella in rainy season and some warm clothes if traveling in October to December, as some areas get cool. Some sources say there is no point in bringing a raincoat during the warm rainy season because it is so hot and sticky your raincoat will be uncomfortable.\nYou will only need a couple of changes of clothes as you can get washing done anywhere cheaply. Sandals for when your hiking shoes are too hot can be bought cheaply in Thailand, although large sizes for women are harder to come by. If female and anything above a size 2, busty, or tall, it is often difficult to find clothes that will fit you in any of the Thai shops. If you are male and have a waist more than 38\" you will have trouble finding pants. You will largely be limited to backpacker gear (the omnipresent fisherman pants and  \"Same Same\" t-shirts) or Western imports in Bangkok malls, for the same prices as back home or more. While laundry is cheap, it is useful to bring a few changes of clothes, as you may sweat your way through several outfits a day in the Thai weather. \n\nTake enough padlocks for every double zipper to stop wandering hands and lock up your belongings, even in your hotel room.  Lock zippers through the lower holes, ''not'' the upper ones on the pull tabs &mdash; although even this precaution won't help much if you encounter a razor-blade artist.\n\nTake snorkeling gear or buy it on arrival if you plan to spend a lot of your time in the water. Alternatively put up a notice looking for gear from someone who is leaving. A tent for camping if you are a national park buff is a good idea, as is a compass. You might like to bring compact binoculars too if wildlife is your thing. A good map of Thailand is also handy. \n\nTake earplugs for when you're stuck in a noisy room or want to sleep on the bus. Take a mirror for shaving, as often budget places won’t have any. String is very handy for hanging up washing. Cigarette papers can be difficult to find, except in tourist centres. Climbing shoes for rock climbing are useful as Thailand has some of the best cliffs in South-East Asia. \n\nIf you have prescription glasses, it is a good idea to bring a spare pair of glasses or contact lenses plus a copy of your prescription. Bring a book you're prepared to swap. A personal music player is great as a huge range of cheap music is available everywhere. \n\nInto the toiletries bag throw sun screen and insect repellent. Mosquito coils are also a good idea. A small pocket size torch / flashlight will come in handy when the electricity goes out or for investigating caves. Passport photos come in handy for visas. \n\nIf you plan to travel long distances by motorbike, purchase a good quality helmet, which you can do in Thailand. Last but not least, pack your stuff in plastic bags to stop them from getting wet, especially when travelling in the rainy season or on boats.\n\nAside from the above, the following are recommended:\n* Prescriptions for any prescription medications being brought through customs \n* Travel insurance\n* Blood donor/type card\n* Details of your next of kin\n* A second photo ID other than your passport\n* Credit card plus a backup card for a separate account\n\nATM - how to avoid paying the 200 Thai baht (more than 5 usd) every thai bank is charging foreigners for getting money from the ATM: locate an ICBC ATM (Chinese Bank) They charge nothing. Otherwise you will pay the Thai bank fee plus on top the fee for your own bank at home. This can get really expensive if you do not withdraw huge amounts every time.\n==Contact==\n\nConnectivity in Thailand is generally quite good.\n\n===Telephone===\nTo place an outbound international call from a Thai mobile, you can dial any number starting with the \"+\" and then the international prefix like \"44\".   All incoming calls to a Thai numbers are free. Thailand's new prepaid registration rules may mean you have to show a passport to get your SIM card.\n\nFor mobile phone users, Thailand has three mobile service providers - AIS [http://www.ais.co.th/eng], DTAC [http://www.dtac.co.th] and Truemove [http://www.truemove.co.th]) - which may be useful if you have an unlocked phone, ipad or internet device. You can buy a prepaid SIM card for any of the Thai carriers in the airport or at any convenience store for as little as 50 baht.  Better yet, get the 299 Baht traveler sims that come with 100 Baht top up and a week's worth of 3G, and then you can get more as needed.   All 3 carriers have shops in the airport and will help you get set up.  Moreover, at major airports like Chiang Mai and Phuket, you may be greeted by a service provider giving SIM cards away for free. Look for offers in the baggage claim area.\n\nAll Thai sims work on the concept of credit and validity.  Your SIM needs both credit and validity to operate.  If you run out of validity, your SIM will be expired.  You need credit to add validity, make calls, and purchase data packages. Adding credit in Thailand is called top up, and you can top up your SIM at any 7-11, small phone shop or online with a credit card or paypal at MobileTopup.com. [http://mobiletopup.com]\n\nAll phones sold in Thailand are \"unlocked\".  Which means you can use it with any SIM card.  \n\nInternational rates from a Thai carriers are good, but all carriers now offer discount prefixes, like 009 for CAT telecom.  A standard DTAC call, for example, charges 10 baht/minute to call the USA. With the 004 prefix, the cost is 3 baht/minute. By predialing 009 1(xxx)xxx-xxxx for the USA will give you 5 baht/minute rate, at the expense of slight voice quality decrease (which is often unnoticeable).  If you are on AIS 12Call, you can dial 00500 and then your number to save on international calls. [http://www.ais.co.th/00500/en/index.aspx]\n\nTrueMove H offers very good international call rates from 1 baht per minute to destinations including the USA, Canada, Australia, UK, France and Germany with its Inter SIM promotion [http://www.truemove.com/en/Inter-SIM-Prepay.rails]. You may find the SIM cards handed out for free at some airports, branded as an AOT SIM and including 5 minutes of free calls back home. Note that you should also use prefixes (006 for better quality, 00600 for cheaper rate, however, for some countries, the rate is same for both promotions) to get those cheap rates, but this, as well as rates for selected countries, is clearly listed on SIM card packages.\n\nCoverage is very good throughout the country, all cities and tourist destinations (including resort islands) are well covered, and even in the countryside it's more likely you'll get the network signal than not, especially with AIS or DTAC. True Move H coverage is considered the worst, with phones occasionally losing signal even in towns. Nevertheless, if you plan to stay only in major cities/islands, and/or don't need you phone available all the time when outside of those - True SIM is OK too. As of Oct 2013, all networks have 3G on 2100 MHz and have comparable speeds. [http://www.netindex.com/download/4,424/Bangkok/?tab=1] \n\nIf you plan to visit Thailand at least once a year for short periods, consider buying the SIM with minimal validity restrictions (usually one year from the last top up, even if it was 10 baht). By doing this, you can re-use the SIM on subsequent trips, thus avoiding hassle of buying new one every time, keeping your Thai number the same, as well as saving a bit. For example, DTAC offers Simple SIM [http://www.happy.co.th/index.php?option=com_content&view=article&id=91&Itemid=64&lang=en] plan for that, and before 7-11s sold this one by default, but now they seem to offer cheaper (but with limited validity) Happy SIM instead. Just ask for the former one. Local calls will be a bit more pricey (international are not affected), but usually this is not of much concern for a short time visitor. AIS (1-2-Call) [http://www.ais.co.th/12call/en/sawasdee-nannan.html] has similar (but more expensive) offerings too. If you've already got a Thai SIM and want to switch plan, it is also possible for free or with small charge. You can switch plans with free USSD codes or IVR or by calling the call centre. \n\nFor short term visitors, international roaming onto Thailand's GSM networks is possible, subject to agreements between operators.  There is also some CDMA service in Bangkok and some other cities which allows expensive roaming for customers of some North American CDMA networks.\n\n* Mobile Topup [http://mobiletopup.com] Prepaid top ups online for all Thai networks.\n\n* CAT Telecom 009 IP Telephony service rates [http://www.cattelecom.com/site/th/list_service.php?cat=181&subcat=248] - see how much you'll save on international calls if using 009 instead of +\n\n===Smart Phones / Tablets / Aircards===\nA smart phone is an incredibly useful thing to have while traveling. All three GSM operators offer nationwide GPRS/EDGE and 3G service in all major desitinations. Usually this service is already pre-activated on the prepaid SIM. Internet usage is billed by the minute, if there is no data package chosen. Without a data package, any minute within which your phone accesses the Internet is billed to you. The price of this pay-as-you-use access is not too cheap, around 0.5 to 1 baht/minute; that is comparable to Internet cafes. To avoid these fees, Internet packages can be purchased, which can save you quite a lot, especially if you use this service often. These come in three types: time-based (good for laptop users who spend online just a couple of hours a day), volume-based (appropriate for smartphones or chatting) and unlimited.  You can also purchase unlimited packages by the day, week or month.  See this useful guide to 3G data plans in Thailand [http://thaiprepaidcard.com/3g-data-plans-for-12call-dtac-and-true/].\n\n* [http://www.happy.co.th/index.php?option=com_content&view=article&id=333&Itemid=368&lang=en DTAC Happy Internet] packages. 3G service (850 MHz, 1800 MHz, and 2100 MHz band), as of Dec 2014, is offered in all major cities including Bangkok, Chiang Mai, Phuket, Koh Samui and Krabi area - outside of it.   A DTAC Happy Tourist prepaid SIM with 7 days unlimited internet and 100 Baht calling credit is available for 299 baht online and at Bangkok Airport. As of Jan 2017, travellers coming in from Hong Kong can purchase the DTAC Klook Happy Tourist SIM card THB 299 package for a discounted THB 278 in HKIA Arrival area 1. As of Dec 2013 the DTAC Happy Tourist SIM was being sold for 495 Baht at Phuket Airport (available in the convenience store on your far right as you are exiting through the small strip of shops after the imigration and customs checks - look for the DTAC logo). They also installed and checked it at time of purchase. A check online shows the price should be 300 Baht though so worth checking. Credit refills are available in 7-Eleven, online, and from any cell phone shop. The one week Unlimited 3G package is 79 Baht - Dial: *104*857*5720283*9# to activate.\n* [http://www.ais.co.th/mobileinternet/en/internet-package/ AIS One Two Call] has a similar, but slightly more expensive Internet packages as it's the largest network in Thailand.  AIS's EDGE and 3G coverage is practically seamless, with 4G being rolled out in places.   Most unlimited packages use a Fair Use policy, where you get X GB of the fastest speeds, then slow down after that.  The slower speeds are find for messaging, but not good enough for photos and videos.   One Week Unlimited 3G package is 79 Baht - Dial *777*982*316358 # to activate.\n* TrueMove's packages [http://www.truemove.com/en/wifi-edge-gprs-package.htm] are different in that they offer combined GPRS/EDGE/3G/Wi-Fi service. 3G service (850 MHz) is offered in various places throughout the country, including Bangkok (mostly the city centre and airport), Chiang Mai, Pai, Phuket, Hua Hin, and (reportedly) Koh Samui. Note that 3G and EDGE/GPRS usage are billed separately in some packages - in particular, beware that if you exceed your EDGE/GPRS quota, you will be billed per minute/per megabyte when using GPRS/EDGE even if you have some 3G quota remaining (3G network will disallow any data connections once 3G quota is finished, but this may change in the future). 3G service is pretty fast, but EDGE coverage/speeds are often (but not universally) inferior to those of DTAC and AIS . To use True WiFi, look for \"@truewifi\" network, enter your phone '08xxxxxxxx@truemove' as a login and receive your password via SMS. 3G coverage is expanding rapidly and many places (e.g. most of Chiang Mai beyond the airport till recently, or Pai) do not yet appear on the official coverage maps [http://www.truemove.com/en/service-3g-3.html]. \nTrue's new prepaid package Unlimited x3 [http://truemoveh.truecorp.co.th/3g/sim-truemoveh/prepaid/entry/2193?ln=en] offers Unlimited use of their Wifi network (daily/weekly/monthly = 49/99/299 baht) up to 500MB of 3G Internet (overuse throttled to 128Kbps), and free calls and SMS to True numbers.\nIf you happen to travel outside a big city (eg. from Hatyai to Nakhon) and find you can't access the Internet, you will have to go to your carrier settings and change your carrier network to Manual and select True-H.\n\nNote that to use 850 MHz 3G (DTAC and TrueMove) you'll need a phone or USB dongle capable of 3G WCDMA at 850MHz (not the most popular 2100 MHz) band - while many phones (including all 3G-capable iPhones) do, others, especially older/cheaper ones, may not. Check your phone's manual for supported 3G bands (not to be confused with supported GSM/EDGE bands!). AIS uses even more exotic (for 3G service) 900 MHz band, which is normally used for GSM, so the chances that your 3G device will work with their 3G are even less.\n\nBesides these, there are a couple of lesser-known options:\n\n* TOT 3G and several resellers offer 3G at 2100MHz (compatible with most 3G phones and USB dongles) throughout greater Bangkok. Unlike packages from other providers, data usage is charged by the megabyte, but allowances are typically generous. For example, i-mobile 3GX [http://www.imobile3gx.com/] will give you 2GB of downloads with a 500 baht recharge (for data only).\n \n* CAT Telecom offers CDMA2000 EV-DO Rev.A service in 800 MHz band (supported in most, but not all, CDMA devices). They offer unlimited packages [http://www.catcdma.com/en/prepaid-packet.rhtml], wider 3G coverage, and (theoretically) unlimited quota - but you will have either to buy or to bring your own (unlocked) CDMA2000 EV-DO capable modem or phone.\n\n* Tune Talk [http://www.tunetalk.com/th/services/tunenetsim] offers 500MB/1.5GB/2.5GB for 100/300/500 baht as well as 0.99baht/min calls and 2baht/SMS. Its 3G services operate under the 2100MHz frequency. Getting hold of a SIM card outside Bangkok is a challenge though. The website is well designed in English and you can manage/top up your account online.\n\n* Klook WiFi Router Rental offers unlimited data on a rented mini wifi router for $2 USD per day/~70THB per day for pick-up and drop-off at Hong Kong International Airport. You can connect up to 8 devices to the router and the rates are an extremely good deal for any traveller who is flying from or transiting through Hong Kong.\n\nMany smartphones will access the Internet in the background, even when you're not actually using the phone or the Internet. This can eat up your minutes quickly (and then will start to consume you remaining bahts much faster!) if you have a time-based package. It's best to use either volume-based or unlimited package in this case. Alternatively, make sure your phone has a reliable way of turning off the Internet usage. For Android phones, try APNDroid, available in the Android Market.  \n\nSome smart phones may require you to manually enter the APN (Access Point Name) for the internet to work. APNs have many configurable parameters, but typically only a few pieces of data are necessary. Check your phone's settings; the procedure for editing APNs varies for different phones.\n\n* DTAC - APN Name: www.dtac.co.th, Username: guest, Password: guest\n* AIS - APN Name: internet, Username: ais (may not be necessary), Password: ais (may not be necessary)\n* TrueMove - APN Name: internet, Username: internet, Password: internet \n\nTopping up (refilling) an Internet package is quite straight forward. Before choosing a data package, you need to have as much or more credit on your phone than the 3G/4G data package costs. You can get credit at numerous operator's offices (dtac shop, TrueMove shop, etc.) generally available at the big malls/trade centres (Big C, Tesco, Carrefour etc.) as well as 7-11. If you have a credit or debit card, you can simply [https://mobiletopup.com topup online].  The best way to get help on your data plan is to call the customer support (1678 for dtac, 1331 for True, 1175 for AIS) - they can subscribe a new package, change an existing one or turn off a package. Calls to these service numbers aren't free for prepaid SIM users, with calling rate up to (DTAC) 3 baht/minute.  You can also try via IVR voice menu (free of charge): *1004 for DTAC happy (Thai language only, so consult someone who can understand if you do not), *9000 for True (in English, at least for Inter SIM handed out in the airports).  And finally this resource has a list of packages and the codes needed to get the package [http://thaiprepaidcard.com/3g-data-plans-for-12call-dtac-and-true/]\n\n===Internet===\nInternet cafés are widespread and most are inexpensive. Prices as low as 15 baht/hour are commonplace, and speed of connection is generally reasonable but many cafes close at midnight. If you plan to go online for a short time you should first ask if there is a minimum charge. Higher prices prevail in major package-tourist destinations (60 baht/hour is typical, 120 baht/hour is not unusual). Islands with multiple Internet cafés include [[Ko Phi Phi|Ko Phi Phi (Don)]], [[Ko Lanta|Ko Lanta (Yai)]], [[Ko Samui]], [[Ko Pha Ngan]], [[Ko Tao]], [[Ko Chang|Ko Chang (Trat)]], [[Ko Samet|Ko Samet (Rayong)]], [[Ko Si Chang|Ko Si Chang (Chonburi)]], and of course [[Phuket]]. \n\nOutside the most competitive tourist areas, free Wi-Fi Internet is not as common as neighbouring countries in many budget hotels and guest houses (\"mansions\") and they usually charge small fee for Internet by LAN or Wi-Fi even if you bring your own laptop. While Wi-Fi is commonly available in certain cafes and restaurants, it's frequently provided by carriers who charge fees for using them, and it usually requires a telecom account to finish the registration process.\n\n'''Keyloggers''' are all too often installed on the computers in cheap cafes, so be on your guard if using online banking, stock broking, or even PayPal. Using cut and paste to enter part of your password may defeat some of them. Or typing part of the user name and password inside the text input field (for password or username) then clicking outside of it some place in the browser window and typing some characters and then clicking back into the text input field and continuing to type the other part and doing this several times. Otherwise take your own laptop to the Internet cafe.\n\nIf you suddenly and unexpectedly find yourself typing in Thai (or any other alien script) you've probably accidentally hit whatever key-combination the computer you're using has been configured to use for switching between languages (often Cmd+Spacebar (Mac), Alt+Shift (Chromebook), Backtick (Windows)). To change back, use the \"Text Services and Input Languages\" option (a quick-access menu is usually available via a \"TH\" icon visible on the taskbar - simply switch it to \"EN\").\n\nBoth pornography and criticism of the Thai Royal Family are illegal and The Thai government actively censors access websites with this content, both inside and outside Thailand. Though enforcement is not consistent.\n\n==Emergency numbers==\n*Emergencies: '''191''', 123, '''999''' (112 on GSM mobile networks)(expect to change to 911 soon)\n*Fire: '''199'''\n*Tourist Police usually have English speakers available: 1155\n*Highway Patrol 1193\n*Traffic control 1197\n*Police Headquarters 1196\n\n{{IsPartOf|Southeast_Asia}}\n\n[[ca:Tailàndia]]\n[[de:Thailand]]\n[[eo:Tajlando]]\n[[es:Tailandia]]\n[[fi:Thaimaa]]\n[[fr:Thaïlande]]\n[[hi:थाइलैंड]]\n[[hu:Thaiföld]]\n[[it:Thailandia]]\n[[ja:タイ]]\n[[nl:Thailand]]\n[[pl:Tajlandia]]\n[[pt:Tailândia]]\n[[ro:Tailanda]]\n[[ru:Таиланд]]\n[[sv:Thailand]]\n[[zh:泰国]]\n[[wts:Category:Thailand]]\n[[Dmoz:Asia/Thailand/]]\n[[World66:asia/southeastasia/thailand]]\n\n{{outline}}\n{{countryguide}}\n{{hasDocent|Yensabai}}\n\n{{related|Meditation_in_Thailand}}\n{{hasDocent|Jeffmcneill}}"
        }
    }
}