{
    "parse": {
        "title": "United Kingdom",
        "pageid": 855,
        "wikitext": {
            "*": "{{pagebanner|United Kingdom banner 2.jpg}}\n\n{{quickbar\n| image=Westminster_Bridge_River_Thames_London_UK.jpg\n| caption=Palace of Westminster, London\n| flag=Flag of the United Kingdom.svg\n| location=United Kingdom in its region.svg \n| capital=[[London]]\n| government=Parliamentary devolved democracy under a constitutional monarch \n| currency=Pound sterling (£, GBP)\n| area=242,295km²<br />''water: 1,680km²<br />land: 241,930km²''\n| population=65 million (2016 estimate)\n| language=English, Welsh (c. 26% of population in Wales), Scots (mostly spoken in the Lowlands of Scotland) Scottish Gaelic (c. 60,000 in Scotland), Ulster-Scots (parts of Northern Ireland) & some speakers of [[Irish]] in Northern Ireland\n| religion=Christian 37.5 million (59.5%), Muslim 2.7 million (4.4%), Sikh 432,000 (0.7%), Hindu 835,000 (1.3%), Jewish 269,000 (0.4%), Buddhist 261,000 (0.4%), no religion 16.2 million (25.7%)\n| electricity=230V, 50 Hz ([[Electrical_systems#Plugs_and_adapters|Type G]] plug)\n| callingcode=+44\n| tld=.uk\n| timezone='''UTC'''<br />''UTC +1 during \"British Summer Time\" (BST)'' \n| emergencies=dial '''999'''\n}}\n\nThe '''United Kingdom of [http://www.visitbritain.com/ Great Britain] and [http://www.discovernorthernireland.com/ Northern Ireland'''] (the ''United Kingdom'' or the ''UK'') is a constitutional monarchy comprising much of the [[Britain and Ireland|British Isles]].\n\nThis Union is more than 300 years old and comprises four constituent countries: [[England]], [[Scotland]], [[Wales]], and [[Northern Ireland]]. It occupies all of the island of Great Britain, the north-eastern portion of the island of Ireland and most of the remaining British Isles. \nThe UK is an island nation, but shares a open land border with [[Ireland]]. It neighbours several countries by sea, including [[France]], [[Belgium]], the [[Netherlands]], [[Germany]], [[Portugal]], [[Spain]], [[Denmark]], [[Norway]], [[Sweden]], the [[Faroe Islands]] and [[Iceland]]. \n\nThe UK today is a diverse patchwork of native and immigrant cultures, possessing a fascinating history and dynamic modern culture, both of which remain hugely influential in the wider world. Although Britannia no longer rules the waves, the UK is still an overwhelmingly popular destination for many travellers. Its capital and largest city of [[London]] is, along with [[New York]], often reckoned to be one of only two cities of truly global importance but many come to see quaint villages and the beautiful and quickly changing countryside.\n\n==Understand==\n* England is just one of the constituent parts of the United Kingdom, alongside Wales, Scotland and Northern Ireland.  Treating \"England\" and \"The United Kingdom\" as synonyms is a mistake commonly made by visitors, which can annoy the Welsh, Scottish & Northern Irish.  Similarly, \"British\" and \"English\" are not the same.  \n* It is important to remember that the [[Republic of Ireland]] is a completely separate state from the United Kingdom, that seceded from the Union in 1922 and gained full independence in 1937. \n\n===Home nations===\nThe 'Great' in Great Britain (''Britannia Major'' in Roman times; ''Grande-Bretagne'' in French) is to distinguish it (the ''island'') from the other, smaller \"Britain\": [[Brittany]] (''Britannia Minor''; ''Bretagne'') which is a region of northwestern [[France]].\n\nHowever, for a geographer \"Great Britain\" (\"GB\") refers just to the single largest island in the British Isles that has most of the land area of Scotland, England and Wales. In normal usage it is a collective term for all those '''three''' nations together. Great Britain became part of the United Kingdom when the Irish and British parliaments merged in 1801 to form the \"United Kingdom of Great Britain and Ireland\". This was changed to \"... and Northern Ireland\" when all but the six Northern Irish counties seceded from the Union in 1922 after a treaty granting Irish home rule. [http://digitaldiplomacy.fco.gov.uk/en/guidance/content/editorial/style/uk-britain \"Britain\"] is simply another name for the United Kingdom, and does include Northern Ireland, despite common misconceptions otherwise.\n\nThe flag of the United Kingdom is popularly known as the '''Union Jack''' or, more properly, '''Union Flag'''. It comprises the flags of St. George of England, St. Andrew of Scotland and the St. Patrick's Cross of Ireland superimposed on each other.  Within England, Northern Ireland, Scotland and Wales, the flags of each nation are commonly used.  The St. Patrick's Cross flag is often seen on St. Patrick's Day in Northern Ireland. Since the Republic of Ireland split from the UK though, St. Patrick's Saltire is not used for Northern Ireland, as it represented the whole of the island of Ireland. A flag (known as the \"Ulster Banner\") was designed for Northern Ireland in the 1920s, which was based on the flag of Ulster (similar in appearance to the Saint George's Cross flag of England) and includes a Red Hand of Ulster and a crown. Although the flag's official status ended with the dissolving of the province's devolved government in the early 1970s, it can still be seen in Northern Ireland, particularly among the Loyalist community and on sporting occasions. As Wales was politically integrated into the English kingdom hundreds of years ago, its flag was not incorporated into the Union Jack. The Welsh flag features the Red Dragon of Cadwaladr, King of Gwynedd, superimposed on the Tudor colours of green and white.\n\n===Crown Dependencies===\n[[File:British Overseas.png|thumb|upright=1.7|Map showing how far away many Overseas territories are from the UK (click image to see enlargements)]]\n\n{{infobox|You don't have to be British to vote in the UK!|* '''British''', '''Irish''', '''EU''' and qualifying '''Commonwealth''' citizens aged 18 or over qualify to register to vote in UK elections in the borough where they reside with a 'considerable degree of permanence'.\n* This means that those who, for example, go to the UK to study or spend their gap year can register to vote, but not those who visit the UK on a short holiday.\n* A ''''qualifying Commonwealth citizen'''' is a national of a Commonwealth country/territory (including Fiji, Zimbabwe, the whole of Cyprus and British Nationals (Overseas) from Hong Kong) who has any type of leave to enter or remain in the UK on the date of his/her electoral registration application.\n* Students are specifically permitted to register to vote at '''both''' their home and term-time addresses.\n* British, Irish and Commonwealth citizens can vote in '''all''' UK elections, whilst other EU citizens can vote in all elections except for UK Parliamentary elections.\n* You can still register to vote in the UK even if you are already registered to vote in another country.\n* You may be unable to open a bank account or apply for a mobile phone contract if you are not on the electoral roll.\n* Register to vote at the [http://www.aboutmyvote.co.uk Electoral Commission's website].}}\nThe [[Isle of Man]] and the various [[Channel Islands (United Kingdom)|Channel Islands]]  are not strictly part of the UK, but rather are 'Crown Dependencies' (or, in the case of [[Sark]], a Crown Appanage): they have their own democratic governments, laws and courts and are not part of the EU. They are not entirely sovereign either, falling under the British Crown which chooses to have its UK Government manage some of the islands' foreign and defence affairs. The people are British Citizens, but unless they have direct ties with the UK, through a parent, or have lived there for at least 5 years, they are not able to take up work or residence elsewhere in the European Union.\n\n===Overseas Territories and the Commonwealth===\nAgain, these are not constitutionally part of the United Kingdom, but are largely former colonies of the former British Empire which are, to varying degrees, self-governing entities that still recognise the British Monarch as their head of state. The key difference is residents of Overseas Territories still possess British citizenship, whereas those of Commonwealth nations do not, and are subject to the same entry and immigration rules as non-EU citizens. The British embassy in your home country however may accept visa applications to selected overseas territories and Commonwealth nations.  \n\n===Government===\nThe United Kingdom is a constitutional monarchy with the Queen as the nominal head of state. It has a bicameral parliament: The lower house, known as the House of Commons, is elected by the people and is responsible for proposing new laws. The upper house, known as the House of Lords, primarily scrutinises and amends bills proposed by the lower house. The House of Lords is not elected and consists of Hereditary Peers, whose membership is guaranteed by birth right, Life Peers, who are appointed to it by the Queen, and the Lords Spiritual, who are bishops of the Church of England. The Head of Government is the Prime Minister, who is usually the leader of the majority party in the House of Commons. It has a first-past-the post system divided into local constituencies. In practice, the Prime Minister wields the most authority in government, with the Queen being pretty much a figurehead, though all bills that have been passed in both houses of parliament require the Queen to grant royal assent before they become law.  The Queen ''does'' have limited powers to dissolve parliament and call a general election in exceptional circumstances - for example during times of war, or if an election ends in stalemate; but these are generally never exercised.\n\nAdditionally, Northern Ireland, Scotland and Wales have their own elected bodies (the Northern Ireland Assembly, Scottish Parliament and Welsh Assembly). These devolved governments have a First Minister and varying degrees of power over matters internal to that constituent country, including the passing of laws. For example, the Scottish Parliament in Edinburgh exercises power and passes laws over almost every matter internal to Scotland. In the areas over which it has power, the UK government plays no role. As a result, institutions and systems can be radically different between the four constituent countries in the UK. England has no similar body of its own, with all government coming from Westminster.  The exception to this is [[London]], which owing to its huge size and population has partial devolved government in the form of an elected Mayor and assembly, which exercises a range of powers previously controlled by both central and local governments.\n\nThere are also local government authorities responsible for services at a local level. Each constituency votes for a local MP (Member of Parliament) who then goes to sit in Parliament and debate and vote.\n\n===Using maps and postcodes===\nMost basic mapping in the United Kingdom is undertaken by the [http://www.ordnancesurvey.co.uk/ Ordnance Survey of Great Britain] and the [http://www.osni.gov.uk/ Ordnance Survey of Northern Ireland]. The maps found in bookshops may be published directly by those organisations, or by private map publishers drawing on basic Ordnance Survey data.\n\nOne consequence of this for the traveller is the widespread use of Ordnance Survey grid references in guide books and other information sources. These are usually presented [xx999999] (e.g. [SU921206]) and form a quick way of finding any location on a map. If using a GPS be sure to set it to the British National Grid (BNG) and the OSGB datum.\n\nAlternatively, every postal address has a postcode, either a unique one or one shared with its immediate neighbours.  British postcodes take the form '''(XXYY ZZZ)''', where XX is a 2 or 1 character alphabetic code representing the town, city or geographic area, a 1 or 2 digit number ''YY'' representing the area of that town or city, followed by a 3 digit alphanumeric code ''ZZZ'' which denotes the road and a specific section or house on that road.  Therefore, a postcode will identify a location to within a few tens of yards in urban locations; and adding a house number and street will identify a property uniquely (at road junctions two houses with the same number may share the same postcode).  Most internet mapping services enable locations to be found by postcode.  Owing to London's huge size and population it has its own distinct variation of the postcode system where the town code XX is replaced by an area code indicating the geographic part of the city - e.g N-North, WC-West Central, EC-East Central, SW-South West; and so on. Although NE refers to Newcasle upon Tyne, 300 miles away, and S to Sheffield, 170 miles away.\n\nThe Ordnance Survey's 1:50000 or 1:25000 scale maps are astonishingly detailed and show contour lines, public rights of way, and access land. For pursuits such as walking, they are practically indispensable, and in rural areas show individual farm buildings and (on the larger scale) field boundaries.\n\n===Climate===\nAlthough few visitors come for the weather, the UK has a benign humid-temperate climate moderated by the North Atlantic current and the country's proximity to the sea. Warm, damp summers and mild winters provide temperatures pleasant enough to engage in outdoor activities all year round. Having said that, the weather in the UK is very changeable over both short distances and periods of time and conditions are often windy and wet. British rain is world renowned, but in practice it rarely rains more than two or three hours at a time and often parts of the country stay dry for many weeks at a time, especially in the East. More common are overcast or partly cloudy skies. It is a good idea to be prepared for a change of weather when going out; a jumper and a raincoat usually suffice when it is not winter. In summer temperatures can reach 30ºC (86ºF) in parts and in winter temperatures may be mild, eg: 10ºC (50ºF) in southern Britain and -2ºC (28.4ºF) in Scotland.\n\nBecause the UK stretches almost 800 miles from end to end, temperatures can vary quite considerably between north and south. Differences in rainfall are also pronounced between the drier east and wetter west. Scotland and north-western England (particularly the Lake District) are often rainy and cold. Alpine conditions with heavy snowfall are common in the mountains of northern Scotland during the winter. The north-east and Midlands are also cool, though with less rainfall. The south-east and east Anglia are generally warm and dry, and the south-west warm but often wet. Wales and Northern Ireland tend to experience cool to mild temperatures and moderate rainfall, while the hills of Wales occasionally experience heavy snowfall. Even though the highest land in the UK rarely reaches more than 1,100m, the effect of height on rainfall and temperature is great.\n\n===Bank (public) holidays===\nEach country within the UK has a number of bank holidays, on which the majority of people do not work. Shops, pubs, restaurants and similar are usually open. Many UK residents will take advantage of the time off to travel, both within the UK and abroad. This makes transport links busier than usual and tends to increase prices. If your travel dates are flexible you may wish to avoid travelling to or from the UK on bank holiday weekends.\n\nThe following 8 bank holidays apply in all parts of the UK:\n* New Year's Day (1 Jan)\n* Good Friday (the Friday immediately before Easter Sunday)\n* Easter Monday (the Monday immediately after Easter Sunday) (Except in Scotland)\n* Early May Bank Holiday (the first Monday in May)\n* Spring Bank Holiday (the last Monday in May)\n* Summer Bank Holiday (the last Monday in August, except in Scotland where it is the first Monday in August)\n* Christmas Day (25 Dec)\n* Boxing Day (26 Dec)\n\nNorthern Ireland has the following two additional bank holidays:\n* St Patrick's Day (17 Mar)\n* Battle of the Boyne / Orangemen's Day (12 Jul)\n\nScotland officially has two additional bank holidays:\n* the day after New Year's Day (2 Jan)\n* St Andrew's Day (30 Nov)\nIn practice, with the exception of Easter, Christmas and New Year holidays, UK bank holidays are virtually ignored in Scotland in favour of local holidays which vary from place to place.\n\nWhere a bank holiday falls on a Saturday or Sunday, it is moved to the following Monday. If both Christmas Day and Boxing Day fall on a weekend, the Boxing Day holiday is moved to the following Tuesday.\n\nA full list of bank holidays for future years can be viewed [http://www.direct.gov.uk/en/Governmentcitizensandrights/LivingintheUK/DG_073741 here].\n\n==Regions==\nThe United Kingdom of Great Britain and Northern Ireland is a union made up of the following regions, home nations and territories:\n\n===Great Britain===\n{{Regionlist\n| regionmap=United Kingdom map.png\n| regionmaptext=Map of the United Kingdom\n| regionmapsize=300px\n\n| region1name=[[England]]\n| region1color=#c08a8e\n| region1items=\n| region1description=The largest home nation, in terms both of size and, by far, population.\n\n| region2name=[[Scotland]]\n| region2color=#4f93c0\n| region2items=\n| region2description=The second largest home nation and occupies the northern third of Great Britain. The four archipelagos of Orkney, Shetland, and the Inner and Outer Hebrides are also part of Scotland.\n\n| region3name=[[Wales]]\n| region3color=#b5d29f\n| region3items=\n| region3description=Located within the largely mountainous western portion of Great Britain.}}\n\n===Ireland===\n{{Regionlist\n\n| region1name=[[Northern Ireland]]\n| region1color=#64ad6f\n| region1items=\n| region1description=Located in the north-eastern part of the island of Ireland, consisting of six of the nine counties of the ancient Irish province of '''Ulster'''. \n}}\n\n===Crown Dependencies===\n{{Regionlist\n\n| region1name=[[Channel Islands]]\n| region1color=#f78412\n| region1items=[[Guernsey]], [[Jersey]], [[Alderney]], [[Sark]]\n| region1description=Technically not part of the UK, the Channel Islands consist of a number of small islands off the coast of [[France]].\n\n| region2name=[[Isle of Man]]\n| region2color=#7d2be2\n| region2items=\n| region2description=Technically not part of the UK, the Isle of Man is a small island in the Irish Sea between Britain and Ireland.}}\n\n===Overseas Territories===\n{{Regionlist\n\n| region1name=[[Anguilla]]\n| region1color=#c08a8e\n| region1items=\n| region1description=Located within the [[Caribbean]].\n\n| region2name=[[Bermuda]]\n| region2color=#4f93c0\n| region2items=\n| region2description=It is the UK's oldest overseas colony. It is located in the Atlantic Ocean, closer to  North America than Europe.\n\n| region3name= [[Antarctica|British Antarctic Territory]]\n| region3color=#b5d29f\n| region3items=\n| region3description= Located in [[Antarctica]], it is the UK's largest overseas territory. \n\n| region4name= [[British Indian Ocean Territory]]\n| region4color=#b5d29f\n| region4items=\n| region4description=Located in the [[Indian Ocean]], it is limited to Military personal.\n\n| region5name= [[British Virgin Islands]]\n| region5color=#64ad6f\n| region5items=\n| region5description=Located in the Caribbean as part of the [[Virgin Islands]], it is the closest British territory to the [[United States]], due to its proximity to the [[US Virgin Islands]].\n\n| region6name= [[Cayman Islands]]\n| region6color=#f78412\n| region6items=\n| region6description=Located in the western Caribbean. \n\n| region7name= [[Falkland Islands]]\n| region7color=#7d2be2\n| region7items=\n| region7description=Disputed territory located in the South [[Atlantic Ocean]], next to [[Argentina]].\n\n| region8name= [[Gibraltar]]\n| region8color=#c08a8e\n| region8items=\n| region8description=Located in [[Southern Europe]], and is bordered by [[Spain]] to the north.\n\n| region9name= [[Montserrat]]\n| region9color=#4f93c0\n| region9items=\n| region9description=Located in the Caribbean part of the [[Lesser Antilles]]. \n\n| region10name= [[Saint Helena, Ascension and Tristan da Cunha]].\n| region10color=#b5d29f\n| region10items=\n| region10description=A Group of spread out islands, Located in the Atlantic Ocean.\n\n| region11name= [[South Georgia and the South Sandwich Islands]]\n| region11color=#f78412\n| region11items=\n| region11description=Located in the South Atlantic.\n\n| region12name= Akrotiri and Dhekelia\n| region12color=#7d2be2\n| region12items=\n| region12description=Located in the [[Mediterranean]] both areas border [[Cyprus]]. \n\n| region13name= [[Turks and Caicos Islands]]\n| region13color=#c08a8e\n| region13items=\n| region13description=Located in the Caribbean part of the Lesser Antilles.}}\n\n==Cities==\n<!-- \nREAD THIS ==> This list is meant to be only a SMALL REPRESENTATIVE  SAMPLE of \nREAD THIS ==> cities in the UK, not a complete list of all the interesting ones.\nREAD THIS ==> We know you may disagree with the selections, but in the interest\nREAD THIS ==> of keeping the list manageable a consensus was reached to limit\nREAD THIS ==> the list to nine.  Please discuss on the talk page under \"The old\nREAD THIS ==> city problem\" BEFORE making changes to which nine are selected.  Thanks!\nREAD THIS ==>\n-->\nMany cities and towns in the United Kingdom are of interest to travellers. Here's an alphabetical list of just '''nine''', headed by the UK's capital - others are listed under their specific regions:\n<!-- BEFORE YOU ADD OR REMOVE CITIES HERE, PLEASE DISCUSS IT ON THE TALK PAGE.  THE CURRENT CONSENSUS IS TO LIST ONLY THE NINE CITIES CURRENTLY DISPLAYED. THIS IS WIKITRAVEL POLICY AND CHANGES MADE VIOLATING THIS POLICY WILL BE REVERTED, INCLUDING ANY OTHER EDITS YOU MIGHT CONTRIBUTE TO THIS PAGE. -->\n*[[London]] - world-renowned capital of culture, history and finance, one of the most popular tourist destinations on the planet\n*[[Belfast]] - capital of Northern Ireland and becoming a popular tourist destination, undergoing major renovations and improvements\n*[[Birmingham (England)|Birmingham]] - the UK's second largest city, features great shopping, home of the famous \"Balti Triangle\" and a strong industrial heritage\n*[[Bristol]] - historical city famed for its Georgian architecture and nautical heritage\n*[[Cardiff]] - capital of Wales, host to a proud coal-shipping past, modern architecture, Dr. Who and one of the most successful urban regeneration projects in the country\n*[[Edinburgh]] - capital of Scotland, hosting the largest arts festival in the world and numerous tourist attractions as well as being the second most visited city in the UK\n*[[Glasgow]] - Scotland's largest city, new cultural hotspot, former European City of Culture\n*[[Liverpool]] - buzzing city, famous for its prominence in music, sport, nightlife and Irish influence. Capital of Culture in 2008\n*[[Manchester]] -  thriving bohemian music scene, gay quarter, and home to the world's only new work arts festival\n<!-- Do NOT add another city here; see above. -->\n\n==Other destinations==\n*[[Cotswolds]]\n*[[Giant's Causeway]]\n*[[Gower Peninsula]]\n*[[Hadrian's Wall]]\n*[[Isle of Arran]]\n*[[Lake District National Park]]\n*[[Loch Ness]]\n*[[Peak District]]\n*[[Snowdonia National Park]]\n*[[Stonehenge]]\n*[[Yorkshire Dales]]\n*[[Yorkshire Moors]]\n\n==Get in==\n[[Image:UK get in map.png|thumb|upright=1.3|Major airports and ferry routes]]\n{{infobox|Common Travel Area|If you enter the United Kingdom through Ireland, you will pass through passport control at your port of entry into Ireland, but you will '''not''' be required to clear UK passport control. However, you will only be limited to a stay of '''90 days''' in the UK and Ireland (or whatever the passport control officer in Ireland gives you a leave to remain for) if you qualify for a visa exemption, '''not''' the usual six-month stay in the UK for visa-exempt nationals. Hence, especially if you attempt to enter the UK as a Student Visitor (i.e. a visitor studying for up to 6 months), you should '''not''' transit through Ireland unless you possess a valid UK visa or entry clearance permitting a stay of more than three months or intend to stay in the UK for fewer than three months.\n\nIf you require a visa for either Ireland or the UK, however, you '''must possess a visa''' from each country that requires you to have one if you intend to visit both of them. Not passing through passport control does not exempt one from having a visa if needed, and you can be fined and deported for not having a visa if discovered.\n\nIn addition, no passport control checks are in place from the Channel Islands and the Isle of Man to the UK.}}\n\nThe United Kingdom is physically linked to two other countries. The Channel Tunnel connects the UK to [[France]] and Northern Ireland shares a land border with the [[Republic of Ireland]]. \n\nWhile the UK is a member of the European Union, it does not fully implement the [[Europe#Get_around|Schengen Agreement]], which means that travel to and from other EU countries (except Ireland) involves systematic passport / identity card checks at the border and separate visa requirements for several countries.\n\nAlmost all passengers travelling to the UK from outside Ireland, the Channel Islands and the Isle of Man go through systematic passport/identity card and selective customs checks carried out by [https://www.gov.uk/government/organisations/uk-visas-and-immigration '''UK Border Force)'''] on arrival in the UK. However, those travelling by Eurostar from Paris Gare du Nord, Lille Europe, Calais-Fréthun and Brussels Zuid-Midi stations and by ferry from Calais and Dunkirk undergo UK passport/identity card checks in France/Belgium before embarkation and selective customs checks on arrival in the UK. Those entering the UK by Eurotunnel from France go through both UK passport/identity card and UK customs checks in Coquelles before boarding the train.\n\n===Immigration and visa requirements===\n* '''EU''', '''EEA''' and '''Swiss''' citizens do '''not''' require a visa, and can enter with either a valid national identity card or passport. They have the right to reside and work in the UK. Irish, Cypriot and Maltese citizens have additional rights, including being able to vote in and stand in UK Parliamentary elections. That said, it is better to use a biometric passport, because only this document is accepted for the e-gates. Travelers entering with an identity card (even if biometric) will have to stand in the regular UK/EU queue, which can be (but not necessarily is) lengthy.\n\n* Citizens of [[Anguilla]], [[Andorra]], [[Antigua and Barbuda]], [[Argentina]], [[Australia]], [[Bahamas]], [[Barbados]], [[Belize]], [[Bermuda]], [[Botswana]], [[Brazil]], [[British Virgin Islands]], [[Canada]], [[Chile]], [[Costa Rica]], [[Dominica]], [[East Timor]], [[El Salvador]], [[Falkland Islands]], [[Grenada]], [[Guatemala]], [[Honduras]], [[Hong Kong]], [[Israel]], [[Japan]], [[Kiribati]], [[Macau]], [[Malaysia]], [[Maldives]], [[Marshall Islands]], [[Mauritius]], [[Mexico]], [[Micronesia]], [[Monaco]], [[Montserrat]], [[Namibia]], [[Nauru]], [[New Zealand]], [[Nicaragua]],  [[Palau]], [[Panama]], [[Papua New Guinea]], [[Paraguay]], [[Pitcairn Islands]], [[Saint Kitts and Nevis]], [[Saint Vincent and the Grenadines]], [[Samoa]], [[San Marino]], [[Seychelles]], [[Singapore]], [[South Korea]], [[Solomon Islands]], [[Saint Lucia]], [[Saint Helena (island)|Saint Helena]], [[Taiwan]], [[Tonga]], [[Trinidad and Tobago]], [[Tristan da Cunha]], [[Tuvalu]], [[Turks and Caicos Islands]], [[Uruguay]], [[United States]], [[Vanuatu]], and [[Vatican City]]  require passports for entry, but do '''not''' require a visa for visits of up to 6 months. Once in the UK, they are not allowed to work (with some '''extremely''' limited exceptions; see [https://www.gov.uk/permitted-paid-engagement-visa/overview the UK Government's explanation]) or access public funds (e.g. claiming state benefits). If citizens of these countries/territories wish to stay in the UK for purposes other than a tourist, businessperson or short-term student (i.e. a visitor studying for up to 6 months) or wish to stay for more than 6 months in the UK, they will need to apply for an '''entry clearance''' (i.e. a visa) ''before'' travelling to the UK. Citizens of these countries/territories who do intend to stay in the UK as a student visitor should ensure that their passport is endorsed with a stamp with either the code 'VST' or 'STV'  '''or''' a specific short-term student entry stamp at passport control; otherwise the education provider where they intend to study may refuse to accept them for enrolment.\n\n* Citizens of [[Oman]], [[Qatar]] and the [[United Arab Emirates]] may apply for an Electronic Visa Waiver (EVA), which is valid for tourism and study, and may stay for up to 6 months [https://www.gov.uk/government/news/uk-electronic-visa-waiver-introduced-for-oman-qatar-and-uae]\n\n* A visa (also referred to by UK border officials as ''entry clearance'') is required for citizens of most other countries to enter the UK and a number of countries to transit the UK airside. This can be obtained from the British Embassy, High Commission or Consulate where the applicant legally resides. Unless they are 6 years old or under or travelling directly to the Channel Islands and not passing through the UK or the Isle of Man, UK visa applicants are required to provide biometric data (10-digit fingerprints and a biometric digital photograph) as part of the application process. As part of the visa application procedure, it is necessary to attend a UK visa application centre ''in person'' to provide your biometrics. Check out different types of UK visa here[https://www.migrationexpert.co.uk/visa_uk/].\n\n* Citizens of China and India who have a valid Irish Short-stay Visa (eligible visa categories: Visit(tourist), Visit(family/friend), Business, Conference/Event) and endorsed with \"BIVS\" ''and'' who have cleared immigration in Ireland can visit the UK visa-free until their current permission to enter/remain in Ireland expires.\n\n* The United Kingdom has converted the previous visa categories (except for the visitor and transit categories) into a five-tiered points-based system (PBS), meaning that you will be required to satisfy specific and non-negotiable criteria before the visa is issued. Points-based system visa fees are ''very'' high, so it may be wise to see if the purpose of your visit can be satisfied under a different, non-points based system visa. For example, if you want to stay in the UK for 11 months to study an English Language course, it would be cheaper to apply for a short-term student visa (£170), rather than a Tier 4 student visa (£328) - however, unlike the Tier 4 visa a short-term student visa/status does not entitle you to work whilst in the UK (Tier 4 visa holders are allowed to work for a maximum of 20 hours per week during term time).  \n\n* Commonwealth citizens who are 17 or over and have a British grandparent (or Irish grandparent before April 1922) can apply for an '''ancestry visa'''. This allows residency and work in the UK for five years. After five years, permanent residence (indefinite leave to remain) may be applied for; after 12 months of continuous permanent residence and five years of continuous residence in the UK, ancestry visa holders will be able to apply for naturalisation as a British citizen. All Commonwealth citizens living in the UK (regardless of what type of visa they hold and whether they have a British grandparent) are eligible to vote in all elections.\n\n* Citizens of Australia, Canada, Hong Kong (British National (Overseas) passport holders only), Japan, Monaco, New Zealand, South Korea and Taiwan can apply for a '''Tier 5 Youth Mobility Scheme visa''' (the former Working Holiday visa for all young Commonwealth citizens has been discontinued). The Tier 5 YMS visa allows the holder to undertake a working holiday in the UK for 2 years from the date of issue. Only a limited number of visas are issued for each nationality -- in particular, demand far exceeds supply for Japan and Taiwan. Visit the [https://www.gov.uk/tier-5-youth-mobility UKVI webpage].\n\n* There are generally no immigration checks when entering the UK from Ireland. However, visitors who are not Irish or British citizens are still required to meet admission requirements and should carry their passport (with appropriate visa stamps if required).\n\n====Other requirements====\n\n* All visitors aged 16 or above who are not EU, EEA or Swiss citizens (or their family members in possession of a residence permit/card which gives them the freedom of movement in the EU, EEA and Switzerland) nor Commonwealth citizens who have the right of abode in the UK must complete a '''landing card''' and present it at passport control, unless they are in direct transit to a destination outside the Common Travel Area (i.e. not to the UK, Channel Islands, Isle of Man or Ireland).\n\n* Travellers subject to immigration control should expect to be asked by the immigration officer upon arrival to demonstrate that they have a) a return ticket to leave the United Kingdom or sufficient funds to meet the cost of an onwards plane ticket, b) a valid address at which they will be staying in the United Kingdom and c) sufficient funds with which to support themselves during their stay.  They must demonstrate that they are entitled to the visa they have been issued back home or in the case of visa-free travellers, that they are a genuine business visitor, family/friend visitor or tourist.  An inability to demonstrate these three basics may lead to a refusal of leave to enter (together with cancellation of any existing UK visa) or a grant of restricted leave.\n\n====Character concerns====\n\n* The United Kingdom is known to be somewhat laxer than some other countries when it comes to character concerns of visitors. Landing cards do not ask about prior convictions and border/ visa personnel seem to be more concerned about convictions ''inside'' the UK rather than those abroad. That said, if the border officer questions you about criminal history, you must answer truthfully. \n\n* If you're applying for a visa or entry clearance, you will have to list any criminal convictions as part of the application, although there are no hard and fast rules regarding who is admissible and who is not: each case is viewed on its own merits and a minor conviction long ago is unlikely to cause problems, especially if your behaviour since then has been good.\n\n*If you're applying for a visa, you are also required to disclose if you've ever:\n**'''Declared bankruptcy''', no matter how long ago. \n**'''Been sued for debt''' (i.e. a civil judgement). This is true even if you've satisfied (paid) the judgement or it is no longer legally collectable.\n*: The UKVI takes a dim view of both these situations, as there have been recent abuses of the UK banking and lending system by foreign visitors and immigrants, and unpaid debt or a bankruptcy abroad can be grounds for refusal. Like with criminality, each case is evaluated based on the totality of the circumstances and denial of entry or a visa for credit problems is very unlikely for visitors ''unless'' you owe money in the UK (see below).\n\n*If you have more than £1,000 of unpaid debt <u>in the UK</u>, that is not in good standing, you cannot be issued a visa or granted entry until the debt is paid or satisfactory arrangements are in place to pay it.\n\nFor more information of UK immigration and visa requirements, see the [https://www.gov.uk/government/organisations/uk-visas-and-immigration '''UKVI''' website].\n\n===Customs and goods===\nThe UK has relatively strict laws controlling which goods can and cannot be brought into the country. Selective customs checks are run by the '''UKBF''' at arrival ports. Particularly stringent laws apply to the movement of animals, except from within the EU, where an animal passport system operates, providing proof of vaccination against rabies. The British Isles are rabies-free, and the government (and the people) want to keep it that way. Signs in several languages are displayed prominently at even the smallest of boat landings all around the coast.\n\nOwing to the abolition in 1993 of customs duty on goods for personal use when travelling across EU borders, it has become popular among the British to bring back large quantities of alcohol and tobacco bought at lower tax rates in Continental Europe. However, the practice is open to abuse, with organised criminals trying to illegally import large amounts for the purposes of selling on at a profit. Customs laws are therefore strict for the importing of alcohol and tobacco for non-personal use and if a Customs officer thinks that the amount you are trying to bring into the country from the EU is excessive, particularly if in a commercial vehicle as opposed to a private car, you may be questioned further, or be asked to prove that it is for your own consumption, although ultimately an EU citizen is backed by the EU's free trade laws and allowed unlimited personal quantities. The fines can be severe, and you also run the risk of the goods (and the vehicle they are being transported in) being confiscated. Importing an excessive amount of alcohol in a private car is more likely to result in action being taken for overloading the vehicle, which is a police matter rather than a customs matter.\n\nJust as in the rest of the EU, you must declare if you are physically carrying at least €10,000 in cash or other financial instruments into or out of the EU through a UK airport.  In addition, if you are carrying at least £1,000, you must also be able to show evidence that you are entitled to possess the money in case a customs officer has questions.    \n\nMost ports of entry that receive traffic from non-EU origins use the European Union's red/green/blue channel system. Ports of entry from EU origins are still manned by customs officers who take more of an interest in controlled substances (e.g. illegal drugs) than alcohol or tobacco.\n\n===By plane===\nWhen flying to the UK you are most likely to arrive at one of London's five airports, although there are direct international flights to many other cities. KLM has a large number of feeder flights to almost every UK regional airport from its international hub in Amsterdam Schiphol.\n\nRecently, many airports in southern England have added \"London\" to their names. Be aware that just because an airport has London in its name ''doesn't necessarily'' mean that it is near to, or easily accessible from, London. [[London#By_plane|see ''London, by plane'' for more details...]]\n\nMajor airports outside of the London area:\n*[http://www.manchesterairport.co.uk/ '''Manchester Airport'''] in the North of England is the UK's largest airport outside London, serving many European and a reasonable number of long-haul destinations. This could be a more convenient arrival airport for visitors to North Wales, the North of England and Scotland.\n\nOutside London and Manchester, many of the regional airports offer a wide range of direct links to European and some long-haul destinations.\n\n*[http://www.bhx.co.uk/ '''Birmingham International'''] is the UK's seventh largest airport outside of London. The airport has good European services and some long haul services to far flung places. The airport is served by the major European flag carriers providing global hub connections, as well as LCC's such as Ryanair and Easyjet. It is an ideal gateway to Central England and Wales. Birmingham Airport also has a direct train route to London Euston (journey times approximately 75 minutes on the fastest trains) and is a hub for the low cost airline [http://flybe.com FlyBe].  Advanced rail fares are often cheaper than standard fares from London to Gatwick, Luton and Stansted airports.\n\n*[http://www.liverpoolairport.com/ '''Liverpool John Lennon Airport'''], in North West England, is the UK's fastest-growing airport and is taking on more and more flights. '''Blackpool''' has an international airport nearby offering a lot of package-holiday flights.\n\n*[http://www.newcastleairport.com '''Newcastle International Airport'''] is the only airport in the North East of England offering a daily service to and from Dubai, with connecting flights into Australia and the far east, it is also a hub for easyjet, Thomson, Thomas Cook and Jet2, with flights available to over 100 destinations. Seasonal flights are available to New York with United's service to Newark New Jersey, operating five times a week.\n\n*[http://www.dsaflights.co.uk '''Doncaster Sheffield Airport'''] is an international airport located at the former RAF Finningley station at Finningley, in the Metropolitan Borough of Doncaster within South Yorkshire.\n\nSmaller regional airports include:\n*'''Bristol''', '''East Midlands''', '''Exeter''', '''Robin Hood''', '''Carlisle''', and '''Leeds Bradford''' all have cheap flights to mainland Europe with Ryanair, Jet2, easyJet and Flybe.\n*'''Southampton''' and '''Bournemouth''' Airports are medium-sized, though they have bargain-price flights with Ryanair and Flybe and can be accessed from London Waterloo train station. \n* '''Norwich''' has a busy route to Amsterdam, as well as Flybe flights across the UK.\n* '''Durham Tees Valley''' (formally called Teesside International before 2004 - some tickets and flight booking sites outside the UK still refer to it as Teesside) and '''Humberside''' have KLM feeders via Amsterdam to the Skyteam worldwide network, and irregular low-cost and charter flights to European tourist destinations.  Durham Tees Valley has a £6 'airport improvement fee', payable at the airport by departing passengers.  Neither airport is easily accessible by public transport, apart from taxis.\n*'''Newquay Cornwall Airport''' has a fluctuating number of flights in recent years, mainly due to a £5 'development fee' introduced in 2006, but is ideal for beating the traffic jams down to this beautiful part of Britain.\n* In the South-east there is '''London Ashford Airport''', also known as Lydd Airport has rather seasonal, limited services as does '''Oxford Airport'''. '''Kent International Airport''' is similarly small. \n\nIn '''[[Scotland]]''', the major airports with links to London and abroad are:\n\n*'''Edinburgh''' (Scotland's busiest airport and the UK's sixth, with a wide variety of European and North American routes as well as a couple of recently introduced routes to [[Abu Dhabi]] and [[Doha]], connecting the city with Asia, Africa and Australasia through these large Middle Eastern hubs)\n*'''Glasgow''' has two airports: [http://www.glasgowairport.com/ Glasgow International] (for most major airlines) and [http://www.gpia.co.uk/ Glasgow Prestwick] (for Ryanair and some low-cost flights)\n* '''Aberdeen'''\n* '''Inverness'''\n* Both the '''Orkney''' and '''Shetland''' Isles' airports have links to Scandinavia besides domestic flights in the UK.\n\n[http://www.cwlfly.com/ '''Cardiff International'''], the only international airport in '''[[Wales]]''', is a major hub of Flybe and Thomas Cook, which has a few long-haul flights, such as Barbados. '''Anglesey Airport''' is the only other noteworthy airport of Wales, which has one flight a day to the Isle of Man and Cardiff.\n\nIn '''Northern Ireland''', [http://www.belfastairport.com/ '''Belfast International Airport'''] and [http://www.belfastcityairport.com/ '''George Best City Airport'''] both serve the province's capital. Belfast International has several North American long-haul flights, while Belfast City is very conveniently situated 19 minutes from the centre of Belfast by local bus. [http://www.cityofderryairport.com/ '''City of Derry Airport'''] serves the northwest with a limited number of international and domestic flights.\n\n'''Isle of Man''', '''Guernsey''' and '''Jersey''' all have their own respective airports, with well-serviced flights from around the UK, as well as to France and further afield. Flying is probably more convenient than ferry to these islands.\n\nDue to an increase in airport security and aviation security in general, long delays are possible when checking in for a flight. Additionally a passport or valid photo ID (such as photo driving licence, national ID card, etc.) is required for most internal flights.\n\nNote very well that airports in the UK, particularly Heathrow, are notoriously stringent on the amount of liquids (and creams) you can bring in your hand luggage, regardless of which airline or class you are flying. This rule is heavily enforced, and so it is strongly advisable to pack all of your liquids into your checked baggage. Bring only the bare minimal with you in your hand luggage if absolutely necessary.\n\n===By train===\n\n====From [[Belgium]] and [[France]]====\n[http://www.eurostar.com/ '''Eurostar'''] high-speed trains run between [[London]] (St Pancras International), [[Ebbsfleet Valley|Ebbsfleet]] and [[Ashford (England)|Ashford]] through the '''Channel Tunnel''' to [[Paris]] (Gare du Nord), [[Lille]] (Europe), [[Calais]] (Fréthun) and [[Brussels]] (Zuid-Midi). During the summer an additional weekly train operates to [[Avignon]] and during the winter a weekly service runs a ski service direct to the French [[Alps]]. Through tickets and connections are available through Lille, Paris and Brussels from many European cities to most large UK cities.\n\nJourney times to central London average two hours fifteen minutes from [[Paris]] and one hour fifty minutes from [[Brussels]]. A second class return from Paris to London costs between €85 and €230. While it can be cheaper to fly from London to Paris using a low-cost airline, bear in mind that the journeys to the airports can be expensive and time-consuming.  When arriving in Calais, Lille, Paris or Brussels, there is no immigration or check - passengers simply walk onto the platform, then into the station. Transferring from the Eurostar to the metro/regional services can take less than 5 minutes, compared to over an hour from airports.  Arriving in London's St.Pancras is slightly slower than on the continent, but it should still take less than 15 minutes from the Eurostar platform to the tube platform.\n\nPassengers travelling by Eurostar to the UK from Paris (Gare du Nord), Lille (Europe), Calais (Fréthun) and Brussels (Zuid-Midi) stations undergo UK passport/identity card checks in France/Belgium before boarding, rather than on arrival in the UK. The UK passport checks take place immediately after the Schengen passport/identity card exit checks in the stations. However, UK customs checks take place on arrival in the UK. Eurostar passengers not travelling to the UK (e.g. Brussels Zuid-Midi to Lille/Calais) are not required to go through UK passport/identity card checks as such journeys are within the [[Travel in the Schengen Zone|Schengen Area]].\n\n====From [[The Netherlands]]====\nMultiple daily connections from Dutch cities are possible via [[Brussels]] and the Eurostar to London. It can be cheaper (and more flexible) to book an 'Any Dutch station' Eurostar ticket that permits connection to/from any Dutch station provided the itinerary doesn't use the more expensive Thalys or ICE services.\n\nCombined train and ferry tickets are available to travellers from stations in the Netherlands to train stations in [[East Anglia]], [[Essex (England)|Essex]] and [[London/East|East London]]. This service may be a useful alternative to Eurostar for travellers from Northern Europe, or for those wishing to travel to [[East Anglia]]. The interchange between the ferry terminal and the train station at both ports is very simple and user friendly. Express trains from [[Harwich International]] are timed to meet the ferry and allow a simple transfer to [[London Liverpool Street]]. The [http://www.dutchflyer.co.uk/what_is_the_dutchflyer.asp Dutch Flyer website] gives prices only for tickets purchased in Great Britain; it does, however, give timetable information. [http://www.stenaline.nl/stena_line/home_-_netherlands/nl/londen.html Stena's Dutch language website] allows booking of tickets for journeys starting from the Netherlands.\n\n====From the Republic of [[Ireland]]====\n=====Cross-border rail services to Northern Ireland=====\nFrom [[Dublin]] in [[Ireland]], the [http://www.iarnrodeireann.ie/our_services/enterprise.asp '''Enterprise'''] takes just over 2 hours to [[Belfast]]. Tickets are available from [http://www.irishrail.ie/ Irish Rail] (in the Republic) and [http://www.nirailways.co.uk/ NI Railways] in Northern Ireland.\n\n=====Services to the British mainland=====\nCombined '''Rail & Sail'''[http://www.sailrail.co.uk/] tickets are available from any railway station in the Irish Republic and Northern Ireland to any railway station in [[Great Britain]].  Tickets can be bought from the railway company and ferry operators. Through tickets are available on most sea corridors.\n\nFares are slightly higher during July and August.  '''Virgin Trains''' [http://www.virgintrains.co.uk/promotions/stena_line_2004/default.aspx] may be offering advance-purchase tickets from [[London]] to [[Dublin]] from £32 return, although these are hard to obtain and possible only for journeys starting in Great Britain.\n\n===By car===\n\nThe '''Channel Tunnel''' has provided a rail/road connection since 1994. Shuttle trains operated by Eurotunnel carry cars from [[Calais]], [[France]] to [[Folkestone]], the journey taking around 40 minutes. Fares start at £49 one way and can be booked on the Eurotunnel website [http://www.eurotunnel.com/ukcmain]. On arrival at Folkestone, you can drive on to the '''M20''' motorway which heads towards [[London]]. Passengers travelling from France to the UK undergo UK passport/identity card and customs checks in Coquelles after the French exit checks before departure, rather than on arrival in the UK.\n\n'''Car ferries''' also operate to many parts of the UK from other European countries - see the 'by boat' section below. \n\nDrivers entering Northern Ireland from the Republic of Ireland will usually find they have done so without noticing. There are no border controls, and only the major roads will display signs stating that you are leaving one country and entering the other.  However, the appropriate travel documents for your nationality are still required for cross-border travel despite the lack of border controls and you are liable under the laws of the country you are attempting to enter if you don't have any.  It should be noted that road signs in the Republic of Ireland are in kilometres while those in Northern Ireland are in miles so it is advisable to take note of the differences in signs and road markings when driving in border areas.\n\nWhen first entering the tunnel waiting zones at Folkestone or Calais, you need to choose the correct type of lane (indicated by the symbols) so that the machine, or booth is on the easiest side of your car for you to reach. As you exit the tunnel onto the M20 in England you will be reminded in three languages to ''drive on the left''.\n\n===By bus===\n\nCoaches are the cheapest way to travel to the UK from [[France]], the [[Benelux]] and western [[Germany]] owing to the high amount of competition. As a guide, a single ticket from Paris, Brussels or Amsterdam to London can start as low as €1 if booked far enough in advance, typically costs €15 and can rise to around €85 if purchased on the day.\n\n'''[http://www.eurolines.co.uk/ Eurolines]''' offer daily services from [[Paris]], [[Amsterdam]] and [[Brussels]] to [[London]] Victoria coach station. Daily overnight coaches and limited day coaches travel between the UK and [[Ireland]]. Journeys take about 8-14 hr.\n\nEurolines will also take you to/from other major European cities. Taking a budget flight is normally cheaper (but with a greater environmental impact) and spares you from a 24 hr+ bus journey.\n\n'''[http://uk.ouibus.com/ OUIBUS]''' and '''[http://www.flixbus.com/ Flixbus]''' also compete on the UK/France/Benelux triangle, with the latter also providing services from [[Germany]] and the [[Czech Republic]].\n\nOther companies, such as '''[http://bustickets.studentagency.eu/?4 Student Agency]''' and '''[http://www.poloniatransport.pl/ Polonia Transport]''', compete with Eurolines between Eastern Europe and the UK. Companies such as this usually come and go.\n\n===By boat===\n''See the city articles for more details on routes, timings and costs.'' [[Ferry routes to British Mainland]]\n\nThere are a large number of ferry routes into the UK from continental Europe. [[Newcastle upon Tyne|Newcastle]] serves a route from [[Amsterdam]] in the Netherlands. [[Harwich (England)|Harwich]] has ferries from [[Hoek van Holland]] in the '''Netherlands'''. You can also sail from [[Rotterdam]] in the Netherlands or [[Zeebrugge]] in '''Belgium''' to [[Kingston_Upon_Hull|Hull]]. There is a regular connection between [[Ramsgate]] and [[Oostende]] in Belgium. There are 4 sailings a day and prices vary between €50 to €84.\n\n[[Dover (England)|Dover]] is one of Britain's most popular passenger ports with sailings from [[Calais]] and [[Dunkirk]] in '''France'''. The Dover-Calais route is particularly busy, with three companies competing and up to 50 sailings per day. The ferry between Dover and Calais costs around £12-18 each way if on foot or bicycle, and around £80 for a car, although big discounts are available if booked in advance or with special offers. Passengers travelling from Calais or Dunkirk by ferry to the UK go through UK passport/identity card checks after French exit checks before boarding, and UK customs checks on arrival in the UK. \n\nOn the south coast, [[Portsmouth]] serves ferries from [[Le Havre]], [[Caen]], [[Cherbourg]], [[St. Malo]] and [[Bilbao]] in '''Spain''' and there are speedy services between [[Dieppe]] and [[Newhaven]]. The other route from Spain is  [[Santander]] to [[Plymouth (England)|Plymouth]], Plymouth also has ferries from [[Roscoff]], [[Poole]] has ferries to [[Cherbourg]] as well as the [[Channel Islands]].\n\nFrom the '''Republic of Ireland''', ports of entry include [[Pembroke (Wales)|Pembroke]], [[Fishguard]] and [[Holyhead]] and [[Swansea]]. There are sailings from [[Dublin]] to [[Holyhead]], and [[Liverpool]]. \n\nYou can also hop onto one of the ships of the [http://www.cunard.com/ Cunard Line] - they depart from '''[[New York City|New York]]''' every month or so. Prices start at around £900.\n\n[[Freighter travel]] is also an option. As an example, [http://www.grimaldi-freightercruises.com/indenen.htm Grimaldi Lines] operates services from [[Italy]], [[Cyprus]], [[Israel]], and [[Uruguay]] that allow up to 12 passengers to travel with their vehicles, in addition to a service from [[Nigeria]], [[Benin]] and [[Côte d'Ivoire]] that carries 12 foot passengers only.\n\n==Get around==\n\n===By plane===\nGiven the short distances involved, flying is rarely the cheapest or most convenient option for domestic travel within the UK with the possible exception of between southern England and Scotland, or where a sea crossing would otherwise be involved, such as between Britain and Northern Ireland or travel to and from many Scottish islands. The main domestic hubs are [[London]], [[Belfast]], [[Birmingham (England)|Birmingham]], [[Manchester]], [[Glasgow]] and [[Edinburgh]]. The arrival of budget airlines have seen a boom in domestic UK air travel, and have forced fares down considerably. To get the best fare, it is advisable to book as far in advance as possible. Many regional airports are not connected to the national rail network, with connections to the nearest cities served by relatively expensive buses. '''Photo ID''' is required before boarding most domestic flights in the UK, although British Airways does not require this. Check your airline's requirements carefully before setting out.\n\n'Screen-scraper' comparison websites can be a useful way to compare flight costs between airports or even city pairs (suggesting alternative airports, for instance). Beware that some airlines, such as Ryanair, object to being included in these searches, so these sites are not always comprehensive. \n\nThe following carriers offer domestic flights within the United Kingdom:\n\n*[http://www.britishairways.com/ British Airways]: Domestic routes radiate from London Gatwick, Heathrow and City Airports.  BA no longer operate non-London routes.  Aberdeen, Belfast, Edinburgh, Glasgow, Inverness, Isle of Man, Jersey, Leeds/Bradford, Manchester & Newcastle.\n*[http://www.flybe.com/ Flybe] - Aberdeen, Belfast City, Birmingham, Bristol, Cardiff, Campbeltown, Doncaster-Sheffield, Edinburgh, Exeter, Glasgow, Guernsey, Inverness, Isle Of Man, Jersey, Leeds/Bradford, Liverpool, London Gatwick, Manchester, Manston-Kent, Newcastle, Newquay, Norwich, Southampton and Southend airports\n*[http://www.loganair.co.uk/ Loganair] operating as a franchise carrier for FlyBe - Eday, Kirkwall, North Ronaldsay, Papa Westray, Sanday, Stronsay, Westray airports.\n*[http://www.easyjet.com/ easyJet] - Aberdeen, Belfast International, Bournemouth, Bristol, Edinburgh, Glasgow, Inverness, Liverpool, London Gatwick, London Luton, London Stansted, London Southend and Newcastle airports.\n*[http://www.aurigny.com/ Aurigny Air Services] - Alderney, Bristol, Guernsey, Jersey, London Gatwick, London Stansted, Manchester, Southampton airports.\n*[http://www.blueislands.com/ Blue Islands] - Alderney, Bournemouth, Brighton, Cardiff, Guernsey, Isle Of Man, Jersey, Southampton airports.\n*[http://www.manx2.com/ Manx2] - Belfast City, Isle Of Man, Blackpool, Leeds, Newcastle, Oxford, Anglesey, Cardiff, Gloucester airports.\n*[http://www.ios-travel.co.uk/ Isles Of Scilly Skybus] - Bristol, Exeter, Isles Of Scilly (St. Mary's), Newquay, Southampton airports.\n*[http://www.jet2.com/ Jet2] - Belfast International, Blackpool, Leeds/Bradford, London Gatwick, Newcastle airports.\n*[http://www.cityjet.com/ CityJet] (now part of AF/KLM) - Dundee and Edinburgh from London City.\n*[http://www.islesofscillyhelicopter.com/ British International] - Isles Of Scilly (St. Mary's), Isles Of Scilly (Tresco), Penzance airports.\n*[http://www.atlantic.fo Atlantic Airways Faroe Islands] - Stansted and Shetland Islands (Sumburgh) airports.\n*[http://www.blueislands.com/ Blue Islands Airline] - Flights from Guernsey, Jersey, Southampton to Europe, Channel Islands and the UK.\n\n===By train===\n[[Image:Aberdeen large station sign.JPG|thumb|The double-arrow symbol signifies a railway station or the rail network throughout Britain. It appears prominently on all stations as well as road signs and maps.]][[Image:UK rail map.png|thumb|upright=1.8|Simplified UK Rail Network]]\n'''See also [[Rail travel in the United Kingdom]]'''\n\nIt is very easy to find train stations in the UK, as '''National Rail''' uses the historic British Rail double-arrow logo which is displayed prominently at all stations, and on road signs. Pedestrian signs in cities and towns will also usually have the logo on display.\n\nThe UK operates two rail networks for the two islands it inhabits. In Great Britain, the '''National Rail''' network covers some 34,000km (21,000 miles) covering most of England, Scotland and Wales, from [[Penzance]] in [[Cornwall]] to [[Thurso (Scottish Highlands)|Thurso]] in the far north of [[Scotland]] and including over 2,600 stations. Train travel is very popular in Britain, with many services busy and passenger numbers rising steadily every year, with the UK having one of the safest railways in the World.\n\nIn Northern Ireland, '''Northern Ireland Railways''' (NIR) operates, which is separate from National Rail and uses a different track gauge (the Irish gauge). For more details, see [[Rail travel in Ireland]]; the remainder of this section will focus on rail travel in England, Scotland and Wales (i.e. the island of Great Britain).\n\nWhile criticised by some as inefficient and there are issues such as overcrowding at peak times, the train is a very effective and enjoyable way to explore Britain and get around places of interest. It is also by far the best option for inter-city travel, with most inter-city trains travelling at 200 km/h (125 mph) and stations in most cities and towns being in the city-centre. Regional services travel up to 160 km/h (100 mph). While this means that services are not as fast as the high-speed lines of France, Germany or Japan, there is a relatively high standard of service on both main and secondary routes. \n\nIn Great Britain, a mixed system is operated, with infrastructure being state-owned while commercial franchises operate trains, to a destination and service pattern specified by the government. This quasi-privatised structure of the rail network has been under constant criticism since its conception in the 1990s and continues to generate strong opinions amongst the British, with almost constant calls for its return to full state ownership. Not all of these criticisms are unfounded, but for the visitor however, it should be noted that most train companies offer good service and value for money, particularly on inter-city and mainline routes, if you book early in advance, and with railcard discounts for certain sectors of the public.\n\n====Planning your trip====\n\nDespite many separate companies running trains, '''National Rail''' is a state-owned brand that brings together all the British railway companies. Tickets can be bought from any one station to any other in Great Britain, no matter how far away, how many train companies or changes of train are needed to get there. Using the National Rail website, you can find tickets from and to any UK destination - the website will redirect you to the relevant company for the actual purchase.\n\nThe '''National Rail''' website [http://www.nationalrail.co.uk/] also includes all timetables, an extremely useful journey planner (which is by far the easiest way to plan a journey), ticket prices and detailed information about every railway station in the country. You can also access this information using the '''National Rail Enquiries''' phone service on 08457 48 49 50 (premium rate from most non BT landlines and mobile phones), and the '''National Rail Enquiries app''' available on most phone platforms.\n\nSimilarly, \"The Train Line\" is a private company which offers a similar online service, but that directly sells you tickets. Be warned The Train Line charges a card handling fee and an additional fee to collect your tickets from a station or to have them posted to you.\n\nMany different places claim the 'cheapest tickets', but you’ll generally find that tickets cost less the further in advance you book – if you buy a ticket at the station on the day of travel, fares can be shockingly high (and surprisingly low if you book a few weeks in advance) - even rising between £30 to £100 for the same journey depending on when you book.\n\nYou can choose to have the tickets mailed to you, or to collect them at any automated ticket machine at a station you specify when booking, using a confirmation code and the payment card used to purchase the ticket. There is no charge for credit/debit card payments or ticket collection/delivery in the UK, but obviously mailing is charged, increasing with urgency (next day services cost more).\n\n====Classes of Travel====\nTwo classes operate: standard class and 1st class. Commuter trains and some local services offer standard class only. Note that service differs a lot between companies - some offer reservation and airline style seating in all classes, some don't offer reservation even for first class.\n\n* '''Standard class''' has two seats either side of the aisle with a mix of 'facing table' or more private 'airline-style' seats.\n* '''First class''' has two seats and one seat either side of the aisle, with a larger, more comfortable seat, more legroom, and on inter-city routes, an at-seat service of drinks, refreshments and a newspaper (not all at-seat services are available at the weekend).\n\nIn both 1st and standard class, most trains also provide:\n* Free seat reservations (not commuter or local services), indicated by a paper tag or electronic display above each seat\n* A walk-up '''buffet''', or a '''trolley service''' of drinks and refreshments moving through the train\n* Air conditioning (not commuter or local services)\n* At least one carriage with a fully disabled-accessible toilet and baby changing facilities\n* On inter-city services, a '''wireless internet''' service (a charge may apply)\n* Most inter-city trains provide a '''\"Quiet Coach\"''' where use of mobile phones, iPods, conversations, and any other noise is not permitted. \n\nThere are also six scheduled overnight sleeper trains that operate every night of the week except Saturday: \n\n* '''The Lowland Sleeper''', which leaves from [[London]] Euston as one train, but divides to [[Glasgow]], [[Edinburgh]]\n* '''The Highland Sleeper''', which leaves from [[London]] Euston as one train, but divides to [[Aberdeen]], [[Fort William]] and [[Inverness]].\n* '''The Night Riviera''', which travels from [[London]] Paddington to [[Plymouth (England)|Plymouth]] and [[Penzance]]\n\nReservations are compulsory on sleeper trains, and a supplement may be payable on top of day-train ticket prices to reserve a berth. Advance-purchase tickets called '''Bargain Berths''' are available on London-Scotland sleepers from £19 to £49. They are only available from the [http://www.scotrail.co.uk/ ScotRail website]. All sleeper trains offer:\n\n* Reclining seated accommodation (comparable to daytime first class but no at-seat service)\n* Standard Class (a cabin with two berths; solo travellers will often need to share with a stranger of the same sex)\n* First Class (a identical cabin but with a single berth and more generous breakfast, toiletry pack and access to departure and arrival lounges at larger stations)\n\n====Tickets====\nGenerally, the ticket prices for a particular type of ticket are the same regardless of operator you choose to travel on.  However the cheaper or promo tickets will be restricted to one operator only.  \n\nOn all except local and commuter routes and the new High Speed 1 from London St. Pancras to [[Kent]], you save money by '''booking in advance''' (tickets normally go on sale three months in advance) and by '''travelling at off-peak times'''; peak train travel is much more expensive and stressful as many trains are seriously overcrowded with commuters. Off-peak is any time after around 9.30am (depends on train company and sometimes route) on a weekday, and all weekends and public holidays. Some train companies around London also have a peak in the afternoon rush hour. You must have a ticket before boarding a train, and many stations now have subway-style ticket barriers. An exception occurs if your station has no ticket office OR machine (i.e. it is a very minor or rural station) in which case you must buy a ticket from the conductor on the train at the first opportunity. If you do not you may be liable to pay a 'penalty fare'. \n\nThere are three types of ticket, which allow you to choose between flexibility and value. In increasing order of cost per mile, tickets are classed as:\n\n* '''Advance''' - Buy in advance, travel only on a specific train at a specific day and time\n* '''Off-Peak''' - Buy any time, travel 'off-peak' (usually 09.32-16:00 and after 19:00, and all day at weekends)\n* '''Anytime''' - Buy any time, travel any time\n\nAdvance tickets are only sold as single (one-way) tickets; to make a return journey, simply purchase two singles. With the exception of some suburban and commuter trains, the cheapest fares are almost always Advance tickets. These are released for sale in limited numbers approximately 12 weeks in advance, and can only be used on the train specified on the reservation. If you travel on any other train or the wrong train, you will be charged an expensive full-price ticket or a penalty fare or else thrown off at the next station. When purchasing an off-peak or any time ticket, return fares are normally only a little more expensive than a single (one-way ticket).\n\nA '''ticket does not guarantee a seat''' unless you also have a '''seat reservation'''. Depending on ticket type and train company, this may come automatically with the ticket or you may be asked if you wish to reserve a seat - ask if you are unsure. Some trains (mostly local and commuter services) do not have reserved seats. If you have no seat reservation, you may have to stand if the train is busy. Seat reservations are normally free. \nWithin London, the Oyster smartcard system (refer to the main [[London]] article for details), is valid within the Greater London boundary on National Rail services - this is cheaper than buying paper Anytime tickets at the station, but only if you don't intend to travel beyond Zone 6.  If you stay on the train beyond Zone 6, you are liable for a wallet-shocking penalty fare.\n\n====Discounts====\nDiscounts are available for:\n\n* Children - up to the age of 15\n* Small Groups – of between 3 and 9 people\n* Large Groups – 10 or more people\n* Railcards – discount cards valid for one year for certain groups\n* Regional Railcards – offering discounts within a specific region\n\nSee [[Rail travel in the United Kingdom]] for full details.\n\n====Rail passes====\nThere are two principal types of rail pass available to visitors to the UK which permit inclusive rail travel throughout the UK. Supplements are normally payable for Eurostar and sleeper trains.\n\n* '''InterRail''' and '''Eurail''' are passes for EU and non-EU citizens respectively. See [[Interrail#Passes]] for more information. Eurail passes are generally ''not'' valid for any part of the UK except Northern Ireland, however.\n* '''Britrail''' [http://www.britrail.com/] is primarily targeted at visitors from the United States of America, Canada, Australia and New Zealand, and must be purchased online or in your home nation before you depart for the UK.\n\n====Ranger & Rover tickets====\n'''Ranger''' and '''Rover''' tickets are tickets that permit unlimited travel with relatively few restrictions over a defined geographical area for a period of anything from one to fourteen days. A full list of tickets is available with their terms and conditions from [http://nationalrail.co.uk/times_fares/promotions/rangers_and_rovers.html National Rail]. These tickets include Rovers for almost every region of the UK, but notable tickets include:\n\n* '''All Line Rover: 7 or 14 Days''' - These allow 7 or 14 days travel on almost all scheduled rail services throughout England, Scotland and Wales. As of May 2012, they cost £450 (7 days)or £680 (14 days) for standard class, and £680 (7 days) or £1040 (14 days) for 1st class, with discounts for children and railcard holders. \n* '''Freedom of Scotland Travelpass: 4 days in 8''' or '''8 days in 15''' cost £129 and £173 respectively, with discounts for children and railcard holders.\n\n====Steam trains and preserved railways====\nThese are enjoyed for their own sake at least as much as they are used as a means of transport.  Most areas will boast a volunteer-run railway using steam traction especially during the summer months. Famous full-gauge railways include the [[East_Grinstead|Bluebell Line]] in Sussex, the [[Keighley|Keighley & Worth Valley Railway]] in Yorkshire, while the [[Eskdale_Green|Ravenglass & Eskdale Railway]] in Cumbria and [[Tywyn|Talyllyn Railway]] in central Wales are examples of narrow-gauge railways now primarily used for tourism.[http://www.silversurfers.net/travel-railsteam.html]\n\n===By car===\n\nThe legal driving age in  UK is '''17''' (except if a UK resident has a mobility disability, in which case it is 16). Overseas territories and Crown Dependencies have their own age limit.\n\nDiffering from most of Europe, '''the UK drives on the left.''' Most cars in the UK are manual (\"stick-shift\") transmission, and car rental companies will allocate you a manual transmission car unless you specifically ask for an automatic when you make a reservation. The cost of renting an automatic vehicle in the UK is significantly more expensive than renting a manual one. Always compare the prices before renting car, or you can book online in advance for good deals from site like [http://www.avis.co.uk Avis], [http://www.rentalcarsuk.net Rental Cars Uk], [http://www.thrifty.co.uk Thrifty],  [http://www.easirent.com/ Easirent].\n\t\nA car will get you pretty much anywhere in the UK. Parking is a problem in large cities and can be very expensive. Petrol (gasoline) is heavily taxed and therefore expensive and like most countries, petrol is sold by the litre. [http://www.theaa.com/motoring_advice/fuel/ Currently] at around £1.20 per litre ''(around USD1.52 per litre, or $5.75 per US gallon)''. The cheapest fuel is usually available at supermarkets (Tesco, Sainsbury's, Morrisons and Asda). If planning to travel on a motorway, it is wise to fill up before starting, since petrol at motorway service stations usually has a hefty mark-up.\n\nLike in the U.S. but unlike the rest of the world, the UK continues to use the imperial system (i.e. the old Roman system) which includes road signage though many height and width signage is now in metric as well and all weight signage is in tonnes (or Metric Tons in American English), plus all motorways/freeways now have locator indicators in kilometres situated at intervals of 500m but these display no unit size and are used for emergency vehicles rather than drivers. Therefore distance signage is indicated in miles, while speed limits are indicated in mph. Although some distances ''appear'' to based on kilometres - e.g. 1/3 mile is 500m, 2/3 mile is 1 km, 330 yds is 300m -  the government has no interest in metricating the roads, meaning that visitors need to gain some understanding of imperial distances and speed limits, or at least a good idea of what they correspond to in metric units. Motorway signs tend to follow the same process of showing upcoming exits at a distance of one mile, then half a mile and then three signs showing /// for 300 yards, // for 200 yards and / for 100 yards.  If you are unfamiliar with imperial distance then a good rule of thumb on a motorway is to read the first (one mile) sign to be about one minute from the exit and the half mile sign being 30 seconds to the exit while driving at a cruising speed. Note that distance signs that show \"m\" refer to miles, not metres.\n\nTraffic can be very heavy, especially during 'rush hour', when commuters are on their way to and from work - typically 07:00-10:00 and 16:00-19:00. School holidays can make a noticeable reduction in traffic, however, particularly in the morning rush hour. \n\nThere are no tolls on any roads with the exception of a few large bridges/tunnels, and the M6 Toll motorway in the midlands.  If driving in central London (which is not advised) there is a levy (congestion charge) of between £4.50 and £11.50. Most tolls are collected using toll booths at the point of use, except for the [https://www.gov.uk/government/news/dart-charge-dartford-crossing-remote-payment Dartford toll bridge] (from October 2014) and the [http://www.tfl.gov.uk/modes/driving/congestion-charge London congestion charge] which use a numberplate recognition system, and drivers must pay, usually online, before or on the same day as travelling.\n\nThe M25 London orbital motorway is notorious for traffic congestion - it is best avoided on Monday mornings and Friday afternoons, use it only if you need to, and take local advice if you plan to drive to Heathrow to catch a plane.  The M6 through Birmingham is another traffic blackspot as well as the M8 in Glasgow (the second most congested motorway after the M25).  You can typically bet on finding a traffic jam if you drive for more than 90 minutes on the motorway system, especially as you approach cities. Checking local traffic reports on the radio or websites such as the [http://www.highways.gov.uk/ Highways Agency],  [http://www.traffic-update.co.uk/ Traffic Update] or [http://www.frixo.com/ Frixo] can help if you know you need to travel during busy hours.\n\nMany cities operate a \"Park and Ride\" scheme, with car parks on the edge of the city and cheap buses into the city centre, and you should consider using them. In major cities (particularly London, Manchester, Liverpool, Glasgow and Birmingham) it is usually a much better option to park on the outskirts and take public transport to the centre. This not only saves money on parking and fuel but also saves a lot of time as heavy traffic, twisty one way systems, and limited parking space causes long delays. \n\nParking on-street is usually heavily restricted. Never park on a white, double yellow or double red line (stopping on motorways and red lines is illegal). Parking on a single-yellow line is restricted (typically no-parking during the daytime e.g. 7am-7pm) and the restrictions are displayed on roadside yellow signs. Many residential streets require a resident's parking permit to park on the street as signed, although outer suburbs have fewer restrictions. On-street parking in cities may be restricted to disability-badge holders or be heavily metered, and is often for no more than a 1-2 hours stay in the daytime but is often free at night. Surface car parks (parking lots) generally operate the \"pay & display\" payment system - you must buy a ticket from a vending machine, select how many hours you wish to pay and then place the ticket on your dashboard in clear view - these places are regularly patrolled and if you don't return to your car before the allotted time you'll get a penalty or get clamped. Often you'll need to enter the numeric digits from your car's number plate when buying the ticket to prevent people from 'selling on' tickets with leftover time. Multi-storeys are usually multi-level buildings or in larger cities may be located underground. Most have barrier-controls - you'll be issued with a ticket upon entry. When returning to your vehicle you must either pay on foot at a 'pay station' (a self-service terminal inside the car park's lobby) in which you insert the ticket and pay the required amount - the ticket will be given back to you and you must insert it into the slot at the exit barrier; or alternatively you will pay a cashier at the exit barrier - it'll normally explain the payment process on the ticket. Parking charges vary from less than 50p per hour in small towns to over £4 an hour in the largest cities. Many larger cities have digital displays on the approach roads indicating how many parking spaces are available in each car park.\n\nIn any town, expect regular bus services between the centre, suburbs and nearby villages, and less frequent services to more rural areas. London also has the largest mass-transit system in the world - the London Underground and an extensive overground system and bus network too. London, Manchester, Birmingham, Sheffield, Nottingham, Blackpool and Edinburgh have trams covering parts of those cities. Outside of London, Liverpool has the most extensive metro system (Merseyrail), spanning from several stations in the city centre to those in the outer suburbs. Newcastle has a similar network. Greater Manchester also has an extensive local train network in addition to its expanding metro system. Glasgow has a small underground rail system in the centre and a local train network. In some cities buses can be slow moving due to traffic congestion.\n\nThe UK has a comprehensive system of road numbers. These generally take precedence on signs: British roads are signed on a route-based rather than destination oriented basis. Therefore, before setting out on a long journey, plan the route you are going to take and note the road numbers you will need to follow. It is very unusual to see destinations, signed more than about 50 miles (80km) in advance. Other than that, UK road signs are excellent and should be very easy to follow. Road numbers are indicated by a letter and a number as in the rest of Europe and sign colours and letters are generally the same as on the rest of European routes, whilst allocated, are unsigned.\n\n'''Motorways (prefix 'M'- blue signs, white route numbers)''' are fast, long distance routes that connect the major cities. The speed limit is 70 mph/115 km/h for cars (lower for other types of vehicle) and certain vehicles, such as pedestrians, cyclists and those operated by learner drivers are prohibited. Exits are known as Junctions, are numbered and commonly used when giving directions. The motorways are the best means of travelling long distances by car, but expect delays at peak times or in poor weather.\n\n'''Primary routes (prefix 'A' - green signs, yellow route numbers)''' connect large towns with each other and with the motorway network. Primary routes usually offer fast journey times, but because they tend to go through towns rather than around them, expect delays at peak times.\n\n'''Secondary routes (prefix 'A' - white signs, black route numbers)''' connect smaller towns, interchangeable with B roads.\n\n'''B-roads (prefix 'B' - white signs, black route numbers)''' are the larger of the back roads.\n\n'''Minor routes (white signs)''' like country lanes or residential streets.\n\nA route number followed by '''(M)''' means upgraded to motorway standard - for example '''A3(M)''' means part of the route A3 that has been upgraded to motorway.\n\nA route number in brackets means 'leading to' - for example '''A507 (M1)''' means you can reach the M1 by following route A507.\n\nNote that brown signs with white text denote tourist destinations/ attractions on all types of road.\n\nSpeed limits for cars are 70mph ''(115km/h)'' on motorways and dual carriageways (i.e. roads divided by a grassy area or other hard barrier between opposing directions of traffic); 60mph ''(100km/h)'' on single carriageway (i.e. undivided) roads unless otherwise signposted; and 30mph ''(50km/h)'' in built-up unless signs show otherwise. The use of 20mph ''(30km/h)'' zones has become increasingly common to improve safety in areas such as those around schools. \n\nSpeed cameras are widespread on all types of road, though more used in some areas than others (England's largest county of [[North Yorkshire]], for example, has a policy of using no fixed enforcement cameras on its highways).  Static cameras are often well signed, painted bright colours with clear markings on the road.  While this might seem rather strange, the idea is to improve their public acceptance as a 'safety' measure (rather than the widely held opinion that they're there to collect money).  \n\nThere are some variable mandatory speed limits on the M25 to the west of London (enforced by cameras, again), the M42 near Birmingham and the M1 between Luton and Milton Keynes - these are shown on overhead gantries inside a red circle; other temporary speed limits shown on matrix boards are recommended but not mandatory. Apart from these and around roadworks, the motorways are generally free of fixed speed cameras. Speeds on motorways are generally much higher than the stated speed limit (usually at least 80mph/130 km/h). Driving at slower speeds in the outside (overtaking lane) may cause frustration to other drivers.\n\nDriving standards are relatively well-maintained in the UK, with the road system being (statistically) among the safest in Europe. It has long been known by visitors that a foreign number plate makes you largely immune from speed cameras, congestion charge cameras and parking enforcement officers.  If you choose to take your chances, be aware you may just hit upon the one camera operator/warden who can be bothered to take the trouble to track down your address from your home licensing authority. British authorities have access to vehicle registration databases from various other countries. Also, British hire car companies will charge traffic fines to your credit card, long after you have left the country. Traffic police patrol the motorways in marked and unmarked cars. Any police officers, regardless of their normal duties, will pursue a vehicle seen driving dangerously.\n\nTraffic lights have a red and yellow preparatory signal immediately before changing to green. When a light changes to amber from green, you are expected to stop unless doing so seems likely to cause an accident (for example by braking harshly). At many pedestrian crossings, before changing to green, the signal may return to flashing yellow for a number of seconds before turning green. During the flashing yellow stage, vehicles may proceed when all pedestrians have finished crossing.\n\nBlack and white striped road surfaces are used at 'zebra crossings', at which you should stop if any pedestrians are waiting by the kerb to cross. This rule is generally well observed by British drivers. \n\nOn single carriageways a solid white line in the centre of the road (rather than the usual dashed line - see the banner picture for a double example) means \"do not cross\" (in practical terms meaning do not attempt to overtake), but should be taken as a caution that the road may be hazardous - typically either tight bends or hidden dips and crests.\n\nIn rural areas there is a good chance that you will get stuck behind slow farm vehicles, or a bus, on quite narrow roads. Be patient - in most areas the drivers will flag you through, or signal left as if they are parking, when it is safe to pass. By the same token, if you are nervous of driving to the speed limit on unfamiliar and twisting roads do all you can to avoid causing delays - let faster traffic through when safe to do so.\n\nDon't drink and drive in the UK. The maximum limit is 80 mg of alcohol per 100 ml of blood (0.08%) (50 mg per 100 ml in Scotland). Going over that limit is a criminal offence, you will be arrested and spend a night in the cells. The police often patrol roads in cities and town centres on Friday and Saturday night, on the lookout for drink drivers. Enforcement of drink driving laws are extremely strict and police will always take action on those failing a breath test or those refusing to do so. Fines are up to £5000, minimum driving ban is 12 months for a first offence, and you may be imprisoned for up to 6 months. \n\nDrivers from abroad should take note that many British drivers regard the flashing of headlights as a signal that '''they can proceed''', rather than as a warning, or as a signal to slow down due to the presence of police. This misunderstanding has led to a number of accidents. \n\nIn a dangerous situation, where there is a risk of death or injury, sound your horn, even during the night. The inappropriate use of the horn is illegal between 23:00 and 07:30 (11pm and 7.30am).\n\nIt is also an offence to use your mobile phone whilst driving, although provision is made for the use of hands-free kits which are exempt from the law. Police will stop you for using your mobile phone and a £200 penalty will be issued on the spot. This fine will be accompanied with 6 points endorsed on your licence. Also, it is a legal requirement that all persons in a vehicle to be wearing their seat-belt. Persons not wearing a seat-belt may receive a £30 fine, although this does not come with any points. If a child is not wearing a seat-belt, the parent or guardian, normally the driver, is responsible and a fine will be issued for that offence also. Children under 1.4 metres (4 ft 7 inches) are also legally required to use a child booster seat for safety reasons. Use of fog lights where there is no fog is also an offence for which you may receive a £30 fine.\n\nThe road rules differ from other countries: side roads never have priority, there is no requirement to stop for school buses, overtaking on the left is illegal, and you may not turn left over a red light. There are no 4-way stop junctions in the UK; priority should be clearly marked on the road.  \n\nThere are lots of roundabouts (traffic circles) across the UK, from large multi-lane roundabouts at dual carriageway junctions to small mini-roundabouts on local streets.  The rules for entering them are the same - you have priority over traffic that has not yet entered it, and you must give way to anybody already on the roundabout (who would collide with your right side if you entered it). Be careful of two lane roundabouts, there are complicated rules for which lane you should be in which UK drivers learn and expect other drivers to follow. You should be fine provided you're cautious and keep an eye on other traffic.  Some roundabouts are arranged in such designs and quick sequence that can make you dizzy.  Take it easy until you get used to it.\n\nFor further information on driving in the UK, consult the Highway Code. [http://www.direct.gov.uk/en/TravelAndTransport/Highwaycode/index.htm]. If you are travelling from aboard you may wish to use the governments online tool to inform you of your licence status if you don't have a GB licence [https://www.gov.uk/driving-nongb-licence]. If you are travelling from the U.S. you are able to drive for up to one year in the UK on your American driver's licence more information issued by the American Embassy http://www.theamerican.co.uk/pr/driving.php [http://london.usembassy.gov/rctour.html].\n\n===By campervan===\n\nHiring a Campervan is one way to explore the UK.   Some companies offer airport pick ups and drop offs. It can work out cheaper than flying/busing and staying in hostels and bed and breakfasts. \n\nSmaller Campers are easier to park and enjoy the narrow lanes in the UK. \n\nSome country pubs may let you use their parking lots for overnight stays if you ask.\n\n===By bus and coach===\n\n===By bus===\n\nLocal bus services (a categorisation which also includes many medium-haul inter-urban services) cover the entire country, but are of variable quality and cost. Rural bus services are in general better than in France and the USA, but not so good as in Italy or Germany. Services range from deep-rural village services operating once a week or less, to intensive urban routes operating every few minutes. All communities except the very smallest villages have some kind of bus service. All buses in the UK are required to display the route number and destination clearly on the front. Almost all are \"one person operation\", i.e. there is no conductor and you must pay the driver as you board. The vast majority of bus stops are \"request stops\", meaning that you must put your arm out as the bus approaches to signal that you want it to stop. Likewise once on the bus, you must ring the bell in advance of the stop you want to get off at.\n\n \n====London====\nIn London, the iconic red buses cover the entire city, with most routes running at high frequencies from early morning until late night, and some operating 24 hours. Service frequencies are such that timetables are generally unnecessary for daytime travel. Comprehensive route maps are available from a variety of outlets and the Transport for London website, and stop-specific maps and timetables are displayed clearly at most bus stops. Buses are modern and highly specified, and are \"low floor\" offering easy access for wheelchairs, buggies and the elderly. Walk-up cash fares can be relatively expensive, but all-day and longer period tickets (including combined bus, rail and tube options) are available, offering excellent value. For travelling in London, the Transport for London website [http://www.tfl.gov.uk/] is an incredibly useful website with a journey planner with maps, all fares, information on planned engineering works (there are plenty of those on the weekend) as well as live updates. It is an indispensible tool if considering even minor trips on public transport, which is an experience in itself.\n\nPlease note: as of 2016, London busses are cashless. You can pay with a debit/credit card (fees are usually around 70p), or buy a travelard in advance. However, you CANNOT buy tickets onboard\n\n====Elsewhere====\nBus services in the UK outside of London are privatised and deregulated, with any licensed operator free to run any route and timetable that they wish. Therefore, co-ordination of services with each other and with rail services can be poor, and tickets often not inter-available. Return tickets are usually much cheaper than two singles, and most operators offer discounted fares for children. Most operators offer day or longer period tickets valid across their own network which can represent very good value, giving all-day travel for as little as £4, but are little use if you need to use more than one operator. However, combined day tickets valid across more than one operator's network are also available in some areas. Weekday daytime services are frequent and comprehensive in many areas, particularly larger towns and cities. However, almost universally, service levels reduce sharply in the evenings and on Sundays. In the larger cities, for example Birmingham, Manchester and Edinburgh, there is an extensive night bus network available.\n \nIn areas with a multitude of  operators, obtaining comprehensive map/timetable information for the area can be difficult. It is not uncommon for operators to attempt to pass off their services as being 'the' network for the town or area in their publicity material - making no mention of the fact that other routes (or in some cases alternative departure times on the same routes) are available, operated by competitors. Many local authorities do attempt to produce comprehensive timetables and/or maps for all services in their area regardless of who operates them - these are well worth obtaining and are commonly available from Tourist Information Centres. However it is still worth checking with the operator(s) before travelling to ensure that the information is up to date, as timetables can change frequently.\n\n===Coach===\nCoach travel tends to be slower than train travel, as well as less frequent, although they are still comfortable and are, for the most part, substantially cheaper. Coaches, like trains, will also generally take you right to the centre of town.\n\nThe largest coach companies in the UK are: \n\n*[http://www.nationalexpress.com/coach National Express] is the largest long distance bus service in the UK, and services all major destinations on the mainland; they sell tickets online and at coach terminals. Prices start at just £1 one way for promotional 'funfares' between major city-pairs, although remain quite expensive on less competitive routes such as those serving airports or minor destinations.\n*[http://uk.megabus.com Megabus] provides services between most major destinations, and a few minor ones, at cut-throat prices - as low as £1 +50p booking charge for some routes if booked well in advance. Understandably, it is very popular with students. To get the cheapest fares you should book a week or two ahead. However, fares are often still good value when booked with less time (sometimes £8 London-Manchester booked only two days in advance). Tickets must be bought online or using the premium rate booking line (0900 160 0900, at 60 pence per minute) and '''cannot''' be bought from the driver. \n*[http://www.citylink.co.uk/ CityLink] services destinations in Scotland. They sell their tickets online, by text, or from the driver, although it is always advised to book your tickets in advance. Some routes also carry Megabus passengers.\n\n===By taxi===\n\nThere are two types of taxis in the United Kingdom:- Metered (black) cabs that can be hailed in the street and are mostly found in larger towns and cities; and minicabs (private hire taxis) which must be ordered by telephone.\n\n'''Black Cabs'''\nThese are useful for travelling within cities - the name originates from the old 1960s purpose-built Austin FX3 taxis which were originally painted black, but today are usually covered in advertisements. In major cities, custom-built vehicles which seat 5 people are commonly used as metered taxis, but in smaller cities regular cars or people-carriers are used instead. These taxis can be hailed on the street or picked up from a taxi rank (usually found near major shopping areas and transport hubs). The rate varies, typically starting at around £2-3 and rising at around £1 a mile, making them fairly expensive. Add night charges, waiting charges, luggage charges for large suitcases etc on to the meter as well, and travelling by taxi can be expensive unless you are in a large group. A short 10 minute trip would normally cost between £3-5. The 'Taxi' sign on the roof is illuminated when a taxi is available.\n\n'''Minicabs'''\nMore common in suburbs and smaller towns, minicabs can only be used by telephone ordering and charge fixed prices to different destinations. Local telephone directories usually advertise taxi companies, and the phone numbers are usually painted in big numbers on the side of their vehicles. Minicabs are usually much cheaper, fares for long journeys can often be negotiated (although you should agree the fare with the phone operator when booking, not with the driver) and most companies have a variety of vehicle sizes from small saloons (Ford Mondeo, Skoda Octavia, Peugeot 406 etc) up to large 12-seater minivans so if you have a large group you can specify the vehicle size. Some minicab firms specialize in serving airports and offer discounted rates.\n\n'''Fake taxis'''\nFake taxis are not a major problem and are mostly found around the major airports. A few tips:\nCheck that the taxi has a rear taxi-licence plate on the rear bumper and that it carries the name of the local authoritative council.\nThe driver's taxi licence should be displayed on the dashboard.\nThe meter displays the correct rate (the metered fares are usually advertised on the side of the taxi).\nIf calling a minicab, the taxi company will ask your last-name and your phone number - the driver should know this when he picks you up. If approached by a taxi driver claiming that you booked their taxi (particularly in airports or nightlife districts), ask them to confirm your name and phone number - if they don't know then it is most likely that they are fake.\nMost local councils require licensed taxis to be newer than 10 or 15 years old. Many fake taxis use older vehicles.\n\n===By boat===\n\nFerries link the mainland to the many offshore islands including the Isles of Scilly from Penzance; the Isle of Wight from Southampton and Portsmouth; the Isle of Man from Liverpool and Ireland and the Orkneys and Shetland Islands from Aberdeen and the far north of Scotland. There are also numerous car and passenger ferry routes between England and France and between Ireland and the UK. There are also regular ferry services between Northern Ireland and Scotland and these depart Larne, Belfast, Troon, Stranraer and Cairnryan. There are also routes from Northern Ireland to Birkenhead and Fleetwood (both near Liverpool in England).\n\n===By thumb===\nPedestrians are banned on motorways, motorway junctions, as well as on certain primary routes.  However, aside from those exceptions, [[hitchhiking]] is not illegal. The British are very aware of safety, and you may expect a long wait for a ride.\n\nIf you use signs, it's fairly customary to use the number of the road on them rather than just the destination. In other words, from Birmingham to London you would use a sign that said \"LONDON\" but  also \"M25\" . Two places where signs are quite useful are [[Land's End]] and [[John O'Groats]], the two extremes of the country, especially if your sign says the other.\n\nNote that traffic in more remote areas of Scotland, Wales and rural areas of England such as Cornwall, Cumbria etc. can be quite scarce.\n\n===By bicycle===\nThe UK can be both a cyclist's dream and nightmare. Fortunately cycling is popular as both a sport and a means of transportation. Bike rental exists in some cities e.g. Cambridge or Oxford and in some scenic areas. \n\nThe Barclays Cycle Hire scheme provides a network of approximately 8,000 bicycles and 570 docking stations across central London, covering an area from White City in the west to Docklands in the east. The scheme is available to walk-up users and charges a daily fee (currently £1, paid by credit or debit card) and, for journeys exceeding 30 minutes, a per-use fee is also charged. Between journeys, users are expected to return their bicycle to a docking station, taking another bicycle for subsequent journeys; the bicycles do not have locks, and journeys of under 30 minutes do not incur a per-use fee. It can be difficult to find bicycles (or spaces at docking stations, in the evenings) at the major rail termini during peak hours, as the scheme is popular with commuters. As well as on each docking station, cycle/dock availability and maps are available online. Should your intended docking station be full, you can request up to 15 minutes additional time free of charge.\n\nThe wheels of choice for most British cyclists is the hybrid bike - they have the comfort and practicality of a city bike combined with the performance (multi-speed gearing) and ruggedness of a mountain bike. Conventional mountain bikes and single-speed roadsters are also common, and folding bikes are becoming more popular in major cities. Bicycles are expensive in the UK - expect to pay £100 or more for a basic model. They are sold by individual manufacturer's dealers (e.g. Dawes, Raleigh, Giant), automobile product stores (e.g. Halfords), sport accessory stores (e.g. Decathlon) and through private bicycle retailers. Cheaper used bikes can be purchased online via websites such as eBay or may be advertised in newspapers, notice-boards etc.\n\nUrban cycling varies city-to-city. Most cities have designated cycle-lanes although they are routinely ignored by drivers and are often shared with buses, motorcycles and taxis. Some major roads will have split-pavements for pedestrians and cyclists, whilst other times cyclists are expected to ride in the traffic. This can be dangerous if you're not a skilled cyclist and general traffic rules should be adhered to. It's a legal requirement to have reflectors and a bell, and front & rear lights must be used at night. Also many cyclists use standard arm-signals to alert motorists - if you are turning left or right you should raise your left or right arm respectively, and if you wish to stop then you should wave your left arm up and down. Cycling is banned on certain roads - all motorways and many primary (A) roads - a sign will indicate this. \n\nMost cities will have designated bike-parking areas with bicycle racks and are almost always free. Carry a good lock with you as bike-theft is common. Bicycles are permitted on SOME trains, depending on the operator. Commuter trains generally allow folding bicycles only, some regional trains may have a rack that can carry 2-3 bicycles, while many intercity trains have a baggage car that can hold many bikes. Check with the operator before-hand - bikes will almost always require a reservation: on some trains for free, some for a small charge (typically half the adult fare) whilst others will require a full-fare ticket. Reservations can be made over the phone (via National Rail or via the train operator), or at the station ticket office. Long-distance coaches also allow bicycles, although again they must be reserved and there may be a surcharge. Local city buses and regional buses don't allow full-size bikes but some operators may permit folding bicycles - you should check before hand. If a bus is quiet then it's often down to the driver's discretion. Rapid transit systems also have varying bicycle policies e.g. London Underground allows folding bicycles at all times and conventional bicycles outside of peak hours as long as the train isn't crowded. \n\nThe SUSTRANS Cycle Network is a series of paved and unpaved cycle tracks covering the whole country, passing through some spectacular scenery on the way. Their website (www.sustrans.co.uk) has a comprehensive cycle-map and most cycle-stores, tourist information centres and youth hostels also sell their maps.\n\n===By tram===\n\nUntil the 1950s and 1960s, many towns and cities had an extensive tramway system. Most were scrapped during this period, however trams have been subject to a revival since then. Modern tramway systems can be found in [[London]] ([[Croydon]]), [[Birmingham]], [[Nottingham]], [[Sheffield]], [[Manchester]], [[Blackpool]] and [[Edinburgh]]. There are also a few tram lines orientated towards tourists in [[Birkenhead]], [[Southport]], [[Llandudno]] and Crich (near [[Matlock]]).\n\n==Talk==\n{{infobox|\"Two countries divided by a common language\"|Speakers of US English will find quite a few terms which differ in UK English:\n*Biscuits - cookies\n*Cash machine/cash point - ATM\n*Cinema - movie theatre\n*Chips - fries, which may be \"french fries\" or thick-cut traditional British chips\n*Crisps - potato chips\n*Fag - cigarette (only used colloquially)\n*Lift - elevator in building; the offer of a ride in car\n*Lorry - truck\n*Motorway - expressway or freeway\n*Nappy - diaper\n*Queue - line\n*Return ticket - round-trip ticket\n*Take-away (in ordering food) - to-go\n*Toilet or Loo - washroom/restroom/bathroom/lavatory (a bathroom is where you have a bath/shower, not where you relieve yourself in British English)\n*Torch - flashlight\n\nPlease see our article [[English language varieties]] for more words that differ from US English.}}'''English''' is spoken throughout the United Kingdom, although there are parts of major cities where immigration has led to a variety of languages being spoken as well. Despite stereotypes portrayed in Hollywood films, it is not overly common to find people speaking the \"Queen's English\" with accents demonstrated in shows such as Downton Abbey or as spoken by Hugh Grant and Colin Firth. English spoken in the UK has several dialects and several strong accents, some of which may contain words which are unfamiliar to other English speakers. It is exceedingly common for a resident of the South and one of Yorkshire not to understand each other at first go, as it would be common for a resident of Cardiff to not understand somebody with a thick Newcastle accent. Do not be afraid to ask someone to repeat themselves. Your best bet would be to ask someone under the age of 30 as it is more common for older people to have thicker or more unintelligible accents (though middle classes and educated classes will tend to be easier to understand at any age).  A trained ear can also distinguish the English spoken by someone from Northern Ireland as opposed to someone from the Republic of Ireland, or even pinpoint their origin to a particular town within a county, such as Leeds or Whitby. English in Scotland and Northern Ireland can be spoken quite fast. The different dialects can be extremely different in both pronunciation and vocabulary. If you encounter difficulty please remember that this is still English and offence might be taken if you ask someone to speak English, instead they should be asked to speak slower.\n\n'''Welsh''' (''Cymraeg'') is also widely spoken in Wales, particularly in North and West Wales. The number of Welsh speakers has risen over the last few years partly due to promotion in schools, but this bilingual population is still only around 30% of the total population of Wales. Government bodies whose area of responsibility covers Wales use bilingual documentation (English and Welsh) - for example, see the website of the [http://www.dvla.gov.uk/ Swansea-based DVLA]. Road signs in Wales are bilingual. Even the non-Welsh-speaking majority in Wales know how to pronounce Welsh place names. Once you hear how to pronounce a name, have a go and try not to offend! You may find that someone does not understand where it is you are trying to get to because you are using the Anglicised name, in this case explain you are not sure how to pronounce it and have the Welsh spelling to hand.\n\n'''Scottish Gaelic''' (''Gàidhlig'') can be seen and heard in the [[Scottish Highlands]] and [[Hebrides|Islands]], but there are only 60,000 native speakers.\n\nThe ancient '''Cornish''' language of Cornwall, in the far south west, was revived during the twentieth century, but it is not passed down from parent to child as Welsh and Gaelic still are.  Be aware, however, that Cornish place names remain and can be rather challenging to pronounce for non-locals!\n\n'''Irish''' is spoken in some areas of Northern Ireland, particularly in the border regions.\n\nMany in Scotland claim '''Scots''' to be an entirely different language to English, it is what people commonly speak in much of Scotland and to some extent Northern Ireland. In northern England similar dialects can also be heard, such as Geordie. It can be difficult to understand, so feel free to ask someone to repeat themselves or speak more slowly. Speakers are likely to use standard English with outsiders.\n\nAll speakers of these minority languages are fluent to near-fluent in standard English but react well if you show an interest in their native tongue and culture. Inter-migration in the United Kingdom means you are likely to encounter people from all over the UK and beyond no matter where you visit. It is rare to find a place where all adults have the same accent or dialect.\n\nThere's an old joke that the people of the US and the UK are \"divided by a common language\", and travellers from English-speaking countries outside the UK may have difficulty catching specific words where regional accents are strong, but still there should not be any major difficulties in communicating. The British are good at understanding English spoken in a foreign accent, and visitors who speak English as a second language need not fear making mistakes. You may just get a slightly blank look for a few seconds after the end of a sentence while they 'decode' it internally.  Most British people will not criticise or correct your language, although some are very keen to promote British usages over American ones when talking to non-native-speakers.\n\nA few examples of words that overseas visitors may not be familiar with:\n\n*Wee - small (Scotland, Northern Ireland, some English people), can also mean to relieve yourself (England)\n*Loch (/lɒx/) - lake (Scotland)\n*Lough - lake (Northern Ireland)\n*Aye - yes (some parts of Scotland, Wales, Northern Ireland and North England)\n*Poke - ice cream served in a wafer cone (Northern Ireland); a paper bag, especially one containing chips or sweets (Scotland)\n*Downing Street - used to refer to the Government (similar to White House referring to the President of the United States)\n*Cymru (pronounced 'Cum-ree') - Wales (Wales)\n*Cockney rhyming slang is not a language but a collection of terms, some local and temporary, others so long-lasting that they are used by many people who don't realise that they are rhyming slang.  Example of the latter: \"raspberry\" for the derisive noise called \"Bronx cheer\" in the US - derived from \"raspberry tart\", rhyming with \"fart\".\n\nBritish people have historically been very tolerant of swearing, when used in context. It is considered far less shocking to say taboo words like \"Cunt\" or \"twat\" compared to in America, and can even be a term of endearment depending on the situation. Tourists should get used to hearing the word \"mate\" (and \"boss or \"bruv\" to a lesser extent in London) a lot which is used in informal interaction (frequently male only) between strangers and friends alike, and is something similar to calling someone \"buddy\" or \"pal\". The use of affectionate terms  between the sexes such as \"darling\", \"love\" or \"sweetheart\" is common between strangers and is not meant in a sexist or patronising manner. Furthermore, British people are prone to apologising for even the smallest things, much to the amusement of some and can be considered perhaps rude to not do so. An example such as bumping into you will warrant a \"sorry\" and is really more like \"pardon\" or \"excuse me\".\n\n'''British Sign Language''', or '''BSL''', is the UK's primary sign language. When interpreters are present for public events, they will use BSL. In Northern Ireland, both BSL and '''Irish Sign Language''' ('''ISL''') see use, and a '''Northern Ireland Sign Language''', or '''NISL''', is emerging from contact between the two. Users of Auslan or New Zealand Sign Language may understand BSL, as those languages were derived from BSL and share much vocabulary, as well as the same two-handed manual alphabet. On the other hand, users of French Sign language and related languages—notably ISL and American Sign Language—will not be able to understand BSL, as they differ markedly in syntax and vocabulary, and also use a one-handed manual alphabet. However do note that Makaton is also used more information about makaton can be found at https://www.makaton.org\n\nFrench (and to a lesser extent, Spanish and German) are taught in schools, although British people are generally not able to speak one of these languages at even a basic level. Immigrant languages are widely spoken in some ethnic minority communities. These are mainly Arabic, South Asian languages, African languages, and Polish, Lithuanian, Russian.\n\n==See==\n\nFrom Lands' End in the south to John O’Groats and Duncansby Head in the North, there is so much to see in the United Kingdom, which is home to 25 Unecso world heritage sites. There are hundreds of free museums to enjoy across the country, many thousands of municipal parks to stroll through, tens of thousands of interesting communities to visit and many millions of acres of countryside to ramble across .  It is much more than just rain and seeing whether the Queen is at home at Buckingham Palace.\n\n===Cities===\n\nLondon – Samuel Johnson once wrote a man who is tired of London is tired of life. This is still true, as London is home to a wide range of attractions: art at galleries such as the National Gallery, The National Portrait Gallery, The Tate and the Tate Modern, amongst others. There are cultural treats in the theatres and cinema of the West End and South Bank, and the recreated home of Shakespeare in the capital, the Globe. There are all the traditional tourist sites to see such as Buckingham Palace, The Houses of Parliament, Westminster Abbey, St Paul’s Cathedral, [[Trafalgar Square]] and the London Eye.\n\nEdinburgh, the capital of Scotland was initially centred on the Old Town, the castle and Holyrood Palace, but the New Town is  a Georgian masterpiece. Both the Old Town and the New Town are UNESCO World Heritage sites. \n\nOxford and Cambridge – The two ancient university towns allow you to wander amongst the dreaming spires, to punt on the river and to at certain times walk through the college quadrangles.\n\n===Parks and Nature===\n\n[[Image:UK parks.png|thumb|right|200px|National Parks and Areas of Outstanding Natural Beauty in the UK]]\n\nThe United Kingdom has an array of [[United Kingdom National Parks|National Parks]] and designated [[United Kingdom National Parks#Areas of Outstanding Natural Beauty|Areas of Outstanding Natural Beauty]] that serve to preserve the country's natural heritage. There are 14 National Parks in total spread across England, Scotland and Wales (9 in England, 2 in Scotland and 3 in Wales) and 49 Areas of Outstanding Natural Beauty in England, Wales and Northern Ireland (35 in England, 4 in Wales, 9 in Northern Ireland and 1 in both England and Wales). There are no Areas of Outstanding Natural Beauty in Scotland, but there are the equivalent [[United Kingdom National Parks#National Scenic Areas|National Scenic Areas]], of which there are 35 spread across the country\n\nThe British countryside has lots to offer, In the south there are the rolling countryside and picturesque villages of the [[Cotswolds]] and the Jurassic coast. In the east, there is the tranquillity of the Fens. The north has the magnificent scenery and outdoor activities in the [[Lake District]] and the [[Peak District]]. Wales offers the ruggedness of the [[Snowdonia National Park]] and the beautiful beaches of the [[Gower]]. Scotland has the vast wilderness of the [[Highlands]] and the beauty of the islands. Northern Ireland is blessed with the [[Giant's Causeway]] as well as the north Antrim coast.\n\n===History===\n\n====History– Stone Age, Roman age and the Dark Ages – before 1066====\n\nThe inhabitants of the United Kingdom have had a tendency to try to leave their mark on the landscape of the UK. For the length of recorded history they have been leaving little marks for the tourists of the future to enjoy. This started with our prehistoric cousins who left their mark in stone circles and mounds at such places such as Stonehenge and Avebury. Obviously these sites started as places of religious observance but today give us a glimpse of the past. \n\nThen came the Romans, who as well as leaving roads, married the natives and left great marks such as  villas at Fishbourne, Baths at [[Bath]], [[Hadrian's wall]] in the north of England, and roman walls and building all over the country, including in London, Lincoln, York and Cirencester (The capitals of the four British provinces in the late Roman period)\n\nAfter the Romans left, the United Kingdom fell along with the rest of Western Europe into the dark ages. Even during this period when much of the learning, cilivation and culture of the Roman period was lost, The people of the United Kingdom continued to make their mark on the landscape of the country, with elaborate burial mounds such as the ones at Sutton Hoo the treasures of which can now been see in the British museum. As time progressed waves of migrants and invaders came from the present day Germany, Denmark and Norway brought with them a new language and new culture. \n\n\n====History – Norman and Medieval periods 1066 to 1603.====\n\n1066 saw a major change in the history of the United Kingdom as the Kingdom of England was conquered by the Norman’s from Northern France. As a means to consolidate their power during the 11th and 12th centuries, they went on a building spree, building castles and churches, including the Tower of London and castles at [[Windsor]], [[Durham]] and [[Warwick]] amongst others and wonderful cathedrals at [[Canterbury]], [[Norwich]], [[Lincoln]], Durham and [[York]]. As the Normans extended their power in Wales in the 13th century, there was more castle building with [[Conwy]], [[Caernarfon]] and [[Harlech]]. In Scotland too, great castles were built at [[Stirling]] and [[Edinburgh]].\n\n\n====History 1603 – 1900====\n\nBritain is littered with historical sites from the Stuart, Georgian, Regency and Victorian era. There are fine examples of English country houses at [[Blenheim]], [[Chatsworth]] and the Royal pavilion at Brighton which shows royal regency splender by the sea. There are fine examples of classic Georgian cities in Edinburgh and Bath. The industrial revolution saw a huge increase in the population and a migration towards the cities and the development of heavy industry. Some key sites from this period include the Ironbridge, site of the world’s first all iron bridge, the mills of Saltaire and New Lanark. Other Victorian treats include St Pancras station in London, The Houses of Parliament, and the Royal Albert Hall, Tower Bridge in London, Forth Bridge in Edinburgh and Glasgow and Manchester Town Halls.\n\n====Modern Britain – 20th and 21st Centuries====\n\nThe early 20th century saw the heyday of the British seaside resort, with towns like [[Blackpool]] seeing millions of visitors to their beaches, theatres and entertainment every year. In [[Liverpool]] the two great cathedrals of the 20th century dominate the skyline, and then there are other modern treats, the domes of the [[Eden project]] in Cornwall, the Angel of the North outside of [[Newcastle]] and the new Titanic Quarter in [[Belfast]].\n\n===Sport===\n\n\nUnited Kingdom can be called the home of sport as it was the birthplace of five of the world’s major sports, association football, rugby football, tennis, golf, and cricket. There are shrines to these sports all over the country (Wembley, Old Trafford, Anfield and Hampden Park for football; Twickenham and Murrayfield for rugby; Lords for cricket; St. Andrew's for golf; and the All England club at Wimbledon for tennis).\n\n===Landmarks===\n\n*'''Edinburgh Castle''', [[Edinburgh]],  is a magnificently situated royal fortress located on one of the highest points in the city. The castle has been continuously in use for 1000 years and is in excellent condition.\n*[[Stonehenge]] is an ancient stone circle located near the cathedral city of [[Salisbury (England)|Salisbury]] in [[Wiltshire]].\n*The '''Georgian architecture''' and '''Roman baths''' in [[Bath]].\n*'''York Minster''' (Cathedral) in the historic city of [[York]].\n*'''Canterbury Cathedral''' is the seat of the head of the church of England. Located in the city of [[Canterbury (England)|Canterbury]] in [[Kent]] \n*'''Shakespeare's Birthplace''', [[Stratford-Upon-Avon]], is home of the Royal Shakespeare Company.\n*The ancient and world-renowned '''universities''' of [[Oxford]] and [[Cambridge (England)|Cambridge]]\n*'''The Eden Project''' near [[St Austell]] is a massive botanical gardens including indoor rainforest and Mediterranean biodomes.\n*'''The Giant's Causeway''' sixty miles from Belfast on the north coast of Northern Ireland is a World Heritage site and a natural wonder.\n*'''Portsmouth Historic Dockyard''' is home to three of the most important ships ever built and 800 years of naval history.\n\n==Do==\nAlthough most if not all visitors will probably visit [[London]] at some point, it is well worth getting out of the capital to get a real taste of the region and important to not forget the diversity one can find in barely 50 miles.\n\nWhether it's the countryside, coast, historic towns or vibrant cities you are after, there's something for everyone.\n\nFor some of the best countryside, head for the National Parks such as the [[Yorkshire Dales]] or [[Dartmoor]], perhaps on a day trip or a longer stay.\n\nThe coasts are varied and interesting with pretty beaches at places such as [[St Ives]], traditional fishing towns like [[Whitby]] or seaside resorts such as [[Blackpool]] and [[Bournemouth]].\n\nMany of the cityscapes that were not destroyed by the Luftwaffe have suffered the urban blight of multi-storey car parks and the sort of insensitive shopping mall developments that Prince Charles moans about, but some cities have managed to preserve their heritage relatively intact, such as [[Edinburgh]], [[Chester]], [[Bath]] and [[York]].\n\nShoppers looking beyond the capital may want to head to [[Manchester]] in the North, [[Bristol]] and [[Exeter]] in the West or [[Glasgow]] in [[Scotland]].\n\n==Buy==\nFollowing the referendum on 23 June 2016 in which the majority voted to leave the EU (Brexit), the exchange rate of the British Pound has undergone rapid changes (which may benefit visitors) and is likely to be more volatile over a considerable period.   \n\n===Cost===\n\nThere is no getting around it, the UK is not a cheap travel destination. England is largely more expensive than the rest of the UK and London and the south east can be horrendously costly. On the plus side, many of the museums and parks in the UK are admission free for all. If one is on a small budget, for food it is best to check out supermarkets which sell an excellent range of food and essentials for competitive prices. Electronics however are competitively priced due to the competition in this sector, with large chains wanting to get the best share out of what is one of the largest consumer markets in the world. Video games are also far cheaper here than say, mainland Europe, though still more expensive than the United States. Costs for traveling basics such as transport, accommodation and food will means that you will spend at least the very least £50 per day as a budget traveler. This figure climbs much higher if you want to use taxis, 3 star hotels, eat in restaurants and admission prices to attractions.\n\n===Cigarettes and tobacco===\n\nCigarettes are heavily taxed ranging to over £9.50 for 20 cigarettes. 50-gram pouches of rolling tobacco are around £19.  Imported brands such as Marlboro, Camel or Lucky Strike are generally the most expensive as are well-known UK brands such as Benson & Hedges and Embassy. Popular and less pricey local brands include Lambert & butler and Silk Cut (a light cigarette similar to Marlboro Light), while the cheapest brands (Mayfair, Richmond, Superking, Windsor Blue) are cheap and cheerful. Low-tar cigarettes cannot be called 'light' so terms such as 'gold' and 'smooth' are used. Most cigarettes come in low-tar and menthol varients, and many brands also sell 'Superking' (100mm length) varients too. The cheapest prices will be found in the supermarkets at the customer service counter.  Almost all newsagents, supermarkets and petrol stations sell tobacco, and most will also sell some brands of pipe tobacco and cigars. For a more extensive selection of tobacco products, most towns and cities will have at least one specialist tobacconist.\n\nThe minimum age to purchase tobacco is 18. Customers who appear younger than 25 will usually be asked to produce a passport or other identification.\n\nIn some places there is a black market in considerably cheaper, imported cigarettes and you may be offered such in some pubs by certain individuals (rarely the publican or bar staff!). The health warning on these is likey to be in a language other than English. This is best avoided as this is indeed an illegal trade, and counterfeits are common.\n\nSmoking is illegal in all enclosed public places and all places of work. For the purposes of the anti-smoking law, 'enclosed' is defined as having a minimum of three walls and a roof, so this can include things such as 'open' bus shelters. It includes all public buildings. It is also illegal to smoke at railway stations. Penalties can include a £50 'on-the-spot' fine. Most pubs and nightclubs have smoking areas which fully comply with the relevant legislation.\n\n===Money===\n\nThe currency throughout the UK is the '''Pound''' (£) (more properly called the Pound Sterling, but this is not used in everyday speech), divided into 100 pence (p, pronounced 'pee').\n\nCoins appear in 1p (small copper), 2p (large copper), 5p (very small silver), 10p (large silver), 20p (small heptagonal silver), 50p (large heptagonal silver), £1 (small, thick gold edge with silver centre) and £2 (large, thick with silver centre and gold edge) denominations, while Bank of England notes (bills) come in £5 (green/light blue), £10 (orange/brown), £20 (blue (newer design) purple (older design)) and £50 (red), and depict the Queen on one side and famous historical figures on the other. The size increases according to value. It's often best to avoid getting £50 notes. £50 notes are often refused by smaller establishments - they are unpopular because of the risk of forgery, and because of the amount of change one needs to give on receiving one. Banks are also unlikely to change them to smaller notes for you, though a post office or bookmaker might.\n\nHowever, Scottish and Northern Irish banks issue their own notes in the above denominations, with their own designs.  If in doubt, check what you are given for the words \"Pounds Sterling\". £100 notes are issued in Scotland. Bank of England notes circulate freely in the whole of the United Kingdom, and in Scotland and Northern Ireland it is quite common to receive change in a mixture of English and/or Scottish or Northern Irish notes (bank notes from the latter are technically promissory notes).  Whilst Scottish or Northern Irish notes are practically supposed to be accepted in England and Wales as well; when in doubt, change them for English banknotes at an England-based bank.  Welsh banks do not issue their own notes since its banking system is directly under the jurisdiction of the Bank of England. \n\nSome smaller English or Welsh vendors might refuse to accept notes issued by Scottish or Northern Irish banks mainly due to unfamiliarity. They are under no obligation to do so, so use them at a larger retailer, or change them for Bank of England notes at a bank. There should never be a charge for this - though foreign-exchange dealers at airports or ferry terminals might well try to charge you.\n\nCoins are uniform throughout the United Kingdom. Non-English speaking visitors should be aware that the new coin designs (introduced from 2008) no longer show the value in numbers, only words. There will be a new 12-sided £1 coin in circulation from September 2016 and also a new flexible plastic £5 note.\n\nYou may also hear the slang term '''quid''' for pounds.  It is both singular and plural; \"three quid\" means \"three pounds\". It is likely that people will use the slang \"p\" when they mean either a penny or pence. Note the singular is penny and the plural pence. Some people still use traditional terms such as a penny, tuppence and thruppence (1p, 2p and 3p). The words \"Fiver\" and \"Tenner\" are common slang for £5 and £10, respectively.\n\nIn general, shopkeepers and other businesses in the UK are not obliged to accept any particular money or other method of payment. Any offer to purchase can simply be refused; for example if you try to pay with notes or coins they don't recognise. If in doubt, ask someone when you enter the shop. If settling a debt, for example, paying a restaurant or hotel bill, usually any reasonable method of payment will be accepted unless it's been made clear to you in advance how you must pay.  Travellers cheques in Sterling may accepted in place of cash but it is best to ask first.\n\nATMs, which are often known in the UK as Cashpoints, cash machines or informally as 'holes in the wall', are very widely available and usually dispense £10, £20 and sometimes £5 notes. Traveller's cheques can be exchanged at most banks. Be aware: some non-bank ATMs (easily identified, sometimes kiosk-style units, as opposed to fixed units in walls, and often at petrol/gas stations and convenience stores) charge a fixed fee for withdrawing money, and your home bank may as well. On average the cost is about £1.75 per withdrawal, but the machine will always inform you of this and allow you to cancel the transaction.\n\nIf a bank card is issued by a foreign bank, some ATMs will ask whether they should perform the conversion to the local currency, instead of debiting the bank account in GBP. This is almost always a worse deal than going with the conversion rate provided by the issuing bank, resulting in surcharges of sometimes over 5% on the withdrawal. [http://transferwise.com/blog/2012-11/choose-local-currency-at-foreign-ATM]. It is more prudent to choose the \"Without conversion\" withdrawal option, whenever this choice is presented.\n\nCompared to the continent, the use of internationally-branded payment cards is much easier and ubiquitous in the UK.  Visa, Mastercard, Maestro and American Express are accepted by most shops and restaurants, although American Express is sometimes not accepted by smaller independent establishments, and it is worth asking if unsure, especially if there are long queues.  Internet purchases from a UK-based merchant (particularly in the travel industry) with a credit card however may incur a 2-2.5% surcharge (this does not apply to a debit card, even those with a Visa or Mastercard logo).  Since February 14, 2006, Chip and PIN [http://www.chipandpin.co.uk/] has become nearly compulsory, with few companies still accepting signatures when paying by credit or debit cards.  Customers from countries without chips in their credit cards are supposed to be able to sign instead of providing a PIN; however, it is wise to carry enough cash in case the retailer does not comply or the machine is having difficulty reading the card.  When one has to sign for a debit/credit card transaction, the merchants in the UK are more particular about verifying the signature than elsewhere.  \n\nAlthough most small shops will take cards, there is often a minimum amount you have to spend (usually around £5).  Anything under the minimum and they may refuse to accept the card. It is now not permitted for shops to charge more for using a card. \n\nSome stores in London and Northern Ireland accept Euros. This however is usually at an unfavourable exchange rate and should not at all be relied upon.\n\n===Shopping===\nAlthough shopping in the UK can be expensive, it is generally regarded as a world-class destination for shoppers both in terms of variety and quality of products, depending on where and what you buy. Fierce competition has brought prices down considerably in the food, clothing and electronic sectors. Prices do vary and it is always worth visiting the various retail stores as bargains can often be found. Avoid buying from the tourist areas and stick to the High Street shops or the many 'out-of-town' retail parks where prices will be considerably cheaper. The retail market in the UK is a very competitive one and many bargains are to be had all year round. In the electronics sector, for example, it is becoming more and more common to ask for a price reduction at time of purchase.\n\nVAT (Value Added Tax - a mandatory tax on almost all goods and services in the UK) is 20% with reduced rates of 5% and 0% applying to specific categories of goods (foodstuffs and most books, for example, are taxed at 0%). For all consumer shopping, VAT is included in the sale price - so unlike the United States for example, the price you see is the price you pay.  The exception to this rule are most industrial goods - where VAT is quoted separately (by law the term \"ex VAT\" must be displayed next to the sales price), but tourists are unlikely to ever be exposed to this.\n\nIn many of the larger towns and cities, many shops have the blue \"Tax-Free Shopping\" sticker in the window, meaning that when you leave the European Union (not just the UK), you can claim back at least some of the VAT before you leave the country. However, in order to do this, you must keep any receipts you receive from your purchase and request a voucher from the store. Minimum purchase amounts at a store before claiming back VAT would normally start at £30.\n\nElectronic items such as computers and digital cameras can be cheaper here than many European countries (especially Scandinavian countries), but do shop around. The internet is always a good way to judge the price of a particular item, also you can use this as a bargaining tool when agreeing on a price with some of the larger electronic retail stores. If visiting from the US, there may be duties and taxes charged that make some of these purchases much less of a bargain so shop wisely.\n\nPlastic bags cost a minimum of 5p each from all large chains across the nation.\n\nBeware of shopping on Sundays as some retailers only operate limited hours.  Limited Sunday hours are in fact actually mandated by law (maximum of 6 hours in England and Wales and 5 hours in Northern Ireland) although in cities like London, if you entered the shop before closing you might still be able to complete the transaction after closing. Keep this in mind when planning shopping trips. Smaller corner convenience stores (eg Tesco Express or Sainsbury's Local) are not covered by this and will normally operate late into Sunday. This law also does not apply to Scotland and stores there generally have longer opening hours on a Sunday.\n\nIn England, Wales and Northern Ireland supermarkets are required by law to remain closed two days a year; Easter Sunday and Christmas Day. In Scotland this doesn't apply, however the vast majority there remain closed on Christmas Day. Certain supermarkets may also choose to close on Boxing Day and/or New Year's Day too.\n\n==Eat==\n[[File:London Breakfast.jpg| thumb| typical British breakfast]]\nDespite jokes and stereotypes, British food is actually very good and internationally oriented British cuisine has improved greatly over the past few decades, and the British remain extremely proud of their native dishes. Restaurants and supermarkets in the middle and upper range have consistently high standards, and the choice of international dishes is among the best in Europe. However, British eating culture is still in the middle of a transition phase. Unlike their continental neighbours, many Britons still eat to live rather than living to eat, and as a result, food quality is variable at the budget end of the market.\n\nThe United Kingdom can be an expensive place to eat out compared to, say, the more southern European countries, but relatively cheap in comparison with countries such as Switzerland and Norway.\n\nMany restaurants in city centres tend to be a little more expensive than ones in the suburbs, and pubs do tend to be slightly more expensive in the countryside, but generally, a three-course meal without drinks will cost the traveller anywhere between £10 and £25. Chicken tikka masala with rice is sometimes claimed as the UK's most popular dish, though roast beef is a more traditional national dish.\n\nIf all else fails decent picnic foods such as sandwiches, cakes, crisps, fresh fruit, cheeses and drinks are readily available at supermarkets. Street markets are a good place to pick up fresh fruit and local cheeses at bargain prices. Bakeries (eg Greggs) and supermarkets ( eg Tesco, Sainsburys, Waitrose, Morrisons and Asda) usually sell a good selection of pre-packed sandwiches, pasties and cakes along with a range of soft drinks, juices and mineral waters. In addition, most chemists and newsagents will have a basic supply of pre-packaged sandwiches and bottled drinks. However, it is worth looking out for independent sandwich bars and bakers, as the quality of the food and value for money that they provide is often far superior to the pre-packaged food stocked by national chains, which is often bland and tasteless.\n \nMany large shops, especially department stores, will have a coffee shop or restaurant. British tolerance for poor quality coffee has lowered significantly in recent years, and it is not hard to find good quality coffee these days.\n\nSmoking is now banned in ''all'' restaurants, cafés, bars and pubs - there are no exceptions. However some establishments have provided 'smoking areas' and smoking is allowed in the gardens/terraces outside pubs and restaurants unless otherwise stated.\n\nThe British breakfast generally consists of either cereal and toast with preserves or a fried breakfast of egg, bacon, sausage, tomatoes, mushrooms and fried bread. The latter is known as a \"full English/Scottish/Welsh breakfast\", depending on where you are, or simply a \"fry-up\". In Northern Ireland it may be referred to as an \"Ulster Fry\". The Scottish variant may include haggis, and black or white pudding is sometimes included especially in the North.\n\nLarger hotels may also offer croissants, pastries, porridge or kippers for breakfast. Some very large hotels will also provide an international selection including cold meat, cheese, boiled eggs and a variety of different kinds of bread.\n\n===Fish and chips===\n\nDeep-fried, battered fish (usually cod or haddock, though with a wider selection in some areas) with rather thick chips, always made from real chunks of potato rather than thin tubes of extruded mashed potato. Fish and chips are often served with mushy peas (in England), and dressed with salt and malt vinegar (or 'Sauce' in parts of Scotland and Northern Ireland). \"Proper\" (authentic, for-the-masses) fish and chips can be bought only from either a backstreet \"chippy\" or a specialist fish and chip restaurant (the latter are mostly at the seaside, although there is a national chain, Harry Ramsden's, which does quite good fish and chips, but at \"tourist prices\"; Mr Ramsden's original shop, near Leeds, was a legend). However, a \"proper chippy\" (a backstreet \"fish and chip shop\", or just \"chip shop\") is the quintessential place to buy fish and chips. In the north you can also add mushy peas to your order. These are rarer in the south of the country. You can also buy pickled onions or gherkins in most locations. In Scotland, especially Glasgow, some fish and chip shops deep-fry almost everything they sell, including meat pies, pizzas, and even battered Mars or Snickers bars. In Northern Ireland, you can also order a ''Pastie'' (not to be confused with a ''Cornish Pasty''). This is meat minced with onions, potato and spices, which is then battered and deep fried. It can be served in a ''bap'' (a soft bread bun), on its own, or with chips. Anything served with chips in Northern Ireland and in parts of Scotland is referred to as a \"supper\", eg, \"a fish supper\" or \"a pastie supper\".\n\nIn the North of England and larger Scottish cities you can also ask for \"scraps\" which are the small remnants of batter left over in the frying oil. These are usually sprinkled on top of any order and are almost always free of charge!\n\nThe best ones are specialists, serving perhaps a few alternatives such as a selection of pies or sausages. They are usually located near where people live, though some good ones, especially \"sit down\" chippies, can be found in town centres. They can be spotted by the illuminated sign which usually has a picture of a fish and a name: either punning and piscine, such as \"Codroephenia\" and \"The Codfather\" or proud and proprietorial, \"Fred's Chippy\", or even both as in \"Jack's Golden Plaice\". Typically a lot of people eating or waiting is an indication of good food.\n\nA \"sit down chippy\" is a chip shop with a separate dining room. Whilst no real one will be exactly like this, although most elements will be present, a stereotypical sit down chippie will be brightly lit and decorated in a nautical theme with yellow or blue formica-topped tables. Typically a waitress will take your order for a Cod Meal, alternatively Haddock, Plaice or another dish, and within five minutes your meal will be served: a huge fish, a mountain of chips and mushy peas. Accompanying it, in more up-market places, will be a sachet of tartar sauce, a slice of lemon, a big plate of bread-and-butter, and a pot of tea. Some will have a separate pot of hot water, either to dilute the tea if it is too strong for your taste, or to \"top-up\" the tea in the pot when you have poured out your first cup. On the table will be a large shaker of salt and a bottle or plastic squeezy bottle of brown malt vinegar, which is what most British will put on their fish and chips. There may even be a tomato-shaped plastic container of ketchup or a container of ''brown sauce''. Fish and chips bought from a pub, hotel or non-specialist restaurant bear little resemblance to those from a chippy.\n\n===Take-aways===\n\nA 'take-away' is either a shop supplying prepared meals for people to eat elsewhere, or the meal itself. A very British take-away is the Fish and Chip shop; the sandwich shop is a popular choice at lunchtimes; they often also sell pies and cakes.  Alternatively, most towns and many main routes have a selection of fast-food chains. Various types of take-aways are present in nearly all towns, ranging from fish and chips to \"Indian\", which can often be operated by non-Indians like Bangladeshi, and Chinese shops.  Thai and Indonesian takeaways are becoming quite common, and lots of others in bigger towns.  Generally the standard of take-aways is good, but the best guide is, as always, to observe what the locals are doing.\nIn towns and cities these places tend to open late (sometimes till about 1AM) to cater for the so called after-the-pub crowd. At this time they tend to be busy and rowdy so to avoid the queues the best time for a takeaway is between 7PM and 11PM after the teatime rush but before the supper crowds. Ordering food for takeaway also tends to be slightly cheaper than eating at the restaurant.\n\n===Food in pubs===\n\nSee below for general points about pubs. Pubs are typically places where you can sample British cuisine. There are no such things as a British restaurant ''per se'', so these will be your next best bet; even if you are against drinking alcohol, you will find a more traditional and full menu then a cafe or chippy.\n\nAlmost all pubs (see below) serve food, although not all will do so during the whole of their opening hours.  Prices of all these types vary enormously, and you should seek local advice if you have particular requirements or standards. Do not sit at a table in a pub expecting a waiter to take your order for food or drinks: pubs nearly always work on a \"queue at the bar for drinks: order at the bar for food\" basis. You go to the bar to request and pay for drinks and food.  To avoid annoying customers behind them, groups usually order as one, and \"settle up\" between themselves later (see elsewhere for \"buying rounds\").  You normally order your \"starters\" and \"mains\" together (food-oriented places have numbers screwed to the tables for you to quote, or will give you a number to take to your table). There is an etiquette that if you see another patron at the bar, you should invite them to order first. You then wait for your drinks to be poured and carry them to the table.  When your meal is ready, it is either brought to you or, less commonly now, announced when it is ready for you to collect. The person who tidies away your main course may ask you what dessert you would like, or you may have to order at the bar again.\n\n===Tipping===\nMost restaurants in the UK (especially in London) will add a '''discretionary''' 12.5% service charge to the bill, a practice which many British people see as rude and assumptive. This is always optional and you are under no obligation to pay it, but you should only decline if you are dissatisfied with the service and be prepared to explain why. If the service charge isn't included, waiters generally expect about 10% of the bill. British people aren't big tippers, and as a visitor the 10% rule is more than generous and worth sticking to (unless the service is amazing, which it's usually not). Visitors from the US and Canada are seen as very generous tippers and even a bit of a soft touch by some. For restaurants that don't automatically add the service charge to the bill, try to leave your tips in cash if you can, since there are a lot of restaurants where the owners will take all of the tips rather than sharing them fairly.\n\n===Restaurants===\n\nLarger towns have a range of restaurants to suit most tastes and you will find a very broad range of cuisines, including Indian, Chinese, Thai, French and Italian. The usual fast-food restaurants (McDonalds, Burger King, Pizza Hut, KFC, Subway and local chain Wimpy) are widespread in larger towns and cities but uncommon in smaller towns. They are typically located in major shopping areas, in or around major train stations, in out-of-town retail parks and in motorway service stations and airports. Prices are average - a burger, chips and drink meal will cost about £4-5, but note that a premium of about £2-£3 is charged in outlets within airports, motorway service areas, and in the heart of London's West End.   Most are open from around 7:00-22:00 although some in large cities are 24-hours. Fast-food restaurants in out-of-town locations offer drive-through service. Delivery service is widely offered. \n\n====Curry====\n\nOne of the most popular types of restaurant in the UK is the Indian restaurant. They can be found in every city and most towns large and small. There are now more and more upmarket Indian restaurants in the larger urban centres. Indian restaurants serve cuisine commonly known to their customers by the generic term \"curry\". Common Indian restaurant dishes include Chicken Tikka Masala, Prawn Biryani and the incredibly spicy Vindaloo. A popular version of curry is known as balti, possibly named after the metal bowl the food is cooked and served in. Balti cuisine, and a number of other commonly served dishes such as the ubiquitous chicken tikka masala, originated in the UK though it is clearly based on food from the Indian subcontinent.  Birmingham in the Midlands is considered the balti capital of the UK as this dish was conceived there. '''Curry Mile''' in [[Manchester]] is well worth a visit if you are in the city.\n\n===Motorway Services & Transport Cafes===\n\nMotorway (highway/freeway for US readers) service areas are open 24 hours a day by law. Most contain fast-food outlets and all have (free) toilets and a petrol station, and a small number also have motel facilities (usually a Travelodge or Premier Inn). Some services may be limited overnight such as the range of hot and cold food, although most will keep a selection available. As a general rule, motorway service areas in the United Kingdom have a poor reputation for hygiene, service and most glaringly - overpriced food and fuel.\n\nMore often than not - a large supermarket can be found a short drive from a motorway exit - try '''5 minutes away''' [http://www.5minutesaway.co.uk/], a website listing facilities no more than 5 minutes' drive from motorway junctions, where both petrol and food can be found considerably cheaper.\n\nTwo notable exceptions to this rule are '''Tebay Services''' [http://www.tebayservices.com/] and '''Gloucester Services''' [http://www.gloucesterservices.com/]. located on the M6 in the Lake District in Northern England and on the M5 near Gloucester ( between Bristol and Birmingham ) respectively. Tebay once prided itself on being the only independently run motorway service area in Britain that was not part of a national chain.  Set in a stunning location, it IS expensive just like any other, but prides itself on quality food and service and is well worth a visit, even if just to admire the spectacular scenery of the area. Gloucester is run by the same company in a very similar way, though the location is somewhat less spectacular!\n\nA close relative of the motorway services area is the '''transport cafe''' (effectively the same as a '''roadside diner''' in the US); these tend to be found on major non-motorway A-roads such as the A1.  Unlike motorway services, they are nearly always independently run and are not bound by any legislation to open 24 hours.  The food can just be as stodgy, but at least it is usually cheap.  Many have a petrol station attached to the side.\n\n===Vegetarian/vegan===\n\nVegetarianism has become more widespread in the UK over the last few decades. If you are staying as a guest in a British home it would be considered courteous to inform your host beforehand as to any dietary requirements, but this will not be considered rude or even particularly unusual.  If you are staying in a B&B, let the owner know when you arrive, and you'll often find that they will cook up a special vegetarian breakfast for you.\n\nBear in mind that even if you call yourself vegetarian some people will assume you eat fish, so if you don't, then tell them so. Nowadays, it is rare to find a pub or restaurant with no vegetarian options.\n\nIf you are a vegan, be prepared to explain precisely what you do and don't eat on a fairly frequent basis. Outside of specialist eateries, most places probably won't have a vegan-friendly main meal, so be prepared to hunt around, order bits and bobs, or in a pub make do with the ubiquitous bowl of chips and tomato ketchup and even then it would be wise to check whether the chips have been cooked in animal fat, a practice quickly falling out of fashion.\n\nIn general, the best places for vegetarian and vegan food are specialist veggie pubs and restaurants and Indian, Chinese and South-East Asian restaurants.  Most major cities and towns will have at least one.  Expensive upscale restaurants may have more limited vegetarian options, and sometimes none at all.  If you're fortunate enough to be dining in such a place, it may be worth ringing ahead.\n\n===Children===\n\nChildren are not necessarily allowed in all pubs and restaurants unless a lounge area is provided, and high chairs are not always available. British pubs and restaurants are subject to complex licensing laws and it is illegal for children under 16 to enter licenced premises unless accompanied by an adult. Under 18s may not purchase or consume alcohol, and it is an offence for them to do so. It is also an offence to serve them or for an adult to buy drinks for a minor. An exception is that 16-17 year olds may consume beer, wine or cider with a meal.\n\nLicensees have discretion as to whether or not to allow children into their premises. Most pubs that serve food will accept children, and it is usually  easy to distinguish those that do. The general rule is that children cannot sit or stand about in the area where drinks are being served. So if the pub has only one small room, they are often not allowed.  \n\nChildren are permitted in most drinks-only pubs, especially those with gardens, but again, they are not supposed to come near the bar. To be safe, ask an employee or telephone the place in advance.\n\n===Regional specialities===\n\n*'''Black Pudding''' - a sausage made of congealed pig's blood or, in the [[Western Isles]] of Scotland, sheep's blood, rusks and sage or spices, cooked in an intestine. Available all over the UK but a speciality of the North of England, in particular from [[Bury]], the [[Black Country]],[[Scotland]], and [[Northern Ireland]]. In actual fact, it tastes much better than it sounds.\n*'''Cheese''' - Although the British are not as boastful of their cheeses as their neighbours in France, a multitude of cheeses are produced and are generally named after a particular region. Well-known examples include Cheddar, named after the village of [[Cheddar]] in [[Somerset]]); Stilton, named after [[Stilton]] but now produced elsewhere; [[Lancashire]], which may be \"creamy\" or \"crumbly\"; [[Wensleydale]], a valley in [[North Yorkshire]]); [[Caerphilly]]; and [[Cheshire]]. The quality varies tremendously, depending on where they are bought; the best place is probably a local market – e.g. buy your Lancashire cheese in Lancashire. Supermarkets will offer a wide range of cheeses but are often of inferior quality.\n*'''Cornish Pasty''' - beef and vegetables baked in a folded pastry case. Originally a speciality of [[Cornwall]], but now available throughout the UK. Usually very good in Devon and Cornwall, but can be of variable quality elsewhere. The variety sold in a plastic wrapper in places like petrol (gas) stations and motorway service stations are well worth avoiding. As of 2011, Cornish Pasties can only be labelled as Cornish if they are made in Cornwall.\n*'''Deep-Fried Mars™ Bar''' - Originally from [[Stonehaven]], [[Kincardineshire]], but now available in other parts of [[Scotland]] and sometimes by request in fish & chip shops elsewhere in the UK. Not usually available in south-east England, where it is sometimes believed to be an urban myth.\n*'''Eccles Cake''' - a popular flaky-pastry type cake with raisins, from the small namesake town in Lancashire.\n*'''Haggis''' - a mixture of sheep innards, minced meat and oatmeal boiled in a sheep's stomach. Available widely, but a speciality of [[Scotland]]. Also available in many supermarkets, where it appears that many sheep have plastic stomachs - although the contents are often quite reasonable - sometimes mildly spicey.\n*'''Lancashire Hotpot''' - a hearty vegetable and meat stew. A speciality of [[Lancashire]], but available throughout the UK. In Lancashire, it is often accompanied by pickled red cabbage or pickled beetroot.\n*'''Laverbread''' - a puree made from seaweed, rolled in oatmeal, lightly fried and generally served with bacon rashers, though can be prepared as a vegetarian dish. Available in [[Swansea]] and [[Wales|West Wales]].\n*'''Oatcakes'''  - this speciality of [[Stoke-on-Trent]], North [[Staffordshire]] and [[Derbyshire]] is a large, floppy, oat-based pancake, eaten hot, in place of bread at breakfast time, or with a savoury filling. Not to be confused with the Scottish oatcake, a sort of biscuit.\n*'''Pastie''' - recipes vary, but generally a pasty is minced pork with onions, potato and spices, shaped into a thick disc, covered with batter and deep fried. Pasties are a specialty in Northern Ireland and well worth trying from a Fish & Chip shop.  Around [[Kingston_upon_Hull]], a slice of potato battered and fried.\n*'''Pork pie''' - a pie made of pork, with an outer of a particularly crispy sort of pastry.  Melton Mowbray in Leicestershire is their spiritual home but they are available across the country.  They are served cold or room temperature as part of a cold meal.\n*'''Potato Bread''' - a mixture of potatoes, salt, butter and flour. A speciality of [[Northern Ireland]] which, alongside Sodabread forms one of the main ingredients of an 'Ulster Fry'. Similar to, but not quite the same as potato bread, are '''Potato Cakes''' as sold in [[England]] and '''Tattie Scones''' in [[Scotland]].\n*'''Sausages''' - Europeans will be surprised to discover that the filling contains breadcrumbs, rusk or other fillers as well as meat (Britons think of frankfurters and similar solid-meat sausages as German or French).  Generic sausages are nothing special and very much a 'mystery meat' experience, that being said not all sausages are pork, with many now seeing a mix with beef, venison, turkey or even soya. Regional speciality recipes such as Lincolnshire and the Cumberland-ring are well worth trying in a pub. Some marketplaces and butchers still serve archaic family recipes, such as Oxford where the sausage is without skin and more like a beef patty. Remeber you get what you pay for.  S 2p or 3p 'bargain' bangers like Walls, will taste of very little.\n*'''Sunday dinner/Roast dinner''' - this meal is common throughout the UK. Traditionally eaten on a Sunday, the meal consists of a roasted joint of meat (eg: Whole roast chicken, leg of lamb, shoulder of pork etc), and roast potatoes and steamed/boiled vegetables.  All served with gravy (a thick or thin sauce, depending on the meat, made with the meat juices and stock. Yorkshire Pudding (a pancake style batter baked in a very hot oven) is traditionally served with roast beef, although some people have it with any roast dinner.\n*'''Smoked fish''' - protected as a regional dish from the Great [[Grimsby]] area. Usually haddock is the most popular type smoked in this special style. In Scotland, it is traditional to have smoked kippers if not porrdige for breakfast.\n*'''Welsh Cakes''' - scone-like cakes studded with raisins and dusted with sugar. Available in bakeries throughout [[Wales]] and served hot off the griddle at [[Swansea]] Market.\n*'''Yorkshire Pudding''' - a savoury side dish made from unsweetened batter. Traditionally a plate-sized pudding would be served with gravy before the main course, to encourage more economical consumption of expensive meat. Squat and round in shape - often served with a roast dinner (consisting of roast potatoes, roast beef and Yorkshire puddings). Originally a speciality of the former industrial cities of [[Yorkshire]], but now an integral part of a beef dinner throughout the UK.\n\n==Drink==\n\nThe legal age to buy and consume alcohol is 18, but many teenagers younger than 18 have seemingly little problem in purchasing alcohol in smaller pubs and from off licences. Nevertheless, if you're over 18 but lucky enough to look younger, expect to be asked to prove your age when buying alcohol (also, in certain places if you look under 21 or 25, you have to prove you're over 18, known as \"Challenge 21(25)\"), especially in popular city spots. However, supermarkets tend to ask everyone regardless of looks. Some premises will require proof of age for all drinks after a certain time of night due to restrictions on the age of people who can be on the premises. The most trustworthy form of ID is a passport or driving licence which shows both your photograph and date of birth.  ID cards are likely to be accepted (providing there is a photograph) and proof of age cards are available which must be applied for by post and take several weeks to issue.  Any other form of ID willl not be accepted. In private residences the minimum age to drink alcohol is 5 years old, although it is likely that if a 5 or 6 year old etc. were getting drunk, the matter would be brought before the courts as child neglect. \n\nGetting drunk is acceptable and often it is the objective of a party, though the police often take a dim view on those causing alcohol-related trouble. This applies to all levels of the British society - it may be worth remembering that the former Prime Minister, Tony Blair, had to collect his son Euan from a police station after he had been found drunk celebrating the completion of his GCSE exams taken at the age of 16. Nevertheless, Britons have a great sense of humour and everything is forgotten after a hangover, at least until the next time. Drinking is an important part of the British culture and, even though it is frequently complained about, it is as popular as ever.\n\nUrinating in public is illegal (unless pregnant), and classified as indecent exposure, technically a sexual offence and quite difficult to explain when applying for a visa.  You should try and use the facilities where you are drinking.\n\n===Pub===\n\nThe '''pub''' or public house is the most popular place to get a drink in the UK. Even small villages will often have a pub, serving spirits, wines, beers, cider, and 'alcopops', accompanied by crisps, nuts and pork scratchings.  Many serve snacks or meals.  The greater volume of drinks served are various kinds of beer, mainly lagers, bitters, and porter / stout (ie Guinness).  People not looking to drink ''real ale'' are free to choose a pub just on the basis of location, and character, because most national \"smooth\" bitters or TV-advertised lagers are available in any non-real-ale pub; however, even non-real-ale drinkers often find that they prefer the types of pubs with a range of real ales, because they tend to be more \"traditional\", with a more individual character and less oriented to juke boxes, games machines, fruit machines and large crowds. \n\nAcross the whole of the United Kingdom there is now a blanket ban on smoking inside pubs and restaurants, though many pubs have areas outside, often known as \"beer gardens\", where smoking is (usually, but not always) permissible. However if you are lucky (or unlucky) enough to be able to stay after the formal closing hours this is called a \"lock-in\" and smoking may be ok if the pub landlord allows it. This will often occur only in the later hours after 11PM and these lock-ins can last any amount of time. As they are classed as a private party, they happen in only a few pubs, and often only pubs with more regular customers, although this is not always the case. Once at a lock-in, you cannot leave and come back in again.\n\nBritish '''real ales''', championed by the Campaign for Real Ale (CAMRA) [http://www.camra.org.uk/], are amongst the best in the world - though people used to colder, blander, fizzier beers may find that the taste needs to be acquired.  People looking for real ale will need to select the right pubs, because although a wide range of pubs serve one or two real ales, only a \"real ale pub\" will have a wide selection.  \n\nBritish ale has a limited shelf life compared to most foreign beers, and as some pubs have only a \"token\" cask with low turnover, it's often well past its prime and has a strange vinegary taste: often, unfortunately, people's first and understandably only experience with \"real ale\".  If you do receive an 'off' pint, ask for a replacement at the bar, which will usually be forthcoming.\n\nThe phrase \"free house\" was usually the main indicator for people looking for a good choice of beer, because this indicated that the pub was not owned by a particular brewery and served whatever beer its landlord thought would appeal to their customers. However, this is no longer a significant factor, because most national pub chains are now owned by large conglomerates who deal centrally with brewers and serve the same mass-market brands in all their pubs: these conglomerates (not being breweries) can still call their pubs \"free houses\". \n\nIf you want to be certain of the quality of the real ale in a pub, look out for a \"Cask Marque\" plaque outside the pub. This is a stringent quality standard, and you can be sure that any pub displaying this plaque will serve good quality ale. Pubs serving a wide variety of real ales will usually be willing to pour small quantities for you to try before you decide to buy, so feel free to ask if you can taste the beer first.\n\n'''Cider''' is available in most pubs, and is usually clear and sparkling. In the West Country, especially Somerset, Devon and Cornwall, a still, cloudy cider known as \"scrumpy\" is often available. Proper scrumpy will come from a wooden barrel, rather than the metal kegs used to serve the more common variation. \n\nScrumpy is often exceedingly strong, but is deceptively easy to drink. Thus it is easy to inadvertently consume large quantities of scrumpy, which can quickly rob the unwary of the power of speech and interfere with co-ordination, balance and fine motor skills. It should be approached with extreme caution.\n\nScrumpy can also be bought very cheaply direct from cider farms, so if you are travelling in the West Country, look out for signs advertising cider or scrumpy for sale. The person selling you the scrumpy may be difficult to understand, because of their regional accent and due to the effects of long-term scrumpy consumption. But don't worry - most British people can't understand them either.\n\nBritish people usually follow a kind of unwritten code of conduct when in pubs, though types of venue can vary dramatically, ranging from a 'local' pub, usually a quiet place consisting of one or two rooms, to a chain pub such as J.D. Wetherspoons which are very large rooms capable of holding hundreds of people.\n\n* Don't tap money on the bar surface to attract the barman's attention.\n\n* Tipping is not a tradition in most pubs and you should take all of your change. Regular customers who have a relationship with the staff will offer to buy the landlord, or bar worker, a drink. They may say something like this: \"A pint of Best, landlord, and one for yourself.\" The landlord will often keep the money rather than have too much to drink. However, you are not obliged to do this yourself.\n\n* Especially in a 'local' pub, keep your voice down and avoid drawing attention to yourself.\n\n* It might be best to avoid heated debates about controversial subjects (E.g. Brexit) in pubs and bars; if others get involved these can escalate.\n\n* If you require extra chairs, you may want to take one from another table. If someone is already seated (even if it is only one person seated at a six-person table) you ''must'' ask if you can take the chair.\n\n* Waiting patiently at a bar is imperative. Pushing in line will not be tolerated and could lead to confrontation. If someone cuts in line before you, feel free to complain - you should get support from other locals around you. Bear in mind that pubs are amongst the few places in Britain which don't actually have formal queues -- you just crowd around the bar, and when everyone who was there before you has been served you can order.\n\n* In the male toilets, especially in big pubs or clubs, don't try to strike up conversation or make prolonged eye contact. UK pub toilets are very much \"get in and get out\" places - some drunk people can take a casual remark the wrong way.\n\nPubs with a good choice of real ales may exhibit almost any pattern of ownership:\n\n* By a real-ale brewery (in which case the pub will serve all of the beers made by them, and perhaps only one \"guest beer\").\n\n* By a national or local pub chain who believe it is possible to serve a range of real ales at reasonable prices (their chain buying power can force down a brewer's margins) in a pub that non-real-ale-fans will be willing to patronise.\n\n* By an independent landlord committed to real ale (usually the ones with the most idiosyncratic beers, and the hard-core \"real ale type\" customers).\n\nMany pubs are very old and have traditional names, such as the \"Red Lion\" or \"King's Arms\"; before widespread literacy, pubs would be identified by most customers solely by their signs.  Recently there has been a trend, strongly resisted in some quarters,  towards chain-pubs such as the Hogshead, Slug and Lettuce and those owned by the JD Wetherspoon company. Another recent trend is the '''''gastro pub''''', a smartened-up traditional pub with a selection of high-quality food (nearly at restaurant prices).\n\nBeer and cider in pubs is served in '''pint''' and '''half-pint''' measures, or in bottles.  A pint is slightly more than half a litre (568ml to be precise).  Simply ordering a beer on tap will be interpreted as a request for a pint, e.g. 'a lager, please'.  Alternatively 'half a lager, please' will get you a half-pint. If you ask for a \"half-pint of lager\" in a noisy pub, you will almost certainly get a pint, because no-one asks for a \"half-pint\" and the bar person will have thought you said \"I'll have a pint of lager, please\".  Prices vary widely based on the city, the pub and the beer, but generally pints will be in the range £2 to £4.\n\nSpirits and shorts are normally 25 ml although some pubs use a standard 35ml measure, in all cases it will be clearly indicated on the optic, in England, Scotland and Wales. In Northern Ireland, the standard measure is a 35ml measure. A ''dram'' in Scotland was traditionally a quarter of a gill measure now 25ml.\n\nPubs often serve food during the day. Drinks are ordered and paid for at the bar.\n\nWhen applying for a licence, pubs can specify any opening times they wish; this can be challenged by neighbours, etc.  Closing times are typically the 'last order' time - the pub can sell drinks before this and customers have to drink up and leave within 20 minutes of the licensing hours.\n\nUntil the recent change in licensing laws, closing times were 11PM and 10:30PM on a Sunday, and this is still quite common.  The most common closing times at the weekends in towns are between midnight and 1AM, and some larger pubs may apply for a licence until 2AM and clubs 3AM or 4AM. It is not unheard of that some bars have licences until the early hours (6AM) although this is rare as many who are out until this time are likely to go to nightclubs and then home.  Theoretically, a pub can ask for a 24-hour licence, though few have done so.\n\n===Wine bars===\n\nIn cities, in additional to traditional pubs, there are more modern '''wine-bars''' and '''café-bars''' (often known simply as '''bars'''), though the variable weather means that there is not as much of a 'street scene' as in other European cities. However, depending on the weather, there are more and more pavement cafés in the UK than in the past. Parts of London, Manchester and other up-and-coming cities are good examples of this change of scene.\n\nPrices in bars tend to be higher than in pubs, with less focus on beer, and more on wine, spirits and cocktails. Customers are often younger than those of traditional pubs, though there is much crossover and some bars are more \"pubby\" than others.\n\n===Clubbing===\n\n'''Clubbing''' is popular in most large towns and cities, and many have world-renowned venues as well as many alternative venues. Great clubs can be found in London, Glasgow, Birmingham, Manchester, Liverpool, Sheffield,  Leeds, Edinburgh, Newcastle and Brighton to name just a few places. Prices in clubs tend to be considerably higher than those charged in pubs, and opening hours may not be the attraction they once were, as pubs can now open late too. Almost all clubs will only admit persons aged 18 and over. ID may be asked for at the door, but ID checks at bars are less common. Dress codes are sometimes applied by doormen or bouncers before entry, sometimes none-too-consistently. Common dress codes are simply to dress smartly and avoid wearing sports wear, including trainers. However \"fashion\" trainers, especially dark coloured ones are increasingly accepted when part of smart attire. That said, some upmarket clubs will still insist on shoes and if in doubt, wear shoes to avoid being turned away. It is far easier for women to get in than men, and on many occasions under-age girls will \"doll up\" to appear older.\n\nClubs are often cheaper during the week (Mon-Thu) as many of these nights are designed to cater for students; however, you usually have to pay an entrance fee. For a club in a small town (capacity 250-300) this will usually be £1-£2 on week night, £2-£3 on weekends, and seldom more than £5 on special occasions. Conventional clubs in bigger towns and alternative clubs in cities will cost anywhere between £5 and £10. Large clubs, especially those in cities, that cater for a \"dance\" crowd will almost certainly cost over £10, though seldom more than £15. For towns with a large student population, it is often much cheaper to go clubbing during week nights (Monday-Thursday), as many clubs advertise towards students on these nights, offering discounted drinks and cheaper entry.\n\n===Non alcoholic===\nThe British drink a lot of tea; usually black tea rather than green tea, normally with milk and sometimes with sugar. In cafés and restaurants, tea is usually served with milk and sugar on the side for you to add to your taste; in private houses, particularly in more domestic and less posh settings, you may be asked to specify whether you want milk and/or sugar before the tea is made. In Britain 'black tea' is likely to be understood as by analogy with black coffee as 'tea without milk' rather than 'black tea as opposed to green tea'. In the south and south-west of the country — Cornwall, Devon, Dorset, Hampshire — and sometimes beyond, there is a traditional light afternoon meal called a 'cream tea': this is not tea whitened with cream, but tea served with milk and sugar, together with scones, jam and clotted cream.\n\nAs noted below it is common to be offered a choice of tea or coffee when visiting someone's home. If you don't want either, appreciatively declining should not cause offence. Although some British companies trade on the country's international reputation for tea-drinking to sell premium tea, many British tea drinkers' relationships with tea are remarkable more for their scale of consumption than for their connoisseurship.\n\nCoffee is also drunk widely. In homes it is usually made simply, and whitened with milk rather than cream. Coffee shops serving more complex ranges of coffee alongside other soft drinks are now common in cities and towns, and very common indeed in more cosmopolitan urban areas. ''Starbucks'' is fairly ubiquitous; ''Costa Coffee'' and ''Caffe Nero'' are two notable British coffee shop chains.\n\nIn the UK, 'lemonade' is usually a carbonated, sweetened, lemon-flavoured non-alcoholic drink. 'Ginger beer' can mean either a carbonated, ginger-flavoured soft drink and therefore not really a beer at all, or a brewed alcoholic ginger-flavoured drink.\n\n==Sleep==\n\nThe UK offers a wide variety of '''hotels''' rated on a scale of stars, from 5-star luxury (and beyond!) to 1-star basic. Budget chains like Premier Inn and Travelodge have excellent sales if you book in advance; rooms are usually non refundable but can be had for as little as £29. There are also a vast number of privately run '''bed and breakfast''' establishments (abbreviated as \"B&B\"), offering rooms with usually a fried 'full English breakfast'. Alternatively you can rent a private house which is let as a holiday home; many such holiday homes advertise on a wide variety of free websites or advertise on their own websites. Good deals can usually be found by using a search engine for \"self-catering holiday accommodation\".\n\nBudget travellers can opt to stay in a '''[[Hostels|youth/backpackers' hostel]]'''\n\n*YHA England and Wales [http://www.yha.org.uk], tel +44 870 770 6113\n\n*Scottish YHA [http://www.syha.org.uk/], Email - reservations@syha.org.uk, tel +44 870 155 3255\n\n*HI Northern Ireland [http://www.hini.org.uk/], tel +44 28 9032-4733\n\n*Independent Hostels. Privately owned hostels offering a more relaxed regime than the YHA. They're listed in the Independent Hostel Guide published by the Independent Hostels UK network.\n\nAnother option is to stay at short term rental apartments. There are numerous such companies around the country. \n\nThere are also many '''camp sites''', with widely varying levels of facilities. \"Wild camping\" on private land outside recognised camp sites may be awkward outside remote areas, though one-night camping stops may be feasible if undertaken discreetly, or landowners may give permission to wild-camp for free, or for a small fee, if asked.\n\nSome travellers to the United Kingdom decide on a campervan or caravan holiday, whereby your accommodation travels with you. Most parts of the country have a good range of camping and caravan parks available.\n\nIf you are smart enough you can hire a camper, and park in remote pub parking spaces (ask first) and really enjoy the country side atmosphere and unique tiny pubs. \n\nAs a more quirky (though sometimes expensive) option, the '''Landmark Trust''' [http://www.landmarktrust.org.uk] is a charitable organisation that buys up historic buildings, follies and other unusual examples of architecture - especially those in danger of destruction - and renovates them in order to rent them out to holidaymakers. For bookings, tel +44 1628 825925, mailto:bookings@landmarktrust.org.uk\n\n==Learn==\n\nThe UK has been a centre of learning for the past 1,000 years and possesses many ancient and distinguished universities. Many former polytechnics and other colleges have been promoted to university status over the past 25 years , and there are now over 120 degree-awarding institutions in England, Scotland, Wales and Northern Ireland.  The two most famous (and oldest) universities are '''Oxford''' and '''Cambridge''' (often referred to as Oxbridge by many Britons), but '''England''' also has several other world-class institutions, including several in '''London''' (notably '''Imperial College''', the '''London School of Economics''', '''University College London''' and '''King's College London''', all are part of London University).  Outside of London in England the top universities are located in '''Durham''', '''Birmingham''', '''Manchester''', '''Liverpool''', '''Exeter''', '''Leeds''', '''Sheffield''', '''Bristol''', '''York''', '''Nottingham''', '''Kent''', '''Bath''', '''Loughborough''', '''Newcastle''', '''Southampton''' and '''Warwick'''.\n\n'''Scotland''' has its own semi-separate educational system, with universities in '''Aberdeen''' (Aberdeen and Robert Gordon), '''Dundee''' (Dundee and Abertay), '''Edinburgh''' (Edinburgh, Napier, Queen Margaret and Heriot-Watt), '''Glasgow''' (Glasgow, Strathclyde and Caledonian), '''Stirling''' and the oldest and most traditional one at '''St Andrews'''.\n\nThere are two universities in '''Northern Ireland''': the Queen's University of Belfast, and Ulster University (with campuses in Belfast, Jordanstown, Coleraine and Londonderry). Although Queen's is the older and more famous institution, both are highly respected throughout the UK as centres of excellence.\n\nTraditionally the University of '''Wales''' comprised four large universities: [[Aberystwyth]] [http://www.aber.ac.uk/], [[Bangor (Wales)|Bangor]] [http://www.bangor.ac.uk/index.php.en?width=1024&height=768], [[Cardiff]] [http://www.cardiff.ac.uk/index.html] and [[Swansea]] [http://www2.swan.ac.uk/], but since many polytechnics and institutes were upgraded to university status the number of Welsh universities has increased.\n\nForeign students make up a significant proportion of the student body at UK universities, with over 300,000 foreign students in 2004. All undergraduate applications go through a central body UCAS [http://ucas.com/], which acts as a clearing house passing applications to the universities for consideration and feeding their decisions back to applicants. Course fees for overseas students vary considerably, costing significantly more for the prestigious institutions.  For postgraduate applications, applicants will have to apply directly with the institution.\n\nIn order to study, one needs to get either a student visitor for a 6-month course or a Tier 4 visa for something longer.  In the case of the latter, you must have a confirmation of acceptance of studies from the institution, take an English Proficiency Exam (preferably the IELTS but this may be waived if you are a national of or took your previous education in '''a majority English-speaking country''') and demonstrate that you have sufficient funds available to you for the duration of your course.  Most importantly, students on a Tier 4 must be enrolled full time in an entire course of study, they cannot come just to study individual modules.     \n\nThe UK - London, Manchester and Edinburgh in particular - remains an exceedingly popular destination for those seeking to learn the English language. A huge variety of organisations and companies exist to cater for this desire, some much more reputable than others:\n\n*The '''British Council''' [http://www.britishcouncil.org/learning-learn-english.htm] offers information on courses and advice.\n\n==Work==\n\nCitizens of the European Union, Iceland, Liechtenstein, Norway and Switzerland have permanent work rights in the UK. In general, the citizens of other countries will require a visa to work in the UK. The UK has had low unemployment in recent years, making it easier for those with specialist skills to gain working visas. A general shortage of skilled labour in the health sector means the British health service actively recruits abroad, making it easier for those with specialist health care skills to work in the UK. This however may change due to the large investment the British government has made into getting more nurses and doctors trained from the United Kingdom. There continues to be a severe shortage in dentists, with many British people travelling to Hungary or Poland for dental treatment.\n\nBeware that ''all work'', paid or unpaid, requires a non-EU/EEA/Swiss citizen to hold a visa with work permit in order to take part (tourist or visitor visas do not qualify). This includes, strangely, volunteer work.\n\nCitizens of Australia, Canada, Hong Kong (British National (Overseas) passport holders only), Japan, Monaco, New Zealand, South Korea and Taiwan (as well as British overseas citizens and British overseas territories citizens) can apply for a Tier 5 visa under the Youth Mobility Scheme, which lasts 2 years and permits the holder to work.\n\nYoung people of other nationalities may be able to work on internships in the UK by applying for a Tier 5 visa under the Government-sponsored exchange category. Organisations such as IEPUK [http://www.iepuk.com/] can help to sponsor and assist a young people from aboard to applying for such a visa.\n\nMost holders of a Tier 4 student visa are permitted to work for up to 20 hours a week during term-time and an unlimited number of hours outside term-time [http://www.ukba.homeoffice.gov.uk/visas-immigration/studying/adult-students/conditions/].  Unused hours from a previous week however, '''cannot''' be carried over to or advanced from another week (e.g. you cannot work 10 hours during the first week and then work 30 hours during a different week or vice versa).  \n\nIf you work in breach of your visa conditions, not only will your status be in jeopardy (you may face deportation, denial of entry next time, etc.) but your employer will also face a hefty fine.  \n\nThe credit crunch, however, has caused many businesses to lose profit and go broke. Unemployment in 2008 reached its highest since the economic downturn of the early 1990s.\n \nFor more details on immigration rules relating to working in the UK, visit the [https://www.gov.uk/government/organisations/uk-visas-and-immigration '''UKVI''' website].\n\n===Volunteer===\n*'''WWOOF''' [http://www.wwoof.org/wwoof_uk/] arranges for volunteers to work for free on organic farms throughout the UK in exchange for room and board. This system provides an excellent means to experience life in the country-side, make friends and, at the same time, learn a little about organic farming.\n\n==Stay safe==\nIn any '''emergency''' call '''999''' or '''112''' (free of charge from any phone, including mobiles) and ask for Ambulance, Fire and Rescue Service, Police, Coast Guard or Mountain And Cave Rescue when connected. The United Kingdom has this one, unified number for all the different emergency services.\n\nBritish cities and towns can be dangerous in some parts at night as you can find rowdy groups of drunk people on the street, usually in nightlife and clubbing areas. Drinking alcohol in public (except outside a bar or pub) is not permitted in some towns and areas of cities. Crime rates in areas such as homicide are broadly in line with the European average (though there can be significant variations between different parts of the UK) and crime in general has been falling in recent years.\n\nThe police have fairly wide ranging powers to fine or arrest people who are causing a disturbance, and although they can be heavier-handed in major cities they are generally tolerant. If you are stopped by the police, avoid arguing and be sure to appear respectful. Do not try to reason with them, and above all, do not swear, because although it has been ruled that swearing is not a crime, police will often arrest people who swear at them.\n\nBe wary of wearing football shirts or otherwise showing support for a football team – particularly on match days. Hooliganism has almost entirely vanished but some footballing rivalries are still taken very seriously - arguably the most infamous and internationally known one being Glasgow's \"Old Firm\" (Rangers vs Celtic), which often descends into violence. Generally it shouldn't be a problem but use common sense: for example do not wear a Liverpool shirt in Manchester – doing so will definitely draw you some very dirty looks at the very least!  For this reason you will find that many bars and restaurants in major towns and cities universally ban the wearing of football shirts - regardless of team.\n\nJay walking is not illegal except on motorways, but always try and cross at designated pedestrian crossings. Most operate a \"Push the button and wait for the green man\" system, but [http://www.gov.uk/using-the-road-159-to-203/pedestrian-crossings-191-to-199 zebra crossings] are also widespread, particularly outside of city centres – identified by white stripes on the road and yellow flashing spherical lights – pedestrians have right of way but it is advisable to make eye contact with the driver before stepping into the road. Unlike in many other countries British drivers tend to be very respectful of the laws around zebra crossings.\n\nIf you are bringing or hiring a car, be sure to lock the doors if you leave your car, and always park in a busy, well-lit area. Don't leave valuables on display in a parked car – satellite navigation systems are a particular target.\n\nThe age of both heterosexual and homosexual consent is 16 throughout the United Kingdom. British law (and the majority of the public) support LGBT rights. Anti-gay attacks do occur so be cautious. There are some areas where you may want to not be overtly showing your sexuality (very remote villages, 'tough' places such as football matches, Truro and the Cornwall area, Devon, Peterborough, Wales, bad areas of cities). Keep your sexuality private. \n\nRacism is not common in the UK, and racially motivated violence is rare. Most Britons are strongly opposed to racism. The main concern for Britons isn't racism; the government strongly encourages the notion of a multi-cultural society, but recent high levels of immigration have been of debate, and concerns over immigration partially led to the \"Leave\" side of Brexit to win in 2016. However, the UK is generally regarded by its own immigrant population as being among the most liberal and tolerant of European countries in this respect, but obviously there will be some people who are exceptions. Most Britons will go out of their way to make tourists and immigrants feel welcome and it's not uncommon for police to impose harsh punishments on any form racial abuse – physical or verbal. \n\nAll in all though, the UK is generally a much safer country to visit than most of [[Africa]] and the [[America]]s, and the vast majority of tourists will run into no problems.\n\n===Police===\nOn the whole, British police officers tend to be professional and polite, and are generally less aggressive than law enforcement agencies in other developed nations (however, this does not mean they are lenient). The vast majority of British police officers '''do not carry firearms''' on standard patrol, and the only time one would usually see a \"Bobby\" with a weapon is at ports or when there is a suspicion they will meet armed offenders. The exception to this is Northern Ireland, where all police are armed. Most officers will only speak English and you will be made to speak to an interpreter over police radio or will do so at a police station if you cannot communicate in English. You have the legal right to remain silent during and after arrest – but police in England and Wales will warn you that \"''You do not have to say anything, but it may harm your defence if you do not mention when questioned something which you later rely on in court. Anything you do or say may be given in evidence''\".\n\n===Illegal drugs===\nAll illegal drugs in the United Kingdom are classified as 'A', 'B' or 'C'. Class A drugs are typically regarded as the most dangerous (not always the case) and attract severe prison sentences for supplying. \n\nClass C are generally regarded as the least harmful (again not always the case) and thus attract lesser penalties.  Remember: '''all of these drugs are illegal''' and you will be arrested for possession regardless of the class; the classes are used to determine policing priorities and penalties.\n\nClass A drugs include ecstasy (MDMA), LSD, heroin and cocaine; penalties will mean arrest and possibly jail even for possession. Magic mushrooms were previously legal because of technicalities in the law, but are now class A.\n\nCannabis is now a 'Class B' drug. A first offence for possession will usually result in a formal warning, or an on-the-spot fine.  This does not apply to other Class B drugs, such as speed.  Subsequent offences may result in arrest.\n\nExamples of Class C include ketamine, some steroids, some prescription drugs such as Valium (legal if they are prescribed for you), GHB, and some tranquillisers.\n\nPrescribed drugs may sometimes require a letter from a doctor to be imported.  This applies where the drug is a Controlled Drug (A,B or C) in the UK.\n\nDrug use is a growing concern for authorities, with some of the highest levels in Europe. Cannabis and ecstasy are both very widely available and you could even be offered it in locations such as certain markets and clubs.\n\n===Prostitution===\nAlthough the act of prostitution is not in itself illegal in Great Britain, many laws criminalise activities associated with it. \n\nBrothels of any kind are illegal under the 1956 Sexual Offences Act, and it's against the law to loiter or solicit sex on the street. 'Kerb-crawling' (driving close to a pavement in order to ask prostitutes for sex) is also banned, and is actively monitored for by police patrols in many towns and cities across the country. \n\nIt should be noted that although exchanging money for sex is not in itself prohibited, many legal grey-areas do exist in this department, and the attitude towards the trade is generally not as liberal as in many other European countries. You should also keep in mind that anyone who does offer sex for money will not be regulated so you act on your own risk of getting transmitted infections and diseases.\nunder The [http://www.legislation.gov.uk/nia/2015/2/enacted '''Human Trafficking and Exploitation (Criminal Justice and Support for Victims) Act (Northern Ireland) 2015'''] Paying for Sex became a Offense in Northern Ireland from the 1st of June 2015\n\n==Stay healthy==\nThe local emergency telephone number is 999; however, the EU-wide 112 can also be used. For advice on non-emergency medical problems, you can ring the 24-hour [http://www.nhs.uk/NHSEngland/AboutNHSservices/Emergencyandurgentcareservices/Pages/NHS-111.aspx NHS 111] service on 111.\n\nEmergencies can be dealt with under the NHS (National Health Service) at any hospital with a '''Casualty''' or '''A & E''' (Accident & Emergency) department. At A&E be prepared to wait for up to 4 hours to be seen to if the medical complaint is not serious, depending on the time of day/night. The longest waiting times usually occur on Friday and Saturday nights. Emergencies will be dealt with immediately and before any question of remuneration is even contemplated. Walk-in centres also provide treatment for less urgent conditions on a first come first served basis. They are open to residents and foreign nationals.\n\nAll treatment at an NHS hospital or doctor is free to residents of the UK. All emergency treatment is free, regardless of citizenship or immigration status. As a result, an EHIC card is, in fact, not necessary (although advised for EU travel in general), as the UK is possibly one of the only countries to provide free emergency treatment without question or identity verification. This also applies to tourists, both from the EU and outside. \n\nFor advice on minor ailments and medicines, you can ask a pharmacist (there are many high-street chemists, and to practise legally all pharmacists must be registered with the General Pharmaceutical Council (GPhC) which involves a university degree and other exams and training). Notable pharmacy chains include Boots and Lloyds, and many supermarkets also have pharmacists. It is worth noting that the medicine trade is strictly controlled and many medicines available to purchase from a pharmacy in other countries, e.g.: antibiotics can only be provided on production of a prescription written by an authorised medical professional.\n\nSexually Transmitted Diseases (STD) are spreading between young people, so make sure you practise safe sex. There are around 50,000 [[HIV]] victims living in the UK.  Chlamydia is common enough to warrant public health screening of young people.  Condoms are available in toilets, pharmacies, and supermarkets.  They are also available free from some NHS sexual health clinics (known as GUM clinics), which also provide free STI testing and treatment, even if you are not eligible for other NHS services.\n\nTap water is safe to drink everywhere, unless otherwise stated.\n\n==Cope==\nThe [[electrical systems|electricity supply]] runs at '''230V, 50Hz AC'''. Visitors from countries such as the US and Canada, where the voltage supply runs at 120V 60Hz, may need a voltage converter (which can be picked up in most specialist electronic shops). Many appliances needed whilst travelling (such as laptop chargers, shavers and the like) are designed to run off both voltages, however check on the label before setting off. Anguilla's electricity is 110V, 60Hz, the Cayman Islands electricity is 120V, 60Hz, and Gibraltar and the Isle of Man's electricity is 240V, 50Hz. \n\nBritish plugs are Type G, with three flat, rectangular pins which form a triangle. These sockets are the same used in Ireland, Cyprus, Malta and several other former British colonies. Both Anguilla and the Cayman Islands use the U.S. plug. Gibraltar, Isle of Man, and the Channel Islands uses the Europlug, along with the Type G plug.\n\n===Public Holidays===\n\nNote that during the '''Christmas''' and '''New Year''' holiday period much of the country shuts down. During the week leading up to Christmas people will travel to their hometowns to visit their family, meaning that the motorway traffic can be very heavy and trains are much more crowded. Also, many people rush to shopping areas to stock up on food and drink and last-minute gifts. On Christmas Day, Boxing Day (Dec 26th) and New Year's Day most businesses will close (including supermarkets and most restaurants and bars) although major hotels remain open. If you need to purchase food, drink or cigarettes on these days then most petrol (gas) station convenience stores will still be open but almost everything else is closed, and on Christmas Day itself even many of these are closed. Many large shops are open (and extremely busy) on Boxing Day. If you don't have a car then avoid travelling on these days as the only available transport in many areas is taxis, which will charge up to three times the regular price. If you have a car then it is much better as roads are almost empty on Christmas Day and parking is often free - however many petrol stations are closed on Christmas Day (except those at Motorway Service Stations, which must be open by law) so plan your journey carefully if you will need to refuel. In many areas, bus and train services finish much earlier than usual on Christmas Eve and New Years Eve, and do not run on Christmas Day or Boxing Day. Buses also tend not to run on New Years Day, outside of major cities. During the week between Christmas and New Year, many transport services operate revised schedules and it is advisable to check with operators.\n\n===Newspapers===\n\nSome of the most important British newspapers are as follows:\n\n*[http://www.thesun.co.uk '''The Sun'''] - the nation's biggest selling newspaper (with a daily circulation of over 2 million), and the most ubiquitous of the British red-tops.  The Sun is infamous for its sensationalized stories, and frequently courts controversy - legal action between The Sun, celebrities and politicians is almost a blood sport in Britain.  Its sister Sunday title '''The News Of The World''' was killed off in 2011 after one scandal too many and replaced by '''The Sun On Sunday'''.  The Sun's political stance generally floats between centre-left or centre-right depending on the political mood of the moment, the paper famously backed Margaret Thatcher at the height of her popularity in the 1980s, then switched to supporting Tony Blair's administrations in the late 1990s and early 2000s.\n\n*[http://www.themirror.co.uk '''Daily Mirror'''] - similar to The Sun in both style and content, if slightly less sensational.  Is known for known synthesizing news down to easy-to-read-and-comprehend stories.  The '''Daily Record''' is the Mirror's Scottish sister paper. Unlike The Sun however, the Daily Mirror takes a definite left-wing stance, and strongly supports the Labour Party.\n\n*[http://www.dailymail.co.uk '''Daily Mail'''] - A staunchly right wing tabloid, notable for its strong support of the Conservative Party, its promotion of what it perceives to be \"British\" values, and frequently courts populist opinion.\n\n*[http://www.express.co.uk '''Daily Express'''] - A tabloid which has a major agenda of withdrawing the United Kingdom from the European Union. There is also a Sunday edition called '''The Sunday Express'''.  Like the ''Daily Mail'', the ''Express'' goes after a traditional right-wing conservative readership, but does not vocally support the Conservative Party to the same degree, but in recent years has backed the UK Independence Party (UKIP).\n\n*[http://www.dailystar.co.uk '''Daily Star'''] - A red top tabloid from the same stable as the ''Daily Express''.  It is often more  sensationalist than even ''The Sun'', but is largely politically neutral and instead concentrates mainly on celebrity gossip and sport.\n\n*[http://www.theguardian.com '''The Guardian'''] - One of the \"quality broadsheets\", along with its sister Sunday edition known as '''The Observer'''. The ''Guardian'' takes a liberal, and generally centre-left political view, and prides itself on factual and investigative journalism and opinion.  It backs no political party, although is generally sympathetic towards the Labour and Liberal Democrat parties.\n\n*[http://www.thetimes.co.uk '''The Times'''] - one of the oldest and traditional broadsheet newspapers, it takes a moderate right-wing stance, although stops short at vocally supporting the Conservative Party.\n\n*[http://www.telegraph.co.uk '''Daily Telegraph'''] - Similar to The Times, it is a right wing broadsheet which is affectionately known as the \"Daily Torygraph\" owing to its support of the Conservative Party\n\n*[http://www.ft.com '''Financial Times'''] - one of the best known British newspapers internationally, it is aimed primarily at a business readership, competing with The Wall Street Journal, and of course sponsors the London Stock Exchange (FTSE). Officially it is politically neutral, although by its very nature does tend to lean right.\n\n==Respect==\nIn general, the British are polite, reserved, and welcoming. Even though the country has built up a solid reputation due to its etiquette, most ordinary visitors will be forgiven for getting things wrong, since British etiquette is so precise. \n\nThe British have a somewhat undeserved reputation for being \"cold\" and/or \"indifferent\", but in actuality, this is far from the truth. They are in fact generally very helpful and friendly, especially to foreign visitors. \n\n=== Social Etiquette ===\n\n* '''The British in general are both indirect and direct'''. The British try to take careful measures to remain polite throughout discussion, but in close personal relationships, communication becomes more direct and open. As a country priding itself on etiquette and professionalism, the British will make no hesitation in confronting someone for behaving inappropriately. This can come across as assertive to many. \n\n* '''Always respect authority figures, including others older than you'''. If anyone in a position of authority requests you to do something, you are expected to comply. Do not object or lose your temper, even if someone is visibly being unprofessional when you are being confronted. Using abusive, confrontational language would adversely offend them and make them more distant from you. Listen to what they have to say, and move on.\n\n* '''Although the UK is famous for its pubs, being aggressively drunk in public is not acceptable'''. In some areas, the police have the power to request that you not drink in public. It is a crime to ignore such a request. Generally, though, drinking sensibly in public is both legally and socially permitted.\n\n* '''Greetings are dependent upon the situation'''. In anything but a business situation, a verbal greeting (such as 'Hello, 'Hi,' 'Hiya,' or 'Hey' 'You all right?' or 'All right?') Etiquette for a hug is somewhat complicated, so the best advice is to accept a hug (regardless of the gender offering it) if it is offered, otherwise a handshake is appropriate. Kisses on both cheeks are not common but that could happen, so be prepared, especially when dining.\n\n* '''The British often use \"Alright?\" or \"You all right?\" as a greeting'''. The usual answer is simply responding with the same \"Alright?\".\n\n* '''It is very common to use \"Sir\" for a man and \"Madam/Miss\" for a woman, when communicating with a stranger.''' Use of the terms 'Sir/Madam/Miss' is seen as very polite. \n\n* '''In informal situations, people usually address each other with \"mate\"'''. It's impolite to use the term with someone you haven't met or seen. \n\n* '''Do not imitate a British accent or any other regional accent'''. It is considered very rude manners. \n\n* '''Don't be afraid to ask about someone's accent'''. The UK is a diverse country, and asking about someone's accent is often a good way to start a conversation. \n\n* '''Playful banter is a cornerstone of British culture'''. Groups of friends may openly make fun of each other in a non-aggressive comical manner. People may make humourous and witty comments regarding such things as football teams, appearance, eating and drinking habits, spending habits, general behaviour, and so on. Even people you meet for the first time, especially in pubs, people may make mocking comments in a light-hearted, playful manner. Don't be offended by this as the British don't intend to insult or pull you down in any way. If the moment sees fit, reply back with a joke or otherwise, a friendly chuckle and smile is usually enough to go along with it.\n\n* '''Never ask about someone's age'''. It is considered rude manners. \n\n* '''Privacy is a cornerstone of British culture'''. Asking about someone's salary, personal life and so forth is considered rude manners unless you are well acquainted with them. However, it is common to be asked about where you come from and your vocation. It's relatively common for the average British person to know what their neighbours do for work. Don't hesitate to also ask the same, but let the person ask you first before proceeding. \n\n* '''The British are notorious for their overuse of apologising'''. Although many visitors regard this particular quality as annoying, it's infact a cornerstone of British culture.  You should do the same even for the little things, and '''even when the other person is in the wrong'''. This is a very British quality, and despite the lack of sincerity in the apology, not saying 'sorry' is seen as rude, and can even lead to a minor confrontation.\n\n* '''Punctuality is highly valued'''. As in many places around Europe, it's considered rude to be late to a meeting or an appointment, and as such it's advisable to arrive 5-10 minutes early to something so as to not stand out like a sore thumb.\n\n* '''Never be loud in a public place or use excessive hand gestures'''. They are considered rude manners and many would be lead to believe that you're deliberately being confrontational.   \n\n* '''Never cut a queue'''. It is considered rude manners, and you'll find that in most situations, people will angrily confront you for doing so.  \n\n* '''Women are treated with a degree of chivalry'''. Female travellers should not act indignant or surprised if their male British friends open every door in front of them, offer their jacket to them, offer their seat to them, or help them out with anything that they need. Male travellers should also note that this all will be expected by British women too.\n\n=== Dining and Home Etiquette ===\nThere are hundreds of traditional rules which have developed over time, but outside of the upper class, most people don't follow them. However, there are a couple of rules which are worth bearing in mind. \n\n* '''Put your knife and fork aligned together on the plate after eating'''. It's seen as basic politeness.\n\n* '''Do not start eating when others have not yet started'''. It's considered rude manners.  \n\n* '''Avoid using technology such as TV, mobile phones or laptops'''. It's seen as disrespectful to the other person.\n\n* '''Do not discuss business, politics or personal affairs on the dining table'''. It's seen as disrespectful unless you've been asked to discuss it. \n\n* '''Never ask your hosts to give you a tour of their home'''. It's considered rude manners, even if it is not in your intention to be rude.\n\n=== Things to avoid ===\n\n==== Sports: ====\n* '''Avoid criticising any sports teams or wearing rival jerseys'''. Sports of all kinds are taken very seriously in the United Kingdom, and you will find that many, including the younger generation, are ardently and fiercely supportive of all kinds of sports, including soccer, cricket, and rugby. It is wise to refrain from criticising any sports teams and wearing rival jerseys as it could lead to some confrontations depending on where you go. Wearing a rival football team jersey in a pub for instance, could lead to violence. If you do choose to wear a sports jersey, it's best to wear one of the national team of any sport. \n\n==== Politics: ====\n* '''Avoid criticising the British Royal Family'''. Although it is legal to criticise them, many British people are still very fond of the Royal Family and criticising or ridiculing them will offend some people. As a general rule of thumb, it's advisable to only praise the British Royal Family and not say anything negative about them. Although there are Facebook groups for people who dislike them allowing them to share their frustrations, being such how much they cost taxpayers for example, it is still a safe bet to refrain from criticism.\n\n* '''Avoid discussing Brexit'''. It's best to avoid the subject as British society takes a very emotional stance on it. Many will be happy to discuss which way they voted but discussions may become heated if prompted to justify their reasoning behind their vote.\n\n* '''Steer clear of discussing internal politics'''. Unless you follow British politics ardently, it's wise to steer clear from discussing anything political as you will immediately be seen as uninformed. Although many British people are fiercely and ardently political and will usually be tolerant of different opinions, know the position that being a foreigner puts you in.\n\n==== Sensitive Issues: ====\n* '''Avoid criticising British history'''. The UK has had a colourful past and, while the British are rightly proud of many parts of their history, other aspects are regarded with dismay. Try not to criticise the bad things that Britain has done in the past, as this could cause offence. Feel free to discuss history, but avoid directly criticising it. \n\n* '''Avoid discussing [[Cornwall|Cornish]] identity'''.  The issue of identity and nationality in Cornwall is very sensitive among some people, and it is best to refer to anyone you meet in Cornwall as Cornish, unless they have already explicitly stated their identity as English.\n\n* '''Steer clear of discussing \"The Troubles\" and nationality in [[Northern Ireland]]'''. Although the worst of the conflict has gone away, tensions still remain very high between those that favour unity with Ireland and those that favour unity with the UK. If absolutely necessary, always ask someone if they view themselves as British, Irish, Northern Irish, and so on. As a general rule of thumb, avoid the topic of nationality altogether, and most certainly do not discuss the conflict as [[Northern Ireland]] takes a highly emotional stance on these set of issues. \n\n* '''Steer clear of discussing [[Scotland|Scottish]] independence'''. Independence sentiments in [[Scotland]] run very high, and many Scots will be very offended if you question Scotland's ability to function as an independent country. It's best to avoid discussing this topic, if at all, as Scottish society has a very emotional stance on this issue. \n\n* '''Steer clear of discussing [[Wales|Welsh]] independence'''. Although there isn't a strong independence movement in Wales, some Welsh people support the idea of Wales becoming an independent country and will be very offended if you question Wales' ability to function as an independent country. It's best to avoid discussing this, if at all.\n\n* '''Do not call the [[Falkland Islands|Falkland Islands]] the Malvinas'''. The vast majority of Brits support the islands as being part of a British Overseas Territory, even more ever since the 1982 Falklands War. Calling the islands the Malvinas is considered very taboo and disrespectful and will spark fierce and very heated debate.\n\n==Contact==\n\n===Telephone===\nIn case of '''emergency''', call '''999''' or 112 from any phone. Such calls are free and will be answered by an emergency services operator who will ask you for your location, and the service(s) you need ('''police''', '''fire''', '''ambulance''', '''coastguard''', '''mountain rescue''' or '''cave rescue'''). You can call this number from any mobile telephone as well, even if you do not have roaming or even any SIM card inserted. It is a '''very''' serious offence to call this number without due cause.\n\nNon-urgent calls to the police should be made on '''101''' if you are in England or Wales and are charged at 15 pence per call. If you need non-urgent medical help call '''111''' (This number is gradually replacing 0845 46 47).\n\nWhen calling the UK from overseas, dial your international access code (00 from most of Europe, 011 from the US and Canada or '+' from any mobile phone) followed by the UK's country code ('''44''') and then the UK area code and subscriber number. If the number you are calling is shown with a leading 0 at the beginning of the area code, the 0 must be omitted when calling from abroad.\n\nTo phone another country from the UK, dial 00 followed by the overseas country code, area code and subscriber number.\n\nWhen calling a UK landline number from any other UK number, dial the area code (beginning with the leading 0) and the subscriber number. If calling from a landline to another landline within the same area code the area code can usually be omitted.\n\nFor calls to UK mobile telephones from anywhere within the UK all of the digits have to be dialled by all callers.  The same is true when you are doing the opposite.  \n\nWhen the building you're in has its own internal phone system, the number for an outside line is usually \"9\" (not \"0\", as in many other countries, which in the UK usually connects you to the operator or reception desk).  \n\nPayphones are widely available, especially in stations, airports, etc. Payphones usually take cash (BT: minimum 60p, which buys 30 minutes to a UK landline number; although some private payphones may charge more); change is not given, but you can choose to use the excess on the next call or unused coins may be returned. Some newer payphones accept credit and debit cards and may even allow you to send emails and surf the web. Phonecards have been phased out, though various pre-paid phonecards can be purchased from newsagents for cheap international calls. Some BT payphones now accept Euros.  \n\nA simpler and often cheaper alternative for international calls is to use a direct-dial service, these offer vastly reduced call rates over the standard providers and don't require you to purchase a card or sign up for an account. You simply dial an access number which is usually a more expensive revenue-share (084x or 087x) or premium rate (09xx) number.\n\nWhether you are calling someone who is inside or outside the UK, it may be important to find out if the phone number being called corresponds to a landline or mobile phone as most operators have different rates for each.  \n\n==== Mobile Networks and Phones ====\nMobile phones are heavily used. The main networks are:\n* [http://www.o2.co.uk/ O2]\n* [http://www.three.co.uk/ 3] \n* [http://ee.co.uk/ EE] which has amalgamated the previous T-Mobile [http://www.t-mobile.co.uk/] and Orange [http://www.orange.co.uk/] networks\n* [http://www.vodafone.co.uk/ Vodafone]\n\nThere are also a range of smaller operators who piggyback their network off the four main networks above (e.g. Tesco Mobile, Giffgaff, Sainsbury, TalkTalk, Natterbox, Vectone, etc).\n\nAll have 3G and 4G services as well as GPRS (excluding 3). GPRS and 3G data services are available, usually priced per megabyte. GPRS (Voice, Text, Basic Internet) coverage is sparse in mountainous areas but reaches 99% of homes, 3G signal (MMS, Video, Internet etc) has similar huge gaps outside of urban areas (dependent on network) and may also be difficult to get indoors. T-Mobile and Orange are both now run by Everything Everywhere [http://everythingeverywhere.com/] and share each others signal.  A 4G service has just started in a small number of the largest cities.  OpenSignal provide independent [http://opensignal.com/coverage-maps/UK/ United Kingdom coverage maps] comparing network quality and data speeds.\n\nThere is no charge for calls that you receive on your handset except for those roaming; charges are only for calls that you initiate.\n\nPay as you go (prepaid) plans are available. Credit the phone with a top-up card or cash payment via a top-up terminal in a shop or at an ATM; there is no formal, paper term contract. Some operators also offer packages which mix texts, phone calls and/or data at affordable rates and some offer unlimited data (e.g. 3). These packages can come with your initial top-up or be deducted from your balance.  These are usually more ideal if you intend to stay in the UK for a short period of time; getting pay monthly plans will save you more if you will reside in the UK for a longer time.\n\nIf you have an unlocked GSM-compatible handset (most dual- and tri-band phones are GSM-compatible) you can purchase a SIM card from electrical or phone outlets, in supermarkets, or online (i.e. although giffgaff themselves only send sims to UK addresses. Be aware prices do vary considerably – from £5 (with £10 call credit) from Tesco on-line (available in Tesco supermarkets) to £30 (with £2.50 credit) from Vodafone (available at all mobile phone shops). Often bargain handset-and-SIM deals can be found, if you don't have an unlocked handset - at the time of writing you can get a very basic mobile with SIM for £18 from Tesco, though this will be a locked phone and won't work with other SIM cards.\n\nCosts for calls can vary significantly depending on when you call, where from and where to. Calls from hotel rooms can be spectacularly expensive because of hotel surcharges; check before you use and consider using the lobby payphones instead. Calls from payphones and wired, or landline, phones to mobile phones are expensive too; if you have the choice call the other party's landline. Beware of premium rate calls (070, 084n, 087n and 09nn), which can be very expensive, especially from mobiles. Text messaging from mobiles costs around 10 pence per message and picture or MMS messages cost around 45 pence (20 pence on some networks).\n\nIf you expect to frequently call abroad from your mobile phone, consider getting a sim from a virtual carrier.  Carriers such as Vectone One, Lebara and Lycamobile offer deeply discounted rates to call or text phone numbers in other countries.  \n\nCalls between landlines are charged at national or geographic rate by most providers.  Many mobile and landline packages provide inclusive minutes to call 01, 02 and 03 numbers either off-peak or at any time. Calls to the crown dependencies of Jersey, Guernsey, Sark and the Isle of Man may be charged at a higher rate.\n\nIf the originating and destination area codes are the same then the area code can be omitted when calling from a landline. Note that local calls are charged at the same rate as other geographic phone calls, and are not automatically free unless the user has an appropriate contract with the phone provider.  Non-geographic 08xx numbers used to be cheaper than their geographic counterparts, but this has effectively changed as an increasing number of calls are made using mobile phones, where such non-geographic numbers are charged higher and are rarely included in mobile phone plans.  The following table relates the first few digits dialled to call types, so you can avoid some of the pitfalls above:\n\n<table cellpadding=\"2\" cellspacing=\"0\" style=\"border: 1px solid #9866FF; background-color:  #f3f3ff\">\n <tr>\n  <td style=\"border-bottom: 1px solid #9866FF; border-right: 1px solid #9866FF; background-color: #ddddff; width:30%;\">Digits dialled</td>\n  <td style=\"border-bottom: 1px solid #9866FF; background-color: #ddddff; width:70%;\">Call Type</td>\n </tr>\n <tr>\n  <td>00</td>\n  <td>International call (to outside the UK)</td></tr>\n <tr>\n  <td>01</td>\n  <td>Call to a landline at geographic rate.</td>\n </tr>\n <tr>\n  <td>02n</td>\n  <td>Call to a landline at geographic rate.</td>\n </tr>\n<tr>\n  <td>03nn</td>\n  <td>A non-geographic number charged at the same rate as 01 or 02.</td>\n </tr>\n<tr>\n  <td>0500</td>\n  <td>Free call from landlines, mobiles and public payphones.</td>\n </tr>\n <tr>\n  <td>070</td>\n  <td>Call to a personal number. These are very expensive.</td>\n </tr>\n <tr>\n  <td>073nn to 075nn</td>\n  <td>Call to a mobile telephone.</td>\n </tr>\n <tr>\n  <td>076</td>\n  <td>Call to a pager. These are usually expensive.</td>\n </tr>\n <tr>\n  <td>077nn to 079nn</td>\n  <td>Call to a mobile telephone.</td>\n </tr>\n <tr>\n  <td>0800, 0808</td>\n  <td>Free call from landlines, mobiles and public payphones.</td>\n </tr>\n <tr>\n  <td>0844, 0843, 0842</td>\n  <td>Variable rate from 1p to 10p/min from landlines, plus your phone providers' access charge [https://planet-numbers.co.uk/news/phone-operators-access-charges-from-1st-july-2015/]</td>\n </tr>\n <tr>\n  <td>0845</td>\n  <td>From 1p to 7p/min from landlines and mobiles, plus your phone providers' access charge [https://planet-numbers.co.uk/news/phone-operators-access-charges-from-1st-july-2015/].</td>\n </tr>\n <tr>\n  <td>0870</td>\n  <td>From 6p to 13p/min from landlines and mobiles, plus your phone providers' access charge [https://planet-numbers.co.uk/news/phone-operators-access-charges-from-1st-july-2015/]</td>\n </tr>\n <tr>\n  <td>0871, 0872, 0873</td>\n  <td>Variable rate from 10p to 13p/min from landlines and mobiles, plus your phone providers' access charge [https://planet-numbers.co.uk/news/phone-operators-access-charges-from-1st-july-2015/]</td>\n </tr>\n <tr>\n  <td>09nn</td>\n  <td>Calls at a premium rate – anything from 13p up to £1.50/minute. plus your phone providers' access charge [https://planet-numbers.co.uk/news/phone-operators-access-charges-from-1st-july-2015/]</td>\n </tr>\n</table>\nWhere a call is chargeable, calling from a mobile telephone will usually cost more than calling the same number from a landline.\n\n===Internet===\nInternet cafés can be found in cities and towns; check the city pages for details. All UK public libraries provide access, often branded as \"People's Network\", usually at no or little charge, though time is rationed. Some hotels/hostels also offer internet access either via their cable TV system or WiFi, although the prices are quite steep (www.spectrumineractive.co.uk provide the Scottish YHA with a network of broadband and WiFi-capable Internet terminals).\n\nA number of ISPs charge nothing for Internet access by telephone modem - they get their payment from the phone company; local call costs are time-related. Examples are [http://www.Gonuts4Free.com/ GoNuts4Free], [http://www.DialUKT.com/ DialUKT].\n\nThere are some Wi-Fi hotspots, although intentionally publicly available wireless is not yet widespread outside central London. Most McDonald's restaurants in the UK now offer free Wi-Fi.  Many coffee shops offer paid Wi-Fi.  The most you should pay for Wi-Fi access across the UK is £1 for half an hour.  Many chain cafés will charge more for no extra value.\n\nYou can also rent a mobile Wi-Fi hotspot (4G/LTE) for short term period at a reasonable price. Some companies such as My Webspot provide unlimited internet for the duration you need in the United Kingdom (from 5€ per day). It is delivered to your hotel or at the airport. A good solution to stay connected, and place international calls with your favorite Apps\n\nMost major UK population centres are covered by UMTS/HSDPA 3G coverage, giving download speeds up to 7.2Mbps, and GPRS coverage is extensive.  However, in relatively rural parts of the country as well as in indoor locations, mobile broadband may become more limited.  3G data services should roam seamlessly onto the UK networks, or you can purchase a pay-as-you-go SIM card for which credit can be purchased in the same way as for mobile phones. For example T-Mobile stores will give you a free SIM-card on which you can load any amount you want. Access cost £2 per day, £7 per week.\n\n===Post===\nThe Royal Mail has a long history. Postboxes are still the traditional red colour (although there are green and gold Victorian \"Penfold\" boxes retained in some areas and a historically important blue box in [[Windsor and Eton|Windsor]]). To commemorate British gold medal winners at the 2012 Summer Olympics and Paralympics, some post boxes, usually located in the home towns of the gold medallists, were re-painted gold. Mail can also be posted at post offices.\n\nThe Royal Mail has introduced a new system where post within the UK is priced on size '''and''' weight. You can find size charts at all post offices but bear this in mind when sending a larger envelope, parcel or packet. Postage stamps cost 64p/55p (domestic 1st/2nd class for envelopes up to C5 size which are less than 5mm thick and less than 100g), £1.05 (Europe up to 20g), £1.05p (Worldwide up to 10g). Stamps can be bought at supermarkets, newsagents and tourist shops. Domestic first-class mail can usually be expected to arrive the following day; second-class mail may take several days. Signage on all postboxes displays the final collection time at that location (typically about 17:30 on weekdays and noon on Saturdays), as well as details of later weeknight collections that are available in many areas from a central postbox or sorting office. Deliveries are likewise made six mornings per week, Monday to Saturday. There is generally no post on Sundays or Public Holidays.\n\nIf you wish to send something heavy, or want to send a larger letter or packet within the UK, then you will have to get it weighed and/or measured at the post office.  The staff at post offices are very helpful, but avoid the lunchtime rush at around 12:00-13:30 when there is often a long queue and 30+ minute waiting times.\n\nNote that some shops and tourist attractions sell \"international\" stamps that are not issued by Royal Mail (and don't have the Queen's head on). They may cost the same as Royal Mail stamps, and you can post the letters in Royal Mail postboxes, but your letters will be routed via a different mail carrier to their destination. There are reports of such mail taking months to arrive and being damaged or defaced by the mail carrier. \n\nOne interesting side-pursuit is to look at when the postboxes were built since some can be very old. The 'R' stands for Rex/Regina and the first letter the initial of the reigning monarch when it was built. E.g. A postbox built after 1952 would have the initals 'E II R'. Finding a box with the initials 'VR' (Queen Victoria, pre-1901) is possible.\n\n{{countryguide}}\n\n{{usablecountry}}\n\n{{isPartOf|Britain and Ireland}}\n\n[[ar:المملكة المتحدة]]\n[[ca:Regne Unit]]\n[[de:Vereinigtes Königreich]]\n[[eo:Britio]]\n[[es:Reino Unido]]\n[[fi:Iso-Britannia]]\n[[fr:Royaume-Uni]]\n[[hu:Egyesült Királyság]]\n[[it:Regno Unito]]\n[[ja:イギリス]]\n[[nl:Verenigd Koninkrijk]]\n[[pl:Wielka Brytania]]\n[[pt:Reino Unido]]\n[[ro:Regatul Unit]]\n[[ru:Великобритания]]\n[[sv:Storbritannien]]\n[[zh:英國]]\n\n[[wts:Category:United Kingdom]]\n\n[[WikiPedia:United Kingdom]]"
        }
    }
}