{
    "parse": {
        "title": "Venezuela",
        "pageid": 876,
        "wikitext": {
            "*": "{{pagebanner|Venezuela banner.jpg}}\n{{Warningbox|Venezuela is currently in a state of widespread civil, economic, and political crisis. The US, Canadian, Australian, and UK governments have advised against all but essential travel to Venezuela due to crime, civil unrest, widespread shortages in basic goods (medicine, food, drinking water), and arbitrary arrest and detention of U.S. citizens. Some areas have increased risk. Do not travel to certain neighborhoods of Caracas due to crime, or any other large cities as well. The tourists areas are considered today relatively safe for tourists, however (though this is not entirely true). Read the newest Travel Advisory here (January 10, 2018) [https://travel.state.gov/content/travel/en/traveladvisories/traveladvisories/venezuela-travel-advisory.html/ Venezuela Travel Advisory]}}\n\n{{quickbar\n| image=angel_falls-distant_view.jpg\n| caption=Angel Falls\n| location=Venezuela in its region (Federal Dependencies of Venezuela special).svg\n| flag=Flag of Venezuela.svg\n| capital=[[Caracas]]\n| government=Republic\n| currency=Bolivar Soberano (VES)\n| area=912,050km²<br />''water: 30,000km²<br />land: 882,050km²''\n| population=31,828,110 (official projection for 2018)\n| language=[[Spanish]] (official), numerous indigenous dialects\n| religion=Nominally Roman Catholic 96%, Protestant 2%, other 2%\n| electricity=120V, 60Hz (US plug)\n| callingcode=+58\n| tld=.ve\n| timezone= UTC -4\n}}\n\n'''Venezuela''' is a country in [[South America]]. Having a shoreline along the Caribbean Sea and the North Atlantic Ocean, Venezuela borders  [[Colombia]] to the west, [[Guyana]] to the east and [[Brazil]] to the south, and is situated on the major sea and air routes linking North and South America. Off the Venezuelan coast are the [[Caribbean]] islands of [[Aruba]], [[Bonaire]], [[Curaçao]] and [[Trinidad and Tobago]].\n\nThe [[Angel Falls]] (Churun Meru) in the Guiana Highlands is the world's highest waterfall and one of Venezuela's major tourist attractions.\n\n==Understand==\n\nVenezuela is home to the world's highest waterfall, Angel Falls and the second longest river in South America, the Orinoco. It also has the longest coastline on the Caribbean sea. Venezuela is the world's fifth-largest oil exporter and also has vast untapped reserves of natural gas. Ecologically, Venezuela is considered among the 20 Megadiverse countries of the planet; more than 40% of its national territory is covered by protected areas.\n\n===Terrain===\n\nAndes Mountains and Maracaibo Lowlands in the northwest; central plains (llanos); Guiana Highlands in the southeast.\n; ''Highest point'' : Pico Bolivar (La Columna) 5,007 meters.\n\n===History===\n\nVenezuela was named by Europeans during the 1499 Alonzo de Hojeda expedition: a tranquil bay was described as \"Little Venice\" or \"Venezuela\" and the name stuck. Venezuela as a nation has a very interesting history: it has produced notable Latin Americans such as Simon Bolivar. The First Europeans to see present-day Venezuela were the men sailing with Christopher Columbus in August of 1498 when they explored the coast of northeastern South America. They explored Margarita Island and saw the mouth of the mighty Orinoco River. They would have explored more had Columbus not taken ill, causing the expedition to return to Hispaniola.\n\n===Electricity===\n\nVenezuela uses a 60 Hz and 120 V power system. The power plugs are identical to those used in North America (referred to as A and B type power plugs). The NEMA 6-15 plug is used for 240 V. The power supply is often ''very'' poor, and can lead to frequent power outages and blackouts.\n\n==Regions==\n\n{{Regionlist\n| regionmap=Venezuela regions map.png\n| regionmaptext=\n| regionmapsize=400px\n\n| region1name=[[Andes (Venezuela)|Andes]]\n| region1color=#748ab7\n| region1items=\n| region1description=Mountainous and picturesque, this region is made up of the states of [[Mérida (state)|Mérida]], [[Táchira]] and [[Trujillo (Venezuela)|Trujillo]]\n\n| region2name=[[Caribbean Islands (Venezuela)|Caribbean Islands]]\n| region2color=#e18256\n| region2items=\n| region2description=With more than 600 islands or smaller formations, many of the best beaches can be found here\n\n| region3name=[[Central (Venezuela)|Central]]\n| region3color=#b77698\n| region3items=\n| region3description=The most populous part of Venezuela enjoys great beaches like the ones in the [[Morrocoy National Park]] and big cities, from [[Caracas]] and the nearby commuter towns in [[Miranda]] and [[Vargas]] out to the states of [[Aragua]] and [[Carabobo]]\n\n| region4name=[[Guayana]]\n| region4color=#72a370\n| region4items=\n| region4description=The immense and largely uninhabited area south of the Orinoco River, which makes up around half of Venezuela's national territory, includes rainforest in [[Amazonas (Venezuela)|Amazonas]], table-top mountains in the [[Gran Sabana]] and [[Bolívar (state)|Bolívar]] state, and the flat marshlands extending out in the [[Orinoco Delta]]\n\n| region5name=[[Los Llanos (Venezuela)|Los Llanos]]\n| region5color=#abb27a\n| region5items=\n| region5description=Vast open plains, home to cattle-ranching and amazing wildlife, make up of the states of [[Apure]], [[Barinas]], [[Cojedes]], [[Guárico]] and [[Portuguesa]]\n\n| region6name=[[Northeast (Venezuela)|Northeast]]\n| region6color=#67a8a6\n| region6items=\n| region6description=Stunning deserted beaches in [[Anzoátegui]] and [[Sucre (Venezuela)|Sucre]], as well as hills and caves in [[Monagas]] state\n\n| region7name=[[Northwest (Venezuela)|Northwest]]\n| region7color=#b28379\n| region7items=\n| region7description=Rich with oil from [[Zulia]] state, the northwest also boasts more beaches in [[Falcón]] and a lush agricultural countryside in [[Yaracuy]] and [[Lara]].\n\n}}\n\n==Cities==\n*[[Caracas]] - Being the capital and the largest city in Venezuela, Caracas was once known for being one of the most cosmopolitan and modern cities in South America. There are still lots of places to visit, such as theaters, malls, museums, art galleries, parks, well-conserved colonial architectures and even gastronomic restaurants. Crime is an epidemic.\n*[[Carupano]] - Carúpano is a welcoming town on the Caribean Coast famous for its carnaval and nearby paradisiac beaches.\n*[[Coro]] - The first capital of Venezuela and a city of rich colonial architecture, a unique natural scenery and tourist attractiveness. Its historical downtown is considered as a cultural World Heritage Site.\n*[[Ciudad Bolivar]] - Stop-off point for flights to Angel Falls, and a comfortable stopover to Brazil.\n*[[Ciudad Guayana]] - Dominated by heavy industry, it is Venezuela´s most organized city and the main gateway to the Orinoco Delta and the Gran Sabana. It is locally still known as either Puerto Ordaz or San Félix. In this city you will find a curious and strange phenomenon where two rivers, \"El Orinoco\" and \"El Caroní\" find each other but don't mix up because of the density of their water. You can go and be face to face with this natural wonder on a boat called \"lanchas\"and, if you are brave enough, take a dip.\n*[[Maracaibo]] - Venezuela's second most populated city, swelteringly hot and built on oil. Here you can watch a natural phenomenon Guinness Record included in 2015, \"El relámpago del Catatumbo\" or The Catatumbo Thunder, where during 140 to 160 nights a year you can watch electric storms for ten hours row making this phenomenon number one in the world.\n*[[Maracay]] - Home to the main military garrison.\n*[[Mérida  (Venezuela)|Mérida]] - A charming university town in the Andes mountains, popular for outdoor activities.\n*[[Puerto La Cruz (Venezuela)|Puerto La Cruz]] - The city to go to if you want to visit the beaches in Eastern Venezuela.\n*[[San Cristóbal (Venezuela)|San Cristóbal ]] - A leafy industrious city in the Andes mountains, bordering Colombia.\n*[[Valencia (Venezuela)|Valencia]] - Twice the capital of Venezuela, now an affluent industrial city.\n*[[Valle de la Pascua]] City nearest to center of the country, in [[Guárico]].\n*[[Barquisimeto (Venezuela)|Barquisimeto]] - known as the twilights city because of the formation of the clouds when the sun goes down, is the house of one of the most famous virgins in Venezuela, The Shepherd Virgin o \"La Virgen de la Pastora\" with many devotees in the country because of the many miracles conceived. Also you can find, a few kilometers from Barquisimeto, a small waterfall named The Wine Waterfall or \"La Cascada del Vino\" because the colour of its water seems like red wine, in a small town called \"San Pedro\".\n\n==Other destinations==\n\n*[[Margarita Island]]\n*[[Los Roques|Los Roques Archipelago]]\n*[[Angel Falls]]\n*[[Choroní]]\n*[[Mochima National Park|Mochima]]\n*[[Los Llanos (Venezuela)|Los Llanos]]\n*[[Orinoco Delta]]\n*[[La Gran Sabana]]\n*[[Morrocoy]]\n*[[Canaima National Park]]\n*[[Medanos de Coro]]\n*[[Teleférico de Mérida]]\n*[[El Catatumbo]]\n\n==Get in==\nCitizens of the following countries may not require a visa to visit Venezuela for ''tourist purposes only'' for up to 90 days IF arriving by air(a tourist-card will be issued instead)If arriving by sea or overland VISA are officially required for most foreigners (but not commonly enforced), and must be obtained from nearest consulate beforehand not at the borders (no issuing authority at the borders): Andorra, Antigua & Barbuda, Argentina, Australia, Austria, Barbados, Belgium, Belize, Brazil, Bulgaria, Canada, Chile, Costa Rica, Denmark, Dominica, Estonia, Finland, France, Germany, Greece, Grenada, Hong Kong, Hungary, Iceland, Iran (max. 15 days), Ireland, Italy, Jamaica, Japan, Lithuania, Liechtenstein, Luxembourg, Malaysia, Mexico, Monaco, Netherlands, Netherlands Antilles, Nevis, New Zealand, Norway, Palestine, Paraguay, Peru, Poland, Portugal, Russia, San Marino, Spain, St. Kitts, St. Lucia, St. Vincent & The Grenadines, Sweden, Switzerland, Taiwan, Trinidad & Tobago, United Kingdom [https://www.gov.uk/foreign-travel-advice/venezuela/entry-requirements], and Uruguay. Business travelers almost invariably require a visa to be issued before entry.\n\nAs of March 2015, American citizens need to apply for a visa 90 days before traveling to Venezuela.  The cost of the visa is $30(USD) and is valid for one year of multiple entries [http://www.eluniversal.com/nacional-y-politica/150306/us-citizens-to-pay-usd-30-for-tourist-visas-to-enter-venezuela].\n\nAs of October 2015, one can stay in Venezuela for 90 days in a year if entering by land. Meaning if you try to do a visa run you will be turned away at Venezuela's SAIME if they see you have stayed for 90 days. To stay longer, you need to fly in from another country. There is no limit if entering by air. Meaning you can fly in as often as you want to reset your 90 day visa. \nYou can also apply for an extension of an extra 90 days at the SAIME office at Plaza Caracas, Caracas. You can only pay the fee by debit card (so you need to borrow from a local) or a bank deposit. As of Oct 2015, it cost 2250 Bs ($4).\n\nIn Caracas, passengers pass through immigration in the recently refurbished arrivals hall before going to baggage claim. Officers will check your passport and may ask questions. If a customs officer or anyone asks about your purpose of visit, tell them you are only there to visit, tourism. At baggage claim you will be required to match the baggage sticker on your flight ticket to the bar code on your bag before you hand over your tax form to customs officials.\n\nThere will be many individuals who approach you after your arrival offering assistance with locating a taxi or trading currency. It is best to not interact with anyone who approaches you. Even airport officials with proper identification may attempt to lead you to other areas of the airport to trade currency on the black market. When taking a taxi from the airport, always settle on a price before getting into the cab, and only use taxis that have the official yellow oval seal. \n\n===By plane===\n\n{{infobox|Vaccinations|Some airlines ask passengers to show a valid '''[[Yellow fever]]''' vaccination certificate before flying to Venezuela. This is not an official entry requirement, however the CDC Yellow fever vaccination recommendation is \"for all travelers over 9 months of age travelling to Venezuela, except the northern coastal area. The cities of Caracas and Valencia are not in the endemic zone.\" A valid measles vaccination certificate may be required to board flights out of the country following a nationwide immunisation program in 2006, but foreign tourists are usually exempted.}}\n\nThe main international airport is Simon Bolivar International Airport ('' also known as Maiquetia airport''), ({{IATA|CCS}}, {{ICAO|SVMI}}) located in Vargas (Federal State). It is located about 30 kilometres (approximately a 30-minute ride) from Caracas. Buses are available during the day, departing from Parque Central next to Avenida Sur 17 (under Avenida Bolivar viaduct). Look for Buses at Domestic Terminal, running from 5:00 AM-6:00 PM, fare is BsF 50 per passenger. A taxi ride from the airport will cost BsF. 1500  during the day, or BsF 2000 at night. There are international flights to Maracaibo and Valencia from cities such as [[Miami]], but the choices are very limited.\n\nYou can travel non stop from the [[United States|US]] and some major European cities. \n\nAmerican Airlines offers daily flights from [[Caracas]] or [[Maracaibo]] to [[Miami]], Delta Airlines offers a daily flight from [[Caracas]] to [[Atlanta]]. Santa Barbara offers daily service to [[Miami]] and [[Panama]] from [[Caracas]]. \n\nFrom Europe, there are non-stop flights from Paris-Charles de Gaulle (Air France), Istanbul (Turkish Airlines via Havana), Madrid-Barajas (Air Europa) and Lisbon (TAP).\n\nAeropostal, Conviasa, Copa and Aerolineas Argentinas provide flights to the rest of South and Central America.\n\nAeropostal Alas de Venezuela, Santa Bárbara Airlines, Avior Airlines, Conviasa and Aserca Airlines are the major domestic airlines in Venezuela.\n\nCopa Airlines has a daily service from Caracas, Maracaibo and Valencia to Panama and connections to all South, Central America, USA and Canada.\n\nSeveral classic flights no longer run from [[Caracas]]: Lufthansa to Frankfurt, TAP to Oporto, Alitalia to Milano, Latam to Santiago, Lima and Sao Paulo, American Airlines to [[New York]]-JFK, Dallas and San Juan (Puerto Rico), Avianca to Bogotá, Air Canada to Toronto and Delta Air Lines to Atlanta. Conviasa has suspended all its flights to Buenos Aires, Madrid and Bogotá. \n\nFor international departures (at Maiquetia Airport), the airport tax is BsF. 570. These taxes are normally included with airfare, although a difference may be applicable, should the tax rate be increased by an Act of Legislature, to be paid at the airport.\n\nCurrently, many international commercial airlines are allowed to charge the airport tax with the ticket purchase. However, it is a good idea to keep at least BsF. 1000 on hand when departing from Venezuela. Ask for \"Casa De Cambio\" should you need to exchange your foreign currency.\n \nFor domestic flights (at Maiquetia Airport), the airport tax is BsF. 120.\n\n===By car===\n\nVenezuela has road links with [[Colombia]] and [[Brazil]]. The road crossing to Brazil, not far from the frontier town of [[Santa Elena de Uairén]], is a long way from most tourist destinations in Venezuela and so not a common point of entry. Border controls are tight and all travelers arriving from [[Boa Vista]] are expected to have visas. The Venezuelan consulate in Boa Vista is on Av Benjamin Constant. \n\nVenezuela's main connection with Colombia is from [[Cúcuta]] to Venezuela's frontier town of [[San Antonio del Táchira]], which itself is about 50 km from the busy Andean city of [[San Cristóbal (Venezuela)|San Cristóbal]]. For a day visit to Cúcuta no visa documents are required but border controls are otherwise very tight with frequent searches. The border area can be dangerous and visitors are advised to pass through quickly.\nJUL 2012: the border controls are now very relaxed and nobody even stopped me on my way from Venezuela to Colombia nor searched my luggage. It is possible to take a local bus directly from San Cristobal to Cucuta for 25 BSF (a taxi costs 250 BSF), but note that locals do not need to stamp their passports, and the bus will not wait for you while you are undertaking the migration procedures.\nIf you are leaving Venezuela by land from San Antonio to Cucuta, you are obliged to pay the annoying BSF 90 departure tax, so do not change all your bolivares in Venezuela. Actually, you will get better rates in Cucuta. (currently 195 pesos for 1 bolivar).\nYou may also leave Venezuela by way of the Paraguachón-[[Maicao]] land border, located about 120 km from [[Maracaibo]] on the NW border. Another point of entry is from Puerto Carreño in Colombia's Llanos region where boats cross the Orinoco river to El burro and onward connection to Puerto Ayacucho exist.\n\n==Get around==\n\nTravelers in Venezuela are required to have identification, in the form of an ID Card or a passport. There are military/police/National Guard checkpoints on many roads, so while travelling by car or bus keep your passport handy, ideally you should keep a colour photocopy of your passport. Should your passport be stolen, this will facilitate procedures with your local consulate. The military presence is constant, yet is not usually cause for concern. That having been said, there are corrupt officials. It is wise to keep a close eye on your belongings when, for instance, bags are being checked for drugs. A soldier of the Guardia Nacional (National Guard) sometimes plants drugs to solicit a bribe or steal valuables. Penalties for drug use are severe, and the burden of proof falls on the accused. The police may also demand bribes using the same modus operandi.\n\nThere is no national railway system in Venezuela as of yet, which leaves three options for travel inside the country: car rental, using buses, and using cars-for-hire. Drivers in Venezuela are generally aggressive and unconcerned by traffic regulations. The traffic in Venezuela is very bad, the drivers are aggressive and all drivers want to be the first. Thus, car rental is not recommended in general. The very cheap price of gas, however, makes this option fairly economical. The expensive part of renting a car will be the insurance and the bribes you will have to pay to police and army checkpoints along the highways. The fuel price for 95 oct fuel unleaded is 6 BsF/liter, which is about 1/1,000th of a US -penny- (Jan 2018).\n\nDo not underestimate the sheer chaos of Venezuela's traffic. The often ignored road rules state that you must drive on the right unless overtaking and give way to traffic coming on to a roundabout. Drivers frequently top 160 km/h (100 mph) on intercity highways. Laws requiring car occupants to wear seat belts are not always complied with.\n\nTraffic lights are often ignored, especially at night, not for lack of patience, but because drivers do not like to stop theirs cars, as they can be robbed while stopped. \n\nBe aware also that motorcycles (moto taxis) are sometimes seen transporting up to five people, usually without helmets, which adds to the dangers of the road.\n\nWhen approaching a crosswalk in Venezuela, it is important to remember that pedestrians do not have the right of the way as they do in the U.S. and many European countries. If you slow down or stop at a crosswalk to allow a pedestrian to cross, you could cause an accident with unsuspecting motorists.\n\nThe bus system is extensive and extremely affordable (in part due to the low price of gas). Bus terminals are hectic, but it is usually easy to find a bus to any major city leaving within a short amount of time. Short bus rides (1 hour) may cost 100 BsF (about US$0.000001), and even extremely long bus rides (13 hours) will only cost slightly more. The larger buses are typically air-conditioned. In fact, they are usually overly air-conditioned, so it is worth bringing a blanket with you. Buses are an easy and convenient way to get around the country.  However, proper security awareness should be exercised as robberies occasionally take place on buses in both cities and on highways.  It is best to choose bus lines that use a metal detector and bag check to insure no passengers are carrying weapons of any kind.\n\nIf you decide to travel by bus a good option is 'Aeroexpresos Ejecutivos' they have their own terminal in a residential zone of Caracas (Chacao, Bello Campo) ( [http://www.aeroexpresos.com.ve] ), baggage is checked on the buses (as in an airport).  The units are clean, safe and well maintained, plus the drivers are trained to respect the speed limit (there are many accidents on regular buses on Venezuelan highways, most of them caused by speeding on poorly maintained roads).  They are more expensive than a regular bus, but still cheap by American/European standards. You may pay with credit card and buy tickets in advance by phone.  Aeroexpresos offers slightly more expensive options for many long routes that include semi-cama seating, chairs that recline extra, and allow for more comfortable sleeping on overnight trips.\n\nFor smaller towns, there may not be regular buses. In such cases, one can use cars-for-hire, called \"por puestos.\" These are typically old and run-down vehicles, but they are affordable. They are more expensive than buses. The main problem is that they typically wait to have a full car (4 or 5 passengers) before undertaking a route. The driver will usually try to convince you to pay for the extra passengers if you want to leave right away. The cars are popular, however, and one does not usually wait long for a car to fill up.  Por puestos are identifiable by signage bearing the name of the streets or destinations they typically drive along or stop at.  Avoid traveling alone in a por puesto and avoid 'pirates,' inauthentic, unofficial taxis that may intend to rob foreigners.\n\nTravel within cities is usually via taxi. Taxis are more expensive than any other form of transport, but still affordable when compared to North American or European equivalents. The taxis do not have meters and will charge more at night. This is normal in Venezuela, however all prices are flexible in the Venezuelan economy, so it is a good idea to negotiate the fare for the ride up front.  Tipping is not expected and not necessary.  The driver considers the tip as part of the fare he is charging and will factor that into his negotiations.\n\nLocal buses exist, and usually connect the terminal to the center of each city. Bus routes usually remain a mystery to the uninitiated and you can try to read the signals in he windows (going to --- coming from). \n\nCaracas has a modern and cheap metro system (although it is crowded and a bit dirty!), currently being expanded.  While armed robberies are almost unheard of in the metro, pickpocketing is rampant.  Typically, delinquents will aim to distract the passenger and then another member of the group will remove the wallet, or bag in the opportune moment.  Its best to keep bags in front of you and avoid unsolicited contact with strangers.\n\nThe web page for the metro is: [http://www.metrodecaracas.com.ve]\n\n===By car===\n\nA large road network (which comprises approx. 82,000 km) and historically low fuel costs make Venezuela an attractive country for exploring with your own car, at least once security returns to the country.\n\nMany roads are in good condition but there are also gravel and dirt roads for which an off-road vehicle is recommended – especially during the rainy season from May to October. This is why it is important to travel with a good road map (e.g. Venezuela Laminated Map by ''Berndtson & Berndtson'') and to be well informed about distances, road conditions and the estimated travel time. On the web, the site of ''cochera andina'' publishes information on nearly 120 routes in the country. \n\nNote that when renting a car using foreign credit card in Venezuela, you will be charged at the DICOM rate, which currently is 21 times more expensive than the market rate (Jan 2018; 11,000 BsF=$1 credit card, vs. 230,000 BsF=$1 cash). However, even at this rate it is still rather cheap—around 20 dollars a day for a small manual car. This may make you think twice about renting a car, especially when considering the fact that renting a car with a driver usually costs the same.\n \nThere are many gas stations in the main areas, although they will frequently be out of all types of fuel. For outlying areas, you should fill the tank before you leave or take a reserve canister with you.\n \nAn international driver's license is needed to drive in Venezuela. Police will often ask for the license as well as for the frame or motor number during routine checks. Traffic rules generally comply with the international standard. But do not underestimate the sheer chaos of Venezuela's traffic. Be attentive when driving in Venezuela.\n\nThe often ignored traffic rules state that you must drive on the right unless overtaking and give way to traffic in a roundabout. Although the maximum speed limit is 80 km/h outside the city and 60 km/h within the city (at night 50 km/h) local drivers frequently top 160 km/h (100 mph) on intercity highways. The law obligates car occupants to drive with fastened seat belts – which is regularly ignored.If you are in a traffic jam, always other drivers will try to pass. Be aware also that motorcycles are sometimes transporting up to five people, without helmets. Pay attention at night: streets and cars as well as bicycles often have poor lights or none at all. Also note, that even \"good\" roads may have unexpected and deep potholes. For this reason, as well as for security issues in general, long-distance interurban car traveling is not recommended during dark hours.\n\nGood sign-posting is only found on the main roads. Common and especially important road signs are:\n\n* Curva peligrosa: \"Dangerous curve\"\n* Sucesión de curvas: \"Winding road\"\n* Reduzca velocidad: \"Reduce speed\"\n* Conserve su derecha: \"Keep right\"\n\n\nIf you wish to rent a car, you may download an unnoffical Routeable Map for Garmin GPS Devices. Is free, and it has been made by hundreds of volunters across the country. The name is Venrut and it can be download from: [http://www.gpsyv.net].\n\n==Talk==\n\nSpanish is the official language of Venezuela, accompanied by numerous indigenous dialects (usually never heard except in the Amazon region). Outside of Caracas, English is not commonly spoken or even understood, and even within Caracas it is usually only spoken by the younger generations.\n\n==See==\n\n*[[Morrocoy National Park]] plenty of coraline islands with crystal clear waters\n*[[Angel Falls]] in the Guiana Highlands and [[Canaima National Park]].\n*[[Los Roques]] with its crystalline beaches.\n*[[Los Llanos (Venezuela)|Los Llanos]] and its spectacular wildlife.\n*[[Mérida (Venezuela)|Mérida]] and its breathtaking Andes scenery.\n*[[Caracas]], the true urban jungle.\n\n==Buy==\n\n[[Image:venezuela-bolivar_money.jpg|thumb|250px|Examples of Bolivar bills used in Venezuela (Before the introduction of Bolivar Fuerte)]]\n\nVenezuela's currency is the '''Bolívar Soberano''' (BsS), which replaced Bolivar Fuerte in August of 2018. The Bolivar fuerte had, in turn, replaced the old bolivar in 2008. Venezuela's currency has been in a period of double-digit inflation for the past several years, and has now reached a period of hyperinflation, so keep in mind that any information you see from tour guides or blogs regarding prices quoted in BsS and exchange rates will probably be hopelessly out of date, even if it was published only in the last few months. For most things, prices quoted in US dollars from old guides are, however, likely to still be approximately the same when converted using the informal exchange rate . \n\nDue to strict currency controls in place since 2003, bolivars are not easily convertible by official means neither in or outside the country. Theoretically, there exist two official exchange rates in Venezuela: one for imports of medicine, food, and other essentials which gives 10 BsF per US dollar (DIPRO), and one exchange rate (DICOM) for all other purposes, which is around 62 BsS (october 2018). In practice, the dollar supply available for the DICOM exchange is insufficient to meet demand, and on the informal exchange market you will receive around 98 BsS per dollar. Withdrawing money from an ATM will give you the DICOM rate. The informal exchange rate is the one most likely to be encountered by both locals and foreigners, unless they have connections to the government or major industries. The daily-variable informal exchange rate can be found on Dolar Today [https://dolartoday.com/]. Except for certain items which are price-fixed (e.g. gasoline, sugar, rice, coffee, bread), most items will fluctuate in price according to the informal exchange rate. These exchange programs also change quickly and can be difficult to navigate or find up-to-date news on without a Venezuelan to help you, e.g. DICOM replaced the previously-existing SIMADI exchange rate. \n\nOfficially, it is not allowed to speak about or publicize the informal market exchange rates. In practice, it is commonly done. However, take care if you are unaware of what you are doing and not with any locals who can help you, as you could find yourself either scammed or arrested. Due to censorship, please be aware that you will have a hard time accessing the exchange rates from within Venezuela.\n\n'''Most Venezuelans will advise that you not even think about coming to visit unless you have a local friend in the country who can help you navigate the currency system.'''. As an example of how difficult it is to gauge rates due to Venezuela's hyperinflation, in October 2017: the exchange rate is 1 USD = 38'000 BsF, compared to 1 USD = 3000 BsF in April 2017, and 1 USD = 1000 BsF in October 2016, i.e. the currency has lost 97% of its value in the last year. This trend has continued, with the currency dropping to 230,000 BsF = 1 USD by January 2018, i.e. a loss of nearly 90% in only three months.\n\nThe exchange rate over time can be viewed on Venezuela Econ's website [https://web.venezuelaecon.com/] (registration required, free trial period), which tracks the Dolar Today value over time. Consequently, any price listings you find are likely to be quickly out of date. Although the parallel rate is technical illegal, it is a critical element of life for the locals as it represents one of the only ways that they can actually save money since the Bolivar currency is subject to massive devaluation. Many Venezuelans have bank accounts in the US so you can make an electronic transfer and get local currency that way.\n\nVisa and MasterCard are widely accepted, American Express and Diners Club are usually accepted at upscale restaurants, hotels and shopping centers. However, these will all use the DICOM exchange rate, which will make transactions more expensive than using US$ exchanged on the informal market. Merchants always ask for ID before making a credit card transaction (a passport will suffice). ATMs exist all over the country, but are highly discouraged due to gun crime and kidnappings. Furthermore, withdrawing from an ATM will effectively charge you 95% of your withdrawal in fees (January 2018) due to the discrepancy between the DICOM exchange rate and the practical exchange rate. Larger denominations of banknotes are now available, which somewhat alleviate the previous problem where individuals would need to carry around bags full of cash to pay for a dinner, as the previous largest banknote was 100 BsF (worth approximately 3 cents before the introduction of new bills). Maestro Debit Cards are the most accepted but Visa Debit Cards are often not accepted, and some ATMs also ask for the last two digits of Venezuelans' ID numbers as an added security precaution, causing problems for foreigners with no ID number tied to their bank account, in such a case try entering the relevant digits of your PIN number (first two or last two digits), for some ATMs a simple double zero (00) will do just fine. Be aware that not all the ATMs accept foreign credit cards, at current Banco Provincial (BVPP) and Mercantil accept foreign credit cards. \n\nIt is best to carry small change rather than large bills as many traders, in particular taxi drivers, rarely have change. Tipping taxi drivers is not customary and can appear strange. Be a little wary of cab drivers. There have been reports of cab drivers exploiting tourists, particularly from the airport to Caracas. Use only the official airport taxis (black Ford Explorer SUVs) going to Caracas or get airport pick-up (mostly luxury hotels). At restaurants, tipping is usually minimal. If a 10% service charge is included then some extra small change can be left on top of the total, or if not included then a tip of only about 5% is customary.\n\n===Handcraft===\n\nHammocks and some dark wooden handcraft pieces can be purchased throughout Venezuela, as well as gaudy painted statuettes of big-busted women. Some areas such as [[Falcón]] state have a tradition of excellent glazed pottery.\n\n===Food and drink===\n\nFine Venezuelan rum and chocolate are on sale at the airport. Since Chavez's death, a new phenomenon has arisen: the 'cola' (queue) to supermarkets. This is due to the short supply of milk (powdered and liquid), margarine, butter, sugar, beef, chicken, pasta, cheese, corn flour, wheat flour, oil, rice, coffee, toilet paper, diapers, laundry detergent, bar soap, bleach, dish, shampoo. Thus when word gets out that certain supermarkets receive a new shipment of said products, the queue forms. Due to the new rationing system (to avoid hoarders and people smuggling essential goods to Colombia), you will need your passport when you pay at the counter. If you are not buying the regulated goods, you may skip the queue.\n\n'''Due to an ongoing economic crisis, many foods and drinks are in short supply, or none at all, and are often expensive and ''extremely'' difficult to find, making your well-being seriously dire if you're trying to find something to eat.'''\n\n==Eat==\n\nArepas, thick corn tortillas which are split and stuffed with myriad fillings, are the quintessential Venezuelan dish. The most famous variations are the \"reina pepiada\" (shredded chicken salad with avocado) and “domino” (stuffed with black beans and shredded white cheese). Hallacas (Venezuela's homegrown version of the tamale, with meat, olives, raisins covered in cornmeal and wrapped in plantain leaves to be steamed) are a popular Christmas dish. Cachapas (corn pancakes often topped with a salty cheese called \"telita\" or \"queso de mano\"), empanadas (savory pastries) and the ubiquitous \"perros calientes\" (hot dogs) are popular street food.  For slow food, try delicious fish meals, or a shrimp soup known as “cazuela de mariscos”.\n\nThe traditional Venezuelan lunch is pabellón, and consists of rice, black beans, and meat, with a side of fried plantain slices. The above dishes are known as \"comida criolla\", or Creole food.\n\nVenezuela is a leading producer of fine cacao beans and Venezuelan chocolate can be excellent. The El Rey brand has consistent quality.\n\n'''Owing to the ongoing crisis, don't count on these types of food to be readily available. Not only are they basically nonexistent and in short supply, they are often expired and this can lead to serious health problems.'''\n\n==Drink==\n\nTo some tastes, especially those who prefer stronger and complicated beers, Venezuelan beers may seem thin and watery. The most popular beer brand is Polar, which is available in a low-calorie/no-flavour version (Polar Light), light version (Polar Ice), or premium version (Solera), which actually bears some semblance to real beer. Brahma and Regional are other beers available throughout the country. \nWhisky is very popular among Venezeulans, particularly for special events. Venezuelan-made rum is generally dark and of very good quality. Among the best is the \"1796\" brand from Santa Teresa. It is a Solera rum. \nVenezuelans are heavy drinkers and will often go through a case of beer (admittedly of the aforementioned watery kind) during vacation days, starting before breakfast, only to carry on with a bottle of rum or whisky come nightfall.\n\nA popular non-alcoholic drink is called \"chicha Andina,\" which is made from rice or corn flour. \n\nMalta or Maltin is a carbonated non-alcoholic malt drink sold alongside regular soft drinks, although it is also manufactured by the Polar company.\n\nVenezuelan coffee is excellent, but make sure you are asking for proper coffee (machine-made, 'de la maquina'), otherwise you might be served a 'negrito' or 'guayoyo', which can be anything from weak filter coffee to coffee-smelling brown water. Some types of machine coffee are: \ncafe con leche(a milky coffee)\nmarrona(a little stronger)\nnegrito(black)\n\n==Sleep==\nIn Caracas, there is a good selection of 5-star hotels, although these are predictably expensive. At tourist spots elsewhere in Venezuela, guest houses or B&Bs, known as ''posadas'' are usually the best option, each with an individual style and usually offering breakfast or dinner if requested. Posadas can vary enormously in price and quality. Youth hostels are very scarce.\n\nKeep in mind that the beds in many hotels (mostly up to the mid-range levels) are nothing more than mattresses on concrete slabs that resemble box springs. Depending on what your sleep preference is, they may not be the most comfortable for you. Something for you to consider when looking for a hotel to stay at.\n\nIn other cities there are many hotels rated from 1 to 5 stars; but, if you are visiting small towns outside the big cities, you will find many hostals called \"posadas\", very comfy and for a good price. Make sure you stay in places with air conditioner because weather might be too hot.\n\n==Learn==\nThere are great universites throughout the country, both private and public ones. Caracas is the city with most universities, including the Venezuelan Central University (''Universidad Central de Venezuela'', UCV) which has 60,000 students and is a architectural attraction in its own right since being awarded World Heritage Site status by the UN in 2002.\n\nVenezuela is becoming increasing popular as a destination for learning Spanish. Merida is normally the destination. Jakera Spanish school [http://www.venezuelaspanishschool.com]was voted by the Language industry as one of the top three Spanish schools world wide (LTM awards).\nCela Spanish School on Margarita Island offers intensive Spanish courses in different levels. Excursions and activities on Margarita Island are included in the Spanish course.\n\n==Work==\n\nWorking hours are usually from 8:00AM to 12:00PM and from 1:00PM to 5:00PM, or from 9:00AM to 12:00PM and 2:00PM to 6:00PM. (8 hours per day, and from 1 to 2 hour(s) of lunch time).  Most banks close at 3:30PM, except the ones located at shopping malls (as Sambil, C.C.C.T, etc) work after 3:00PM but probably will make a little charge by the transaction. Also in December when they stay open an extra hour to deal with the holiday rush.\n\n==Stay safe==\n{{TravelAlert\n| start=\n\n| link= http://travel.state.gov/content/passports/en/alertswarnings/venezuela-travel-warning.html], [https://travel.gc.ca/destinations/venezuela?_ga=1.20190395.2019633288.1484522920], [http://www.gov.uk/foreign-travel-advice/venezuela\n\n| alert=Travel to Venezuela is discouraged by the US State Department and the Canadian Ministry of Foreign Affairs  due to the significant level of violent crime, the unstable political and economic situations and the decline in basic living conditions, including shortages of medication, food staples and water, in the country. The UK Foreign Office advises against all travel to within 80km (50 miles) of the Colombian border in the states of Zulia, Tachira and Apure.\n| end=\n}}\n\nWith mass protests, resulting in large amounts of violence between the opposition forces and government, deteriorating economic and social conditions, and shortages of basic goods and medicine, travel to Venezuela should be avoided. The country suffers from a high rate of poverty, corruption, and violent crime, having one of the highest homicide rates worldwide. In other words, it is considered the survival of the fittest for many residents, no exceptions. One of the most dangerously notorious gang, the \"Colectivos\" (collectives in Spanish), known for their support for Maduro, will target and kidnap, even kill, anti-Maduro protesters and other unfortunate victims, residents and tourists alike, and they pose an extreme threat to tourists as well.\n\nMost sections of large cities are not safe to walk at night. Stay in populated areas (though not ''too'' populated as most residents are very sketchy owing to the ongoing crisis). Travel by vehicle at night is extremely dangerous and is ill-advised. The outskirts of many cities are very poor and crime-ridden, and are not appropriate for tourists; the same applies for big cities that are in economic turmoil. When in doubt, ask local inhabitants or taxi drivers whether an area is safe or not, though don't expect answers from them as they will either look at you funny or not answer at all. In general, if one looks like a (presumably wealthy) tourist, these sections of town should be avoided. It is advisable not to wear expensive jewelry or watches. Take care with taking pictures and unfolding maps in crowds. Pretend you know where you are going even if you aren't sure, though this move can be seriously dicey. \n\nAlways ride on a legal taxi (Yellow plates), though only if you're ''absolutely'' certain of this. The white plates taxis are illicit and may be dangerous. Those with smartphones can download and use Easytaxi (Uber equivalent). This is a safe way to get around and the price is determined by the app. Even so, however, be on your guard, as even legitimate taxis can and will pose a threat with absolutely no warning, so always expect the unexpected.\n\nOfficial airport looking employees with carts will gladly help you transport your luggage on their carts.  Be aware that once they have your baggage, you must pay to get it back.  You gave them such for a service and you must pay for that service.  Ask in advance the cost for this service. These same official looking employees will gladly help you with expediting your position in the ticket line, connection flights, and such.  They will ask for your papers and passport. Again, be aware that once they have your passport, you may have to pay a fee to get it back.  Never give anyone your passport.\n\nAdditionally, one must be wary of corrupt officials (police and National Guard). Some officials may demand bribes or otherwise extort travelers. Keep watch of your belongings at all times. Despite all these recommendations, one is usually quite safe in Venezuela if they apply a little common sense, and avoid looking overly wealthy when traveling. Women with big purses are recommended not to walk around alone. Tourists should avoid walking long distances in the towns and cities unless you know where you are going (though this is ill-advised). It is not advisable for female tourists to walk through poor areas or shanty towns without a local guide (or not even that). They are of greater risk of rape or sexual assault if they walk through these areas. \n\nIn the sad event you do get mugged, by all means don't even try to put up resistance and avoid eye contact. Most muggers in Venezuela carry firearms and don't hesitate to shoot at the slightest provocation. Keep calm and give the mugger whatever he wants, because failure to do so is often deadly, specifically being killed on the spot. Reporting a mugging to the police is seldom worth the trouble; it's best to forget it as muggers are rarely caught. Of course, in very dire and, in most cases, inevitable situations where you have nothing to give to said mugger, expect to be kidnapped and held for ransom, lest you end up facing death at the hands of these murderous muggers, not just criminals.\n\nDespite all the issues with insecurity, you may avoid most problems by either staying in the touristy areas or visiting the less touristy areas with someone that lives in the country.  Most Venezuelans will not advise you to even visit the country unless you have a friend who can help you navigate safely through Caracas and deal with currency exchange. With the economic situation getting worse and worse, violent crime has branched out beyond the big cities (Caracas, Valencia, Barquisimeto) to more tourist-driven places including Puerto Ordaz, Merida, and Margarita.  Still, most of the natural areas are quite safe (although this is not always the case; potential murderers and kidnappers target their unfortunate victims as lucrative prey).\n\nVenezuela has an interesting policy towards cannabis. You may possess up to 20gr, but be forewarned that anything more can get you thrown in prison for a long time. Even though this policy is quite liberal by American or British standards, you should keep all cannabis use private, if just to not have unwanted attention drawn towards you.\n\nAvoid long-distance car traveling at night, since many highways are not secure at that time, especially with highway bandits waiting to strike at anytime. Venezuelans are \"usually\" ready to help you if you have a problem. However, they probably won't dare to stop for you in the dark, as they would risk being assaulted by doing so.\n\n==Stay healthy==\n\nYou may have some diarrhea issues adjusting to the foods and liquids in Venezuela. You should preferably buy bottled water and not drink from the tap, but iced drinks and salads are generally fine (depending on the water supply quality of your native country). Be careful with expired foods and cheeses that are many days old.\nYou usually find street vendors by highways, who sell food and who don't always have much of hygienic food handling practices. Use common sense when selecting what to eat in the street. Mind, that fresh food and mayonnaise may go bad fast due to the local climate.\n\nMost major hospitals are in seriously bad condition, even in large cities. There are no medicines or prescriptions, and hospital staffs are very few and far between, and in seriously volatile situations where your health is struck by life-threatening illnesses, you're on your own.\n\n==Respect==\n\nMost Venezuelans are laid-back regarding racial issues, since white or creole persons blend naturally with natives and Afro-Venezuelans in everyday life (education, living, politics, marriage), so the word \"negro\" may be used regardless of who's saying it, or who is being referred to in this way. Expressions like \"negrito\" or \"mi negro\" are often used as terms of endearment. You could hear someone calling \"negra\" to a woman, regardless of the race of the person, and in general, Afro-Venezuelans don't find it offensive, as they are simply variations on the Spanish word for \"black\". Similarly, don't be offended if someone calls you \"flaco\" (thin) or \"gordo\" (fat) as these may also be used fairly indiscriminately, and often as a term of friendliness.\n\nDifferences between Brits, White Americans, or Europeans are not perceived by most Venezuelans. Hence, you can expect to be called \"gringo\" even if you are, say, Russian.  Any person who looks Asian is automatically \"chino\" - this is also a friendly term of endearment.  Don't let this offend you as a non Spanish-speaking visitor. \n\nVenezuelans, like Colombians and Panamanians, have a very amusing way of pointing to objects by pouting their lips and lifting their chin, so don't assume that people are blowing kisses to you when you ask for directions.\nNeither, do not be offended if people stare at you. Remember, you may look different, perhaps strange. The fact is, you can appear to be in the spotlight for a short period of time, only to be ignored after the other person  satisfies his or her  curiosity.\n\nAnother important point to be kept in mind is that the Venezuelan society is severely split between \"Chavistas/PSUVistas\" (those who support Ex-President Chavez and his Political Party) and \"Anti-Chavistas/Opositores\" (those who oppose PSUV), so it is strongly advisable not to talk about him and/or his politics unless you are sure on which side your Venezuelan friends are.\n\n==Contact==\n\n===By phone===\n\nVenezuela has international country telephone code 58 and three-digit area codes (plus an initial '0'), and phone numbers are seven digits long.\n\nArea codes beginning with '04' - e.g. 0412, 0414, 0416 - are mobile phones, while area codes beginning '02' - e.g. 0212 (Caracas), 0261 (Maracaibo) are land lines.\n\nA single emergency number ''171'' is used in most of the country for police, ambulance and firefighters.\n\nThe international phone number format for Venezuela is +58-(area code without '0')-(phone number)\n* To dial to another area code: (area code starting with '0')-(phone number)\n* To dial to another country: 00-(country code)-(area code)-(phone number)\n* Directory enquiries/information (in spanish): 113\n* Emergency service for mobile phones: (in spanish): 911 (Movistar), 112 (Digitel), *1 (Movilnet)\n\nPublic payphones use prepaid cards which cannot be recharged but are easily available in shopping centers, gas stations, kiosks, etc. Phone boxes are common in the cities and do not accept coins. The vast majority are operated by the former state monopoly, CANTV, although some boxes operated by Digitel or Movistar do exist, particularly in remote areas. CANTV prepaid cards can be used only in their booths. \n\nMore popular today are the ubiquitous 'communication centers' or clusters of phone booths located inside metro stations, malls, or like a normal store in the street. Most of these comunication centers are operated either by CANTV or Movistar, and offer generally cheap phone calls from a normal phone in comfortable booths equipped with a seat. A log is made of all your calls and you pay when exiting the store.\n\nMany street vendors or ''buhoneros'' also offer phone calls from portable (antenna-based) land lines set up at improvised stalls. Callers are charged by the minute.\n\n====Mobile phones====\n\nMobiles operated by Movilnet, a division of CANTV, start with the 0416/0426 code and use the CDMA 800 MHz system and GSM/HSDPA 850 MHz. Rival Telefonica Movistar, formerly Telcel, start with 0414/0424 and use both CDMA & GSM/HSDPA (GSM/HSDPA 850 MHz). Digitel is another operator with a GSM/HSDPA (GSM/HSDPA 900 Mhz) network and its numbers start with 0412. It is possible to buy a pay-as-you-go SIM card for Digitel's GSM phones, but make sure your phone is unlocked. A pay-as-you-go Digitel card is working straightaway when bought from any official retailer. The cost of the card is around 20 VEF (new bolivares). Top up vouchers from 10 VEF. The cost of a text message abroad is 0.3 VEF.\nPlease note that from Movilnet phone you are not able to send a text message almost to any European network. A Digitel phone allows to send a text message to almost any European network (tested) and Movistar may let you send a text message to any european network but is not reliable as Digitel for this purpose. \nAs of Sept 2015, Digital requires a national ID (cedula) to acquire the SIM Card (known as \"chip\" here), while both Movilnet and Movistar accept passports. \n\nYou may use your phone with a foreign SIM card in roaming. Check: www.gsmworld.com or call to your operator for roaming information to Venezuela.\nMovilnet and Movistar will require quad-band phones for European users, Digitel will work with any European phone. Tourists from other than European countries should check their phones if the phone will work with the above bands.\n\n===By net===\n\nInternet cafes, often incorporated in the above-mentioned 'communication centers' are increasingly common, and even small towns usually have at least one spot with more or less decent connections.\n\nHowever, owing to the ongoing political and economical crisis, internet usage is severely restricted and heavily monitored.\n\n===By mail===\n\nVenezuela's state-owned postal is slow, unpredictable, and not widely used. Postal offices are few and far between, although they are still probably your best bet for sending postcards back home. For mailing within Venezuela, courier services such as MRW, Domesa and Zoom are the most popular. These usually guarantee next day delivery! For International mailing, DHL-Cantabria, FEDEX, Zoom, and MRW are best. \n\n\n\n\n[[ca:Veneçuela]]\n[[de:Venezuela]]\n[[eo:Venezuelo]]\n[[es:Venezuela]]\n[[fi:Venezuela]]\n[[fr:Venezuela]]\n[[hu:Venezuela]]\n[[it:Venezuela]]\n[[ja:ベネズエラ]]\n[[nl:Venezuela]]\n[[pl:Wenezuela]]\n[[pt:Venezuela]]\n[[ro:Venezuela]]\n[[ru:Венесуэла]]\n[[sv:Venezuela]]\n[[wts:Category:Venezuela]]\n\n\n[[WikiPedia:Venezuela]]\n[[Dmoz:South America/Venezuela/]]\n[[World66:southamerica/venezuela]]\n\n{{isPartOf|South America}}\n\n{{outline}}\n{{countryguide}}"
        }
    }
}